[
    {
        "content": "<p>With the Da Vinci DTR specification, we want the EHR to pass in the current 'request' resource (MedicationRequest, ServiceRequest, NutritionOrder, etc.) OR the current DTR-relevant QuestionnaireResponse as part of launch context.  However, we don't ever want both and we don't want the EHR to prompt the user for either if neither are present in current context - because a DTR-specific search within the app is going to be smarter about filtering what sets of orders or QRs are potentially relevant than a generic search.  </p>\n<p>Therefore, I think we <em>don't</em> want to use the launch context mechanism defined by the new SMART App Launch spec, which would mean passing in a request for launch/questionnaireresponse, launch/medicationrequest, launch/servicerequest, etc.</p>\n<p>As I read things, we're better off defining a 'custom' context (or set of contexts) that would have the behavior we want.  However, that's sort of unfortunate as I suspect we're not the only SMART app who would like to be launched in the context of \"whichever of these resource types, if any, happen to be in current context - but don't prompt the user if there aren't any/all of them\".  Has this use-case been thought about?  Is there already a way to do this that I somehow missed?  If not, does it seem like something that would be worth standardizing?  If we create something custom, would it still be appropriate for the results to come back in the fhirContext element?</p>",
        "id": 275597213,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1647479655
    },
    {
        "content": "<p>Your assessment is correct -- we don't currently account for semantics like \"exactly one of\" or \"only if it's already available\". However assuming you're using the EHR launch, this is already in the realm of \"system specific configuration\", so it doesn't matter too much how you ask for it (or even if you ask explicitly at runtime or implicitly at configuration time).</p>\n<p>Returning a result in fhirContext makes sense however it's requested, assuming you're targeting the new <a href=\"http://jira.hl7.org/browse/FHIR-35801\">FHIR-35801</a> and defining a role value like \"dtr-request\".</p>\n<p>(BTW <span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span> is doing the work for this technical corrections still on your queue?)</p>",
        "id": 275598637,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1647481271
    },
    {
        "content": "<p>So you don't think there's utility in a 'standard' way to say \"give me this resource if it's in current context, but don't prompt for it otherwise\"?</p>",
        "id": 275602417,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1647485961
    },
    {
        "content": "<p>My understanding if we do something non-standard is it should be \"__dtr-request\"?</p>",
        "id": 275602474,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1647486006
    },
    {
        "content": "<p>or, to be extra safe \"__davinci-dtr-request\"</p>",
        "id": 275602515,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1647486024
    },
    {
        "content": "<p>For scopes, you can prefix with underscores or use a full URL like <code>http://hl7.org/fhir/us/davinci-dtr/smart-app-launch-request</code>. But I'm not seeing a huge interop benefit to trying to standardize general purpose semantics (i.e., for scope modifiers like \"exactly one of\" or \"only if you've got it already\") at this stage because an EHR will need to write custom code to support DTR anyway</p>",
        "id": 275603058,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1647486720
    },
    {
        "content": "<p>Just defining something use case specific seems OK</p>",
        "id": 275603114,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1647486779
    },
    {
        "content": "<p>We don't even have super consistent support for our core scopes like encounter selection, so I'd hesitate to go deeper</p>",
        "id": 275603200,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1647486891
    },
    {
        "content": "<p>Ok.  We don't really need to say \"send one of\".  Simply saying \"send if it's in context, but don't prompt for it\" for all of the possibilities is sufficient.  There's little likelihood of there being more than one in context, and if there is, it'll be up to the app to figure it out.  So all we'd really be looking for is a standard resource context, with the ability to say \"no-prompt\".  I'll leave it to others to see if they think there's value in that.  For now, we'll proceed with something custom.</p>",
        "id": 275603646,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1647487519
    },
    {
        "content": "<p>Even if you are just looking for standard resource context though, your initial message indicates that there is not any one specific resource type that you would want to ask for; and there is not currently a way to ask for context by role although that's presumably something that would be part of the technical correction.</p>",
        "id": 275604351,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1647488467
    },
    {
        "content": "<p>I would ask for a whole bunch - with the expectation I'd probably get only one, maybe a few.<br>\nE.g. launch/medicationrequest#noprompt, launch/servicerequest#noprompt, launch/questionnaireresponse#noprompt, etc.</p>",
        "id": 275604823,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1647489160
    },
    {
        "content": "<p>Does that +1 signal that you think there might be value in defining such a '#noprompt' mechanism as a standard part of SMART app launch in the future?</p>",
        "id": 275606623,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1647491696
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191315\">Josh Mandel</span> <a href=\"#narrow/stream/179170-smart/topic/'Optional'.20launch.20parameters/near/275603200\">said</a>:</p>\n<blockquote>\n<p>We don't even have super consistent support for our core scopes like encounter selection, so I'd hesitate to go deeper</p>\n</blockquote>\n<p>Could it be that going deeper could also bring value to the elementary use cases?</p>\n<p>From my perspective, it would be nice to get the ref to the Encounter if the EHR considers it to be \"in the context\" of the launch and if I list patient/Encounter or user/Encounter in the scopes of my app. The same for Appointment, Observation, CarePlan, MedicationRequest, QuestionnaireResponse...</p>",
        "id": 275645764,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1647521024
    },
    {
        "content": "<p>Regarding prompts, and just as a side note, we have seen an implementation demanding that launch/patient be in scope for it to even allow stand-alone launch of a patient facing app, and others that select the right patient (you) based on login info to patient portal if you don't specify that scope, and require an extra step of selecting your identity (the only one available on a list) if you do include the scope.</p>",
        "id": 275646340,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1647521321
    },
    {
        "content": "<p>(I guess the latter is due to <a href=\"http://build.fhir.org/ig/HL7/smart-app-launch/scopes-and-launch-context.html#apps-that-launch-from-the-ehr\">http://build.fhir.org/ig/HL7/smart-app-launch/scopes-and-launch-context.html#apps-that-launch-from-the-ehr</a> saying </p>\n<blockquote>\n<p>The EHR MAY refuse authorization requests including patient/ that do not also include a valid launch/patient scope, or it MAY infer the launch/patient scope.</p>\n</blockquote>\n<p>That makes it hard to implement an app that works nicely (does not require a prompt when the patient can be inferred) and also with EHRs that require the launch/patient scope to be present.</p>",
        "id": 275647349,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1647521801
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  - just double checking, but are you wanting to pass the resource as part of the launch context?  Or a reference to the resource (like we do for encounter and patient)?</p>",
        "id": 275654270,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1647524779
    },
    {
        "content": "<blockquote>\n<p>From my perspective, it would be nice to get the ref to the Encounter if the EHR considers it to be \"in the context\" of the launch and if I list patient/Encounter or user/Encounter in the scopes of my app. The same for Appointment, Observation, CarePlan, MedicationRequest, QuestionnaireResponse...</p>\n</blockquote>\n<p>For EHR launch, this is already the case. You just ask for launch context and the EHR gives you all the contexts that it has that it thinks is relevant. What we're getting into in this discussion is more about hints about what an app thinks might be relevant to inform the EHR.</p>\n<p>From <a href=\"http://hl7.org/fhir/smart-app-launch/scopes-and-launch-context.html#apps-that-launch-from-the-ehr\">http://hl7.org/fhir/smart-app-launch/scopes-and-launch-context.html#apps-that-launch-from-the-ehr</a> describes EHR Launch context scopes as:</p>\n<blockquote>\n<p>“hints” regarding which contexts the app would like the EHR to gather. The EHR MAY ignore these hints.</p>\n</blockquote>\n<p>(Note this is different from standalone launch where the EHR SHOULD include any requested parameters and SHALL provide patient context if requested.)</p>",
        "id": 275660607,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1647527195
    },
    {
        "content": "<blockquote>\n<p>Does that +1 signal that you think there might be value in defining such a '#noprompt' mechanism as a standard part of SMART app launch in the future?</p>\n</blockquote>\n<p>No I was just signaling that I understood the request. If you did want to formulate one, given the language above it might be more helpful to formulate a \"!important\" type of suffix because the current requests are already pretty much optional. But again, I don't know that any of this really matters at runtime for interoperability in the use cases we have delineated here.</p>",
        "id": 275660806,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1647527274
    },
    {
        "content": "<blockquote>\n<p>(BTW <code>Vassil Peytchev</code> is doing the work for this technical corrections still on your queue?)</p>\n</blockquote>\n<p>Yes, it is! HIMSS is over, so I will be spending more time in FHIR.</p>",
        "id": 275847876,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1647629960
    }
]