[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194452\">@Bas van den Heuvel</span> submitted <a href=\"https://jira.hl7.org/browse/FHIR-32213\">https://jira.hl7.org/browse/FHIR-32213</a> and it raises an important question about parameter naming. I've proposed a disposition saying we should keep the <code>aud</code> parameter instead of renaming to <code>resource</code>, for compatibility reasons. But please review my proposed disposition and comment here or in Jira if you disagree. (<span class=\"user-mention\" data-user-id=\"191609\">@Matt Randall</span> since you initially identified the need for this param, I wonder if you have a perspective, 6 years later ;-))</p>",
        "id": 244614247,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1625167153
    },
    {
        "content": "<p>Hello!  I hadn't been aware of RFC 8707 [1], but I'm glad to see that the problem has been recognized and is being tackled by the standards community!</p>\n<p>I agree with your comments, typically the way that this is handled in software engineering is to first declare the parameter/input as \"deprecated\" and support the replacement in a major version release (providing an overlap period in which both can be utilized.)  Then, in the next major version, deprecated elements are removed.</p>\n<p>I think the commentary in your disposition points to the uncertainty about when/if a \"v3\" of SMART App Launch may come into existence, hence that implementations may end up supporting both \"indefinitely\".  </p>\n<p>At a minimum, I think it would make good sense to document that the audience parameter in SMART App Launch is semantically equivalent to the resource parameter in RFC 8707.  </p>\n<p>I think it would be a bit confusing to declare that applications \"MAY\" support the other name without formally requiring that authorization servers \"MUST\" support it (having \"MAY\" on both sides of the equation just makes everyone's life more difficult, here.)  I'd personally have no objections advocating for supporting this to help align SMART App Launch with RFC 8707, but it seems like there would need to be broad consensus/support between EHR implementations before doing so.</p>\n<p>[1]: <a href=\"https://datatracker.ietf.org/doc/html/rfc8707\">https://datatracker.ietf.org/doc/html/rfc8707</a></p>",
        "id": 244620625,
        "sender_full_name": "Matt Randall",
        "timestamp": 1625170464
    },
    {
        "content": "<p>Thanks for these comments -- I'll update the proposed disposition so our spec includes a note about this equivalence.</p>",
        "id": 244627029,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1625173651
    }
]