[
    {
        "content": "<p>Payers and providers may want to expose FHIR related portal functionality. Would the following scope be appropriate?:<br>\n\"portal_access\":  \"Request an access token that can be used to access a patient portal.\" </p>\n<p>if the scope was fulfilled it would result in two new properties in the access token payload: <br>\n\"portal_token\":\"sometokenvalue\"<br>\n\"portal_url\":\"<a href=\"https://www.something.com\">https://www.something.com</a>\"<br>\n-or-<br>\n\"portal_token\":\"sometokenvalue\"<br>\n\"portal_endpoint\":\"654987\" (FHIR Id for an endpoint resource)</p>\n<p>This would help consumer applications support B2B use cases.</p>",
        "id": 223981497,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1611620106
    },
    {
        "content": "<blockquote>\n<p>can be used to access a patient portal</p>\n</blockquote>\n<p>What does it mean for an app to \"access a patient portal\"? A portal is a user-facing web site, right?</p>",
        "id": 223981617,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1611620186
    },
    {
        "content": "<p>Yes, exactly. </p>\n<p>The portal screen we provide in this endpoint would be for B2B configurations, views, and other FHIR settings.</p>",
        "id": 223981667,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1611620238
    },
    {
        "content": "<p>so they would open up a website, nothing fancy.</p>",
        "id": 223981689,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1611620263
    },
    {
        "content": "<p>or we push them to a \"screen\" in a payer/provider app...</p>",
        "id": 223981751,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1611620294
    },
    {
        "content": "<p>But what is an app doing with this token? How is it used and what does it accomplish?</p>",
        "id": 223981809,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1611620345
    },
    {
        "content": "<p>Many people do not interact with the portals. They may begin to use an application first. If a patient downloads a consumer application first, they can still select a data source and activate their account. This would provide a consistent way for people who interact with their portals when using a consumer application as the point of entry.</p>",
        "id": 223981935,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1611620429
    },
    {
        "content": "<p>Even if they get the consumer application second, it may be nice to have easy access to the relevant portal webpage.</p>",
        "id": 223981975,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1611620477
    },
    {
        "content": "<p>A consumer applicatino will not be able to perform certain types of activities, like opt-in to share prior authorization status or to request that a diagnosis is shared with a physician.</p>",
        "id": 223982049,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1611620530
    },
    {
        "content": "<p>I think we're schedule for a 1:1 conversation soon -- would be good to talk through this, because I'm fundamentally not getting what you're saying. Patients need \"portal\" access in order to approve an app; that's where the approval happens.</p>",
        "id": 223982128,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1611620609
    },
    {
        "content": "<p>Sounds good. We can go through it then. </p>\n<p>One last attempt at clarity: Once a patient adds a data source (during the app login sequence), they will generally have portal access, but they did not necessarily interact with the portal in a meaningful way. </p>\n<p>These patients may have only interacted with the IMS and Authorization screens. We would not want someone to have to go through the login sequence every time they wanted to change a setting on their portal. Because of this, payers and providers may eventually have dedicated screens to perform FHIR functionality, like prior auths, and to manage opt-ins (consumer devices cannot act as a HIPAA covered entity).</p>\n<p>This link in the access token payload would provide easy access to the portal. The \"portal_token\" is used to enable the portal to open instantly without login.</p>",
        "id": 223982971,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1611621159
    },
    {
        "content": "<p>Ideally, this would be a direct link to the FHIR. configurations</p>",
        "id": 223983045,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1611621222
    },
    {
        "content": "<p>I see. You are basically asking the app to hold on to an authentication cookie for the user. This seems like a dramatically painful real-world security and compliance challenge</p>",
        "id": 223983175,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1611621329
    },
    {
        "content": "<p>But I get it now!</p>",
        "id": 223983199,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1611621350
    },
    {
        "content": "<p>The app already has a dangerous token, but i see your point. The security is not worth the minimal convenience. </p>\n<p>They can log in again. I am okay with that. In most cases, the phone/internet browser saved the PW anyway.</p>",
        "id": 223983492,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1611621601
    },
    {
        "content": "<p>Yeah, I would focus on defining apis for the features you want, and if you want a little bit of flexibility you can define apis by which the app can discover URLs representing to-do items, and those URLs can come with authorization tokens built in specifically for completing one task like approving one prior authorization request.</p>",
        "id": 223983649,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1611621699
    },
    {
        "content": "<p>(and then it is up to the EHR to decide whether a specific prior auth link works on a simple click-through or whether requires a full sign-in event or something in between like a pin entry)</p>",
        "id": 223983709,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1611621723
    },
    {
        "content": "<p>Some payers and providers may update their web portals to support new use cases like FHIR configurations. Creating new b2c APIs to support configurations changes is certainly an option. I see this as a different IG, perhaps under CARIN. Providing a link to a portal webpage that has the FHIR settings may be a good stopgap measure.</p>",
        "id": 223984884,
        "sender_full_name": "Josh Lamb",
        "timestamp": 1611622654
    }
]