[
    {
        "content": "<p>What's the best way to ask patients for consent for following scopes on login? But first question before that, is it required as per SMART or as per ONC rule? Or can it be given implicitly?</p>\n<ul>\n<li>openid</li>\n<li>fhirUser</li>\n<li>launch/patient</li>\n</ul>\n<p>As i understand, these scopes are technical in nature and are kind of hard to put in a way that non-technical people may understand.<br>\nAny suggestions here!</p>",
        "id": 222461529,
        "sender_full_name": "Sagar Shah",
        "timestamp": 1610470817
    },
    {
        "content": "<p>consent tends to be handled at a different level than at OAuth... not everywhere, just a tendency.</p>\n<p>Often Consent is handled within the Resource Server and is not exposed at the OAuth level. See the Consent resource.</p>\n<p>There is a OAuth solution that did focus on Consent -- UMA HEART -- this would be orchestrated as a cascaded OAuth along with SMART. So you would have SMART deal with app authorization and user authorization; and HEART dealing with consent authorization.</p>",
        "id": 222465093,
        "sender_full_name": "John Moehrke",
        "timestamp": 1610472144
    },
    {
        "content": "<p>See the Security and Privacy pages in the FHIR specification <a href=\"http://hl7.org/fhir/secpriv-module.html\">http://hl7.org/fhir/secpriv-module.html</a></p>",
        "id": 222465166,
        "sender_full_name": "John Moehrke",
        "timestamp": 1610472191
    },
    {
        "content": "<p>I'm hearing this as a question about best practices and requirements for implementing SMART App Launch</p>",
        "id": 222465218,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1610472218
    },
    {
        "content": "<p>For patient apps, you definitely want to make sure there is an explicit approval step where a patient allows access before you proceed.</p>",
        "id": 222465306,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1610472247
    },
    {
        "content": "<p>...but you do not have to ask explicit approval for specific scopes like <code>openid</code> - some generic statement is OK</p>",
        "id": 222465606,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1610472383
    },
    {
        "content": "<p>The descriptions for these Scopes that you listed above are basically \"allow the app to know who you are and see your contact details\" (<code>fhirUser</code> + <code>openid</code> scopes) and \"allow the app to have access to the patient record you have selected\" (<code>launch/patient</code> scope -- though usually this is used in conjunction with specific patient data access scopes like <code>patient/Immunization.read</code> so it is easier to explain these together, like \"allow the app to see which select patient you have selected and see immunizations for this patient\"</p>",
        "id": 222465620,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1610472390
    },
    {
        "content": "<p>Agreed <span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span>  -- hopefully this aligns with the paragraph I was typing above :-)</p>",
        "id": 222465664,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1610472414
    },
    {
        "content": "<p>(Part of what we are recommending in our updated guidance for smart is that server authors should publish more details about the kinds of explanatory language they use for these approvals so that it's easier for developers to get a sense of common practices.)</p>",
        "id": 222465746,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1610472450
    },
    {
        "content": "<p>(In the meantime, I would definitely recommend registering with some of the EHR vendor sandboxes and having a look at the approval screens they render.)</p>",
        "id": 222465783,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1610472472
    },
    {
        "content": "<p>Appreciate the clarifications on this here!</p>",
        "id": 222490998,
        "sender_full_name": "Sagar Shah",
        "timestamp": 1610483980
    }
]