[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197072\">@Paul Church</span> just brought up some interesting edge cases that we can take up on a future call. As background reading, <a href=\"https://cloudblogs.microsoft.com/opensource/2020/01/07/fhir-subscriptions-state-changes/\">https://cloudblogs.microsoft.com/opensource/2020/01/07/fhir-subscriptions-state-changes/</a> deals with some similar issues.</p>",
        "id": 211805422,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1601492555
    },
    {
        "content": "<p>Wrote up some examples and proposed rules for SMART and transactions: <a href=\"https://gist.github.com/paulchurch/92d2385dca120fb51a43a45289d37bd1\">https://gist.github.com/paulchurch/92d2385dca120fb51a43a45289d37bd1</a></p>",
        "id": 213218184,
        "sender_full_name": "Paul Church",
        "timestamp": 1602623912
    },
    {
        "content": "<p>Thanks for this!</p>",
        "id": 213222844,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1602626752
    },
    {
        "content": "<blockquote>\n<p>root patient being updated to refer to the CREATE entry </p>\n</blockquote>\n<p>Can you explain what this means? A patient's id presumably can't change, but that's the only way I'm thinking of to interpret...</p>",
        "id": 213222916,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1602626790
    },
    {
        "content": "<p>Reading the examples now... I'm starting to understand it has something to do with <a href=\"http://Patient.link\">Patient.link</a>. There's an interesting underlying assumption about compartment membership and <a href=\"http://Patient.link\">Patient.link</a>, which is maybe worth making explicit.</p>",
        "id": 213223453,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1602627124
    },
    {
        "content": "<p>It'd also be good to say something about the implied processing model: taking FHIR semantics to evaluate the deletes, then creates, then updates, then reads... And after doing all of that, making a determination about whether the transaction is <em>allowed</em> by policy to be applied (which in turn means evaluating some pre- transaction state and some post-transaction state).</p>",
        "id": 213224048,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1602627595
    },
    {
        "content": "<p>I'm creating an Organization, and updating Patient/123 to refer to it, and I have <code>patient/*.*</code> for Patient/123</p>",
        "id": 213224144,
        "sender_full_name": "Paul Church",
        "timestamp": 1602627662
    },
    {
        "content": "<p>otherwise you can create things in a compartment that refer to the Patient, but you can't create things in a compartment that the Patient refers to</p>",
        "id": 213224200,
        "sender_full_name": "Paul Church",
        "timestamp": 1602627707
    },
    {
        "content": "<p>OK -- so we're using the word \"compartment\" here in not-quite-precisely the way that FHIR uses it.</p>",
        "id": 213229642,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1602631226
    },
    {
        "content": "<p>hmm, that's true - we're using the Patient $everything definition</p>",
        "id": 213233126,
        "sender_full_name": "Paul Church",
        "timestamp": 1602634289
    },
    {
        "content": "<p>Do you want to comment on the \"headers\" as well? Is this just ad hoc syntax or something you'd want to formalize for reverse proxies in front of a FHIR server?</p>",
        "id": 213288887,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1602682660
    },
    {
        "content": "<p>That's just ad hoc for this discussion</p>",
        "id": 213298191,
        "sender_full_name": "Paul Church",
        "timestamp": 1602686383
    },
    {
        "content": "<p>We are probably too casual about using \"compartment\" to mean \"resources associated with a patient\".</p>\n<p>As far as I can tell, the SMART spec doesn't say anything about what resources are associated with a patient, or whether a patient scope gives access to some or all non-compartment resources. It does say \"Note that some EHRs may not enable access to all related resources - for example, Practitioners linked to/from Patient-specific resources\" which seems completely unhelpful. Maybe you'll get some data, maybe you won't. Can we standardize the answer to that?</p>",
        "id": 213305185,
        "sender_full_name": "Paul Church",
        "timestamp": 1602688773
    },
    {
        "content": "<p>are we considering in these usecases the use of ids and references that are only persistent within the bundle (uuids) These usecases seem to rely on PUT to create and referencing the soon-to-be id in any other resources in the transaction. <br>\nI bring this up because the core fhir spec defines the transaction processing rules as DELETE &gt; POST &gt; PUT (and to my knowledge they are ordered this way to specifically be able to resolve any uuid references before the resources are created) <a href=\"https://www.hl7.org/fhir/http.html#trules\">https://www.hl7.org/fhir/http.html#trules</a></p>\n<p>But I noticed that this proposal seems to re-organize those to instead be DELETE &gt; PUT &gt; POST<br>\nThe more I consider this as I type I think I'm wrong in my interpretation, but I'm not sure of what else you could be proposing; a pre-commit walkthrough the affected resources to see if any references break?</p>",
        "id": 213306071,
        "sender_full_name": "ryan moehrke",
        "timestamp": 1602689077
    },
    {
        "content": "<p>No, we are considering real IDs set by the client (upserts). It's possible that we still need to reconcile these ideas with the transaction processing rules.</p>",
        "id": 213307732,
        "sender_full_name": "Paul Church",
        "timestamp": 1602689613
    },
    {
        "content": "<p>On today's call, this discussion expanded to \"wait, how does <em>reading</em> data work\"; which expanded to \"should access like <code>patient/*.rs</code> come along with the ability to read data about Practitioners, Organizations, and metadata like ValueSets, etc?</p>\n<p>We didn't have a super-crisp answer, and that's <em>kind of</em> intentional.</p>",
        "id": 213337332,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1602702490
    },
    {
        "content": "<h3>Here's where I got to in jotting down my thoughts post-call (captured in our <a href=\"https://docs.google.com/document/d/1PL0YIhe6IzTECXO9SkezSnk80b3R-KiEk4e0_GuaBhs/edit#bookmark=id.8v7jhlsh9lmf\">shared notes doc</a>):</h3>\n<ul>\n<li>\"What permissions come along with access to observations?\" e.g., linked patients, etc?<ul>\n<li>\"Party line\" == the decision about what data the user is allowed to see belongs to the EHR; rule of thumb might be \"data in your record + data needed to interpret your record\" but the real-life details are super complex (influenced by state laws, health system policies/defaults, etc). SMART doesn't try to model this, but only models how a user's permissions are shared downstream with an app</li>\n</ul>\n</li>\n<li>\"Generic FHIR server needs\" == Much, much more!<ul>\n<li>General-purpose language for defining data that can be read/written, possibly in terms of references to other data, or in terms of coded data types (e.g., one set of rules for data about substance abuse history), or in terms of time/lockos (e.g., how to specify when a lab result is \"released to\" a patient)</li>\n</ul>\n</li>\n</ul>",
        "id": 213337428,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1602702548
    },
    {
        "content": "<p>I'd welcome feedback! And I continue to believe that work is required on the \"Generic FHIR server\" front, but the consensus group is slightly different than the SMART v2 project.</p>",
        "id": 213337546,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1602702609
    },
    {
        "content": "<p>We actually do not allow apps to ask for patient/Organization or patient/Practitioner (many others) type scopes because they're nonsensical/aren't enforceable</p>",
        "id": 213338666,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1602703237
    },
    {
        "content": "<p>and we do require that they have the scope for any linked (not contained) resource in order to read it</p>",
        "id": 213338734,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1602703269
    },
    {
        "content": "<p>(note: I believe we started using user/... only for those types of resources after conversation on here... I can try to track down the original discussion)</p>",
        "id": 213338807,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1602703321
    },
    {
        "content": "<p>If I have patient/Patient.read can I read the Organization referenced by it though? Or do I need user/Organization.read?</p>",
        "id": 213338983,
        "sender_full_name": "Paul Church",
        "timestamp": 1602703415
    },
    {
        "content": "<p>You would need the user/Organization.read as well/the app would need to request it</p>",
        "id": 213339321,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1602703592
    },
    {
        "content": "<p>here's the <a href=\"#narrow/stream/179170-smart/topic/scopes\">old conversation</a> (notice how long ago... and that as it goes on it starts to discuss the \"SMART 2.0\" approaches :) ).</p>",
        "id": 213339455,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1602703663
    },
    {
        "content": "<p>Jenni's statement makes sense to me. How about this: patient scopes only apply to actual compartment members. To read referenced non-compartment resources you need user scopes for those resource types. I don't know if we want to allow searches on non-compartment resources under that scope since the user scope is going to be all resources in a non-EHR permissions model.</p>",
        "id": 213346765,
        "sender_full_name": "Paul Church",
        "timestamp": 1602707813
    },
    {
        "content": "<p>Are any elements filtered based on user information?  E.g., if I have an app that wants practitioner names and photos, it doesn't mean that I should have their home addresses.</p>\n<p>Otherwise, it might be a good boundary point (e.g., <code>user</code> has everything, <code>patient</code> has limited access).</p>",
        "id": 213347168,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1602708053
    },
    {
        "content": "<p>Out of scope for the general-purpose fhir server case. We currently have no way to specify that, so we just give out the resources.</p>",
        "id": 213347903,
        "sender_full_name": "Paul Church",
        "timestamp": 1602708306
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"197072\">Paul Church</span> <a href=\"#narrow/stream/179170-smart/topic/Authorization.20for.20transactions/near/213346765\">said</a>:</p>\n<blockquote>\n<p>patient scopes only apply to actual compartment members. To read referenced non-compartment resources you need user scopes for those resource types. </p>\n</blockquote>\n<p>Could user scope apply to compartment members? If yes, why not just use user scope instead of mixing patient scope and user scope? Is this also true for patient facing standalone app? <span class=\"user-mention\" data-user-id=\"197072\">@Paul Church</span></p>",
        "id": 227680683,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1614204066
    },
    {
        "content": "<p>Yes, this is sort of a mismatch for our use case and we could just use user scopes. Without an EHR permissions model to draw on, there is no concept of a user separate from a patient.</p>",
        "id": 227704259,
        "sender_full_name": "Paul Church",
        "timestamp": 1614216386
    },
    {
        "content": "<p>Then what is the purpose for patient scope? Almost all patient compartment resources haver reference to non compartment resources. A simple query to get Observations could not be fully achieved by using patient scope only without pull Observation.performer information.</p>",
        "id": 227798097,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1614271583
    },
    {
        "content": "<p>Quick question<br>\nA client application that is authenticating with my system for SoF tests, is providing a “state” value in its authorization request that is too long for my system to handle. Currently my system can accept a state value up to 100 characters (this is the maximum size that the database table column can currently handle for this value). In this case, it appears that the state value being provided by the client app is 124 characters long.<br>\nMy question is, what is a best practice “state value”. Is there a length that is recommended?</p>",
        "id": 273842218,
        "sender_full_name": "Tanvi Shah",
        "timestamp": 1646241373
    },
    {
        "content": "<p>We don't have any formal requirements on how long a state the EHR needs to support. We do have a hard requirement that apps </p>\n<blockquote>\n<p>SHALL use an unpredictable value for the state parameter with at least 122 bits of entropy</p>\n</blockquote>\n<p>This can be achieved in 36-char UUIDs, So your current implementation supporting 100 characters meets that floor and provides  breathing room.</p>\n<p>That said, without digging into the details I was going to suggest 128 characters would be a fair target, and it sounds like that would support this specific client app. Do you know how they are structuring their state values and whether they are conforming with our requirements above?</p>",
        "id": 273855499,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1646246151
    }
]