[
    {
        "content": "<p>Hello everyone, <br>\nFor SMART backend services, for the jwks public keys, what format is expected. Does it need to have \"use\":\"sig\" param in the body or not? I could not find any concrete example for the same? Our OpenID server requires tihs parameter, while I could not find an example on SMART on FHIR website as this link is broken there (<a href=\"http://build.fhir.org/ig/HL7/bulk-data-export/authorization/sample-jwks/RS384.public.json\">http://build.fhir.org/ig/HL7/bulk-data-export/authorization/sample-jwks/RS384.public.json</a>) and inferno jwks keys does not have \"use\" in the json body. <br>\nAny clarification on this is appreciated</p>",
        "id": 249299555,
        "sender_full_name": "Sagar Shah",
        "timestamp": 1628806335
    },
    {
        "content": "<p>We don't say anything about this specifically, and the base jwk specification leaves this optional. <a href=\"https://github.com/smart-on-fhir/bulk-data-server/blob/master/static/keys/RS384.public.json\">https://github.com/smart-on-fhir/bulk-data-server/blob/master/static/keys/RS384.public.json</a> is a working link to our example keys, and looks like it omits this property.</p>\n<p>So: as a client, you shouldn't depend on this property</p>",
        "id": 249303366,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1628808776
    },
    {
        "content": "<p>In my experience, depending on how the key has been generated, this property may or may not be included. If you know that this is a public key you can assume <code>use: \"sig\"</code>.  This is similar to <code>\"key_ops\": [\"verify\"]</code>.</p>\n<p>However, a JWKS is just a collection of JWK keys and in theory you might have anything in there (including private keys). A strict implementation on the client side may/should not trust that all keys in the JWKS are public and may want to filter out any private keys using the <code>use</code> or <code>key_ops</code> properties.</p>\n<p>In this case the important thing is to make sure you ONLY host public keys in that JWKS. Once you are certain of that, you can even manually add <code>use</code> or <code>key_ops</code> to those keys if needed, and that will not invalidate them in any way.</p>",
        "id": 249304732,
        "sender_full_name": "Vladimir Ignatov",
        "timestamp": 1628809854
    },
    {
        "content": "<p>Thank you for the responses. It seems we are blocked on this with our Open ID implementation tool as it does require <code>use</code> parameter only and as per specs it says - Use of the \"use\" member is OPTIONAL, <strong>unless the application requires its presence.</strong></p>",
        "id": 249361146,
        "sender_full_name": "Sagar Shah",
        "timestamp": 1628861881
    },
    {
        "content": "<p>You can just add this field to any keys you want to parse in your library, if needed --- are you saying that your library is responsible for fetching and parsing jwks files directly, with no opportunity for intervention?</p>",
        "id": 249365836,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1628864343
    },
    {
        "content": "<p>Our auth server (Open ID) is an open source product Ory Hydra, so I have put up a request on their github as well if this change can be accomodated there. but if they are still compliant with OIDC, then they may not take this up. and as a result inferno keys (I believe inferno is one of the tools to be used for certifications for Cures Act) won't work with our OpenID solution. Our Auth server only stores the public url of jwks keys and connect to that endpoint and retrieve keys \"as is\". It does support storing keys in raw format as well, but inferno does not recommend that approach for certification needs</p>",
        "id": 249373404,
        "sender_full_name": "Sagar Shah",
        "timestamp": 1628867816
    },
    {
        "content": "<p>According to <a href=\"http://hl7.org/fhir/uv/bulkdata/STU1.0.1/authorization/index.html#registering-a-smart-backend-service-communicating-public-keys\">Bulk Data Backend Service Authorization Guide</a>, using JWK Set directly is <strong>strongly discouraged</strong></p>",
        "id": 249439781,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1628914501
    },
    {
        "content": "<p>A broader question is that if Inferno add <code>\"use\": \"sig\"</code> to its public key, would that cause other servers to fail because \"The \"use\" and \"key_ops\" JWK members SHOULD NOT be used together\"</p>",
        "id": 249736281,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1629214515
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191506\">@Yunwei Wang</span>  for your response. We are using public Jwk url of the client and that seems to be working as long as that url provides \"use\":\"sig\" in its key because our Open ID implementation uses this key. Even though use of both key_ops and use together is discouraged it should still support and allow as long as the values for both key_ops and use are consistent. Also is it not possible to have a different public key with use instead of key_ops as we can have multiple jwks keys exposed via that url?</p>",
        "id": 249745287,
        "sender_full_name": "Sagar Shah",
        "timestamp": 1629218486
    },
    {
        "content": "<p>Have you tried save the public key locally, insert the <code>use</code> property, and register Inferno using that modified key?</p>",
        "id": 249749103,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1629220246
    },
    {
        "content": "<p>Yes. I tried that option and verified that it solved the issue</p>",
        "id": 249750165,
        "sender_full_name": "Sagar Shah",
        "timestamp": 1629220818
    },
    {
        "content": "<p>OK. That confirms that the <code>use</code> tag does not actually impact the encryption and decryption. Is that right?</p>",
        "id": 249752944,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1629222103
    },
    {
        "content": "<p>Not sure, if I understood your queston correctly. </p>\n<p>As I see use can have two values. </p>\n<ol>\n<li>sig - indicating its used for verifying signature  (equivalent to key_ops=[verify]</li>\n<li>enc - indicating its used for encryption</li>\n</ol>\n<p>When I used sig='use' for the inferno keys in raw format for my regitered client(for testing), I found that token endpoint was working fine</p>",
        "id": 249754242,
        "sender_full_name": "Sagar Shah",
        "timestamp": 1629222771
    },
    {
        "content": "<p>Does BDA-07 and BDA-08 pass?</p>",
        "id": 249754438,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1629222874
    },
    {
        "content": "<p>I am not able to test it from inferno as I cannot change publi inferno jwks url, but I verified that for BDA-07, I was getting token using postman. if we have inferno url with use:sig then I can verify that from inferno. For now, I am not sure how do I bypass and use a different key when testing from inferno. Because of this, BDA-08 is being skipped as well</p>",
        "id": 249755861,
        "sender_full_name": "Sagar Shah",
        "timestamp": 1629223487
    },
    {
        "content": "<p>Inferno need to be preregistered as client with its public key to get client_id from authorization server. I assume you can: register Inferno using the locally saved JWKS instead of the JWKS url. Then run the Inferno Multi-Patient tests. I am wondering if that works.</p>",
        "id": 249757550,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1629224299
    },
    {
        "content": "<p>Yes, with that approach it did pass. <a href=\"/user_uploads/10155/5wAMdAUlLEip7yTFSrHczPCt/image.png\">image.png</a>  However, BDA-06 failed for a different reason. This issue is of invalid client and OpenID implementation is returning 401 instead of 400 (which is another issue that I am investigating) as there too OpenID spec says it can return 401 when invalid_client error is returned</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/5wAMdAUlLEip7yTFSrHczPCt/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/5wAMdAUlLEip7yTFSrHczPCt/image.png\"></a></div>",
        "id": 249763626,
        "sender_full_name": "Sagar Shah",
        "timestamp": 1629226949
    },
    {
        "content": "<p>So I am also wondering if this (other issue about invalid client on BDA-06) should be reported as a bug on inferno or not?</p>",
        "id": 249764485,
        "sender_full_name": "Sagar Shah",
        "timestamp": 1629227384
    },
    {
        "content": "<p>Can you post the server response headers?</p>",
        "id": 249766587,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1629228454
    },
    {
        "content": "<p>For BDA-06:<br>\nHeaders<br>\ndate: Tue, 17 Aug 2021 18:56:26 GMT<br>\ncontent_type: application/json;charset=ISO-8859-1<br>\ncontent_length: 262<br>\nconnection: keep-alive<br>\ncache_control: no-cache, no-store, max-age=0, must-revalidate<br>\npragma: no-cache<br>\nexpires: 0<br>\nstrict_transport_security: max-age=31536000; includeSubDomains<br>\nx_frame_options: ALLOWALL<br>\nx_xss_protection: 1; mode=block<br>\nx_content_type_options: nosniff<br>\nreferrer_policy: no-referrer<br>\ncontent_security_policy: default-src https:; connect-src https: wss:; font-src https: data:; frame-src https:; frame-ancestors https: http:; img-src https: data:; media-src https:; object-src https:; script-src 'unsafe-inline' 'unsafe-eval' https:; style-src 'unsafe-inline' https:;<br>\nfeature_policy: payment 'none';</p>\n<p>For BDA-07:<br>\ndate: Tue, 17 Aug 2021 18:56:26 GMT<br>\ncontent_type: application/json;charset=UTF-8<br>\ntransfer_encoding: chunked<br>\nconnection: keep-alive<br>\ncache_control: no-cache, no-store, max-age=0, must-revalidate<br>\npragma: no-cache<br>\nexpires: 0<br>\nstrict_transport_security: max-age=31536000; includeSubDomains<br>\nx_frame_options: ALLOWALL<br>\nx_xss_protection: 1; mode=block<br>\nx_content_type_options: nosniff<br>\nreferrer_policy: no-referrer<br>\ncontent_security_policy: default-src https:; connect-src https: wss:; font-src https: data:; frame-src https:; frame-ancestors https: http:; img-src https: data:; media-src https:; object-src https:; script-src 'unsafe-inline' 'unsafe-eval' https:; style-src 'unsafe-inline' https:;<br>\nfeature_policy: payment 'none';</p>\n<p>Does this help?</p>",
        "id": 249766880,
        "sender_full_name": "Sagar Shah",
        "timestamp": 1629228602
    },
    {
        "content": "<p>RFC6749 <a href=\"https://datatracker.ietf.org/doc/html/rfc6749#section-5.2\">section 5.2</a> states that </p>\n<blockquote>\n<p>The authorization server MAY<br>\n               return an HTTP 401 (Unauthorized) status code to indicate<br>\n               which HTTP authentication schemes are supported.</p>\n</blockquote>\n<p>That does make sense I think. Please create a github issue on Inferno Program for this. We will add 401 as expected status code. Thanks <span class=\"user-mention\" data-user-id=\"344150\">@Sagar Shah</span></p>",
        "id": 249767859,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1629228902
    },
    {
        "content": "<p>Thanks a lot for confirmation <span class=\"user-mention\" data-user-id=\"191506\">@Yunwei Wang</span> . I will create a ticket for this shortly today.</p>",
        "id": 249768524,
        "sender_full_name": "Sagar Shah",
        "timestamp": 1629229227
    },
    {
        "content": "<p>Also do you consider adding \"use\":\"sig\" as well in the inferno keys? Or that still requires more investigation and research? Please advise</p>",
        "id": 249768759,
        "sender_full_name": "Sagar Shah",
        "timestamp": 1629229330
    },
    {
        "content": "<p>Created <a href=\"https://github.com/onc-healthit/inferno-program/issues/345\">https://github.com/onc-healthit/inferno-program/issues/345</a></p>",
        "id": 249769965,
        "sender_full_name": "Sagar Shah",
        "timestamp": 1629229952
    },
    {
        "content": "<p>It is up to the server on how to register a client using public key. This is out of Inferno testing process. As we have tested, it does not prevent a server from registering Inferno as a client (with a work around) and it does not affect encryption and decryption. IMO Infenro does not need to accommodate that optional parameter to avoid any side effects on other servers.</p>",
        "id": 249770238,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1629230090
    },
    {
        "content": "<p>Ok. I understand. But would/can that cause an impact on certification process as inferno is the tool (as I have heard) being used for certification. Of course with workaround it works fine, but not certain if that's acceotable to certifying agencies. So I was suggesting a change in public keys or maybe additional keys using the \"use\" parameter</p>",
        "id": 249770869,
        "sender_full_name": "Sagar Shah",
        "timestamp": 1629230379
    },
    {
        "content": "<p>At Drummond, we also have a couple of customers using an open source Hydra that passes a \"use:sig\" and Inferno fails their testing.  This is blocking them from passing the required ONC testing for g.10.  There are currently multiple issues open on this in the Inferno github; however, we cannot allow them to pass testing until it is at least acknowledged that this is a bug that Inferno does not allow \"use\" as an OAUTH key.</p>",
        "id": 250131944,
        "sender_full_name": "Jim Dow",
        "timestamp": 1629472845
    },
    {
        "content": "<p>Inferno does not \"allow\" or \"disallow\" any JWK parameter. Inferno doesn't provide <code>use</code> parameter because 1) the parameter is optional, and 2) Inferno uses the <code>key_ops</code> parameter to convey the same message. Since the parameter is optional in RFC 7515, then server shall be able to register a public key with or without that parameter.</p>",
        "id": 250143051,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1629478154
    },
    {
        "content": "<p>I am coming back to the this question again. Inferno is considering to add <code>use: sig</code> to the public keys. </p>\n<p>According to <a href=\"https://datatracker.ietf.org/doc/html/rfc7517#section-4.3\">RFC-7517</a></p>\n<blockquote>\n<p>The \"use\" and \"key_ops\" JWK members SHOULD NOT be used together;<br>\n   however, if both are used, the information they convey MUST be<br>\n   consistent.</p>\n</blockquote>\n<p>It should be fine to have both values in the same key, like</p>\n<div class=\"codehilite\"><pre><span></span><code>            &quot;use&quot;: &quot;sig&quot;,\n            &quot;key_ops&quot;: [\n                &quot;verify&quot;\n            ],\n</code></pre></div>\n<p>Will there be a problem to have both in the same public key? Thought?<br>\n<span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> <span class=\"user-mention\" data-user-id=\"193731\">@Vladimir Ignatov</span></p>",
        "id": 250664813,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1629917879
    },
    {
        "content": "<p>That'd be an inferno product decision. I think the downside is that it might provide rigid/narrow information about compatibility --- like, systems with hard-coded dependencies on specific optional properties might pass against Inferno but still fail against real-world, spec-compliant endpoints.</p>",
        "id": 250665023,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1629917971
    },
    {
        "content": "<p>(To my mind, ideally a testing tool like Inferno would be designed so that systems that \"pass\" tests with Inferno have the greatest possible chance of working with the whole spectrum of real-world spec-compliant endpoints.)</p>",
        "id": 250665342,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1629918082
    },
    {
        "content": "<p>Perhaps you can also list the same key twice. Once with <code>key_ops</code> and once with <code>use</code>.  Servers should try every key in the set and only fail if none of them works (although that is not something I have tested). Also, that may be problematic if those keys have <code>kid</code> which should be unique within the set.</p>",
        "id": 250667246,
        "sender_full_name": "Vladimir Ignatov",
        "timestamp": 1629918848
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> In this specific test case, we cannot say that a server requiring <code>use</code> parameter is non conformant to RFC-7517 because the RFC does <a href=\"https://datatracker.ietf.org/doc/html/rfc7517#section-4.2\">say</a></p>\n<blockquote>\n<p>Use of the \"use\" member is OPTIONAL, unless the application requires its presence.</p>\n</blockquote>",
        "id": 250672423,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1629920861
    },
    {
        "content": "<p>To clarify, client registration is not in Inferno test sequences. Inferno provides the key for server to register Inferno as a bulk data client before  tsting</p>",
        "id": 250673271,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1629921231
    },
    {
        "content": "<p>I'm saying that if backend service providers want to be widely compatible, they should avoid depending on specific optional properties as much as possible. If Inferno can nudge them in that direction (e.g, by omitting these optional properties), it'd improve interop overall.</p>",
        "id": 250673893,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1629921491
    },
    {
        "content": "<p>To my understanding both key_ops and use properties are optional, unless required by the application (OpenID provider). So if Authorization server requires \"use\" (or the \"key_ops\"), the client may have to register using that property on Authorization server. At present, inferno does not give that option and always assumes that OpenID provider will support key_ops parameter. That's where I am suggesting that if inferno could support any of the following, then that would work</p>\n<ul>\n<li>Allow option on the UI to choose  between \"use\" or \"key_ops\" from public key on the interface when running Bulk Data Tests and accordingly use a url that either produces key with \"use\" or \"key_ops\"</li>\n<li>Include both key_ops and use in the jwks keys</li>\n<li>Have separate public keys(with different kid) in the set as Vladimir suggested. One of them with \"use\" and other using \"key_ops\"</li>\n</ul>\n<p>Suggestions are welcome!</p>",
        "id": 250828865,
        "sender_full_name": "Sagar Shah",
        "timestamp": 1630007176
    },
    {
        "content": "<p>I'm confused by the mention of Open ID providers here -- neither party in the backend services interaction is necessarily an open ID provider (and if one of the parties happens to be that doesn't surface  in this particular interaction), right?</p>",
        "id": 250831781,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1630008313
    },
    {
        "content": "<p>By OpenID Provider I meant the Authz server (Authorization server), which complies with Open ID/Auth 2.0 Spec</p>",
        "id": 250831986,
        "sender_full_name": "Sagar Shah",
        "timestamp": 1630008417
    },
    {
        "content": "<p>From my perspective, the most helpful thing Inferno could do (given the current specification language) is to publish keys omitting these optional properties. This helps to ensure that authorization servers are robust to their absence. (If we think it's important for them to be present, the specification needs to make this clear. Otherwise we'll just see fragmentation in requirements across different authorization servers.)</p>",
        "id": 250832056,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1630008452
    },
    {
        "content": "<p>Right but as I see in specs, <br>\n<strong>Use of the \"use\" member is OPTIONAL, unless the application requires its presence</strong><br>\nSo application may still require it. so simply removing it (use or key_ops) from keys won't work either with many authz servers</p>",
        "id": 250832769,
        "sender_full_name": "Sagar Shah",
        "timestamp": 1630008746
    },
    {
        "content": "<p>You're citing an underlying framework specification; I'm talking about what we say at the level of the SMART Backend Services IG, which is intended to provide a profile for consistent use of those underlying specifications. Currently we do not require either field. If one server wants to require  key_ops, and another server wants to require use, and another server wants to impose no requirements... This leads to a non interoperable situation.</p>\n<p>We should tighten down our specification to be clear about what we mean, or else we should ensure that services are robust too any of these cases.</p>",
        "id": 250833535,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1630009068
    },
    {
        "content": "<p>Ideally, auth should work in any of the following cases:</p>\n<ul>\n<li>the public key has no <code>key_ops</code> or <code>use</code></li>\n<li>the public key has <code>key_ops</code> but does not have <code>use</code></li>\n<li>the public key has <code>use</code> but does not have <code>key_ops</code></li>\n<li>the public key has both <code>key_ops</code> and <code>use</code> </li>\n</ul>\n<p>However, we are dealing with an auth server that refuses to trust us by assuming that all the keys in the JWKS are indeed  public. I think that is good behavior so far (or at least a good intention :) ). It then excludes case 1 and case 2, picks <code>use</code> (case 3) as the only acceptable option and might also work with case 4.</p>\n<p>That said, my opinion is that:</p>\n<ol>\n<li>If an auth server wants to \"validate\" the keys, then it must work with either <code>use</code> or <code>key_ops</code>. It is not correct to require one and disregard the other</li>\n<li>Inferno - considering the nature of this tool it probably makes sense to provide as much flexibility as possible (eg. by having multiple keys), as long as that does not violate any specification.</li>\n<li>The Backend Services spec itself is probably OK as it is now, although this does point out a weak spot with JWKS URL auth type - since there is no opportunity for manual intervention  and key manipulation with this type of auth, clients need to be aware ahead of time if the server has specific expectation for the key structure.</li>\n</ol>",
        "id": 250837694,
        "sender_full_name": "Vladimir Ignatov",
        "timestamp": 1630010792
    },
    {
        "content": "<p>Really like this analysis. I'd re-examine (2) -- if the spec is correct, then I'm not sure it's good for Inferno to be \"flexible\" because it's used for certification of other systems, and a \"flexible\" Inferno can lead to \"brittle\" servers being certified. As I said earlier, that's a product decision for the inferno team; and not something for HL7 process to decide.</p>",
        "id": 250838313,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1630011122
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193731\">@Vladimir Ignatov</span> <br>\nAs stated in RFC-7515, an application can require that parameter though I am not so sure what \"application\" mean in that RFC. <br>\n<span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> <br>\nBulk Data client registration is not part of Inferno Program testing. It is a prerequisite. So this has nothing to do with the certification. The purpose to include <code>use</code> parameter is to help tester and implementer to register bulk data client.</p>",
        "id": 250856069,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1630020034
    },
    {
        "content": "<p>I think that language is too abstract to  be taken literally. For example, if you develop a client (like Inferno) and a server to connect to, then you control both sides and you can decide that your server will require <code>use</code> and your client's key will provide it.</p>\n<p>However, if you only control the client and that client should be able to connect to multiple servers (not under your control), then I cannot agree that any of those servers  should be allowed to require something that is otherwise optional.</p>\n<p>P.S. I think \"application\" is the app that \"consumes\" the public key. That would be the bulk data server in this case, or it's authorization server.</p>",
        "id": 250857100,
        "sender_full_name": "Vladimir Ignatov",
        "timestamp": 1630020771
    },
    {
        "content": "<p>Maybe Bulk Data IG could add a clarification that client MAY use either <code>use</code> or <code>key_ops</code> parameters and server SHALL be able to handle both of them.</p>",
        "id": 250864787,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1630027274
    },
    {
        "content": "<blockquote>\n<p>Yunwei Wang: Maybe Bulk Data IG could add a clarification that client MAY use either use or key_ops parameters and server SHALL be able to handle both of them.</p>\n</blockquote>\n<p>Would this mean the server SHALL be able to handle </p>\n<ul>\n<li>the case were neither is present, and </li>\n<li>the case where only <code>use</code> is present, and </li>\n<li>the case where only <code>key_ops</code> is present?</li>\n</ul>\n<p>Or just that servers SHALL handle the case where both are present? (If it's just \"SHALL handle the case when both are present\", then we might as well require clients to provide both all the time, because that'd be the only reliably support client behavior.)</p>",
        "id": 250952127,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1630079632
    },
    {
        "content": "<blockquote>\n<p>Bulk Data client registration is not part of Inferno Program testing. It is a prerequisite. So this has nothing to do with the certification. </p>\n</blockquote>\n<p>The end result is a JWKS URL binding to a client -- however that binding is <em>established at registration time</em>, the question is whether the contents a server receives when it dereferences the JWKS URL at runtime are going to <em>work</em> with a given server, or fail. So outside of <em>registration</em>, this is still an important <em>runtime</em> test that's part of certification.</p>",
        "id": 250952376,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1630079731
    },
    {
        "content": "<p>FWIW I just tried this with keycloak and I believe that auth server is also requiring the <code>use</code> field to be present.  The only documentation I've found to that effect is in an old issue tracker:  <a href=\"https://issues.redhat.com/browse/KEYCLOAK-11156\">https://issues.redhat.com/browse/KEYCLOAK-11156</a></p>\n<blockquote>\n<p>Consuming keys without validating alg and use is dangerous as such Keycloak requires these to be present. Hence the \"application\" in this case is Keycloak and we do require these for security reasons.</p>\n</blockquote>",
        "id": 251407668,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1630424911
    },
    {
        "content": "<p>True. I have seen many libraries that work with \"use\" parameter than key_ops. I would suppose client public keys should include both for compatibility with more authz servers as most authz server are more likely to support one or the other parameter if not both and and still comply with auth specs for jwks keys structure</p>",
        "id": 251471170,
        "sender_full_name": "Sagar Shah",
        "timestamp": 1630449239
    },
    {
        "content": "<p>Has anybody encountered real-world issues with software that refuses to import JWKs because they have both <code>use</code> and <code>key_ops</code>  designations?</p>",
        "id": 251476481,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1630452448
    },
    {
        "content": "<p>(I know that officially there is a recommendation against including these together, but I am curious whether there are  real world issues with this practice.)</p>",
        "id": 251476572,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1630452485
    },
    {
        "content": "<p>FYI I opened <a href=\"https://issues.redhat.com/browse/KEYCLOAK-19166\">https://issues.redhat.com/browse/KEYCLOAK-19166</a> but I would prefer for the keys used in conformance testing to just include the use field.  And if we had to pick one between the <code>use</code> field and the <code>key_ops</code> fields, I would recommend the <code>use</code> field at this point because<br>\n<a href=\"https://datatracker.ietf.org/doc/html/rfc7517\">rfc7517</a> says </p>\n<blockquote>\n<p>The \"key_ops\" parameter is intended for use cases in which public, private, or symmetric keys may be present.</p>\n</blockquote>\n<p>The \"or\" there is rather vague:  does it mean any of those 3 (so basically every JWKS) or does it mean in cases where you are likely to have a mix of them?<br>\nMy interpretation was the latter and so, because the JWKS URLs we're dealing with here should only have public keys (right?), the <code>use</code> field seems more appropriate.</p>",
        "id": 251711281,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1630587953
    },
    {
        "content": "<blockquote>\n<p>JWKS URLs we're dealing with here should only have public keys (right?)</p>\n</blockquote>\n<p>Yes, that's true for sure :-)</p>\n<p>Re: proposed changes on keycloak, I'm curious whether you've considered a change that makes keycloak work when neither <code>use</code> nor <code>key_ops</code> is present (e.g., an algorithm like: filter keys by <code>kid</code>; assert <code>use</code> is consistent with signature verification if present; assert that <code>key_ops</code> is consistent with signature verification if present; proceed to signature verification if you haven't blown up yet.)</p>",
        "id": 251731008,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1630595393
    },
    {
        "content": "<p>I'm not a maintainer of the keycloak project, but in past issues they've expressed the opinion I shared earlier that verifying the use of the key is important.  I'm happy to suggest your revised algorithm in this issue I opened, but I lack the real-world experience to know how common it is for <code>use</code> to be omitted (with or without a <code>key_ops</code> field)...my assumption is that <code>use</code> must be pretty common for 2 independent OIDC implementations to both get away with requiring it</p>",
        "id": 251743108,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1630599928
    }
]