[
    {
        "content": "<p>Is there a mechanism for an app to instruct the launching server to close the app? For example, lets a SoF app is opened in a modal or inline, and is used to fill out and submit a form, and then its job is done. Once the form is submtted, can the app tell the launching application to close the app?</p>",
        "id": 161311149,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1553136145
    },
    {
        "content": "<p>This is something we are working on in the smart web messaging project -- It is still early days, but design and initial thoughts are at <a href=\"https://github.com/smart-on-fhir/smart-web-messaging\" target=\"_blank\" title=\"https://github.com/smart-on-fhir/smart-web-messaging\">https://github.com/smart-on-fhir/smart-web-messaging</a></p>",
        "id": 161311226,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1553136270
    },
    {
        "content": "<p>This is one of the projects that Argonaut is taking on this year, so we expect that this draft specification will begin to mature quickly.</p>",
        "id": 161311228,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1553136290
    },
    {
        "content": "<p>This is great thanks. Quick question from some language in this document, what is an \"EHR's Scratchpad\" and what is it's purpose?</p>",
        "id": 161456967,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1553268059
    },
    {
        "content": "<p>This smart-web-messaging is very exciting!  We have an app that is using an Epic Link but would like to soon move to Cerner and Allscripts among others.  What is the best way to track this project?</p>",
        "id": 162627417,
        "sender_full_name": "Travis Cummings",
        "timestamp": 1554474120
    },
    {
        "content": "<p>Hey Travis, this site is probably the best way to track the project: <a href=\"https://github.com/smart-on-fhir/smart-web-messaging\" target=\"_blank\" title=\"https://github.com/smart-on-fhir/smart-web-messaging\">https://github.com/smart-on-fhir/smart-web-messaging</a></p>",
        "id": 164021425,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1556047519
    },
    {
        "content": "<p>Hey Tim, the \"scratchpad\" is the idea that there are draft FHIR resources that may only exist in memory on the EHR client that's hosting the SMART app inline. The current example of this is an unsigned order.</p>",
        "id": 164021501,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1556047567
    },
    {
        "content": "<p>Could an \"unsigned order\" on the scratchpad be discarded based on the actions in the SMART app?</p>",
        "id": 166279549,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1558539164
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> , similarly, if a SMART app is opened in a new tab (or, in the same tab) instead of inline, is there a mechanism where the launcher can specify a redirect URL for the SMART app to land on once its done its job?</p>",
        "id": 166280329,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1558539622
    },
    {
        "content": "<p>Re: scratchpad, yes the API includes deleting items.</p>",
        "id": 166304533,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1558555592
    },
    {
        "content": "<p>For closing an app, the expectation is that whether the app is in an iframe or a tab, the EHR is the opener and has the power to call \"close\", so the messaging API is just a way for the app to tell the EHR \"please call close now\".</p>",
        "id": 166304607,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1558555677
    }
]