[
    {
        "content": "<p>I'm puzzled a bit if it's possible to use the Consent resource to store the fact that user has authorized a third-party app to access his data? To me this sounds more as a AuditLog rather than the Consent, but may be someone does that. Any thoughts?</p>",
        "id": 218439546,
        "sender_full_name": "Shamil Nizamov",
        "timestamp": 1606837743
    },
    {
        "content": "<p>an audit log entry would be useful too. but audit log entries tend to not be persisted forever. The intended use of Consent for this use-case is to enable a record that would be useful.<br>\nAs to the question of if it is possible... would love to get any community feedback on the Consent resource to make it more useful, and to provide more informative examples and discussion/notes.  There is one example, but it is very old and thus likely missing useful information.</p>",
        "id": 218440635,
        "sender_full_name": "John Moehrke",
        "timestamp": 1606838132
    },
    {
        "content": "<p>The <a href=\"http://Consent.provision.actor\">Consent.provision.actor</a> in a Consent can be a device, so it is possible to use it as a record of software access.</p>",
        "id": 218449955,
        "sender_full_name": "David Pyke",
        "timestamp": 1606841579
    },
    {
        "content": "<p>The possibility to stretch the Consent in this direction is great, but what I'm trying to understand if is this a recommended practice or simply one of the possible applications of the resource not explicitly mentioned in the resource narrative?</p>",
        "id": 218459439,
        "sender_full_name": "Shamil Nizamov",
        "timestamp": 1606845972
    },
    {
        "content": "<p>Just to be clear, SMART doesn't have an opinionated stance about how servers record a patient's authorization decision; this can be using FHIR or some server-internal tracking mechanism. Clients learn about approval decisions (ultimately) in the access token response.</p>",
        "id": 218460794,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1606846625
    },
    {
        "content": "<p>Using things like Consent or Permission seems like a good area for servers to explore, though!</p>",
        "id": 218460834,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1606846643
    },
    {
        "content": "<blockquote>\n<p>Using things like Consent or <em>Permission</em> seems like a good area for servers to explore, though!</p>\n</blockquote>\n<p>You mean Provenance, do you? It was in one of the John's blog posts that Provenance is more for create/update, and AuditLog for access/delete/etc.</p>",
        "id": 218461776,
        "sender_full_name": "Shamil Nizamov",
        "timestamp": 1606847054
    },
    {
        "content": "<p>I mean <a href=\"http://build.fhir.org/permission\">Permission</a> (a new resource; work in progress; I think it's pretty abstract which might make it challenging to use, but figured I'd point it out in case you haven't come across it.)</p>",
        "id": 218469695,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1606851001
    },
    {
        "content": "<p>Using Consent this was is a possible action.  WE have not specifically outlined that use case but have made Consent as extendable as possible to allow for it.  It could be done via the patient-privacy scope or through a custom scope.</p>",
        "id": 218469911,
        "sender_full_name": "David Pyke",
        "timestamp": 1606851099
    },
    {
        "content": "<p>the Permission resource is very drafty... but yes, it is intended to hold access control rules for ANY purpose. Once fully developed it is likely that Consent would leverage Permission, but Permission would be useful for other use-cases such as B-2-B permissions, or app-permissions, or etc...  But we need to develop it further to prove this vision</p>",
        "id": 218472067,
        "sender_full_name": "John Moehrke",
        "timestamp": 1606852163
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192587\">David Pyke</span> <a href=\"#narrow/stream/179170-smart/topic/Consent.20to.20record.20user's.20authorization/near/218469911\">said</a>:</p>\n<blockquote>\n<p>Using Consent this was is a possible action.  WE have not specifically outlined that use case but have made Consent as extendable as possible to allow for it.  It could be done via the patient-privacy scope or through a custom scope.</p>\n</blockquote>\n<p>there is an example that has been in the Consent resource examples all along - <a href=\"http://build.fhir.org/consent-example-smartonfhir.html\">http://build.fhir.org/consent-example-smartonfhir.html</a></p>",
        "id": 218472663,
        "sender_full_name": "John Moehrke",
        "timestamp": 1606852486
    },
    {
        "content": "<div class=\"codehilite\"><pre><span></span><code>there is an example that has been in the Consent resource examples all along - http://build.fhir.org/consent-example-smartonfhir.html\n</code></pre></div>\n<p>Oh, I missed this one, thank you for pointing.</p>",
        "id": 218475336,
        "sender_full_name": "Shamil Nizamov",
        "timestamp": 1606853828
    }
]