[
    {
        "content": "<p>Is there a mandate as per CuresAct rule to allow patient users to selectively provide consent for certain scopes (and not all) during authorization? If so, Has anyone implemented it using KeyCloak as OIDC server with custom consent screens?</p>",
        "id": 219260094,
        "sender_full_name": "Sagar Shah",
        "timestamp": 1607460267
    },
    {
        "content": "<p>I'm not sure if this is what you are referring to, but ONC's Standardized API criteria does <a href=\"https://www.healthit.gov/test-method/standardized-api-patient-and-population-services#ccg\">include guidance</a> stating that systems must grant patients the ability to select subsets of scopes in order to meet the certification criteria: </p>\n<blockquote>\n<p>As part of the “permission-patient” “SMART on FHIR Core Capability” in § 170.215(a)(3), Health IT Modules presented for testing and certification must include the ability for patients to authorize an application to receive their electronic health information (EHI) based on FHIR resource-level scopes. Specifically, this means patients would need to have the ability to authorize access to their EHI at the individual FHIR resource level, from one specific FHIR resource (e.g., “Immunization”) up to all FHIR resources necessary to implement the standard adopted in § 170.213 and implementation specification adopted in § 170.215(a)(2).</p>\n</blockquote>\n<blockquote>\n<p>Although Health IT Modules presented for testing and certification must include the ability for patients to authorize an application to receive their EHI based on FHIR resource-level scopes, Health IT Modules are not prohibited from presenting authorization scopes in a more user-friendly format (e.g. grouping resources under categories, renaming the scopes for easier comprehension by the end-user, using more granular scopes), as long as the ability for patients to authorize applications based on resource-level scopes is available, if requested by the patient.</p>\n</blockquote>",
        "id": 219390044,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1607544111
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"192576\">@Robert Scanlon</span> - Yes that's what I was referring to. I was also willing to find if anyone has implemented such a capability using keycloak</p>",
        "id": 219394402,
        "sender_full_name": "Sagar Shah",
        "timestamp": 1607546377
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"344150\">@Sagar Shah</span> just asking I think you were part of this meet. Did this not answer the question? I'm asking as, I want to use this as a base for my use case, although not in the context of U S</p>\n<p><a href=\"https://youtu.be/Pp32GOOq0Vw\">https://youtu.be/Pp32GOOq0Vw</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"Pp32GOOq0Vw\" href=\"https://youtu.be/Pp32GOOq0Vw\"><img src=\"https://i.ytimg.com/vi/Pp32GOOq0Vw/default.jpg\"></a></div>",
        "id": 219396533,
        "sender_full_name": "Venu Gopal",
        "timestamp": 1607547429
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"251824\">@Venu Gopal</span> - We did not have enough time to cover this aspects of keycloak.we mainly covered smart on FHIR (patient selection) need and launch parameters and some criteria about refresh token in that 1 hour meet.</p>",
        "id": 219399134,
        "sender_full_name": "Sagar Shah",
        "timestamp": 1607548617
    },
    {
        "content": "<p>I've checked for the same in keycloak discourse as well, but usual no replies or recommendations I have found so far - <a href=\"https://keycloak.discourse.group/t/consent-management-with-selective-scope-authorization/6337\">https://keycloak.discourse.group/t/consent-management-with-selective-scope-authorization/6337</a></p>",
        "id": 219399275,
        "sender_full_name": "Sagar Shah",
        "timestamp": 1607548679
    }
]