[
    {
        "content": "<p>For a standalone launch, does the <code>launch/encounter</code> SMART scope limit the data that the resulting access_token can access to only information relevant to that encounter, or does it merely request the AS to return an encounter id alongside the access_token?</p>",
        "id": 200098615,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1591623778
    },
    {
        "content": "<p>It just provides an encounter. Limitations are currently in coded in the resource level Scopes (either bound to a patient or bound to a user). The ability to share information about specific encounters could certainly be a useful practical way to impose limits -- we should take this up in are granular access discussion call this week.</p>",
        "id": 200100457,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1591624617
    },
    {
        "content": "<p>Josh, would you give the same answer regarding provider-facing, standalone launches and the <code>launch/patient</code> scope?</p>",
        "id": 200106253,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1591627065
    },
    {
        "content": "<p>Yes -- like if a provider facing app asked launch/patient user/*.read\" that'd be a request for access to all records available for the provider, and a single patient as context.</p>",
        "id": 200106832,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1591627312
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191356\">@Jenni Syed</span> - do you agree with this:</p>\n<blockquote>\n<p>if a [standalone] provider-facing app asked for: <code>launch/patient</code> <code>user/Patient.read</code> that'd be a request for access to all [patient] records available for the provider</p>\n</blockquote>\n<p>?</p>",
        "id": 200107554,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1591627613
    },
    {
        "content": "<p>this is one of the things I would like to see clarified in the specification</p>",
        "id": 200139964,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1591641987
    },
    {
        "content": "<p>This means that there is a clear boundary between the start context, and the security token. That the start context is simply a start context, not a security mechanism, not a mechanism that limits the app.... except for the fact that patient scope is using the patient identified in the start context. right?</p>",
        "id": 200143618,
        "sender_full_name": "John Moehrke",
        "timestamp": 1591643843
    },
    {
        "content": "<p>Yes, and we support that today <span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span>, though we don't generally see that combination in practice (using a launch type that requests patient in combination with user scopes) EXCEPT where patient scope doesn't apply (eg: user/Practitioner.read)</p>",
        "id": 200143643,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1591643864
    },
    {
        "content": "<p>When apps at a \"chart\" level launch from our EHR go though functional validation, we generally catch and recommend they don't cross patients when in the context of a single chart for clinical data... very problematic.</p>",
        "id": 200143778,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1591643925
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  the start context and scopes interplay specifically only at the patient level because of the definition of the patient/... scopes</p>",
        "id": 200143808,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1591643948
    },
    {
        "content": "<p>but we see many confused about the encounter not doing this :)</p>",
        "id": 200143820,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1591643958
    },
    {
        "content": "<p>(I don't think encounter should, but it does surprise some)</p>",
        "id": 200143839,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1591643973
    },
    {
        "content": "<p>I think that is why people presume encounter acts similarly. I recommend we adjust this in future releases of smart. I would far prefer the patient identity be added to the security token/scope rather than this loose coupling between the start context in a single case.</p>",
        "id": 200145106,
        "sender_full_name": "John Moehrke",
        "timestamp": 1591644712
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  what are you wanting to change in the future release of smart? Today, the patient identity does get associated when you request it to, but would only apply in places the app requests it today.</p>",
        "id": 200145286,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1591644819
    }
]