[
    {
        "content": "<p>Hi. I’m looking for guidance on launching a SMART app from an EHR, prompted by a request communicated from an external system. This would happen after a patient encounter, maybe hours or days later. I spent some time googling IGs and searching <a href=\"http://chat.fhir.org\">chat.fhir.org</a> and didn’t find models matching our use case, so I thought I’d reach out to folks for feedback on the approach below.</p>\n<p>In our use case…</p>\n<ul>\n<li>a doctor sends a prescription from her EHR to a specialty pharmacy</li>\n<li>the pharmacy gets the prescription and determines that it needs to ask the prescriber’s office a question (e.g., a clarification on an aspect of the prescription)</li>\n<li>the pharmacy needs to notify clinic staff and ask them to answer the question</li>\n<li>the clinic user gets notified, launches the pharmacy’s SMART app, get’s brought to the right question for the patient/prescription, and provides an answer </li>\n</ul>\n<p>My main question areas… </p>\n<ul>\n<li>best way to notify clinic staff to launch the SMART app from the EHR and answer the questions</li>\n<li>best way to convey a unique identifier for the particular question(s) to be answered… to be used during SMART launch so the app can pull up the right questions. In the approach below, the pharmacy sends this identifier in the Task to the EHR, and it is then sent in the “intent” launch context parameter back to the app</li>\n</ul>\n<p>Strawman approach:</p>\n<ul>\n<li>while working the prescription, pharmacy staff captures their questions in the pharmacy’s SMART app. The app associates the questions with an “initiation id” that can be used later to pull them up</li>\n<li>the pharmacy system exchanges a Task resource with the EHR, asking it to create a staff work queue item to launch the pharmacy’s app and answer the questions. Included in the Task are: identification of the SMART app, the patient ID and the “initiation ID” for pulling up the questions</li>\n<li>when the clinic user takes action on the notification, the EHR…<ul>\n<li>launches the SMART App</li>\n<li>sets a session launch context using the patient ID it received in the Task</li>\n<li>includes the “initiation ID” in the “intent” launch context parameter… which the SMART app will use to pull up the right patient/medication questions. (I'm proposing  the intent parameter here because I don't see another option...)</li>\n</ul>\n</li>\n</ul>\n<p>Is this a reasonable approach? Or is there an existing convention that folks could point me to that accomplishes the same thing but in a different way? I’d appreciate any input.<br>\nThanks! <br>\n(sorry this got kind of long)</p>",
        "id": 211534941,
        "sender_full_name": "Frank McKinney",
        "timestamp": 1601319644
    },
    {
        "content": "<p>Frank, in truth, I'd say that these more complex workflows are still being figured out and there aren't yet strong patterns for them. A Task containing a link to a SMART app makes sense to me. CDS Hooks defines an <code>appContext</code> SMART launch parameter which is used in a similar way to your proposed use of intent, but it wouldn't make sense for the CPOE/EHR system to always ask the pharmacy if a prescription needs more information.</p>",
        "id": 211535873,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1601320084
    },
    {
        "content": "<p>Personally, I think it's very reasonable for an IG to define it's own \"SMART launch context parameters\", with their own meaning.</p>",
        "id": 211535937,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1601320117
    },
    {
        "content": "<p>Thanks for your input, Isaac. Appreciate it<br>\nWe'll write up this approach with some more detail in the Specialty Rx IG... and will reach out for thoughts on the more concrete description.</p>",
        "id": 211650925,
        "sender_full_name": "Frank McKinney",
        "timestamp": 1601398740
    },
    {
        "content": "<p>agreed that IG-specific params are a good balance here. (They key aspect of <code>appContext</code> is that values are created and consume by the app, and are <em>opaque</em> to the EHR, which just manages the state of passing them around; it'd be good to avoid using <code>appContext</code> in a way that violated this basic premise.)</p>",
        "id": 211785651,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1601483006
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span> , <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> . I drafted an approach for prompting the launch/use of a SMART app by submitting a Task to the EHR... like we discussed above. Based on your suggestion, the process passes a context value into the EHR in the Task that's then included in the SMART launch in the <code>appContext</code> parameter. <br>\nIf you'd have a chance to take a closer look at what I've put together, and let me know if I'm on the right track, that would be great. </p>\n<ul>\n<li><a href=\"http://build.fhir.org/ig/HL7/fhir-specialty-rx/branches/master/human-interaction.html\">Here's a page</a> from the IG I'm working on that overviews the process and talks about the key Task content and how it's used in the app launch</li>\n<li><a href=\"http://build.fhir.org/ig/HL7/fhir-specialty-rx/branches/master/StructureDefinition-specialty-rx-task-smart-launch.html\">This is the Task profile</a></li>\n<li>and <a href=\"http://build.fhir.org/ig/HL7/fhir-specialty-rx/branches/master/Task-specialty-rx-task-smart-launch-1.html\">here's an example Task</a></li>\n</ul>\n<p>Any thoughts will be appreciated!</p>",
        "id": 213489664,
        "sender_full_name": "Frank McKinney",
        "timestamp": 1602796968
    }
]