[
    {
        "content": "<p>For an existing EHR application, after a user logs in and wants to open up an integrated 3rd party App (SMART on FHIR), Only parameters EHR needs to pass to App is launch and iss. What's the best practice to avoid requiring to user login again on auth server? <br>\nAs I understand, launch is meant for the patient context and not meant for the current logged in user session, which is already authenticated on existing EHR system. <br>\nAny suggestions are appreciated!</p>",
        "id": 211042011,
        "sender_full_name": "Sagar Shah",
        "timestamp": 1600884989
    },
    {
        "content": "<p>Our system reuses the existing session if it launches from the chart (or if the system in question has an identity provider that supports SSOi sessions)</p>",
        "id": 211043404,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1600885662
    },
    {
        "content": "<p>so the auth server only re-prompts for authentication if there isn't a session (iOS can make this fun) - or if there's a regulatory/security reason that we need to prompt for auth</p>",
        "id": 211043605,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1600885742
    },
    {
        "content": "<p>Appreciate your inputs, Jenni! In our case, its even more tricky, as certain EHR applications are written in VB.NET (desktop applications) and some are written in Spring (Java web applications) and they all have different user management. We have the OAuth server (implemented &amp; hosted in AWS), which needs to federate the user provider to both these EHR systems (desktop and web). But if they are logged into the EHR, then somehow user should not be required to login again on Auth Server.</p>",
        "id": 211045286,
        "sender_full_name": "Sagar Shah",
        "timestamp": 1600886525
    },
    {
        "content": "<p>We have similar scenarios, but have ways to hook into the local desktop session.  Our OAuth server and identity provider are separate</p>",
        "id": 211046258,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1600886988
    },
    {
        "content": "<p>so our identities are always federated in some way</p>",
        "id": 211046356,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1600887016
    },
    {
        "content": "<p>How you handle this is outside of the specifications :)</p>",
        "id": 211046405,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1600887041
    },
    {
        "content": "<p>(unless you use a different spec, like SAML, for federation... )</p>",
        "id": 211046433,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1600887056
    },
    {
        "content": "<p>we too have oauth server and identity provider as separate. and we plan to federate identity provider during login using OAuth on the authorization server. It may work fine for web application, as that will involve sign-in from browser, which will tie Authorization session from oauth server. But not sure about VB.NET application as thats a desktop application</p>",
        "id": 211055988,
        "sender_full_name": "Sagar Shah",
        "timestamp": 1600891823
    }
]