[
    {
        "content": "<p>Reading through this document  - <a href=\"http://hl7.org/fhir/smart-app-launch/scopes-and-launch-context/index.html\">http://hl7.org/fhir/smart-app-launch/scopes-and-launch-context/index.html</a><br>\nMy understanding is it makes sense to assign scopes differently for</p>\n<ul>\n<li>patient facing apps -  patient/(resource).(read/write/*)  - so that patient has access to his/her own data in fhir format?</li>\n<li>provider facing apps - user/(resource).(read/write/*)   - so that user could have this privilege on any patient's data?</li>\n</ul>\n<p>Is that a correct understanding? <br>\nAlso, I think another use case for patient facing app is with representative accessing data on behalf of the patient, where I think, we should be assigning user level scopes?</p>\n<ul>\n<li>What's the general thought process behind these 2 different patient/user type of scopes? </li>\n<li>When do we use it considering provider facing app (for ehr or standalone) and patient facing apps?</li>\n<li>Do we see a situation when same client may be given both scopes as patient specific and user level?</li>\n</ul>\n<p>Appreciate your views!</p>",
        "id": 213487410,
        "sender_full_name": "Sagar Shah",
        "timestamp": 1602795726
    },
    {
        "content": "<p>For your first question: at t a high level there's no strict attachment of <code>user/</code> scopes to provider apps (e.g., any app that runs within a single chart inside the EHR should request the narrowest scopes appropriate for its job -- this typically means <code>patient/</code> scopes). And in the other direction, consumers often have access to more than one patient record (e.g, self and a child) and it's powerful to pull all available data into a consumer facing app.</p>\n<p>So the short answer is: no, the description you wrote isn't the right mental model.</p>",
        "id": 213562165,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1602856125
    },
    {
        "content": "<p>Re: examples where one app might get patient- and user- level scopes, this is a bit atypical but one example would be <code>user/Appointment.read patient/*. read</code> which might help an app focused on one patient's chart to show a message like \"your next appointment is coming up in 5 minutes\".</p>",
        "id": 213562526,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1602856301
    },
    {
        "content": "<p>(There's also ongoing discussion about what's the appropriate way for apps to request access to broader supporting data like ValueSet, Organization, Structure Definition, etc -- whether it makes sense to request these in a patient context or only in a user context; this came up earlier this week.)</p>",
        "id": 213562725,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1602856383
    },
    {
        "content": "<p>Thank you for clarifying. <br>\nis that ongoing discussion's decision would be related to FHIR version 4 or for later version? Or is it something still to be identified?</p>",
        "id": 213596014,
        "sender_full_name": "Sagar Shah",
        "timestamp": 1602872250
    },
    {
        "content": "<p>It'd be appropriate for use with any version of FHIR for r2 and onward; that's generally where SMART applies.</p>",
        "id": 213601541,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1602875186
    }
]