[
    {
        "content": "<p>Hi all, Generally for Practitioner of different categories we can assign roles with practitioner-role resource but apart from practitioner other users from, maybe Administrative, IT Department, Managing Teams..... How can we assign roles and resource mapping to search users in fhir server? Can anyone suggest me.</p>",
        "id": 228545609,
        "sender_full_name": "Mounika",
        "timestamp": 1614754452
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"193569\">@Mounika</span> I'm not fully understanding your question - and particularly how it's related to SMART on FHIR?  Can you explain more, perhaps with some examples?  If this isn't related to SMART, it might be best to re-ask your question (with clarifications) on <a class=\"stream\" data-stream-id=\"179166\" href=\"/#narrow/stream/179166-implementers\">#implementers</a></p>",
        "id": 228599786,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1614781548
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"193569\">@Mounika</span> I have a similar question. SMART has launch scopes like patient/Patient.read, user/MedicationStatement.write. This applies to all the resources. The launch scopes act as a safety net at the Resource (API), similar to custom scopes of OAUTH2.0. Some resources like, Medication, ServiceRequest, CarePlan are not be written by everyone, AFAIK. So creating personas and giving them specific scopes would achieve a good amount of Role Based Access Control and streamlined access to the launch scopes and thereby control the resource actions. The standalone application can also customize behavior as per the designated role. It appears it is left for the implementers to decide</p>",
        "id": 234442132,
        "sender_full_name": "Venu Gopal",
        "timestamp": 1618377109
    },
    {
        "content": "<p>You're right that SMART doesn't try to represent the permissions that any given user has; our OAuth scopes provide a delegation mechanism for sharing (a subset of) a user's permissions with a third party app.</p>",
        "id": 234507140,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618410259
    }
]