[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> I wanted to follow up on something you said in the other thread (and keep it's discussion separate):</p>\n<blockquote>\n<p>First off, there's not necessarily A correspondence directly between the fhirUser running an app and the patient context to which authorization is bound for patient/ scopes (for example, a user might be a clinician or parent, sharing access scoped to a child's clinical record).</p>\n</blockquote>\n<p>The SMART on FHIR documentation for the CMS Interoperability Rule doesn't talk about users authenticating that are anything other than the patient (or at least, there aren't any walk throughs such as sequence diagrams that speak to users accessing other user's data).</p>\n<p>Is \"a user might be a clinician or parent, sharing access scoped to a child's clinical record\" about the capabilities of SMART [on FHIR] in general, or applicable to the CMS Rule (that you know of)?</p>\n<p>If it applies to the CMS Rule then I'm very keen to follow guidance on how it should be implemented.</p>\n<p>Thanks in advance!<br>\nMerlyn</p>",
        "id": 240669703,
        "sender_full_name": "Merlyn Albery-Speyer",
        "timestamp": 1622242871
    },
    {
        "content": "<blockquote>\n<p>CMS Interoperability Rule doesn't talk about users authenticating that are anything other than the patient </p>\n</blockquote>\n<p>In general, patient have the right to delegate access to designated representatives. I'm not sure whether/how CMS plans to test this.</p>",
        "id": 240670231,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1622243418
    },
    {
        "content": "<blockquote>\n<p>Is \"a user might be a clinician or parent, sharing access scoped to a child's clinical record\" about the capabilities of SMART [on FHIR] in general, or applicable to the CMS Rule (that you know of)?</p>\n</blockquote>\n<p>The point about a clinician end-user is a general consideration, not related to patient access APIs.</p>",
        "id": 240670246,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1622243458
    },
    {
        "content": "<p>Thanks, Josh. Super useful clarifications. Much appreciated!</p>",
        "id": 240670743,
        "sender_full_name": "Merlyn Albery-Speyer",
        "timestamp": 1622243969
    }
]