[
    {
        "content": "<p>How does the FIDO standard fit into SMART-on-FHIR? I always envisioned this as a plugable authentication mechanism inside the OpenID-Connect service. Thus SMART-on-FHIR would be agnostic to if FIDO was used or any other authentication mechanism. right?</p>",
        "id": 200119436,
        "sender_full_name": "John Moehrke",
        "timestamp": 1591632051
    },
    {
        "content": "<p>Correct! FIDO would be used as a way to authenticate to the SMART authz server (which the SMART spec doesn't constrain).</p>",
        "id": 200122359,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1591633415
    },
    {
        "content": "<p>Awesome <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>. How could we link an identity proofed credential with a FIDO2/WebAuthn (<a href=\"https://www.w3.org/TR/webauthn/\">https://www.w3.org/TR/webauthn/</a>) / SMART authentication event? Could the UDAP profiles be helpful? </p>\n<p>To make identity federation work at scale, many entities are first voluntarily strengthening their authentication approach using FIDO2/WebAuthn. The next step is to determine how to connect their ID proofed credential to FIDO/SMART. FIDO has created some draft protocols for how to do this below. Curious to get yours and <span class=\"user-mention\" data-user-id=\"195299\">@Luis Maas</span> thoughts on the role SMART or UDAP should play. The three of us should also discuss FIDO's Fall conference CARIN will be participating in (<a href=\"https://authenticatecon.com/\">https://authenticatecon.com/</a>). <br>\n•   How FIDO integrates with federation protocols: <a href=\"https://www.slideshare.net/FIDOAlliance/integrating-fido-authentication-federation-protocols\">https://www.slideshare.net/FIDOAlliance/integrating-fido-authentication-federation-protocols</a><br>\n•   How FIDO could be used with Open ID <a href=\"https://openid.net/2019/04/22/public-review-period-for-two-proposed-eap-implementers-drafts/\">https://openid.net/2019/04/22/public-review-period-for-two-proposed-eap-implementers-drafts/</a></p>",
        "id": 210081941,
        "sender_full_name": "Ryan Howells",
        "timestamp": 1600132873
    },
    {
        "content": "<ul>\n<li>\n<p>UDAP is unrelated to user authentication</p>\n</li>\n<li>\n<p>SMART is agnostic about how users authenticate to the SMART authorization server (it just allows a downstream app to leverage that authentication event -- however performed -- for single sign-on via OpenID Connect)</p>\n</li>\n</ul>\n<p>This separation of concerns is a benefit; it allows technologies to be layered and combined to accomplish the things they're best at.</p>\n<p>I think <span class=\"user-mention\" data-user-id=\"196361\">@Ryan Howells</span> you're using the word \"credential\" to mean some verified identity attributes that are bound to an authentication method. Like, any SMART EHR that happens to support logging in with WebAuthn would probably be an example of what you're asking about. (But as usual, the challenges are establishing rules for how attributes are verified, deploying identity proofing in a pro-privacy + scalable fashion  and building a network of participants willing to trust these attributes.)</p>",
        "id": 210082650,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1600133766
    },
    {
        "content": "<p>In Ryan's link to <a href=\"http://openId.net\">openId.net</a> above, there's a proposal for use of \"token binding\" with OIDC. This is a pretty highly technical proposal to digest, but to ground the discussion in current reality, I'll note that <a href=\"https://groups.google.com/a/chromium.org/g/blink-dev/c/OkdLUyYmY1E/discussion?pli=1\">https://groups.google.com/a/chromium.org/g/blink-dev/c/OkdLUyYmY1E/discussion?pli=1</a> captures the decision from 2018 to <em>remove</em> token binding from the Chromium browser. So it's basically not available in any current browsers, and I'd suggest we not get stuck on / distracted with this thread of discussion.</p>",
        "id": 210083941,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1600135498
    },
    {
        "content": "<p>+1</p>",
        "id": 210148369,
        "sender_full_name": "John Moehrke",
        "timestamp": 1600185124
    },
    {
        "content": "<p>That's right, Josh. We're working on some policy components to help with establishing the rules of the road. FIDO is also doing some work in the area of identity verification and binding but it's unclear if it's related to 'token binding'. <a href=\"https://fidoalliance.org/identity-verification-binding/\">https://fidoalliance.org/identity-verification-binding/</a> I'm trying to get access to some of their working documents but their virtual event is probably the best place to find out more (<a href=\"https://authenticatecon.com/\">https://authenticatecon.com/</a>).</p>",
        "id": 210537340,
        "sender_full_name": "Ryan Howells",
        "timestamp": 1600443632
    }
]