[
    {
        "content": "<p>A question crossed one of my streams regarding the lack of fine-grained access control in SMART on FHIR.  I point out in this blog post that a SMART on FHIR implementer CAN support fine-grained access control, even if the base specification doesn't say anything about it.  <a href=\"http://motorcycleguy.blogspot.com/2020/01/fine-grained-access-control-with-smart.html\" target=\"_blank\" title=\"http://motorcycleguy.blogspot.com/2020/01/fine-grained-access-control-with-smart.html\">http://motorcycleguy.blogspot.com/2020/01/fine-grained-access-control-with-smart.html</a></p>",
        "id": 187176411,
        "sender_full_name": "Keith Boone",
        "timestamp": 1580590634
    },
    {
        "content": "<p>There is occational interest in advancing SMART scopes... but never seem to get a group of people together to do the work.<br>\nThere is similar work in IHE to profile OAuth for use with FHIR...</p>",
        "id": 187228569,
        "sender_full_name": "John Moehrke",
        "timestamp": 1580693834
    },
    {
        "content": "<p>Should mention this is one of the candidate Argonaut projects for 2020. We should know within the next couple of weeks if it's selected.</p>",
        "id": 187579096,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1581016651
    },
    {
        "content": "<p>Please have Argonaut work in the light-of-day along side with the Security wg. It is very frustrating to have these things ironed out elsewhere and have them imposed upon the workgroup.</p>",
        "id": 187593891,
        "sender_full_name": "John Moehrke",
        "timestamp": 1581026972
    },
    {
        "content": "<p>Agreed! If we wind up picking this project we'll post call details publicly for broad participation.</p>",
        "id": 187593982,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1581027041
    },
    {
        "content": "<p>Also, re: Keith's blog post: I agree there's very strong value in letting each authz server offer its own UX and capabilities for limiting access, effectively out-of-band (i.e., without communicating those restructions via OAuth scopes). The Argonaut project would be about seeing whether there's more we can <em>standardize</em> in-band -- i.e., the kind of stuff we've noodled about at <a href=\"https://github.com/HL7/smart-app-launch/blob/master/spec/scopes-and-launch-context/scopes-v2.md\" target=\"_blank\" title=\"https://github.com/HL7/smart-app-launch/blob/master/spec/scopes-and-launch-context/scopes-v2.md\">https://github.com/HL7/smart-app-launch/blob/master/spec/scopes-and-launch-context/scopes-v2.md</a></p>",
        "id": 187594200,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1581027220
    },
    {
        "content": "<p>There are also multiple suggestions for improved scopes that were provided as ballot comments. Ballot comments that were deferred under the Argonaut mandate. I really think that the HL7 ballot process should be respected and have these ballot comments re-considered as the deferred status intends.  This is now a work of HL7, and needs to be revised under HL7 rules.</p>",
        "id": 187594481,
        "sender_full_name": "John Moehrke",
        "timestamp": 1581027453
    },
    {
        "content": "<p>I'm pretty sure that some of my SMART comments got deferred during our STU1 ballot a few years ago! It'd be great not only for the matter-of-course HL7 process to reconsider these, but also for anyone from the community working within the accelerator to do so as well.</p>",
        "id": 187601904,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1581033868
    }
]