[
    {
        "content": "<p>(Placeholder for discussion about <a href=\"https://healthwallet.cards/\">https://healthwallet.cards/</a>)</p>",
        "id": 213353068,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1602711056
    },
    {
        "content": "<p>New here and new to FHIR.  I have some questions about how to implement a health certificate for COVID-19 PCR test results as a Verifiable Credential.</p>\n<p>By way of background, my company NextID is working on the Safe Travel project in Singapore (<a href=\"https://safetravel.ica.gov.sg/pdt-digital-certification\">https://safetravel.ica.gov.sg/pdt-digital-certification</a>).  We are adding a feature to our NextCert issuance application to support HealthCerts which use FHIR syntax, much like the Health Cards example (<a href=\"https://healthwallet.cards/credential-modeling\">https://healthwallet.cards/credential-modeling</a>).  These certs will record the result of a COVID-19 PCR test based on a nasalpharyngeal swab.  The presentation layer will display the result as 'positive/negative/inconclusive/invalid'.</p>\n<p>The sample certificate given in the specification (not to be confused with a JSON schema) has capability for recording the clinical lab result as a text string such as 'negative'.  But we feel that the certificate should be more informative and include also the Ct (cycle time), igG and igM (2 types of antibody) in the certificate data, whether or not is shown in the presentation layer.  Here is a snippet from the observation block of the sample cert as shown in the specification document:</p>\n<p>{<br>\n            \"resourceType\": \"Observation\",<br>\n            \"identifier\": [{<br>\n                \"value\": \"123456789\",<br>\n                \"type\": \"ACSN\"<br>\n            }],<br>\n            \"code\": {<br>\n                \"coding\": [{<br>\n                    \"system\": \"<a href=\"http://loinc.org\">http://loinc.org</a>\",<br>\n                    \"code\": \"94531-1\",<br>\n                    \"display\": \"Reverse transcription polymerase chain reaction (rRT-PCR) test\"<br>\n                }]<br>\n            },<br>\n            \"valueCodeableConcept\": {<br>\n                \"coding\": [{<br>\n                    \"system\": \"<a href=\"http://snomed.info/sct\">http://snomed.info/sct</a>\",<br>\n                    \"code\": \"260385009\",<br>\n                    \"display\": \"Negative\"<br>\n                }]<br>\n            }</p>\n<p>I'm not sure if the only value we need to make dynamic is the valueCodeableConcept display.  It seems from what I've read that the code number also changes if the result is other than negative.  Aside from this point, my primary question is, how would we add the fields to capture Ct, igG and igM and what is the data type to be captured (eg- are they text, integer values or scientific notation)?</p>",
        "id": 213379691,
        "sender_full_name": "Bill Claxton (wmclaxton)",
        "timestamp": 1602736637
    },
    {
        "content": "<p>Seeing as this is focused more on how to express the Observation, not SMART, I'd suggest asking on <a class=\"stream\" data-stream-id=\"179166\" href=\"/#narrow/stream/179166-implementers\">#implementers</a> or perhaps <a class=\"stream\" data-stream-id=\"179256\" href=\"/#narrow/stream/179256-Orders-and-Observation-WG\">#Orders and Observation WG</a></p>",
        "id": 213380242,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1602737410
    },
    {
        "content": "<p>and a direct answer to the question is, component observations. I don't think LOINC has published codes for those things? <span class=\"user-mention\" data-user-id=\"193853\">@Swapna Abhyankar</span></p>",
        "id": 213380263,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1602737506
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> , <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>  suggested I post here but happy to have it moved to the correct forum if that helps.  Apologies, I'm new here.</p>",
        "id": 213380642,
        "sender_full_name": "Bill Claxton (wmclaxton)",
        "timestamp": 1602738067
    },
    {
        "content": "<p>No apologies needed.  This forum is a big place.  The recommendation was more about where you might find more people with the right expertise paying attention.  Unfortunately, we can't move posts.  You'd have to re-ask the question elsewhere.  Normally asking the same question in multiple places is frowned upon, but it's fine if someone suggests you post elsewhere (and best practice is to include a link on the old discussion to the new discussion so those late to the party can see where things moved to.</p>",
        "id": 213380793,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1602738298
    },
    {
        "content": "<p>sorry, about the confusion on where to post. This is getting into details about modeling specific lab results, but briefly: I would think about capturing these kinds of attributes of a test as components of an observation, via <code>Observation.component</code>.</p>",
        "id": 213428097,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1602769918
    },
    {
        "content": "<p>I would be happy to work with you on writing out some examples that we could make public, if you like. Oftentimes the process of doing this translation reveals areas of ambiguity or mapping details that we will need to work through.</p>",
        "id": 213428594,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1602770098
    },
    {
        "content": "<p>Is it a mistake that the $HealthWallet.issueVC example requests in <a href=\"https://healthwallet.cards/#lab-results-are-finalized\">this section</a> don't contain a presentationContext?</p>",
        "id": 219501616,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1607619507
    },
    {
        "content": "<p>Right now, \"presentation context\" is a way of shaping what details the issuer should include in a Health Card; it's not <em>necessarily</em> a field baked in to the VC itself.</p>",
        "id": 219515087,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1607625469
    },
    {
        "content": "<p>We've been thinking about removing \"presentation context\" as a concept from the spec altogether, to focus on one \"primary\" use case initially -- a use case that includes a pretty rich set of details in the issued card.</p>",
        "id": 219515228,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1607625515
    },
    {
        "content": "<p>(After discussion with the team from Pew re: patient matching, etc, we tried to write a \"simple\" set of recommendations -- not requirements! -- at <a href=\"https://healthwallet.cards/credential-modeling/#modeling-a-health-card\">https://healthwallet.cards/credential-modeling/#modeling-a-health-card</a> under \"FHIR identity resources\". Feedback would be quite welcome.)</p>",
        "id": 219515732,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1607625730
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> <span class=\"user-mention\" data-user-id=\"365368\">@James Kizer</span>  and I were chatting about <a href=\"https://github.com/smart-on-fhir/health-cards/pull/50\">https://github.com/smart-on-fhir/health-cards/pull/50</a> and <a href=\"https://github.com/smart-on-fhir/health-cards/pull/49\">https://github.com/smart-on-fhir/health-cards/pull/49</a> -- how much of the size of the VC bundle is driven by long-form ION DIDs? If Health Card VCs just used short-form DIDs (seems possible considering that ION is now live) - would that save us enough space?</p>",
        "id": 224508931,
        "sender_full_name": "Daniel Levenson",
        "timestamp": 1611942568
    },
    {
        "content": "<p>Indeed -- if you look into the <a href=\"https://github.com/smart-on-fhir/health-cards/pull/50/files?short_path=b4d68dc#diff-b4d68dc855d0f9476d3f2ee343853bd21bf82ea9960d0cf06661baa244439dd6\">details on #50</a>  you'll see that this suggests short-form DIDs (but does <em>not</em> suggest/expect DLT-based resolution, to be clear  -- we are not going to introduce a hard dependency on sisdetree nodes in v1 of Health Cards).</p>",
        "id": 224509234,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1611942677
    },
    {
        "content": "<p>In this QR scheme, we can resolve DIDs by linked domains  (.well-known/did-configuration) and/or trust framework-hosted registries; the suffix data is always verifiable, since the short-form DID is calculated by hashing this data.</p>",
        "id": 224509438,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1611942752
    },
    {
        "content": "<p>Got it – yeah, re: \"we are not going to introduce a hard dependency on sidetree nodes in v1 of Health Cards).\" what's the thinking there? Just that the ION nodes are perhaps too immature at this point or that the infra requirements are too much to get started? Some other thoughts/concerns (which may or may not be warranted, just thinking out loud):</p>\n<ul>\n<li>Is supporting a QR-able flavor of a VC (distinct from a general Health Card) too much complexity for issuers? I imagine this would be another VC type with it's own schema, so perhaps not, but it's still definitely \"more stuff to support\" for issuers.</li>\n<li>It feels a bit against the grain of sidetree-based DID methods to have a, effectively, a closed network, of DID resolution. At least, that's my gut impression -- would love to learn more about what you thinking there.</li>\n<li>To play out how .well-known/did-configuration.json plays a role here, is the following correct. QR VC includes short-form DID and DID origin -&gt; verifier/holder resolves origin's well-known/did-configuration.json domain linkage VC -&gt; check that short-form DID in VC matches long-form DID in domain linkage VC -&gt; if check passes, resolve long-form DID in domain linkage VC to DID Document (local res; not DLT) -&gt; verify signature of VC using signing key in DID Document.<ul>\n<li>This assumes that the DID @ .well-known/did-configuration.json is long-form, but perhaps that's a fair assumption</li>\n</ul>\n</li>\n</ul>",
        "id": 224512871,
        "sender_full_name": "Daniel Levenson",
        "timestamp": 1611944252
    },
    {
        "content": "<p>also, meta point -- lmk if GH is the preferred way to have this conversation! Happy to do whatever</p>",
        "id": 224513190,
        "sender_full_name": "Daniel Levenson",
        "timestamp": 1611944395
    },
    {
        "content": "<blockquote>\n<p>what's the thinking there? </p>\n</blockquote>\n<p>It's just  early; it raises questions for instance about whether DIDs need to be public (for issuers, they are; for users, that's another story, and by simply avoiding ledger-backed DIDs for now, we avoid those questions).</p>\n<ul>\n<li>\n<p>Yes doing something (anything!) specific for QRs is more work for issuers -- but it's a core part of the problem we're committed to solving, given the importance of supporting users without a smartphone. There are trade-offs, but we want to develop the best system we can.</p>\n</li>\n<li>\n<p>Yes, the flow your dsecribed with <code>.well-known/did-configuration.json</code> is what I had in mind. We'd indeed need to specify that long-form ION DIDs appeared in those configuration docs, but that's an eaay thing.</p>\n</li>\n</ul>\n<p>Happy to discuss here or GH at your preference.</p>",
        "id": 224525848,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1611950623
    },
    {
        "content": "<blockquote>\n<p>It's just early; it raises questions for instance about whether DIDs need to be public (for issuers, they are; for users, that's another story, and by simply avoiding ledger-backed DIDs for now, we avoid those questions).</p>\n</blockquote>\n<p>gotcha - yeah, totally makes sense.</p>\n<blockquote>\n<p>Yes doing something (anything!) specific for QRs is more work for issuers -- but it's a core part of the problem we're committed to solving, given the importance of supporting users without a smartphone. There are trade-offs, but we want to develop the best system we can.</p>\n</blockquote>\n<p>For sure :) – I haven't dug too deeply yet, but I would hope that there's some specification for \"concatenating many QR codes together\", so that a data-rich VC could be encoded via 2/3 QR codes without any modification to the VC payload - of course that would be only be useful if QR scanners/libs implement said spec. If of interest and not done already, I would be happy to do some research there.</p>",
        "id": 224534861,
        "sender_full_name": "Daniel Levenson",
        "timestamp": 1611955015
    },
    {
        "content": "<p>Thanks -- I haven't done any research in this regard, and would love to know what's out there. (E.g. in scanning multiple codes, presumably you'd need to ensure you weren't order-dependent, so each chunk would need to embed its own index an the total set size.)</p>",
        "id": 224555075,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1611967131
    },
    {
        "content": "<p>I'm working on a PoC to play with some of these questions - there are a lot of theoretical approaches that have been tossed around already, and I'm curious to see how they work in practice.  Once there's something \"working\", I'll post to GH.</p>\n<p>On scanning multiple QR codes, there is a specification for it; my exploration so far has found exactly one library that implements it.  I haven't spent too much time looking, but I'm not too confident in it either.</p>",
        "id": 224783934,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1612210311
    },
    {
        "content": "<p>I am building a mobile wallet application that can store the Vaccine information of members enrolled.<br>\nIs there a listing of the Labs that are capable to support the \"Issuer\" role? Where can I find this information?</p>\n<p>I see the healthcare wallet demo is here: <a href=\"https://github.com/microsoft-healthcare-madison/health-wallet-demo\">https://github.com/microsoft-healthcare-madison/health-wallet-demo</a><br>\nIs there github sources for the Verifier app and Lab (\"issuer\") app for reference?</p>\n<p>I posted it here previously: <a href=\"#narrow/stream/179170-smart/topic/Labs.20that.20support.20SMART.20on.20FHIR.20for.20sharing.20Vaccination.20info\">https://chat.fhir.org/#narrow/stream/179170-smart/topic/Labs.20that.20support.20SMART.20on.20FHIR.20for.20sharing.20Vaccination.20info</a></p>",
        "id": 224972626,
        "sender_full_name": "Santosh Jami",
        "timestamp": 1612326898
    },
    {
        "content": "<p>Trying to take in the documentation here, and related specs.. and make sure I've connected all of the dots correctly.  Say I'm taking on the perspective of an issuer.  The user has given a VC I've issued to a holder.  Some time later, the holder presents the VC I issued to a verifier...</p>\n<p>I wasn't totally clear on interactions between the verifier and the issuer; or, perhaps the verifier only deals w/ the holder.  I do think that the verifier does have some interaction w/ the issuer... in <a href=\"http://healthwallet.cards\">healthwallet.cards</a> docs, this bit stuck out to me:</p>\n<blockquote>\n<p>Verifiers will discover public keys associated with an issuer via .well-known DID URLs</p>\n</blockquote>\n<p>The sequence diagram, \"Complete the Presentation\", has a note joining the the holder and the verifier \"Verify VC\" and subsequent operations on the verifier participant \"extract issuers did and resolve\".. then another operation titled just \"...\". </p>\n<p>Switching gears quite a bit, I was reading about \"Status\" and \"Revocation\" (<a href=\"https://www.w3.org/TR/vc-data-model/#status\">https://www.w3.org/TR/vc-data-model/#status</a>).  I'm interested in bolstering my mental model on this subject as it relates to healthcards.  Say, for example, an immunization resource is \"entered-in-error\".  How will the VC's status be updated w/ the holder?</p>\n<p>I'll probably need to read through all of the specs involved (DID, VC) a few more times before everything really \"clicks\"..</p>",
        "id": 225771340,
        "sender_full_name": "Rob Resendez",
        "timestamp": 1612912172
    },
    {
        "content": "<p>Re: DIDs and encryption I should  point out that <a href=\"https://github.com/smart-on-fhir/health-cards/pull/64\">https://github.com/smart-on-fhir/health-cards/pull/64</a> is in flight and will likely change the story here.</p>",
        "id": 225774806,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1612914268
    },
    {
        "content": "<p>Re: updates, we're not currently planning to support updates to a Health Card; they're designed to cover (more or less) immutable clinical facts. This isn't perfect, but neither is vaccine protection; if I give you a card with information that turns out to be incorrect... you can still show that card to people. Some notes:</p>\n<ul>\n<li>The holder can always go request new cards from the issuer, so if there's a change to the data that the holder <em>desires</em>, they can obtain and use a new health card. But if the holder <em>wants</em> to keep sharing the old one, that's a threat we don't try to mitigate.</li>\n<li>If an issuer's keys are compromised, the issuer may decide to revoke them in a way that may invalidate health cards (e.g., from a particular date range) -- so at the time of validation when a verifier goes to determine \"is this signature valid,\" they may decide \"no, the associated key isn't trustworthy\". This isn't quite what you're asking about, but has some similar properties.</li>\n</ul>",
        "id": 225775142,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1612914488
    },
    {
        "content": "<p>Is the <code>https://smarthealth.cards#health-card</code> credentialType still used? It's not listed on the Vocabulary section, but there's still a dangling reference to it in one of the sample responses. It's also still used by the demo app at <a href=\"http://c19.cards\">c19.cards</a>.</p>",
        "id": 227327719,
        "sender_full_name": "Alberto Peirats",
        "timestamp": 1614023845
    },
    {
        "content": "<p>I may try and implement this on <a href=\"http://OAuth2.org\">OAuth2.org</a> or <a href=\"http://verifymyidentity.com\">verifymyidentity.com</a> server when I get some free cycles.  I may attempt to work on this during the connect-a-thon, but hopefully before.</p>",
        "id": 227329977,
        "sender_full_name": "Alan Viars",
        "timestamp": 1614024740
    },
    {
        "content": "<p>The expectation for COVID-19 immunizations is currently to include:</p>\n<div class=\"codehilite\"><pre><span></span><code>    &quot;https://smarthealth.cards#health-card&quot;,\n    &quot;https://smarthealth.cards#immunization&quot;,\n    &quot;https://smarthealth.cards#covid19&quot;\n</code></pre></div>\n\n<p>in the <code>.vc.type</code> array. Our examples should include this; will add it to the vocab page right now.</p>",
        "id": 227332002,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1614025665
    },
    {
        "content": "<p>Thanks, Josh. So it's only used on the response, right? Is it ever required for the request, or is the <code>#covid19</code> type enough?</p>",
        "id": 227332497,
        "sender_full_name": "Alberto Peirats",
        "timestamp": 1614025891
    },
    {
        "content": "<p>I've updated <a href=\"https://smarthealth.cards/vocabulary/\">https://smarthealth.cards/vocabulary/</a> to include this value, and to clean up no-longer-relevant content.</p>",
        "id": 227332649,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1614025953
    },
    {
        "content": "<blockquote>\n<p>Is it ever required for the request,</p>\n</blockquote>\n<p>When you say \"the request\", you mean in the case where a client is obtaining Health Cards by calling the FHIR <code>$HealthWallet.issueVc</code> operation?</p>",
        "id": 227332774,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1614026007
    },
    {
        "content": "<p>The Vocab now has <code>#covid19</code> listed twice</p>",
        "id": 227332913,
        "sender_full_name": "Alberto Peirats",
        "timestamp": 1614026053
    },
    {
        "content": "<p>(D'oh, fixing.)</p>",
        "id": 227332938,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1614026064
    },
    {
        "content": "<p>When calling <code>issueVc</code>, you can provide just a single type if you want  -- e.g., \"https://smarthealth.cards#health-card\" for all health cards, or \"https://smarthealth.cards#covid19\"  if you just want any covid-related stuff, or \"https://smarthealth.cards#immunization\" if you want any immunization records.</p>",
        "id": 227333030,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1614026113
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191315\">Josh Mandel</span> <a href=\"#narrow/stream/179170-smart/topic/Health.20Cards/near/227332774\">said</a>:</p>\n<blockquote>\n<blockquote>\n<p>Is it ever required for the request,</p>\n</blockquote>\n<p>When you say \"the request\", you mean in the case where a client is obtaining Health Cards by calling the FHIR <code>$HealthWallet.issueVc</code> operation?</p>\n</blockquote>\n<p>Yes. If the request only specifies <code>#covid19</code>, the response's <code>vc.type</code> should include all of <code>#health-card</code>, <code>#covid19</code>, and <code>#immunization</code>, or should it only include the types that were requested?</p>",
        "id": 227333205,
        "sender_full_name": "Alberto Peirats",
        "timestamp": 1614026199
    },
    {
        "content": "<p>If the request includes type X, then all responses should include type X (in addition to the other types needed to describe them). So if you ask for <code>#covid19</code> you should get a pile of cards that each include <code>#covid19</code> and <code>#health-card</code> at minimum (some might include <code>#immunization</code>, too).</p>",
        "id": 227472690,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1614102424
    },
    {
        "content": "<p>I saw this article which may be of interest, \"As more governments mull vaccine passports, critics raise discrimination fears: \"<a href=\"https://www.france24.com/en/europe/20210223-as-more-governments-mull-vaccine-passports-critics-raise-discrimination-fears\">https://www.france24.com/en/europe/20210223-as-more-governments-mull-vaccine-passports-critics-raise-discrimination-fears</a></p>",
        "id": 227628724,
        "sender_full_name": "Alan Viars",
        "timestamp": 1614184488
    },
    {
        "content": "<p>Are JWKs expected to be backed by a valid CA-signed certificate, or is it enough to simply generate private/public keys without issuing signed certificates?</p>",
        "id": 228007877,
        "sender_full_name": "Alberto Peirats",
        "timestamp": 1614379571
    },
    {
        "content": "<p>The core Health Cards spec only describes bare keys in a jwks.json file. (We're interested in developing guidance for linking out to certs as well, as part of trust framework options -- but that's something we'd layer on top; discovery bare keys should always work.)</p>",
        "id": 228010649,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1614381005
    },
    {
        "content": "<p>Gotcha. Our CA doesn't seem to be fond of signing certs with 256-bit keys, so I'm just looking at my options.</p>",
        "id": 228011487,
        "sender_full_name": "Alberto Peirats",
        "timestamp": 1614381501
    },
    {
        "content": "<p>Just to check: you mean your CA won't sign certificats that <em>contain</em> 256-bit keys (rather than: your CA can't use a 256-bit key to <em>sign</em> a cert)?</p>",
        "id": 228016157,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1614384542
    },
    {
        "content": "<p>I believe we're limited to just RSA-2048 certs.</p>",
        "id": 228244276,
        "sender_full_name": "Alberto Peirats",
        "timestamp": 1614610712
    },
    {
        "content": "<p>Get a new CA</p>",
        "id": 228246886,
        "sender_full_name": "David Pyke",
        "timestamp": 1614611577
    },
    {
        "content": "<p>I am reading the health card IG and would like to clarify how the .well-known endpoint is constructed: </p>\n<blockquote>\n<p>Issuers SHALL publish keys as JSON Web Key Sets (see RFC7517), available at &lt;&lt;iss value from Signed JWT&gt;&gt; + .well-known/jwks.json.</p>\n<p>The URL at &lt;&lt;iss value from Signed JWT&gt;&gt; SHALL NOT include a trailing /. For example, <a href=\"https://smarthealth.cards/examples/issuer\">https://smarthealth.cards/examples/issuer</a> is a valid iss value (<a href=\"https://smarthealth.cards/examples/issuer/\">https://smarthealth.cards/examples/issuer/</a> is not).</p>\n</blockquote>\n<p>So the well-known endpoint (using the example quoted here) is <code>https://smarthealth.cards/examples/issuer.well-known/jwks.json</code>. This is different from what SMART App Launch uses (<a href=\"http://hl7.org/fhir/smart-app-launch/conformance/index.html#using-well-known\">http://hl7.org/fhir/smart-app-launch/conformance/index.html#using-well-known</a>) <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span></p>",
        "id": 229014279,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1614973989
    },
    {
        "content": "<p>I think you're politely pointing out that our spec has a bug/typo <span class=\"user-mention\" data-user-id=\"191506\">@Yunwei Wang</span>  :) Fixed in <a href=\"https://github.com/smart-on-fhir/health-cards/commit/51859cdaa58c2ca00cdbaf60fba3d461203f8f17\">https://github.com/smart-on-fhir/health-cards/commit/51859cdaa58c2ca00cdbaf60fba3d461203f8f17</a></p>",
        "id": 229016414,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1614974851
    },
    {
        "content": "<p>Another confusion (not typo) for the first time reader is \"what is VC\". The first instance this word is \"Issuers sign Health Card VCs with a signing key (private key)\" But there is not indication what the acronym means. I assume it mean \"Virtual Card\" but sure if that is the actual meaning.</p>",
        "id": 229016922,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1614975062
    },
    {
        "content": "<p>Oh I got it. It is \"Verifiable Credentials\" <a href=\"https://www.w3.org/TR/vc-data-model/#use-cases-and-requirements\">https://www.w3.org/TR/vc-data-model/#use-cases-and-requirements</a></p>",
        "id": 229017744,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1614975365
    },
    {
        "content": "<p>Still it would be less confusion by indicate the full name in the first instance of acronym like: \"Issuers sign Health Card VCs (Verifiable Credentials) with a signing key (private key)</p>",
        "id": 229017947,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1614975457
    },
    {
        "content": "<p>Thanks! If you're willing to submit a PR that'd be excellent.</p>",
        "id": 229020613,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1614976668
    },
    {
        "content": "<p>(otherwise I'll get to this when I'm back at my desk .)</p>",
        "id": 229020723,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1614976705
    },
    {
        "content": "<p>OK. I will do that later. (Maybe sometime this week end)<br>\nIf I have more such thing, should I put them here, github issues, or JIRA?</p>",
        "id": 229023992,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1614978053
    },
    {
        "content": "<p>Here and/or GitHub is great.</p>",
        "id": 229030607,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1614981135
    },
    {
        "content": "<p>At your preference.</p>",
        "id": 229030630,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1614981145
    },
    {
        "content": "<p>I don't quite understand how this works</p>\n<blockquote>\n<p>Any JWS longer than 1195 characters is split into \"chunks\" of length 1191 or smaller; each chunk is then encoded as a separate QR code to ensure ease of scanning. </p>\n</blockquote>\n<p>Does this mean that after scanning the initial QR code, the second one pops up automatically? I have never seen this before. Is there any reference to the requirement (about the subsequent codes) and real world implementations?</p>",
        "id": 229362093,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1615232613
    },
    {
        "content": "<p>It's probably easy to think about paper to start: this would mean a piece of paper with two QRs on it. (Or digitally, could be 2 QRs displayed on the screen, or a \"next\" button -- probably not something automated.)</p>",
        "id": 229874921,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1615478769
    },
    {
        "content": "<p>To be clear, we look at multi-QR Health Cards as an exceptional case / escape hatch; generally health cards are expected to fit in a single QR, and if we find this isn't the case, we may want to re-work the way we encode data to be more efficient.</p>",
        "id": 229875223,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1615478848
    },
    {
        "content": "<p>(No matter what approach we take, we'll want some kind of escape hatch though.)</p>",
        "id": 229875271,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1615478859
    },
    {
        "content": "<p>FYI: John Halamka promoting the Vaccine Credentials concept <a href=\"http://geekdoctor.blogspot.com/2021/03/vaccine-credentials-done-right.html\">http://geekdoctor.blogspot.com/2021/03/vaccine-credentials-done-right.html</a></p>",
        "id": 230385692,
        "sender_full_name": "John Moehrke",
        "timestamp": 1615828836
    },
    {
        "content": "<p>WHO set some principles for a Vaccine Certificate<br>\n<a href=\"https://www.who.int/news-room/articles-detail/call-for-public-comments-interim-guidance-for-developing-a-smart-vaccination-certificate-release-candidate-1\">https://www.who.int/news-room/articles-detail/call-for-public-comments-interim-guidance-for-developing-a-smart-vaccination-certificate-release-candidate-1</a></p>",
        "id": 231784556,
        "sender_full_name": "John Moehrke",
        "timestamp": 1616672008
    },
    {
        "content": "<p>will the HL7 Vaccine Credential follow these guidelines?</p>",
        "id": 231784575,
        "sender_full_name": "John Moehrke",
        "timestamp": 1616672024
    },
    {
        "content": "<p>A couple of us from the Health Cars / VCI crew participated in the WHO process gathering input. A few notes:</p>\n<ul>\n<li>\n<p>The WHO scope it is broad compared with the scope for SMART Health Cards. It includes continuity of care use cases in addition to proof of vaccination, and because of this, it assumes there will be a centralized national database that each public health authority makes available for queries from authorized users or outside jurisdictions. In Health Cards, we are entirely focused on giving individuals a copy of their own data in a verifiable format, with a workflow that allows paper-based or electronic presentation.</p>\n</li>\n<li>\n<p>The \"RC1\" doc from the WHO does not yet include recommendations from the ethics workstream; I'm looking forward to seeing these land in a subsequent revision.</p>\n</li>\n</ul>",
        "id": 231797985,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1616678170
    },
    {
        "content": "<p>What is the current specification for adding  Location (Immunization.location) resource to the vaccination credential? Should it be included?</p>",
        "id": 231825294,
        "sender_full_name": "Stephen Whitney",
        "timestamp": 1616687045
    },
    {
        "content": "<p>We don't include a Location resource in our recommended data profiles, but rather \"performer\" -- <a href=\"https://smarthealth.cards/examples/example-00-b-jws-payload-expanded.json\">https://smarthealth.cards/examples/example-00-b-jws-payload-expanded.json</a> shows an example</p>\n<div class=\"codehilite\"><pre><span></span><code>              &quot;performer&quot;: [\n                {\n                  &quot;actor&quot;: {\n                    &quot;display&quot;: &quot;ABC General Hospital&quot;\n                  }\n                }\n              ]\n</code></pre></div>",
        "id": 231829849,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1616688587
    },
    {
        "content": "<p><a href=\"http://build.fhir.org/ig/dvci/vaccine-credential-ig/branches/main/StructureDefinition-vaccine-credential-immunization-dm-definitions.html#Immunization.performer.actor\">http://build.fhir.org/ig/dvci/vaccine-credential-ig/branches/main/StructureDefinition-vaccine-credential-immunization-dm-definitions.html#Immunization.performer.actor</a> is the formal definition for this</p>",
        "id": 231829875,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1616688598
    },
    {
        "content": "<p>And if  you're interested in some of the thinking behind this: aim is to support the relevant fields from CDC paper cards, but acknowledging there's not generally going to be detailed/consistent structured data for this. (<a href=\"https://github.com/dvci/vaccine-credential-ig/issues/15\">#15</a> if you want to see the full discussion.)</p>",
        "id": 231830079,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1616688653
    },
    {
        "content": "<p>Hi all,</p>\n<p>As an FYI - we have added an SMART Health Cards track to the CARIN Connectathon next week. Our objective is to bring together implementers in various roles to test out reference implementations of the framework.</p>\n<p>More info here: <a href=\"https://confluence.hl7.org/display/CAR/Track+Page+for+the+SMART+Health+Card\">https://confluence.hl7.org/display/CAR/Track+Page+for+the+SMART+Health+Card</a></p>",
        "id": 233895967,
        "sender_full_name": "Michael Turman",
        "timestamp": 1618004123
    },
    {
        "content": "<p>So, I've been piecing a Vaccine Wallet/Passport together also, but I've been taking a slightly different approach, since we're using Apple Health Records.  We get the Immunization records raw, which I can generate a QR code with.  So, for instance, if you take out your phone, and scan the following code, you should get a FHIR Immunization record for Candace Salinas.</p>\n<p><a href=\"/user_uploads/10155/G6tXfEFFPvhAXW3_YEKcybFt/Symptomatic-VaccineWallet-QrCode-CandaceSalinas.png\">Symptomatic-VaccineWallet-QrCode-CandaceSalinas.png</a> </p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/G6tXfEFFPvhAXW3_YEKcybFt/Symptomatic-VaccineWallet-QrCode-CandaceSalinas.png\" title=\"Symptomatic-VaccineWallet-QrCode-CandaceSalinas.png\"><img src=\"/user_uploads/10155/G6tXfEFFPvhAXW3_YEKcybFt/Symptomatic-VaccineWallet-QrCode-CandaceSalinas.png\"></a></div><p>I'll update this over the weekend, put it into a Bundle, hash the whole thing, and put the output of _that_ on in the QR code.</p>",
        "id": 233920276,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1618023929
    },
    {
        "content": "<p>Thanks for sharing, Abigail. </p>\n<p>Hope to continue the conversation into next week's Connectathon!</p>",
        "id": 233977830,
        "sender_full_name": "Michael Turman",
        "timestamp": 1618080563
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>  Is there only <a href=\"https://confluence.hl7.org/pages/viewpage.action?pageId=104573738\">one HL7 project</a> health card project that is bound to immunization passports or is there a stand alone Health Cards project?</p>",
        "id": 234366751,
        "sender_full_name": "Eric Haas",
        "timestamp": 1618334363
    },
    {
        "content": "<p>Today  there are two key implementation guides in development:</p>\n<ol>\n<li><a href=\"https://smarthealth.cards/\">SMART Health Cards: Framework IG</a></li>\n<li><a href=\"http://build.fhir.org/ig/dvci/vaccine-credential-ig/branches/main/\">SMART Heath Cards : Vaccination and Testing IG</a></li>\n</ol>\n<p>(2) is already on its way through the HL7 process (as you noted above), and we're preparing a PSS for (1)</p>\n<p>(<span class=\"user-mention\" data-user-id=\"197651\">@Reece Adamson</span> <span class=\"user-mention\" data-user-id=\"322501\">@Max Masnick</span> <span class=\"user-mention\" data-user-id=\"194164\">@Neelima Karipineni</span> FYI.)</p>",
        "id": 234372595,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618336617
    },
    {
        "content": "<p>Something small I noticed in the draft spec:</p>\n<p>JWKS URL looks like:<br>\n/.well-known/jwks.json</p>\n<p>Most outh servers publish JWK like:<br>\n${baseUrl}/&lt;?version&gt;/keys<br>\nthe version is optional</p>\n<p>If nothing else, I would get arid of the .json</p>",
        "id": 235016894,
        "sender_full_name": "Richard Braman (FLY.HEALTH)",
        "timestamp": 1618693019
    },
    {
        "content": "<p>Can you clarify what you mean about \"most OAuth servers\"? And are you saying they're following some kind of standard? (I should note that at this stage we would make breaking changes to the specification only if there is a pressing reason to make a change -- e.g., if we discover something that makes the spec implementable.)</p>",
        "id": 235023033,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618697772
    },
    {
        "content": "<p>FWIW, AWS, Auth0, Akamai, and others do follow this .well-known/jwks.json pattern; it's as close to a convention as anything else I could identity.</p>",
        "id": 235024929,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618699873
    },
    {
        "content": "<p>I was referring to Okta and AzureB2C.  From the looks of it, it is not standardized at all. See <a href=\"https://tools.ietf.org/html/rfc8414#section-2\">https://tools.ietf.org/html/rfc8414#section-2</a><br>\nTheir example uses neither .well-known or keys.  But the example does show jwks.json, which I had never seen before you mentioned it.  It does seem widely used. But so is /keys  The spec says jwks_uri should be advertised to /.well-known/oauth-authorization-server.  Are we trying to standardize its uri for SHC?</p>",
        "id": 235028157,
        "sender_full_name": "Richard Braman (FLY.HEALTH)",
        "timestamp": 1618703563
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191678\">@Abigail Watson</span> when I scan the QR code above using my iphone's camera, it opens safari and tries to search the web for the patient's data.  Doesn't seem to secure...  Am I missing something?</p>",
        "id": 235028434,
        "sender_full_name": "Richard Braman (FLY.HEALTH)",
        "timestamp": 1618703926
    },
    {
        "content": "<p>SMART Health Cards imposes a hard requirement on this, relative to the issuer URL, yes.</p>",
        "id": 235031746,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618707499
    },
    {
        "content": "<p>You need a fully specified discovery algorithm for this to work.</p>",
        "id": 235031765,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618707549
    },
    {
        "content": "<p>Hi Richard,<br>\nOnce the data gets to the patient, it's their choice to share the data freely and publicly if they wish.  The security aspects are primarily required when dealing with somebody else's data.  The auto-opening in Safari is maybe not desired, but the intent was to demonstrate that FHIR resources can be shared via QR codes.  Also, there may be interest in sharing FHIR resources insecurely as a Receipt function.</p>\n<p>Also, I added the security components in during the connectathon and in another stream.  You're continuing a conversation from early in the implementation and connectathon.</p>",
        "id": 235032224,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1618707969
    },
    {
        "content": "<p><a class=\"stream\" data-stream-id=\"284830\" href=\"/#narrow/stream/284830-smart.2Fhealth-cards\">#smart/health-cards</a> has the discussion on this</p>",
        "id": 235035626,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618712104
    }
]