[
    {
        "content": "<p>In a Questionnaire call, I was was asked how a patient vs provider facing app would be able to access only the questionnaire for patients to fill out themselves vs those that authored by providers?  because of the login scope the EHR knows it dealilng with a  patient, but how it know which Questionnaires are OK to share  since they are all sitting at the same endpoint? I am assuming (secuity) tags?</p>",
        "id": 153962896,
        "sender_full_name": "Eric Haas",
        "timestamp": 1526512712
    },
    {
        "content": "<p>In Epic, whatever resource you hit, an early step in the logic is to check whether you can see it.</p>",
        "id": 153962899,
        "sender_full_name": "Michael Donnelly",
        "timestamp": 1526512869
    },
    {
        "content": "<p>1. Check if the client is allowed to access that type of resource.<br>\n2. Check if the user is allowed to access that type of resource. <br>\n3. Check if the user is allowed to see that kind of data for that patient. <br>\n4. Check if the data are specifically restricted (e.g. encounters in behavioral health departments) and, if so, if this user is able to break through that restriction.</p>",
        "id": 153962900,
        "sender_full_name": "Michael Donnelly",
        "timestamp": 1526512981
    },
    {
        "content": "<p>All that applies for patients and providers, though the logic is different.</p>",
        "id": 153962901,
        "sender_full_name": "Michael Donnelly",
        "timestamp": 1526512992
    },
    {
        "content": "<p>Same for Cerner. We have lots of additional authorization/permission/filtering checks applied as well.</p>",
        "id": 153962902,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1526512997
    },
    {
        "content": "<p>OK  thanks</p>",
        "id": 153962903,
        "sender_full_name": "Eric Haas",
        "timestamp": 1526513109
    },
    {
        "content": "<p>We also determine persona based on the endpoint used to access the resource (provider vs patient) that allows additional business rules to be applied.</p>",
        "id": 153962904,
        "sender_full_name": "Drew Torres",
        "timestamp": 1526513120
    },
    {
        "content": "<p>[Seven minutes turnaround to get answers from three implementers after one a.m.]</p>",
        "id": 153962905,
        "sender_full_name": "Michael Donnelly",
        "timestamp": 1526513201
    },
    {
        "content": "<p>Dedication... and jet lag</p>",
        "id": 153962906,
        "sender_full_name": "Drew Torres",
        "timestamp": 1526513318
    },
    {
        "content": "<p>Security tags on the data would tend to be a 5th test to Michael's list. I would agree that his list is first. Further within Security Tags there is a more useful use-case that only uses the Confidentiality vocabulary, as these are non-overlapping 'risk' values. The value given is usually influenced by the content of that resource. The sensitivity vocabulary is usually only a temporary tag between looking at the resource for sensitive topics, and the picking of which Confidentiality value to tag it with. Other vocabulary are more likely to be transactional.   <br>\nThe PurposeOfUse is often fixed at a single (Treatment) purpose of use for single purpose API endpoints. Supporting many purposeOfUse is unusual, but it is part of the design. PurposeOfUse would factor into decision mixed somewhere into steps 1-5... does this user have permission to use the data for that purposeOfUse, is this data allowed (was it collected for this purpose) to be used for this purposeOfUse, has the patient authorized (consent or contract) this user to have this data for this purpose...</p>",
        "id": 153963253,
        "sender_full_name": "John Moehrke",
        "timestamp": 1526565743
    }
]