[
    {
        "content": "<p>Is it possible to return the FHIR server base url as a claim in the id_token?</p>",
        "id": 198954632,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1590614236
    },
    {
        "content": "<p>That behavior is something you currently get if a server uses an absolute URI for a fire user, but I think you're asking for a reliable way for a client to get this :-)</p>",
        "id": 198962138,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1590618790
    },
    {
        "content": "<p>usually the FHIR server would be known <em>before</em> the id_token since apps start at the FHIR server to discover the auth endpoint. Are you wanting it in the id_token for \"storage\" or for that id_token to be passed around with context?</p>",
        "id": 198962868,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1590619401
    },
    {
        "content": "<p>technically the id_token isn't tied to a specific FHIR server endpoint... it's tied to a specific auth endpoint (or issuer in the openId world...)</p>",
        "id": 198962885,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1590619419
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191356\">@Jenni Syed</span> trying to pass it around with context</p>",
        "id": 198973191,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1590628321
    },
    {
        "content": "<p>the approach I took was to store the fhir server \"iss\" passed from the initial launch as part of the state when authenticating, and then pass the fhir server to my application server from the state. was hoping to get it from claims in the id_token... but, thinking about it, your comment about the fhir server not being known to the auth server makes sense. the fhir server is aware of the auth server, but not the other way around??</p>",
        "id": 198973284,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1590628405
    },
    {
        "content": "<p>Each needs to be aware of the other. The authorization server needs to be aware of the FHIR server to be able to validate the AUD parameter passed into the authorize endpoint...</p>",
        "id": 198974890,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1590630143
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> agreed, but technically the id token is a representation of the <em>user</em> authenticated and not the app/where that was authenticated to. In our system, we have multiple FHIR servers that the id token could be valid for, though we choose one for the profile URL itself. EG: different FHIR version implementations</p>",
        "id": 199037373,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1590679307
    },
    {
        "content": "<p>We have apps today that run against both DSTU 2 and our R4 fhir instances</p>",
        "id": 199037470,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1590679341
    }
]