[
    {
        "content": "<p>Hello,<br>\nI have setup SMART Dev Sandbox (<a href=\"https://github.com/smart-on-fhir/smart-dev-sandbox\">https://github.com/smart-on-fhir/smart-dev-sandbox</a>). I'm launching our Smart app that is secured with KeyCloak. On launch getting error bad_audience (bad audience value).<br>\ni tried setting aud parameter value to to token endpoints of SMART dev sandbox (i.e. <a href=\"http://localhost:4013/v/r3/auth/token\">http://localhost:4013/v/r3/auth/token</a>) but error persists.</p>\n<p>Can someone guide what exact value aud parameter needs to be?</p>",
        "id": 246464855,
        "sender_full_name": "Muhammad Asif",
        "timestamp": 1626706314
    },
    {
        "content": "<p>Can you say more about what the role of KeyCloak is, and what the role of the SMART Launcher is in your setup? It's not clear how your are planning/attempting to integrate these tools.</p>",
        "id": 246473666,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1626710065
    },
    {
        "content": "<p>The SMART Launcher is designed to give you the ability to test an \"unsecured\" app and see how it would behave when deployed to a secure SMART on FHIR environment. Trying to combine that with another auth layer is not necessary (nor supported). Try launching the app without KeyCloak to see if that works.</p>",
        "id": 246475890,
        "sender_full_name": "Vladimir Ignatov",
        "timestamp": 1626711087
    },
    {
        "content": "<p>I agree its to test a unsecured app. Actually i am trying to use the launcher as alternative to some EHR. Thus without going into EHR itself we can easily demo the app and manipulate data in FHIR server.</p>",
        "id": 246477320,
        "sender_full_name": "Muhammad Asif",
        "timestamp": 1626711790
    },
    {
        "content": "<p>Actually all the oAuth flow is done between KC and FHIR server. We have IDPs configured in KC,  and using identity federation these IDPs in KC does all the oAuth2 authentication for smart app..</p>\n<p>For example in IDP we have configured FHIR server auth and token endpoints. And using these KC handle all the authentication. I am trying to pass aud as query parameter in auth end point URL.</p>",
        "id": 246477492,
        "sender_full_name": "Muhammad Asif",
        "timestamp": 1626711874
    },
    {
        "content": "<p>Is it possible to turn off aud checking feature in dev box?</p>",
        "id": 246479333,
        "sender_full_name": "Muhammad Asif",
        "timestamp": 1626712796
    },
    {
        "content": "<blockquote>\n<p>Is it possible to turn off aud checking feature in dev box?</p>\n</blockquote>\n<p>No, unless you want to modify the code...</p>\n<p>I'm not sure I follow. If you handle OAuth yourself (via KC), then what do you need the launcher for? Perhaps you only need a FHIR server instead?</p>\n<p>As for the current issue,  you need to pass your FHIR base URL as <code>aud</code> query parameter to the authorize endpoint. However, the app being launched should do that for you, based on the <code>iss</code> launch parameter that it receives. Please verify that your FHIR base URL (wherever you set that in KC) is the same as the <code>iss</code> sent while launching the app.</p>",
        "id": 246481251,
        "sender_full_name": "Vladimir Ignatov",
        "timestamp": 1626713728
    },
    {
        "content": "<p>Sure i will double check and keep you posted</p>",
        "id": 246488248,
        "sender_full_name": "Muhammad Asif",
        "timestamp": 1626717004
    },
    {
        "content": "<p>Yup it get passed specifying exact FHIR base URL as in iss.  Thank you for your help.<br>\nThere are some epic specific context parameters get passed to SOF app. Now trying for those.</p>",
        "id": 246558776,
        "sender_full_name": "Muhammad Asif",
        "timestamp": 1626770328
    },
    {
        "content": "<p>It worked once had correct aud value. Thank you.</p>",
        "id": 248443368,
        "sender_full_name": "Muhammad Asif",
        "timestamp": 1628145707
    }
]