[
    {
        "content": "<p>I interpret <a href=\"https://hl7.org/fhir/uv/bulkdata/authorization/index.html#registering-a-smart-backend-service-communicating-public-keys\">this section of the SMART Backend Services spec</a> to say that:</p>\n<ul>\n<li>SMART servers SHALL support the JWKS format for receiving an app's public key, </li>\n<li>SHOULD support retrieving that key via a TLS-protected jwks_uri and </li>\n<li>MAY only support receiving that key through an out-of-band mechanism. </li>\n</ul>\n<p>An alternative interpretation is that :</p>\n<ul>\n<li>SMART servers SHALL support retrieving the key through a jwks_url </li>\n<li>SMART servers SHALL support receiving the key through an out-of-band mechanism and</li>\n<li>apps SHOULD support jwks_url and MAY support communicating the key through an out-of-band mechanism</li>\n</ul>\n<p>Which of the above two interpretations is (1) intended? and (2) supported by your SMART server?</p>",
        "id": 201316863,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1592509648
    },
    {
        "content": "<p>(1) sounds like what we intended. But just to be sure I understand, the third bullet point you listed under your alternative interpretation seems to contradict the first bullet point, so I might be missing something.</p>",
        "id": 201318705,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1592510425
    },
    {
        "content": "<p>Also, looks like your link is wrong -- do you want to update it so we're reading the same text?</p>",
        "id": 201318792,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1592510463
    },
    {
        "content": "<p>Josh - link fixed. Thanks. </p>\n<blockquote>\n<p>the third bullet point you listed under your alternative interpretation seems to contradict the first bullet point, so I might be missing something.</p>\n</blockquote>\n<p>The alternate interpretation is that a SMART server must support both methods, and use whichever is supported by the app. This phrase could suggest that interpretation:</p>\n<blockquote>\n<p>If a client cannot host the JWK Set at a TLS-protected URL, it MAY supply the JWK Set directly to the FHIR server at registration time</p>\n</blockquote>",
        "id": 201327441,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1592515116
    },
    {
        "content": "<p>Right, ok -- and reviewing now more carefully: the goal was to ensure that servers support both, and encourage clients to support jwks_uri based publication.</p>",
        "id": 201328402,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1592515810
    },
    {
        "content": "<p>(Goal was to support clients that aren't online / capable of hosting keys, but as a less-common special case.)</p>",
        "id": 201328465,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1592515859
    },
    {
        "content": "<p>Ergh. Yet, the spec never says:</p>\n<blockquote>\n<p>the FHIR server SHALL ... </p>\n</blockquote>\n<p>Also, what's the case in which an app can securely host a redirect_uri, and not a jwks_uri?</p>",
        "id": 201330020,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1592516967
    },
    {
        "content": "<p>There's no redirect_uri involved in Backend Services.</p>",
        "id": 201330760,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1592517574
    },
    {
        "content": "<p>That is also our interpretation that server SHALL support both and client SHOULD support jwks_url.</p>",
        "id": 201758866,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1592934588
    },
    {
        "content": "<p>thanks, Yunwei! Yet, that's explicitly not required by the spec. There is no requirement placed upon the FHIR server in this section. It's an assumption to turn this into a normative requirement.</p>",
        "id": 201874673,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1593018044
    },
    {
        "content": "<p>Yes. We had a discussion during the last Connectathon about those ambiguity in current Bulk Data IG for server requirement vs client requirement. I believe those will be addressed in Bulk Data 1.2 <span class=\"user-mention\" data-user-id=\"191414\">@Dan Gottlieb</span></p>",
        "id": 201902865,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1593032328
    },
    {
        "content": "<p>Thanks, Yunwei, Dan. Any idea yet of how this would be addressed? I'd like to understand the scenario in which a FHIR server should be disallowed from requiring an backend system to host a jwks_url, for example.</p>",
        "id": 202121569,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1593194052
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span> <span class=\"user-mention\" data-user-id=\"191506\">@Yunwei Wang</span> the clarifications around server requirements we discussed at the connectathon were for the  export API kickoff request parameters, though that's not to say we shouldn't also consider updating the backend services spec if that's needed.</p>",
        "id": 202127244,
        "sender_full_name": "Dan Gottlieb",
        "timestamp": 1593197244
    },
    {
        "content": "<p>My recollection matches that of <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> above - the intent was for servers to support both methods of registering public keys (jwks url and fixed jwks). While the first method is superior, I believe some clients devs were concerned about the need to maintain keys at an online location when the rest of the app is running behind a firewall and doesn't have any public facing elements.</p>",
        "id": 202127274,
        "sender_full_name": "Dan Gottlieb",
        "timestamp": 1593197267
    },
    {
        "content": "<p>Follow-up with clarifications at <a href=\"https://github.com/HL7/bulk-data/pull/79\">https://github.com/HL7/bulk-data/pull/79</a></p>",
        "id": 202706977,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1593705066
    }
]