[
    {
        "content": "<p>In the <a href=\"https://www.federalregister.gov/d/2019-02224/p-857\" target=\"_blank\" title=\"https://www.federalregister.gov/d/2019-02224/p-857\">ONC NPRM</a>, this process is described for using a refresh token to get a new refresh token:</p>\n<div class=\"codehilite\"><pre><span></span>Further, we propose that once a valid refresh token has been used to get a new access token that the FHIR server\nmust demonstrate that it can issue a new refresh token to the app, which must be for a new period no shorter\nthan three months. For example, if an application were issued a refresh token that was good for three months\nupon its first-ever connection and then subsequently connected to the FHIR server one month later, the FHIR\nserver would need to enable that connection to occur without re-authentication and re-authorization, and it\nwould need to issue a new refresh token for a new three-month period from that access date.\n</pre></div>\n\n\n<p>Is this actually allowed by either SMART or OAuth 2.0?  I can't find any reference in either the SMART guide or the OAuth 2.0 RFC about arbitrarily extending access by re-issuing new refresh tokens.  This approach effectively makes refresh token expiration irrelevant, I'm assuming it isn't intended by SMART/OAuth 2.0, but since it isn't explicitly disallowed, I was hoping to get confirmation.</p>",
        "id": 160569031,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1552396979
    },
    {
        "content": "<p>I believe it is an OAuth 2.0 concept.</p>",
        "id": 160569264,
        "sender_full_name": "Drew Torres",
        "timestamp": 1552397191
    },
    {
        "content": "<p><a href=\"https://tools.ietf.org/html/rfc6749#section-1.5\" target=\"_blank\" title=\"https://tools.ietf.org/html/rfc6749#section-1.5\">https://tools.ietf.org/html/rfc6749#section-1.5</a></p>",
        "id": 160569436,
        "sender_full_name": "Drew Torres",
        "timestamp": 1552397318
    },
    {
        "content": "<p>The question of refresh token expiration is valid. How often do you want the user to enter in credentials for an application that has the ability to impersonate you? Every 3 months, yearly, or indefinitely?</p>",
        "id": 160569607,
        "sender_full_name": "Drew Torres",
        "timestamp": 1552397417
    },
    {
        "content": "<p>The expiration in the token is the expiration for that token. you refresh to see if you have continual authorization. In this way the user can revoke background access, and it will be effective upon next refresh. The size of this token expiration is a ballance between user-experience vs noise.</p>",
        "id": 160569614,
        "sender_full_name": "John Moehrke",
        "timestamp": 1552397425
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191357\">@Andrew Torres</span> I must have missed paragraph H when I looked at the RFC.  Thanks for the reference.</p>",
        "id": 160572021,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1552399071
    }
]