[
    {
        "content": "<p>I am building a mobile wallet application that can store the Vaccine information of members enrolled.<br>\nIs there a listing of the Labs that are capable to support the \"Issuer\" role? Where can I find this information?</p>\n<p>I see the healthcare wallet demo is here: <a href=\"https://github.com/microsoft-healthcare-madison/health-wallet-demo\">https://github.com/microsoft-healthcare-madison/health-wallet-demo</a><br>\nIs there github sources for the Verifier app and Lab (\"issuer\") app for reference?</p>",
        "id": 224972384,
        "sender_full_name": "Santosh Jami",
        "timestamp": 1612326559
    },
    {
        "content": "<p>Labs?</p>",
        "id": 225242623,
        "sender_full_name": "Eric Haas",
        "timestamp": 1612482967
    },
    {
        "content": "<blockquote>\n<p>Is there a listing of the Labs that are capable to support the \"Issuer\" role? </p>\n</blockquote>\n<p>Hey Santosh, to my knowledge this list doesn't exist yet. This part of the <a href=\"https://smarthealth.cards/#trust\">smarthealth.wallet spec describes</a> the future intent to create a directory of trusted issuers (primarily intended to be used by verifiers), which would also likely satisfy your need.</p>",
        "id": 225371856,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1612567972
    },
    {
        "content": "<p>Also, are \"Labs\" going to be the entity that will be issuing passports?  I wouldn't normally expect labs to be doing vaccination administration.</p>",
        "id": 225554144,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1612795822
    },
    {
        "content": "<p>The language dates back to a point when we were focused on laboratory results, before vaccinations were available; <a href=\"https://smarthealth.cards\">https://smarthealth.cards</a> has been updated with more general language now. (That said, none of this technology is in production so there is no published list of issuers today. The specification is evolving and we are hoping to get it in shape for a 1.0 over the next week or two.)</p>",
        "id": 225555159,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1612796228
    }
]