[
    {
        "content": "<p>Hello, We are implementing the scenario for Standalone Launch for Patient using the app and accessing the data from EHR. We are having following Queries where we need suggestions:</p>\n<p>1&gt; How does the Patient Revocation actually works in the workflow? Who initiates the revocation_endpoint URL and How it is informed to Resource Server that token is revoked by patient?</p>\n<p>2&gt; Is it mandatory for the app to declare the Intent of data usage and if app has not declared, do we need to mandatorily provide the alert to the Patient after their login identification?</p>\n<p>Please suggest. Thanks in advance.</p>",
        "id": 251576360,
        "sender_full_name": "Nihar",
        "timestamp": 1630509164
    },
    {
        "content": "<blockquote>\n<p>We are implementing the scenario for Standalone Launch</p>\n</blockquote>\n<p>Are you building an EHR or an app in this scenario?</p>",
        "id": 251582623,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1630511492
    },
    {
        "content": "<blockquote>\n<p>How does the Patient Revocation actually works in the workflow? Who initiates the revocation_endpoint URL </p>\n</blockquote>\n<p>Once an app has been granted access, it gets an access token (and optionally a refresh token). The authorization server can revoke access (meaning: the refresh token and perhaps the access token will stop working!) at any time. One pathway for this is that the user can sign into their portal, review a list of \"current apps connected to my data\", and the press a button like \"revoke access\". Another pathway could be: the EHR e-mails the patient on a regular basis to say \"Reminder: the following 3 apps are connected to your health record, click here to adjust\". This is all out of band. What <code>management_endpoint</code> in the <code>.well-known/smart-configuration</code> file  provides is just a way for an app to learn the management URL to send a user to, if it wants to be helpful surface this URL to the user; and <code>revocation_endpoint</code> provides a URL that the app can call to revoke its own access token, following <a href=\"https://datatracker.ietf.org/doc/html/rfc7009\">https://datatracker.ietf.org/doc/html/rfc7009</a> (of course, you can't <em>rely</em> on apps wanting to revoke their own access, but it's nice to support them when they want to).</p>",
        "id": 251583303,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1630511776
    },
    {
        "content": "<blockquote>\n<p>Is it mandatory for the app to declare the Intent of data usage and if app has not declared, do we need to mandatorily provide the alert to the Patient after their login identification?</p>\n</blockquote>\n<p>For a SMART standalone launch, this generally happens out of band, based on the app's terms and conditions, privacy policy, etc. It's helpful if an EHR can record the URLs for these artifacts so that it can display links to them in-line during the approval process (e.g. \"Do you want to approve MyCoolApp? Keep in mind that MyCoolApp is not offered to you by your healthcare provider and is subject to its own terms and conditions [link]\".) We're also seeing EHRs develop their own structured surveys to help summarize an app's policies and data use practices; we'd love to standardize this over time, and would point to <a href=\"https://docs.smarthealthit.org/privacy-manifest-builder/\">https://docs.smarthealthit.org/privacy-manifest-builder/</a> as an example of how this might look. In this world, EHRs would ask apps to submit a QuestionnaireResponse at registration time, or to submit the URL for a QuestionnairResponse that the app could update over time... and then the EHR could display this information in an easy-to-read fashion during the approval process, to surface key details about the app's policies.</p>",
        "id": 251583649,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1630511926
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> : We are actually implementing the EHR Part including the Registration Process.  Thank you so much for the detailed explanation of revocation, this really helped in understanding the complete mechanism. Also, went through the <a href=\"https://datatracker.ietf.org/doc/html/rfc7009\">rfc7009</a> link and as suggested it mentions about the client taking the call to revoke...!!!<br>\nRegarding Question 2: Understood what you explained and just to confirm from myside, Intent to use the data (e.g. We want medication information), Terms &amp; Conditions and Privacy Manifest (QuestionnaireResponse) are actually not mandatory implementation yet, it might be in future but we as an EHR Implementer can implement these good to have features for apps as well as patient's clarity about the app policies.</p>",
        "id": 251607894,
        "sender_full_name": "Nihar",
        "timestamp": 1630521362
    },
    {
        "content": "<p>That's right -- and re: Question (2), we'd love feedback on the proposed SMART Privacy Manifest questionnaire, if you happen to dig in. (Builder at <a href=\"https://docs.smarthealthit.org/privacy-manifest-builder/\">https://docs.smarthealthit.org/privacy-manifest-builder/</a>; underling artifacts <a href=\"https://github.com/smart-on-fhir/privacy-manifest-builder/blob/main/src/questionnaire.json\">here</a>. H/T <span class=\"user-mention\" data-user-id=\"194948\">@Raheel Sayeed</span>!)</p>",
        "id": 251609711,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1630522095
    },
    {
        "content": "<p>Sure, <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>. We will explore more about the Privacy Manifest and will definitely provide the feedback...!! Thank you.</p>",
        "id": 251673748,
        "sender_full_name": "Nihar",
        "timestamp": 1630565997
    }
]