[
    {
        "content": "<p>Can/should patient facing standalone app pass (or any app rather) pass both the scopes \"launch\" and \"launch/patient\" in auth request? I believe that's an error from the 3rd party app, but are there any rules on how Auth server is supposed to honor that request?</p>",
        "id": 211119355,
        "sender_full_name": "Sagar Shah",
        "timestamp": 1600948034
    },
    {
        "content": "<p>The expectation is that in the EHR Launch, an app that wants access to any launch context parameters should include a <code>launch</code> scope. If no more specific launch context requests are included, the server can convey whatever launch context it finds appropriate to share. Servers might choose to infer the <code>launch</code> scope when an app includes more specific launch context requests like <code>launch/patient</code>, but the general explanation is for clients is to include it <code>launch</code> .</p>\n<p>For the apps using the Standalone Launch, they should provide specific launch context requests as needed.</p>",
        "id": 211126750,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1600952279
    },
    {
        "content": "<p>Reviewing the launch/patient scope, couldn't that also be appropriate for a smart client to request to indicate that it \"requires\" the patient context - and if the session doesn't currently have it, then it should get it.</p>",
        "id": 246541794,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1626752510
    },
    {
        "content": "<p>For Standalone launches, that's precisely how it works. For EHR Launch, I don't think we go quite this far (since these apps are generally configured to launch from specific points in the workflow where relevant context exists).</p>",
        "id": 246542905,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1626753965
    },
    {
        "content": "<p>So that is assumed that it is in the \"registration\" of the SMART App into the EMR where that is known/configured rather than discovered?</p>",
        "id": 246543097,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1626754228
    },
    {
        "content": "<p>(makes sense)</p>",
        "id": 246543101,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1626754234
    }
]