[
    {
        "content": "<p>I am reading through the links related to smart on fhir for ehr and standalone sequences.<br>\n<a href=\"https://hl7.org/fhir/smart-app-launch/index.html\">https://hl7.org/fhir/smart-app-launch/index.html</a> and <a href=\"https://hl7.org/fhir/smart-app-launch/scopes-and-launch-context/index.html\">https://hl7.org/fhir/smart-app-launch/scopes-and-launch-context/index.html</a></p>\n<p>I am more or less on clear on EHR sequence, where patient or encounter value is returned as well by token endpoint from Auth server depending on launch.<br>\nCan anyone clarify, what's the expected behavior for stadnalone launch (when launch parameter is not passed by the app to auth server)? What does auth server need to return in the response for launch context?</p>",
        "id": 210748524,
        "sender_full_name": "Sagar Shah",
        "timestamp": 1600698264
    },
    {
        "content": "<p>In the standalone case, the app may request a patient or encounter context by requesting the \"launch/patient\" or \"launch/encounter\" scope.  The authorization server then needs to establish a context (identify a patient id or encounter id to send back to the client, if authorized).  If the user of the app has access to multiple patients and the app has requested a patient context, then the authorization server can present a 'patient picker' to the user prior to redirecting back to the app in this case.  Then the patient/encounter value gets returned during token exchange in the same way as the EHR launch.  Does that help?</p>",
        "id": 210756179,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1600701484
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192576\">Robert Scanlon</span> <a href=\"#narrow/stream/179170-smart/topic/launch.20context.20for.20standalone/near/210756179\">said</a>:</p>\n<blockquote>\n<p>In the standalone case, the app may request a patient or encounter context by requesting the \"launch/patient\" or \"launch/encounter\" scope.  The authorization server then needs to establish a context (identify a patient id or encounter id to send back to the client, if authorized).  If the user of the app has access to multiple patients and the app has requested a patient context, then the authorization server can present a 'patient picker' to the user prior to redirecting back to the app in this case.  Does that help?</p>\n</blockquote>\n<p>Thank for clarifying!<br>\nIt does help in a way, but triggered some additional questions. :-)</p>\n<ul>\n<li>'patient picker' - Can you elaborate what does patient picker mean here? How does auth server return patient picker in the token response? Or is it some sort of a redirect to 3rd party app url?</li>\n</ul>\n<p>Also, how does it work, if the end user of app is a patient or representative? Or is this SMART on FHIR requirement applicable only to provider facing apps?</p>\n<p>Also do we need patient picker flow when an authorized representative logs in 3rd party app so that he can choose one patient from many that he/she may be representative for?</p>",
        "id": 210758048,
        "sender_full_name": "Sagar Shah",
        "timestamp": 1600702210
    },
    {
        "content": "<p>Sorry for the lack of clarity.  The 'patient picker' is generally a term for a UI element presented to the user in the <a href=\"http://hl7.org/fhir/smart-app-launch/index.html#smart-authorization-sequence\">'Authorize App' step</a> that lets the user pick which patient is in context for this app.  It isn't something that alters the flow at all.  And it isn't necessarily a requirement.  Just in practice, if a standalone app asks for a single patient id to work with, and the user  of that app has access to multiple patients, the authorization server needs to figure out somehow what patient the user wants.</p>",
        "id": 210760059,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1600703104
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192576\">Robert Scanlon</span> <a href=\"#narrow/stream/179170-smart/topic/launch.20context.20for.20standalone/near/210760059\">said</a>:</p>\n<blockquote>\n<p>Sorry for the lack of clarity.  The 'patient picker' is generally a term for a UI element presented to the user in the <a href=\"http://hl7.org/fhir/smart-app-launch/index.html#smart-authorization-sequence\">'Authorize App' step</a> that lets the user pick which patient is in context for this app.  It isn't something that alters the flow at all.  And it isn't necessarily a requirement.  Just in practice, if a standalone app asks for a single patient id to work with, and the user  of that app has access to multiple patients, the authorization server needs to figure out somehow what patient the user wants.</p>\n</blockquote>\n<p>Thanks for making it more clear. It makes sense now. so taking it further :), depending upon the requested scope (by 3rd party app)</p>\n<ul>\n<li>launch/patient - oauth server offers patient picker UI so as to enable patient selection</li>\n<li>launch/encounter - should oauth server offer encounter picker UI so as to enable encounter selection? Does it require patient selection to happen first before encounter selection?</li>\n</ul>\n<p>Also referring to your statement - \"Just in practice, if a standalone app asks for a single patient id to work with....\"<br>\nApp by itself cannot request the patient id without showing patient picker UI component, correct? Basically how would standalone app flow asks for single patient id on the user login (as it cannot pass launch parameter, correct)?</p>\n<p>Appreciate your suggestions!</p>",
        "id": 210764257,
        "sender_full_name": "Sagar Shah",
        "timestamp": 1600704940
    },
    {
        "content": "<p>For your launch/encounter question - I would think for standalone apps you would need to have some kind of 'encounter picker' if you were to support the <a href=\"http://hl7.org/fhir/smart-app-launch/conformance/index.html#launch-context-for-standalone-launch\">context-standalone-encounter</a> capability.  But the guide doesn't require it.  It is up to the server to figure out the best way given its situation &amp; users to associate an authorization request with an encounter (same with patient).  And similarly, there are no requirements around what that picker might look like (if for encounters you need to choose a patient first, etc).</p>",
        "id": 210767923,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1600706758
    },
    {
        "content": "<blockquote>\n<p>App by itself cannot request the patient id without showing patient picker UI component, correct? Basically how would standalone app flow asks for single patient id on the user login (as it cannot pass launch parameter, correct)?</p>\n</blockquote>\n<p>Do you mean, how can an app ask an authorization server to be authorized very specifically for a context of 'patientid=12'?  If so, that's outside of the standard.  The way it works is the app simply states that it needs a patient context (by requesting the launch/patient scope), and the authorization server interacts directly with the user to work that out (in the <a href=\"http://hl7.org/fhir/smart-app-launch/index.html#smart-authorization-sequence\">Authorize App box</a>), and then the app is given a patient id in the token exchange step.  In this case, with 'context', it is the authorization server showing the user the patient picker, not the app.</p>",
        "id": 210771261,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1600708342
    },
    {
        "content": "<p>Thanks a lot for making it more clear. I think I got the correct understanding of flow. <br>\nAppreciate your inputs on this. Just a question, that you mentioned encounter selector and patient selector both are not mandatory as per guide? If that's not implemented by OAuth server, then auth server just returns with standard token response without patient context (for ehr launch) or the patient picker (for standalone app)?</p>",
        "id": 210771995,
        "sender_full_name": "Sagar Shah",
        "timestamp": 1600708677
    },
    {
        "content": "<p>For EHR launch, if the app expects patient context, it should be launched while the user is looking at a patient record in the EHR (for example).  And that info is associated with the launch parameter so the authorization server knows what patient is in context, and therefore no picker is needed.   If the EHR somehow launches the app without a patient in context, but the app needs a patient in context, I'd think that is a config error.</p>",
        "id": 210773391,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1600709278
    },
    {
        "content": "<p>Regarding the existence of a 'picker' -- that is just one mechanism that an authorization server could use to take a request for a patient/encounter context and resolve a specific patient/encounter to it can pass that back to the client during token exchange.   In the EHR launch, the authorization server figures it out simply by that 'launch' parameter.  In the standalone case, as an example, if your system only ever deals with users that are patients without access to any other patient data, the authorization server probably can infer the patient context automatically without showing the user a patient picker.  So SMART doesn't say \"make a patient picker\", because then you may end up situations where implementers create a patient picker where one isn't needed.</p>",
        "id": 210775339,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1600710209
    },
    {
        "content": "<p>It just says, if an app requests the launch/patient scope, then you will want to pass a patient id back to the client at the end of the process.  Figure out how to choose which patient id yourself.</p>",
        "id": 210775841,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1600710462
    },
    {
        "content": "<p>(this is all somewhat informally described, obviously see the standard for the formalisms :)</p>",
        "id": 210776032,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1600710555
    },
    {
        "content": "<p>Thanks for getting it very clear now. So objective is to get patient id in the access token response at minimum from Auth server. Encounter is optional though.</p>",
        "id": 210776052,
        "sender_full_name": "Sagar Shah",
        "timestamp": 1600710567
    },
    {
        "content": "<p>I just used 'launch/patient' as a shortcut to 'launch/patient and launch/encounter' -- it is the same concept.  If 'launch/patient' requested by standalone app, the goal is to get a patient id back to the app (that user authorized the app to use).  if launch/encounter requested by standalone app, the goal is to get a encounter id back to the app (that user authorized the app to use).</p>",
        "id": 210776465,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1600710750
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192576\">Robert Scanlon</span> <a href=\"#narrow/stream/179170-smart/topic/launch.20context.20for.20standalone/near/210776465\">said</a>:</p>\n<blockquote>\n<p>I just used 'launch/patient' as a shortcut to 'launch/patient and launch/encounter' -- it is the same concept.  If 'launch/patient' requested by standalone app, the goal is to get a patient id back to the app (that user authorized the app to use).  if launch/encounter requested by standalone app, the goal is to get a encounter id back to the app (that user authorized the app to use).</p>\n</blockquote>\n<p>Understood. so launch/patient and launch/encounter both needs to be supported from Auth server for SMART at minimum</p>",
        "id": 210776773,
        "sender_full_name": "Sagar Shah",
        "timestamp": 1600710900
    },
    {
        "content": "<p>Well, yes, if you wanted to support all of SMART App Launch 'capabilities'.  But you don't have to support all capabilities from the SMART App Launch Guide perspective.  See <a href=\"http://hl7.org/fhir/smart-app-launch/conformance/index.html#launch-context-for-standalone-launch\">http://hl7.org/fhir/smart-app-launch/conformance/index.html#launch-context-for-standalone-launch</a></p>",
        "id": 210777469,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1600711187
    },
    {
        "content": "<p>Depending on the context of your application, you may have requirements to support a certain subset of the capabilities, or perhaps all of them.</p>",
        "id": 210778058,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1600711424
    },
    {
        "content": "<p>Thanks a bunch for your inputs!</p>",
        "id": 210779228,
        "sender_full_name": "Sagar Shah",
        "timestamp": 1600711957
    }
]