[
    {
        "content": "<p>Newbie lazy question (why read when I can ask) -- can a SMART app talk to multiple FHIR servers on the backend? I'm thinking about an app that pulls together my medical record from multiple disconnected providers.</p>",
        "id": 153815835,
        "sender_full_name": "Jason Walonoski",
        "timestamp": 1458130058
    },
    {
        "content": "<p>either it has to oauth with each of the servers, or they need to share the token. The latter option is .... the sort of thing that makes Justin R's skin crawl, but it justified in some circumstances. Otherwise, there's need for some delegation process, which is in the heart/oauth space but not fully characterised by either at this point</p>",
        "id": 153815837,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458130158
    },
    {
        "content": "<p>Our clients don't support multiple backends (AFAIK), but then again, nothing prevents you from building a SMART app that instantiates as many client instances as you want and your logic manages and mashes the resources each of these fetch.</p>",
        "id": 153815842,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1458130887
    },
    {
        "content": "<p>oddly enough - that's what my past post was about!</p>",
        "id": 153815869,
        "sender_full_name": "David Hay",
        "timestamp": 1458143977
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span> Ah, I see that now. I'll give it a read.</p>",
        "id": 153815873,
        "sender_full_name": "Jason Walonoski",
        "timestamp": 1458154655
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191381\">@Jason Walonoski</span> This is certainly possible but as Grahame mentioned, the authorization bit will be tricky. Unless you're able to authorize to each FHIR server via B2B, your SMART app will get directed to a login page for each FHIR server connection.</p>",
        "id": 153816027,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1458194218
    },
    {
        "content": "<p>Yes, that's exactly what we have happening with our app.<br>\nWe read from one system, and then submit to another.</p>",
        "id": 153816029,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1458194284
    },
    {
        "content": "<p>still better than not having that functionality at all! And there mechanisms for the authentication to last for a reasonable time making the user experience ok at minimal extra complexity...</p>",
        "id": 153816037,
        "sender_full_name": "David Hay",
        "timestamp": 1458196201
    },
    {
        "content": "<p>Agreed. We basically say \"this isn't the problem SMART is designed to solve, but SMART's certainly a useful building block.\"</p>",
        "id": 153816116,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1458228668
    }
]