[
    {
        "content": "<p>Hello,</p>\n<p>If we like to work with multiple tenants and we have one single endpoint for our FHIR Store.<br>\nShould we extend the DomainResource with a tenant element with type id, so that each tenant is offered a special part of the application with its own FHIR resources, configuration and management.</p>\n<p>Or are there other solutions to get this done?</p>\n<p>Regards,</p>\n<p>Bernard</p>",
        "id": 239217258,
        "sender_full_name": "Bernard Stibbe",
        "timestamp": 1621326858
    },
    {
        "content": "<p>Every resource has a meta.source element which can store the provenance. There is also a Provenance resource available. But how will you assign the tenant if they are all coming into a single URL? Force the client to set it?  Without really knowing your requirements, it would seem more flexible to just split off different URLs from your base for each tenant.  Those may all route to a single internal server (or not), but it would give you options to configure per-tenant policies, run the data through proxy services to tag the tenant, etc.</p>",
        "id": 239266046,
        "sender_full_name": "Craig McClendon",
        "timestamp": 1621349188
    },
    {
        "content": "<blockquote>\n<p>Should we extend the DomainResource with a tenant element with type id</p>\n</blockquote>\n<p>Extending DomainResource in ad-hoc ways is never the right answer in FHIR, if you want interoperability. If you wanted a new element, the recommendation would be to use an extension; but as Craig points out, Meta.source may meet your needs here.</p>",
        "id": 239268118,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1621349915
    },
    {
        "content": "<p>I would compartment implicitly by the smart session</p>",
        "id": 239268318,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1621349997
    },
    {
        "content": "<p>I didn't notice this was tagged in the SMART channel. My response was in a general sense to a multi-tenant FHIR server. SMART could be a bit different with defined registration and authorization protocols where it seems is the place you'd figure out who the \"tenant\" is.</p>",
        "id": 239270170,
        "sender_full_name": "Craig McClendon",
        "timestamp": 1621350539
    },
    {
        "content": "<p>Also note that it's best to not start the same conversation in multiple streams at the same time (unless you're explicitly advised to do so, and even then cross-linking is helpful).  Other thread here: <a href=\"#narrow/stream/179181-netherlands/topic/Multitenancy\">https://chat.fhir.org/#narrow/stream/179181-netherlands/topic/Multitenancy</a></p>",
        "id": 239282766,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1621354877
    }
]