[
    {
        "content": "<p>Cross posted from the SMART mailing list:</p>\n<p>The SMART team is excited to announce the release of a new web based tool to launch your SMART applications on the SMART sandbox - check it out at <a href=\"https://launch.smarthealthit.org\" target=\"_blank\" title=\"https://launch.smarthealthit.org\">https://launch.smarthealthit.org</a> !</p>\n<p>Key features include:<br>\n- Test and demonstrate SMART apps without needing to create an account or log in.<br>\n- Share launch configurations by bookmarking and emailing urls.<br>\n- Supports apps that use the SMART EHR launch flow, standalone patient facing apps, standalone provider facing apps, and apps using the backend services authorization API.<br>\n- Quickly switch between the SMART DSTU2 and STU3 FHIR servers to test apps that work in both environments.<br>\n- Pre-configure contextual information (including the patient, provider, and encounter) before the launch or leave these fields blank to be prompted for the required info during the launch flow.<br>\n- Simulate authentication and authorization errors at different points in the launch to give your application a workout.<br>\n- Simulate common EHR and patient portal screens for more realistic app demonstrations.<br>\n- Integrated patient browser to find the best sample data for your app.<br>\n- Simple and straightforward code and architecture to enable experimentation with new FHIR and SMART capabilities.<br>\n- More features coming soon!</p>\n<p>This is an alpha release (there will be bugs) so please post feedback and any issues you run into here. Also, we wanted to get the project out to the SMART community early, but once the code has been cleaned up a bit, we'll be releasing it as open source on the SMART Github account. The launcher currently only supports JSON FHIR responses.</p>",
        "id": 153921668,
        "sender_full_name": "Dan Gottlieb",
        "timestamp": 1511801453
    },
    {
        "content": "<p>Hi..</p>\n<p>I created sandbox so through .Net FHIR API how I can create/update fhir resource to HSPC sandbox server from my .Net application with security</p>\n<p>Help is greatly appreciated...</p>",
        "id": 153922758,
        "sender_full_name": "shivnath shelake",
        "timestamp": 1512385518
    }
]