[
    {
        "content": "<p>In the preamble for ONC's 21st Century Cures rule, there is this blurb:</p>\n<div class=\"codehilite\"><pre><span></span><code>Token introspection will allow implementers of § 170.315(g)(10)-certified\nHealth IT Modules to use API authorization servers and authorization tokens\nwith various resource servers. This functionality has the potential to\nreduce complexity for implementers of § 170.315(g)(10)-certified\nHealth IT Modules authorizing access to several resource servers and\nreduces the overall effort and subsequent use of § 170.315(g)(10)-certified\nHealth IT Modules consistent with the goals of section 4002 of the Cures Act\n to enable the use of APIs without “special effort.” Although we do not\nspecify a standard for token introspection, we encourage industry to\ncoalesce around using a common standard,\nlike OAuth 2.0 Token Introspection (RFC 7662).\n</code></pre></div>\n<ul>\n<li><a href=\"https://www.federalregister.gov/d/2020-07419/p-1256\">https://www.federalregister.gov/d/2020-07419/p-1256</a></li>\n</ul>\n<p>I think this proposed use of token introspection adds a security issue in the case where a system allowed delegated (proxy) access, <em>unless</em> the token introspection response includes the patient FHIR ID associated with the token (similar to how SMART prescribes sending back the patient ID in the oauth2/token response.</p>\n<p>I think in order to get to ONC's goal here, we need to (conditionally) require the patient FHIR ID be returned in the introspect response.</p>\n<p>The issue is: how does a 3rd party resource server determine what patient's data the access token grants access to?  The patient FHIR ID is provided by the patient app to the resource server, alongside the access token issued by the certified API auth server.  However, since the client-provided patient FHIR ID can't be trusted, the resource server needs to have some way to discover to which patient the access token grants access.  Since RFC 7662 (and the current draft SMART introspect profile) only has the \"sub\" (which is the user, not the patient), doing introspect alone doesn't give the resource server a way to determine which patient data should be shared with the app.</p>",
        "id": 241402378,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1622732189
    },
    {
        "content": "<p><a href=\"http://jira.hl7.org/browse/FHIR-32849\">FHIR#32849</a> - but I'm interested if folks think I'm missing something and this isn't actually a problem.</p>",
        "id": 241402425,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1622732213
    },
    {
        "content": "<p>We write <a href=\"http://build.fhir.org/ig/HL7/smart-app-launch/token-introspection.html#conditional-fields-in-the-introspection-response\">in SMARTv2 spec</a>, currently under ballot reconciliation: </p>\n<blockquote>\n<p>SMART Launch Context. If a launch context parameter defined in Scopes and Launch Context (e.g., patient or intent) was included in the original access token response, the parameter SHALL be included in the token introspection response.</p>\n</blockquote>",
        "id": 241413072,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1622736499
    },
    {
        "content": "<p>This is something we've tested at the past few connectathons; does this address the concern? (I can't see your Jira issue right now because Jira's down.)</p>",
        "id": 241413191,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1622736560
    },
    {
        "content": "<p><span aria-label=\"face palm\" class=\"emoji emoji-1f926\" role=\"img\" title=\"face palm\">:face_palm:</span> Yeah.  It's right there in the build.  Thanks for pointing that out.  I withdrew the Jira.</p>",
        "id": 241427797,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1622742606
    },
    {
        "content": "<p>Excellent -- I appreciate the attention to detail on this. It's a \"small thing\" from the spec perspective, but a critical detail if we want to unlock the flexibility ONC is referring to.</p>",
        "id": 241450853,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1622753404
    }
]