[
    {
        "content": "<p>Hi FHIR Community, we are big fans at Mount Sinai and just attended the FHIR App roundtable in DC.  Lots of conversations we had were around a federated identity server for authentication to be coupled with the existing SMART on FHIR OAuth2 flow.  We found in practice many many patients are bouncing on the portal login pages b/c they do not know their login or never registered to begin with.  We are hoping to collaborate to solve this and find out about any existing conversations or agendas in this area.  Thoughts:</p>\n<p>1. Use “OpenID Connect” standard on top of the OAuth2 based SMART spec. <br>\n2. Standard way for health portals (Clinical, Payors, and Health Apps) to list all the Identity Providers they integrate with.  Google, Facebook, LinkedIn, Amazon, Microsoft, etc<br>\n3. Have the government host a default Identity Provider (since many consumers wont trust the above brands with medical records).  Perhaps extending what Medicare has in place for all...<br>\n4. Standardize registration signup and patient pairing if they are not already activated.  Optionally add certified KYC/Auth question providers to plug in.</p>\n<p>Would love to hear thoughts on this, thank you!</p>",
        "id": 154004116,
        "sender_full_name": "Benjamin Maisano",
        "timestamp": 1538430517
    },
    {
        "content": "<p>we strongly recommend OIDC. It would be up to ONC to use levers to require it</p>",
        "id": 154004343,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1538473862
    },
    {
        "content": "<p>There's been a lot of discussion about the identity providers - whether people trust them to know where they have health records, and also the considerably difficult problem of mapping between the identity provider's identity and the institutions identity. I'm not aware of the social media providers being used as identity providers in any situation where you first establish a real world relationship, and then log in through a social media account which is .... somehow... mapped to your record. In a domain as sensitive as health</p>",
        "id": 154004344,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1538473992
    },
    {
        "content": "<p>I am familiar with the idea, and proposed something similar for Australia (see <a href=\"http://www.healthintersections.com.au/?p=2868\" target=\"_blank\" title=\"http://www.healthintersections.com.au/?p=2868\">http://www.healthintersections.com.au/?p=2868</a>) but I'd be completely sceptical that the social media providers would ever be part of that picture.</p>",
        "id": 154004345,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1538474063
    },
    {
        "content": "<p>so in essence, I favor #3. As does the Australian government. Even then, it may not fly in Australia. And it seems unlikely to fly in USA.</p>",
        "id": 154004346,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1538474096
    },
    {
        "content": "<p>there's a fairly obvious approach with a identity provider for health run by a dedicated commercial entity under strict government supervision with several simple token exchange protocols to allow cross-mapping identity during the admission process.  That's a variant of your #4, but it's a difficult market proposition to set up</p>",
        "id": 154004347,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1538474257
    },
    {
        "content": "<p>my view is that the cultural/political environment in USA means that you can't solve this problem. And you'll have to fall back to managed access tokens (e.g. passwords) with the cost this entails</p>",
        "id": 154004348,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1538474316
    },
    {
        "content": "<p>is this discussion being applied to the SMART-on-FHIR version 1 that I am told is now done? Or is this future revision discussion?</p>",
        "id": 154004620,
        "sender_full_name": "John Moehrke",
        "timestamp": 1538490417
    },
    {
        "content": "<p>Thanks Grahame - agree on what you've said, a single identity provider is problematic and likely the health system or hosting organization of the portal's decision on who they support.  Consumers may not trust social, they may also not trust the government.  I do believe allowing each person to make their own choice as to where they authenticate is important.  I think the SMART on FHIR spec simply supporting OpenID Connect or something similar would do, as it sets a recommendation that this is a hugely important step for activation.  #3 would be a big nice to have in that context that isn't in the spec, but a collaboration and perhaps the FHIR community builds up a list of certified IDps.</p>\n<p>Similarly #4 gets at the hairy part of online activation, its the wild west now with many varying implementations or lack of.  If one could say you can signup/register and patient pair in a FHIR standard compliant way that would have value to just focus and iterate on the UI, workflow, etc, and make sure these very important functions are available for a portal that is \"SMART on FHIR\" compliant.</p>",
        "id": 154004639,
        "sender_full_name": "Benjamin Maisano",
        "timestamp": 1538491216
    },
    {
        "content": "<blockquote>\n<p>I'm not aware of the social media providers being used as identity providers in any situation where you first establish a real world relationship, and then log in through a social media account </p>\n</blockquote>\n<p><a href=\"https://www.followmyhealth.com/\" target=\"_blank\" title=\"https://www.followmyhealth.com/\">https://www.followmyhealth.com/</a> does exactly this.</p>",
        "id": 154004700,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1538495636
    },
    {
        "content": "<p>(And they have a FHIR/Argonaut API.)</p>",
        "id": 154004702,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1538495653
    },
    {
        "content": "<p>Thanks Josh for the link. I am really wondering ... IMHO access to sensitive healthcare information shall be only provided to proven identities. Therefore any kind of IDP shall be at least compliant with IAL2 according to NIST SP 800-63 (<a href=\"https://pages.nist.gov/800-63-3/sp800-63-3.html\" target=\"_blank\" title=\"https://pages.nist.gov/800-63-3/sp800-63-3.html\">https://pages.nist.gov/800-63-3/sp800-63-3.html</a>)</p>",
        "id": 154004706,
        "sender_full_name": "Alexander Mense",
        "timestamp": 1538495997
    },
    {
        "content": "<p>I am not aware of any real world identity check process at Facebook, Google, etc.</p>",
        "id": 154004710,
        "sender_full_name": "Alexander Mense",
        "timestamp": 1538496145
    },
    {
        "content": "<p>A healthcare app would do additional identity proofing, to elevate the low assurance Facebook identity, to a higher assurance identity that is also cross-referenced to a Patient identity. -- such as using Postal Mail (covered by federal fraud rules) to send a secret challenge.</p>",
        "id": 154005240,
        "sender_full_name": "John Moehrke",
        "timestamp": 1538573355
    },
    {
        "content": "<p>This does nothing to elevate the level of assurance for authentication, or the management risks of Facebook. But many consumers have facebook identity, and don't want to manage yet-another-password. Adding more passwords the consumer must remember presents risks itself</p>",
        "id": 154005242,
        "sender_full_name": "John Moehrke",
        "timestamp": 1538573442
    }
]