[
    {
        "content": "<p>Hi all, Im new here!! Im having trouble understanding something about smart on fhir. I want to know how i to pass the patient or practitioner into the launch flow. Can anyone help me? Thanks a lot!</p>",
        "id": 223662696,
        "sender_full_name": "Emiliano Fernandez",
        "timestamp": 1611332193
    },
    {
        "content": "<p><a href=\"http://hl7.org/fhir/smart-app-launch/#smart-authorization-and-resource-retrieval\">This page</a> should give you what you need</p>",
        "id": 223665531,
        "sender_full_name": "David Pyke",
        "timestamp": 1611333268
    },
    {
        "content": "<p>yes ive seen it. But I dont really understand if im currently in the EHR with a specific patient, and i start the launch process, how do the parts know that specific patient? (sorry for my english)</p>",
        "id": 223665895,
        "sender_full_name": "Emiliano Fernandez",
        "timestamp": 1611333455
    },
    {
        "content": "<p>It's the responsibility of the launching application to 'know' what patient you're looking at, what user is logged on, etc.</p>",
        "id": 223672246,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1611336475
    },
    {
        "content": "<p>If you're implementing the SMART standard, you would likely have a way in the system to generate the launch code that ties to patient and encounter/other SMART launch context</p>",
        "id": 223675243,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1611337895
    },
    {
        "content": "<p>Thanks for the replies, so there is no \"standard\" to send from the EHR the current patient?</p>",
        "id": 223675749,
        "sender_full_name": "Emiliano Fernandez",
        "timestamp": 1611338127
    },
    {
        "content": "<p>The EHR launch provides a way to communicate a patient from the EHR to the app. It is not provided as a direct parameter on the redirect to the app, because the app is not allowed to see this information until it has successfully completed an authorization. Once you complete authorization, you get an access token response from the EHR, that access token response will include the patient id, as long as you have requested the right scopes. (As Jenni points out, the only parameter that goes out over the wire to the app at lunch time is an opaque launch ID that the EHR uses to tie this whole session together.)</p>",
        "id": 223679133,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1611339633
    },
    {
        "content": "<p>Thank you very much!! Its clear now</p>",
        "id": 223679972,
        "sender_full_name": "Emiliano Fernandez",
        "timestamp": 1611340024
    },
    {
        "content": "<p>In my case, the oauth authentication is with an external IDP, is there another way to get the patient info if the token response from the IDP does not contain that info you mention?</p>",
        "id": 223682169,
        "sender_full_name": "Emiliano Fernandez",
        "timestamp": 1611341141
    },
    {
        "content": "<p>In my case, the oauth authentication is with an external IDP, is there another way to get the patient info if the token response from the IDP does not contain that info you mention?</p>",
        "id": 223901765,
        "sender_full_name": "Emiliano Fernandez",
        "timestamp": 1611583941
    },
    {
        "content": "<p>In general the approval process needs to reflect the user's decision to share information; if the authorization server doesn't know about this information it cannot implement an appropriate approval process.</p>",
        "id": 223904210,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1611585080
    },
    {
        "content": "<p>You'll have to customize the identity provider or add a layer on top of it to handle SMART-specific stuff like the patient selection</p>",
        "id": 223904231,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1611585088
    },
    {
        "content": "<p>Is it ok for example to send from de EHR a JWT token, with the patient information, in the launch parameter?? For Example:<br>\nxxxxxx/launch.html?launch={JWT_token}???</p>",
        "id": 224486584,
        "sender_full_name": "Emiliano Fernandez",
        "timestamp": 1611934196
    },
    {
        "content": "<p>Yes</p>",
        "id": 224487814,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1611934614
    },
    {
        "content": "<p>(Seems overkill though)</p>",
        "id": 224487951,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1611934672
    }
]