[
    {
        "content": "<p>reading the CI build's language around PKCE plain I'm wondering what the actual requirements around not supporting plain are (from: <a href=\"https://build.fhir.org/ig/HL7/smart-app-launch/index.html#considerations-for-pkce-support\">https://build.fhir.org/ig/HL7/smart-app-launch/index.html#considerations-for-pkce-support</a>)<br>\nis a server expected to deny any auth requests using plain? with any particular code and which step? or can they accept plain PKCE requests out of band of SMART (assuming they even have any non-SMART auth) <br>\nOr is it purely a client-facing requirement, and any clients that use plain need to understand they are not using SMART and need to have no expectation that a server supporting SMART will support them?</p>",
        "id": 247000755,
        "sender_full_name": "ryan moehrke",
        "timestamp": 1627058261
    },
    {
        "content": "<p>We say that a server needs to advertise its support for pkce and advertise the code verification methods that it supports. Those methods must not include plain.</p>",
        "id": 247010706,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1627062768
    },
    {
        "content": "<p>If a server wants to support plain but advertisement doesn't support plain... I guess that could be possible? I don't know that there would be negative tests on this point in a conformance suite.</p>",
        "id": 247010815,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1627062829
    },
    {
        "content": "<p>Are you thinking about this because you have a use case for the plain verification method, and you are concerned that you will not be able to support it? Is there something you can't handle with S256 or another method?</p>",
        "id": 247011043,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1627062932
    },
    {
        "content": "<p>Nope, I was thinking about how if/how I would negative test it and who I could hold accountable :p</p>",
        "id": 247035985,
        "sender_full_name": "ryan moehrke",
        "timestamp": 1627076583
    },
    {
        "content": "<p>I'd definitely reject an app for trying to use plain. Because it won't interoperate.</p>",
        "id": 247036134,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1627076686
    },
    {
        "content": "<p>I think the 2nd one. Client SHALL use <code>code_challenge_method</code>. Server SHOULD (or MAY) reject if client use <code>plain</code> (or other value)</p>",
        "id": 247260188,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1627332749
    }
]