[
    {
        "content": "<p>What would you recommend as a presentation of the power of adding SMART-on-FHIR launch framework to an EHR or other data hosting that already supports FHIR? Meaning the presentation focuses on SMART value-add, not FHIR. Presuming FHIR has already caught... on.</p>",
        "id": 223635905,
        "sender_full_name": "John Moehrke",
        "timestamp": 1611319471
    },
    {
        "content": "<p>And when you say presentation do you mean like a slide deck? Or do you mean what is the value proposition that SMART on FHIR offers above \"just FHIR\"?</p>",
        "id": 223636746,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1611319976
    },
    {
        "content": "<p>I will take anything that hits the target... but my need might be best served by a video recording speaking to decision maker level people. A slide deck would be useful, I would try to do the deck justice. A text would be okay, but I likely already extracted that from the spec.</p>",
        "id": 223637955,
        "sender_full_name": "John Moehrke",
        "timestamp": 1611320649
    },
    {
        "content": "<p>Did I just inspire another of your 5 minute videos??? That would be most excellent.</p>",
        "id": 223638790,
        "sender_full_name": "John Moehrke",
        "timestamp": 1611321097
    },
    {
        "content": "<p>Sure, this would be a good topic. But the short story is: SMART provides the glue you need to build user-facing apps (single  sign-on, scoped authorization, UX embedding, and context sharing).</p>",
        "id": 223641021,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1611322347
    },
    {
        "content": "<p>yes</p>",
        "id": 223641076,
        "sender_full_name": "John Moehrke",
        "timestamp": 1611322378
    },
    {
        "content": "<p>If all you know is \"my data host supports FHIR\", you may not have any of these capabilities, or they may be implemented in non-standard ways, or \"oddly standard\" ways.</p>",
        "id": 223641082,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1611322381
    }
]