[
    {
        "content": "<p>Hey all, given some of the most recent clarifications from ONC I wanted to reach out to the community on thoughts around offline access for providers. It looks like the EHR launch is the workflow now required for providers (no longer standalone), but offline access is still in there.</p>",
        "id": 206929401,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1597412120
    },
    {
        "content": "<p>If you're an app dev, I am interested in hearing the use cases/workflows you have that would need offline access (esp if launched from EHR) for a provider</p>",
        "id": 206929457,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1597412159
    },
    {
        "content": "<p>Provider offline access creates some fun admin/revocation workflows as well. In the patient use case, it's very clearly the patient that has rights/responsibility to manage the access to the data. But for provider, it's a mix between the provider (which the app will now act on behalf of) and the site administrators themselves</p>",
        "id": 206929628,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1597412261
    },
    {
        "content": "<p>Can you link to the relevant clarifications?</p>",
        "id": 206931478,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1597413351
    },
    {
        "content": "<p>There are myriad use cases that require offline access for provider facing apps. Consider any app that is going to perform long-term monitoring of a patient and make recommendations or provide outreach based on those monitoring results. It might even be something as simple as \"if this then that\" or \"remind me when\" functionality for providers.</p>",
        "id": 206931737,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1597413506
    },
    {
        "content": "<p>Regarding token revocation, the criteria is specific that it is only required for patients apps.  That doesn't mean you don't want to consider it, but revoking token for practitioner-facing EHR launched apps isn't a requirement for certification.</p>",
        "id": 206932868,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1597414154
    },
    {
        "content": "<p>For those that missed the g10 test method update that was published late last week: <a href=\"#narrow/stream/179190-united-states/topic/2015.20Cures.20Update.20CCG.20.26.20TP.20v1.2E1/\">https://chat.fhir.org/#narrow/stream/179190-united-states/topic/2015.20Cures.20Update.20CCG.20.26.20TP.20v1.2E1/</a></p>",
        "id": 206933380,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1597414457
    },
    {
        "content": "<p>Agree that it's not required, but these apps fall under HIPAA (and most site admins would want to be able to watch and revoke/stop apps from accessing). Or docs moving jobs, retiring, etc :) Some controls will need to be in place.</p>",
        "id": 206936575,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1597416435
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>   yes, the research \"opt in\" and monitoring of a patient were some of the scenarios that seem to make a lot of sense when launched/started within the chart itself. They obviously would need other methods to alert the doc since they won't always be in the chart when the reminder/etc needs to come in.</p>",
        "id": 206936698,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1597416529
    },
    {
        "content": "<p>The section that has a lot of clarifications around the SMART scenarios is Paragraph (10)(v)(A)(1) clarifications</p>",
        "id": 206936985,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1597416696
    },
    {
        "content": "<p>Direct link to CCG: <a href=\"https://www.healthit.gov/test-method/standardized-api-patient-and-population-services#ccg\">https://www.healthit.gov/test-method/standardized-api-patient-and-population-services#ccg</a></p>",
        "id": 206937055,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1597416728
    }
]