[
    {
        "content": "<p>On a discussion for Da Vinic CDEX there was question about providing a <em>reason</em> for a specific query and was suggested is part of OAUTH. Can requester A get access only for reason B   but no other reason?  does it work that way?   (e.g.  I'm want to see the data to verify a claim).  I  wanted to follow up here to see if there is general agreement and how the heck a reason would be incorporated into SMART Launch.</p>",
        "id": 214096630,
        "sender_full_name": "Eric Haas",
        "timestamp": 1603306133
    },
    {
        "content": "<p>Usually only a human would know why they're opening something - eg: it's not something we could really assume</p>",
        "id": 214099098,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1603307119
    },
    {
        "content": "<p>so, for example, let's say I have a growth chart app. The physician might launch it as part of their appt to evaluate growth compared to norms, to discuss something with a patient, or to look at the last measurements b/c the patient was admitted somewhere and they're doing a risk assessment/evaluation for treatment</p>",
        "id": 214099261,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1603307189
    },
    {
        "content": "<p>that was my conclusion: essentially is \"out-of-band\" right?</p>",
        "id": 214099296,
        "sender_full_name": "Eric Haas",
        "timestamp": 1603307204
    },
    {
        "content": "<p>if all daVinci wants to know is \"physician launched app\" - we can tell them that without a human :)</p>",
        "id": 214099309,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1603307214
    },
    {
        "content": "<p>you could make it in band, but it would require manual entry</p>",
        "id": 214099332,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1603307227
    },
    {
        "content": "<p>I thought this was actually more provenance than for a whole session</p>",
        "id": 214099356,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1603307243
    },
    {
        "content": "<p>out-of-band = usage agreement</p>",
        "id": 214099447,
        "sender_full_name": "Eric Haas",
        "timestamp": 1603307284
    },
    {
        "content": "<p>ie: ONC requires provider offline access but not online. The reason they accessed data X today may be very different than when they accessed it yesterday</p>",
        "id": 214099467,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1603307285
    },
    {
        "content": "<p>Again, depends at what level they're trying to get :/</p>",
        "id": 214099500,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1603307306
    },
    {
        "content": "<p><a href=\"http://build.fhir.org/provenance-definitions.html#Provenance.reason\">http://build.fhir.org/provenance-definitions.html#Provenance.reason</a></p>",
        "id": 214099579,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1603307356
    },
    {
        "content": "<p>That is a way for an app/system to give the reason it did something. I don't think most support this today</p>",
        "id": 214099636,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1603307376
    },
    {
        "content": "<p>But there's also: <a href=\"http://build.fhir.org/auditevent-definitions.html#AuditEvent.agent.purposeOfUse\">http://build.fhir.org/auditevent-definitions.html#AuditEvent.agent.purposeOfUse</a></p>",
        "id": 214099747,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1603307412
    },
    {
        "content": "<p>which seems more in line??</p>",
        "id": 214099767,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1603307421
    },
    {
        "content": "<p>I am referring to data access query</p>",
        "id": 214099772,
        "sender_full_name": "Eric Haas",
        "timestamp": 1603307424
    },
    {
        "content": "<p>cc <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  because I'm going by past discussions and am definitely not the expert</p>",
        "id": 214099810,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1603307444
    },
    {
        "content": "<p>that would be a trail</p>",
        "id": 214099813,
        "sender_full_name": "Eric Haas",
        "timestamp": 1603307445
    },
    {
        "content": "<p>I think it has to be per access/query</p>",
        "id": 214099852,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1603307463
    },
    {
        "content": "<p>the \"session\" is very blurry and is even regulated in the US today to only require offline access <span aria-label=\"rolling on the floor laughing\" class=\"emoji emoji-1f923\" role=\"img\" title=\"rolling on the floor laughing\">:rolling_on_the_floor_laughing:</span></p>",
        "id": 214099910,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1603307488
    },
    {
        "content": "<p>(at least for on behalf of user - system access doesn't have a session nor SMART context to hook into)</p>",
        "id": 214100081,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1603307556
    },
    {
        "content": "<p>If they're wanting to restrict auth based on a reason then that's a different way than we've thought of auth today</p>",
        "id": 214100418,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1603307727
    },
    {
        "content": "<p>that would have impacts to the online vs offline access vs single use rules, I would think</p>",
        "id": 214100457,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1603307747
    },
    {
        "content": "<p>So I would go back to \"what level\" they're wanting to know re:what data is being accessed/why, then to <em>who</em> is going to know that and when. That would help us figure out where in the process it would be available for input</p>",
        "id": 214100679,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1603307831
    },
    {
        "content": "<p>I have been trying to get this kind of discussion going. Two things. 1) the authZ token needs to indicate ALL the uses (PurposeOfUse) that the requested results will be used. Not just what triggered 'this' request. 2) the request can indicate the trigger action (activity). Too often I see #2 being talked about as if it was #1.</p>",
        "id": 214102346,
        "sender_full_name": "John Moehrke",
        "timestamp": 1603308564
    },
    {
        "content": "<p>Audit <a href=\"http://log.is\">log.is</a> in addition. Recording what happened. Access to the log would be protected for very specific and targeted (not bulk) access. Like investigating a suspected failure to follow rules.</p>",
        "id": 214102718,
        "sender_full_name": "John Moehrke",
        "timestamp": 1603308696
    },
    {
        "content": "<p>Where do you stick PurposeOfUse in OAuth?  Is there any guidance about how that can/should be computable?</p>",
        "id": 214106355,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1603310298
    },
    {
        "content": "<p>Given the offline access workflow, and that applications may change their data use over time, I'm not sure it's realistic to expect that the initial authorization would contain it. If this is something that could be change on refresh... then that's also interesting</p>",
        "id": 214119716,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1603317319
    },
    {
        "content": "<p>Same question as Lloyd: how is that communicated?</p>",
        "id": 214119830,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1603317365
    },
    {
        "content": "<p>Hey Guys, in our system, this is communicated during registration. Jenni, during registration for your system, does an app communicate if it is patient-facing vs provider-facing?</p>",
        "id": 214370789,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1603490528
    },
    {
        "content": "<p>We know if it is patient facing, provider, or system but that is NOT the purpose of use. Also, as discussed above, we may know the app is generally a growth chart provider facing app, but that doesn't mean you know why the provider is launching that application</p>",
        "id": 214577484,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1603721269
    },
    {
        "content": "<p>This <a href=\"https://hl7.org/fhir/2018Jan/v3/PurposeOfUse/vs.html\">list is terribly intimidating</a> (for me at least), but really there's only a few purposes of use: treatment, patient-requested, public health, marketing, operations, payment, and research. (And some networks have even cut this list down further). All CCDS/USCDI patient-facing apps are registered with an implicit, but concrete, purpose of patient-requested; aren't they?</p>",
        "id": 214642131,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1603752048
    },
    {
        "content": "<p>Those are all extensible or example bindings - this is why I was curious about what \"level\" DaVinci is needing to track.  So, using that it would be hard to tell a training data access from a real clinical scenario, if that is the level of detail needed.  Similarly, research vs trial vs treatment could be all valid reasons a doctor launches an app that graphs data.</p>",
        "id": 214655079,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1603765260
    },
    {
        "content": "<p>would love to see you all provide comments to improve the vocabulary...</p>",
        "id": 214692691,
        "sender_full_name": "John Moehrke",
        "timestamp": 1603802077
    },
    {
        "content": "<p>I have seen a few recommendations for how purposeOfUse is carried. In IHE IUA it is carried as an attribute in the OAuth token. In HEART it is part of the scope.  In the break-glass proposal in the FHIR core it is carried in an http x-header. And SMART is looking at it as well...  There is also the proposed Permission resource that seems could be in many places.   So this all shows that we are in experimental stage at this point. It seems to be agreed that it is an important vector to authorization decisions, and authorization enforcements. It should be clear it is an important vector in data-use after data are communicated (use needs to be restricted to the PurposeOfUse(s) under which it was released)...</p>",
        "id": 214693070,
        "sender_full_name": "John Moehrke",
        "timestamp": 1603802331
    }
]