[
    {
        "content": "<p>Is it allow able to include a parameter or fragment in the redirect_uri in the auth request and have it returned to the app at the end of the authorisation sequence.<br>\nI have tested this against the <a href=\"http://launch.smarthealthit.org\">launch.smarthealthit.org</a> server and it doesn't return a code parameter in the redirect when I include a parameter but works fine when I include a fragment. <br>\nAnother Auth server just gives me an Invalid Redirect response.<br>\nExample: redirect_uri=http%3A%2F%2Flocalhost%3A%23abc</p>",
        "id": 253561990,
        "sender_full_name": "Heath Frankel",
        "timestamp": 1631789679
    },
    {
        "content": "<p>Hi Heath- this is what you can use the “state” parameter for. Its a value that you provide that will be returned untouched from the authz server. The main consideration though is that the state parameter is also used to help protect against various attacks on the protocol so therefore it cannot be a guessable value. So one approach would be to encode your desired value in a signed blob like a Jwt that you can use to both communicate information, but can also be validated</p>",
        "id": 253629365,
        "sender_full_name": "Dan Cinnamon",
        "timestamp": 1631817479
    },
    {
        "content": "<p>Thanks Dan. I am using the SMART JS Client for the SMART Launch and the generation and management of state is buried deep inside the library. Although I could look at modifying the library, I'm reluctant to have to maintain a fork of it. </p>\n<p>So I shouldn't use fragment in the redirect_uri for this purpose?</p>",
        "id": 253685542,
        "sender_full_name": "Heath Frankel",
        "timestamp": 1631850760
    },
    {
        "content": "<blockquote>\n<p>So I shouldn't use fragment in the redirect_uri for this purpose?</p>\n</blockquote>\n<p>Most server would reject that as an unregistered redirect URL, so it won't work</p>",
        "id": 253744990,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1631886700
    },
    {
        "content": "<p>The OAuth 2.0 Threat Model and Security Considerations explicitly states <a href=\"https://datatracker.ietf.org/doc/html/rfc6819#section-5.2.3.5\">\"the \"redirect_uri\" should be the full URI\"</a>. So your ability to include a fragment is dependent upon servers disregarding this advice.</p>",
        "id": 253749115,
        "sender_full_name": "Stephen MacVicar",
        "timestamp": 1631888306
    },
    {
        "content": "<p>I think you should read that as \"full URL and not a relative one\".</p>",
        "id": 253764761,
        "sender_full_name": "Vladimir Ignatov",
        "timestamp": 1631894471
    },
    {
        "content": "<blockquote>\n<p>So I shouldn't use fragment in the redirect_uri for this purpose?</p>\n</blockquote>\n<p>Correct; the only \"variable\" part of a redirect (i.e., the only part that changes across multiple launches) will be the auth-server-supplied query params (<code>code</code> and <code>state</code>), and of these, the only one you control is <code>state</code>. So the advice is: create a high-entropy random <code>state</code> value and attach any state you need to track to this value, within your client.</p>",
        "id": 253766824,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1631895326
    },
    {
        "content": "<p>That prevents external parties from \"tricking\" your app by injecting additional parameters.</p>",
        "id": 253766853,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1631895340
    }
]