[
    {
        "content": "<p>In what scenarios, clients need to ask for online_access scope? If user is online, what capability it gives to the client to get new token? Can't client generate new access token using authorization code workflow without requiring user to login (but just with session cookie). I am trying to understand use case behind it and see, if anyone already implemented this using any OIDC server? Any suggestions are appreciated!</p>",
        "id": 219922109,
        "sender_full_name": "Sagar Shah",
        "timestamp": 1607991697
    },
    {
        "content": "<blockquote>\n<p>Can't client generate new access token using authorization code workflow without requiring user to login (but just with session cookie).</p>\n</blockquote>\n<p>In general this requires a user interaction. Some EHRs may be configured to allow it without clicks, but it still requires a pair of redirects and takes things out of an app's control. Using a refresh token is a better fit when the app can be authorized appropriately, since it allows a fully automated flow.</p>",
        "id": 219924640,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1607993253
    },
    {
        "content": "<p>Appreciate your inputs! I understand the need but I see the limitations with at least the existing OIDC providers I have looked into.</p>\n<ol>\n<li>Keycloak - This does support refresh token that's by default linked to user session (that can support online_access) and when offline_access is requested, it can return the token that's generally persisted and can work longer. But it does not have a way to NOT pass refresh token if client does not have either of online_access or offline_access scope<br>\n2 ORY Hydra - This supports issuing refresh token only as long as offline_access scope is requested and does not support linking refresh token to user sessions on the ground that refresh token should NOT be confused with user sessions and should not have any link/association with user session.</li>\n</ol>\n<p>So trying to understand best approach to resolve this.</p>",
        "id": 219974046,
        "sender_full_name": "Sagar Shah",
        "timestamp": 1608037024
    },
    {
        "content": "<p>This capability might not be the best fit for an authorization server that is highly decoupled from the EHR. I certainly wouldn't points to it as the low-hanging fruit for implantation :-)</p>",
        "id": 219997421,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1608047299
    },
    {
        "content": "<p>However, if one is asked to implement an OIDC solution that complies with SMART on FHIR, is it not mandatory to support online_access scope (as per SMART on FHIR specs) that generates the refresh token tied to the user session, which is in general not suggested as per OIDC.<br>\nSpecifically, I am referring to 21st century Cures Act, which requires Auth server for FHIR API access to be SMART on FHIR compliant, but that itself does not mention any criteria about online_access scope anywhere. So I am not certain if online access is a mandatory need or not? <br>\nRef: <a href=\"https://www.ory.sh/hydra/docs/concepts/before-oauth2/#access-and-refresh-tokens-are-not-sessions\">https://www.ory.sh/hydra/docs/concepts/before-oauth2/#access-and-refresh-tokens-are-not-sessions</a><br>\nPlease suggest your thoughts onto this.</p>",
        "id": 220656026,
        "sender_full_name": "Sagar Shah",
        "timestamp": 1608608280
    },
    {
        "content": "<p>ONC's Standardized API Criteria requires implementation of all <a href=\"https://hl7.org/fhir/smart-app-launch/conformance/index.html#core-capabilities\">SMART Core Capabilities</a>, and the online_access scope is not associated with any of those core capabilities.  So for certification to that criteria (g10) using v1.0.0 of the SMART App Launch Framework, you do not need to demonstrate that functionality.</p>",
        "id": 220698015,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1608649474
    },
    {
        "content": "<p>That's the technical reason why there is not testing associated with <del>offline_access</del> online_access in the <a href=\"https://www.healthit.gov/test-method/standardized-api-patient-and-population-services#test_procedure\">test procedure</a>.  But it also makes sense that online access isn't a requirement because it is more restrictive access-wise than offline access (it doesn't give apps more access than other available scopes), and it imposes tighter coupling between components within the 'ehr' which may be difficult for some health it developers to implement.</p>",
        "id": 220699746,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1608650357
    },
    {
        "content": "<p>Re: offline, do you just test for refresh token capabilities without involving this scope?</p>",
        "id": 220700140,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1608650528
    },
    {
        "content": "<p>We only test using \"offline_access\" scope -- systems must support that scope specifically to get refresh tokens.</p>",
        "id": 220700282,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1608650602
    },
    {
        "content": "<p>Systems can support online_access additionally, of course.  But they can't only support online_access and not offline_access.</p>",
        "id": 220700431,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1608650680
    },
    {
        "content": "<p>Thank you for all the clarifications <span class=\"user-mention\" data-user-id=\"192576\">@Robert Scanlon</span>  and <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> . That does make sense to me. We do plan to support offline_access scope in our auth server, which will be required by the clients, if they need refresh tokens.</p>",
        "id": 220702908,
        "sender_full_name": "Sagar Shah",
        "timestamp": 1608652057
    },
    {
        "content": "<p>I just realized I bungled offline_access/online_access in my response a few messages back, which hopefully didn't cause too much confusion (see the strikeout/replacement).  But based on your last message it seems like you were able to read through it.  Sorry!</p>",
        "id": 220717027,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1608659981
    },
    {
        "content": "<p>Ironically, all of our production provider apps today use online_access as the apps don't get data after the user closes the app :) We found it sad that ONC didn't mention it at all</p>",
        "id": 221820164,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1609965571
    },
    {
        "content": "<p>Leaving a refresh token out and valid (esp for public apps) when an application doesn't need that type of access is an unfortunate security vulnerability</p>",
        "id": 221820378,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1609965676
    },
    {
        "content": "<p>And the \"one time use\" (short term use) token isn't a great alternative for apps like that</p>",
        "id": 221820511,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1609965724
    }
]