[
    {
        "content": "<p>We are planning to create a SMART on FHIR application that can be used by various EHGs. Based on the documentation on <a href=\"http://docs.smarthealthit.org/profiles/\" target=\"_blank\" title=\"http://docs.smarthealthit.org/profiles/\">http://docs.smarthealthit.org/profiles/</a> it looks like the profiles set some constrains – like some values should be defined with LOINC.codes (like the Observation.Code). In Norway we have some national codes, already in place, that we want to use (instead of LOINC)<br>\nHow strict are the constraints listed in the web sites? Is the goal that they are global? And if not will the SMART APPs have the come in different variants as well, to support national/regional customization?</p>",
        "id": 153846066,
        "sender_full_name": "Henrik",
        "timestamp": 1472730829
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191807\">@Henrik</span> let me know when you get the ball rolling ... it might also be usefull here in DK</p>",
        "id": 153846067,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1472731998
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191427\">@Jens Villadsen</span> will do. Have you, Denmark, done any work on SMART on FHIR? Would say we are on a concept level, but will soon start to look into more technical details on how we can use this for several national projects.</p>",
        "id": 153846069,
        "sender_full_name": "Henrik",
        "timestamp": 1472732527
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191807\">@Henrik</span> I don't think is has gotten much attention on a national level but I've been looking into it the past couple of days, though from a different perspective</p>",
        "id": 153846072,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1472734301
    },
    {
        "content": "<p>The main goal of SMART is to make it easier to create substitutable apps, meaning plug &amp; play. We've created the profiles to ease the pain when working with e.g. lab values so that an app does not need to support several lab coding systems.</p>",
        "id": 153846075,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1472736835
    },
    {
        "content": "<p>Hmmm .... <span class=\"user-mention\" data-user-id=\"191339\">@Pascal Pfiffner</span>, AFAIK lab coding systems are pretty standardized in the nordics ... but I might be wrong</p>",
        "id": 153846076,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1472736906
    },
    {
        "content": "<p>With that, the question is whether it makes more sense to create country-specific SMART profiles (<span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span> is working on SMART-ca for Canada) or whether it's possible to create profiles that can be used universally (good joke, right?)</p>",
        "id": 153846077,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1472736911
    },
    {
        "content": "<p>Well yes, but today a SMART app will only support LOINC. If you want to use a SMART app in Norway and they're using their own coding system, it will not work, hence breaking substitutability.</p>",
        "id": 153846078,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1472736963
    },
    {
        "content": "<p>Since I'm (part-time) Switzerland based, this question also arises for me, because we're definitely not using _RxNorm_ (but LOINC, SNOMED is picking up). So this is a good discussion to have. <span class=\"user-mention\" data-user-id=\"191807\">@Henrik</span> , since you seem to be digging in, can you report which (of the SMART profiles) work for you and which don't, and what you'd change?</p>",
        "id": 153846079,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1472737254
    },
    {
        "content": "<p>There will definitely be a need for regional profiles.  Standardizing on LOINC codes worldwide might be possible, but standardizing on RxNorm for drug codes definitely won't be.  We had tried to have a connectathon on this, but didn't get any participants.</p>",
        "id": 153846081,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1472737461
    },
    {
        "content": "<p>Oh yes, no question. One thought I had was that maybe, it's enough to allow 2 or 3 coding systems. e.g. RxNorm *or* ATC for meds. </p>",
        "id": 153846082,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1472737532
    },
    {
        "content": "<p>Well, I guess the question is: How much can we come up with a consistent SMART profile that can reasonably be followed on an international basis (U.S., China, Russia, Europe, South America, etc.) and how much is going to have to be country-specific profiles.  I expect drug code will have to be country-specific, but we might be able to get international agreement on at least the demongraphic codes</p>",
        "id": 153846085,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1472741021
    },
    {
        "content": "<p>Australia is making our own profile on Smart on FHIR - we're taking the base Smart on FHIR profiles, and replacing them with what we need to do for Australian practice. You should do the same for your own countries</p>",
        "id": 153846732,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1473293148
    },
    {
        "content": "<p>We are creating English profiles for the SMART (DAF) profiles though we have numerous differences due to regional terminologies, national architectures and approaches to profiling.</p>",
        "id": 153847219,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1473803227
    },
    {
        "content": "<p>I think it would be good if we could agree on a core set of internationalized profiels that apps could count on wherever they run.  Some things such as diagnosis codes and drug codes may be hard to standardize, but others will be easier.  The more easy it is for apps to cross borders, the more apps we'll have to choose from and the higher the quality of the apps will be.  (My iPhone wouldn't be nearly as much fun if I could only run apps that were designed for the Canadian environment . . .)</p>",
        "id": 153847229,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1473814371
    },
    {
        "content": "<p>I have asked <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>  to be clear on this page: <a href=\"http://docs.smarthealthit.org/profiles/\" target=\"_blank\" title=\"http://docs.smarthealthit.org/profiles/\">http://docs.smarthealthit.org/profiles/</a> that the page is now orphaned and the work deprecated in favor of Argonaut, and that everyone should be adapting argonaut, not that page </p>",
        "id": 153847322,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1473928222
    },
    {
        "content": "<p>Everyone = U.S. implementers?</p>",
        "id": 153847371,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1473947552
    },
    {
        "content": "<p>I'm guessing \"everyone\" thinking of implementing SMART, which currently is probably identical to \"US Implementers\". :)</p>",
        "id": 153847379,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1473950224
    },
    {
        "content": "<p>As per the topic of this thread, there are lots of countries who are interested in using SMART and for whom some of the U.S.-specific decisions in Argonaut (and in the original SMART profiles) would be problematic.</p>",
        "id": 153847381,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1473951139
    },
    {
        "content": "<p>I would agree with <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> We are looking at SMART but will be considering it more as a pattern than a fixed specification.</p>",
        "id": 153847382,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1473951847
    },
    {
        "content": "<p>I agree, we (Ontario, Canada) are also considering SMART as a pattern.</p>",
        "id": 153847383,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1473952278
    },
    {
        "content": "<p>For SMART to work well, we want to minimize the number of patterns and maximize the commonality across jurisdictions.  The more variation there is, the fewer apps everyone will be able to take advantage of.  So the focus of the patterns should be to keep work for the app developers as low as possible.</p>",
        "id": 153847389,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1473956201
    },
    {
        "content": "<p>Argonaut profile = smart profiles are derived from us federal regulations (namely CCDS) hence they are realm specific.  If you want an internationalized version then an international set of requirements are needed as starting point<br>\n.  </p>",
        "id": 153847399,
        "sender_full_name": "Eric Haas",
        "timestamp": 1473964082
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>  Exactly! Why anyone thinks that SMART/DAF and other US profiles will be \"out of the box\" applicable to other realms puzzles me. I am sure they are great for the US and a great reference point for others, but that's it.</p>",
        "id": 153847425,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1473973393
    },
    {
        "content": "<p>They can't be \"out of the box\" applicable - there will need to be some variances, but fundamentally the DAF profiles are about \"what's the simplest set of data that can be exposed that can provide the most value\", and there's a fair bit of world-wide applicability there.  An international profile for SMART would be one that is possible for everyone in the world to map to and expose their data as, not necessarily what may feel most natural/cheapest/easiest to expose their data as for legacy reasons.  I'd much rather have increased cost for those who have to expose the data in order to reduce cost and minimize variance for those who need to write apps.</p>",
        "id": 153847428,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1473978028
    },
    {
        "content": "<p>We are doing SMART down in Australia too, but localizing the valuesets to our jurisdiction.<br>\nRace/Ethnicity values? Country of Birth? Identifiers etc.</p>",
        "id": 153847495,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1474063673
    },
    {
        "content": "<p>There's seems to some confusion here. I said: anyone thinking of implementing smart outside USA should adapt (not adopt) Argonaut, not the data page in the smart docs</p>",
        "id": 153847508,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1474066900
    }
]