[
    {
        "content": "<p>The spec states that all apps when registered with an EHR must register one or more Launch URL's. But this only applies for an EHR launch, nt a standalone launch - correct?</p>",
        "id": 153924625,
        "sender_full_name": "David Hay",
        "timestamp": 1513116149
    },
    {
        "content": "<p>Please let me know if this belongs on the implementers stream.  We (LNRS) have a use case we would like to implement which asks the question 'does our customer need to register with each target as an app-developer in the scenario below, or can we manage the entire registration ourselves'.  I've read the OAuth2 and Consent thread, looked at FHIR UDAP, etc. but am having trouble getting to an answer on this or if this is even feasible currently.</p>\n<p>Workflow:<br>\n1.  LNRS offers a solution to Health Plan A (Customer) to pull Patient Access data on their behalf<br>\n2.  Health Plan A (Customer) engages Member A to request permission to receive their “Patient Access” at Health Plan B (Target) <br>\n3.  Member A authenticates themselves and authorizes the release of information at Health Plan B (Target)<br>\n4.  Health Plan B (Target) provides a consent token to Health Plan A (Customer) to allow access to the Patient Access API<br>\n5.  Health Plan A (Customer) passes the consent token to LNRS<br>\n6.  LNRS accesses Health Plan B (Target) Patient Access API and authenticates the request with the token<br>\n7.  LNRS pulls down the patient access data onto its platform<br>\n8.  LNRS provides the normalized and enriched patient access data back to Health Plan A (Customer) via LNRS’ API</p>",
        "id": 254233500,
        "sender_full_name": "Douglas DeShazo",
        "timestamp": 1632240525
    },
    {
        "content": "<blockquote>\n<ol start=\"3\">\n<li>Member A authenticates themselves and authorizes the release of information at Health Plan B (Target)</li>\n</ol>\n</blockquote>\n<p>This is the crux, I think: does the member see a request (in the Health Plan B portal) like \"Do you want to share your data with LNRS\" or like \"Do you want to share your data with Health Plan A\"? Assuming the language is about Health Plan A, then you'll need to register an OAuth client representing Health Plan A (rather than LNRS) with Health Plan B.</p>",
        "id": 254242825,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632243966
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> will take under advisement.  This seems to be a scenario that is cropping up, certainly for us, so is there anything like this being discussed in WG's anywhere?  Davinci has PCDE, UDAP may have an approach for passing consent, IUA, but I haven't been able to locate OAuth.</p>",
        "id": 254382280,
        "sender_full_name": "Douglas DeShazo",
        "timestamp": 1632322938
    },
    {
        "content": "<p>This all works using standard SMART-on-FHIR, with the following modification: LNRS registers as Plan A, and step (4) and (5) become 'Health Plan B (Target) provides a consent token to LNRS (acting on behalf of Plan A)'</p>",
        "id": 254383064,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1632323225
    },
    {
        "content": "<p>And it is a scenario covered by the DaVinci ePDX guide that the industry is (allegedly) implementing</p>",
        "id": 254383151,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1632323259
    },
    {
        "content": "<p>To be clear in Michele's example, LRNS would need to maintain many individual app registrations (on behalf of its presumably many customers). The scaling story isn't ideal but it works today and doesn't involve exotic requirements.</p>",
        "id": 254385606,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632324225
    },
    {
        "content": "<p>Thanks guys because I'm not too worried about scaling at the moment and it appears that it can be done so that's a positive move forward.  <span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> Are you referring to the base PDEX IG?  I've tested that many times at Connectathon but not this scenario.</p>",
        "id": 254387475,
        "sender_full_name": "Douglas DeShazo",
        "timestamp": 1632324902
    },
    {
        "content": "<p>Yes, I am referring to this: <a href=\"https://build.fhir.org/ig/HL7/davinci-epdx/PDexImplementationActorsInteractionsDataPayloadsandMethods.html#oauth20-and-fhir-api\">https://build.fhir.org/ig/HL7/davinci-epdx/PDexImplementationActorsInteractionsDataPayloadsandMethods.html#oauth20-and-fhir-api</a></p>",
        "id": 254387931,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1632325075
    },
    {
        "content": "<p>We are deploying that at our payer customers, most (all) payer seems to be going that way</p>",
        "id": 254388091,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1632325117
    },
    {
        "content": "<p>...but I was not able to test it with anyone at the last connectathon</p>",
        "id": 254388142,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1632325139
    },
    {
        "content": "<p>(although it is basically the standard SMART-on-FHIR flow, that is well tested in patient app connections with providers and now with some payers also)</p>",
        "id": 254388250,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1632325183
    },
    {
        "content": "<p>Interesting that <a href=\"https://build.fhir.org/ig/HL7/davinci-epdx/PDexImplementationActorsInteractionsDataPayloadsandMethods.html#oauth20-and-fhir-api\">https://build.fhir.org/ig/HL7/davinci-epdx/PDexImplementationActorsInteractionsDataPayloadsandMethods.html#oauth20-and-fhir-api</a> doesn't mention SMART, even though other sections on the same page do. Do you know <span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> whether this is intentional, or just a quirk?</p>",
        "id": 254388453,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632325245
    },
    {
        "content": "<p>I guess <a href=\"https://build.fhir.org/ig/HL7/davinci-epdx/Member-AuthorizedOAuth2Exchange.html\">https://build.fhir.org/ig/HL7/davinci-epdx/Member-AuthorizedOAuth2Exchange.html</a> overall doesn't point to any OAuth 2.0 profile (SMART or otherwise), which is weird; profiling is required for interop, and that's why SMART exists.</p>",
        "id": 254388561,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632325294
    },
    {
        "content": "<p>I don't know for sure but I think it is just a quirk</p>",
        "id": 254388599,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1632325318
    },
    {
        "content": "<blockquote>\n<ol start=\"3\">\n<li>Member A authenticates themselves and authorizes the release of information at Health Plan B (Target)</li>\n</ol>\n</blockquote>\n<p>This is a legal question, not a technical one. </p>\n<p>Actually, if LRNS isn't a covered entity, the member releases their data to LRNS. LRNS merely needs to follow their own privacy policy for handling the data. There's no requirement that \"Health Plan B\"'s authorization page describes LRNS intended/eventual uses for the data. (Although some AS implementations try to). </p>\n<p>My minimal understanding is that the data leaves HIPAA protections when the member authorizes it's release and then re-enters HIPAA protection once it's given to Health Plan A. Can anyone confirm or deny?</p>",
        "id": 254762223,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1632513035
    },
    {
        "content": "<p>Presumably LRNS is acting as a business associate for its health plan customers.</p>",
        "id": 254766892,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632514973
    },
    {
        "content": "<p>As you say, it's a legal question, but I was assuming BAAs in place covering responsibilities and use of these data -- and in this context it's very much not \"leaving\" HIPAA. (Could LRNS offer a direct-to-consumer app instead? Sure.)</p>",
        "id": 254766933,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632514990
    },
    {
        "content": "<p>Business Associates (BA) are more controlled now days than back at original HIPAA definition of BA, where the control was limited to the BA  Agreement (BAA).  -- so, yes a BA handling the data, is a protected space. (or should be)</p>",
        "id": 255043040,
        "sender_full_name": "John Moehrke",
        "timestamp": 1632747558
    }
]