[
    {
        "content": "<p>In my patient-facing app, I’d like to preserve one token for the patient, for full access. Then I’d like to have another access token, with read-only rights with limited scope, for a use case where the user wants to share a view of the app with peer support / caregiver (or another party who is not a user of the EHR). Is there a way for me to ask for another token, so that the previously retrieved one stays valid too?</p>",
        "id": 200477855,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1591823724
    },
    {
        "content": "<p>with a second client id, yes.</p>",
        "id": 200478338,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1591823962
    },
    {
        "content": "<p>Technically, per the general OAuth spec, one of the main reason scopes are both sent and can be returned to the app is so that scope \"downgrades\" can happen</p>",
        "id": 200478985,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1591824327
    },
    {
        "content": "<p>So you could have 2 refresh tokens <em>technically</em> for the same application. In one when you kick off auth, you would request the full set. In another you could request a reduced set. Questions arise on how useful that is if they're stored in the same place and around the user possibly getting prompted twice to approve access.</p>",
        "id": 200479154,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1591824421
    },
    {
        "content": "<p>Some systems could put specific limits on \"sessions\" for an app as well, but that's not covered in the spec</p>",
        "id": 200479201,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1591824449
    },
    {
        "content": "<p>If they're used form a separate app/workflow, it may be useful to have separate client ids</p>",
        "id": 200479316,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1591824505
    },
    {
        "content": "<p>Thanks both, makes sense.</p>",
        "id": 200508846,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1591856156
    }
]