[
    {
        "content": "<p>Hi All,</p>\n<p>According to <a href=\"http://www.hl7.org/fhir/smart-app-launch/client-confidential-asymmetric.html#request\">http://www.hl7.org/fhir/smart-app-launch/client-confidential-asymmetric.html#request</a> <code>exp</code> must be no more than five minutes in the future. We'd like to verify this when consuming jwts, but given the possibility of clock-skew this isn't really possible.  If <code>iat</code> is supplied we can easily compare those two claims to ensure the jwt conforms to the rule. </p>\n<p>Does anyone else perform this, or a similar, check server-side? How does everyone feel about requiring <code>iat</code>?</p>",
        "id": 276245172,
        "sender_full_name": "David Zadok",
        "timestamp": 1647978673
    },
    {
        "content": "<p>The expectation is that clocks should accurate within a tolerance that is significantly better than 5 minutes. EHRs implementing this specification are already required by other ONC certification criteria to support NTP client functionality to keep times accurate; is this not the case in your deployment environment?</p>",
        "id": 276247661,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1647979831
    },
    {
        "content": "<p>Looking at IAT, you would not necessarily be able to tell whether the requirements on expiration time were met. IAT only gives you an indication of what time the <em>client thought</em> it was when the client generated the token. You still need to assess whether the expiration time is valid with respect to your own server's understanding of the current time</p>",
        "id": 276247919,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1647979946
    },
    {
        "content": "<p>While we might be able to safely rely on the time on our server, <code>exp</code> is going to have the same \"issue\" of being what the <em>client thinks</em> five minutes in the future is, <code>exp-iat</code> can be used to confirm a valid five minute window was used when the token was generated, then we can just use <code>exp</code> to determine the token is still valid based solely on server time.</p>",
        "id": 276248297,
        "sender_full_name": "David Zadok",
        "timestamp": 1647980141
    },
    {
        "content": "<p>Currently the only imperative on the server is to ensure that the expiration time on the token received is no more than 5 minutes beyond the time at which the server processes the token. The insurance time does not come into it. So knowing a client has started issuance time would not help you to meet this requirement.</p>\n<p>(To be clear, I think there could be other reasons to look for issuance times, but they are beyond the current specification.)</p>",
        "id": 276249680,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1647980850
    },
    {
        "content": "<p>Could we require <code>iat</code> even if the specs don't say we have to?</p>",
        "id": 276251407,
        "sender_full_name": "David Zadok",
        "timestamp": 1647981818
    },
    {
        "content": "<p>You as a server implementing support for the specification? No: because if you add additional requirements like this and impose them on clients, that means the clients will not be able to interoperably connect to your server without special effort. Assuming you're implementing this specification in the context of an EHR certification requirement, that is.</p>",
        "id": 276253783,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1647982975
    },
    {
        "content": "<p>Thank you</p>",
        "id": 276253910,
        "sender_full_name": "David Zadok",
        "timestamp": 1647983034
    }
]