[
    {
        "content": "<p>Hello!</p>\n<p>I am just wondering are there anybody here with experience in delivering SMART on FHIR application with  EPIC Hyperspace?<br>\nI am working on such a task right now. I can't get what is the version for the EPIC Hyperspace embedded browser.<br>\nBased on the EPIC docs it is IE11. However, I heard that although it is IE11 it always uses IE10 compatibility mode.</p>\n<p>Could you please help me?</p>",
        "id": 214234886,
        "sender_full_name": "Ilya Beda",
        "timestamp": 1603394105
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span></p>",
        "id": 214234980,
        "sender_full_name": "David Pyke",
        "timestamp": 1603394134
    },
    {
        "content": "<p>Hey Ilya, I don't have a lot of experience delivering SMART apps embedded in Hyperspace; however, I did want to point you to this resource and documentation, from: <a href=\"https://open.epic.com/launchpad/OAuth2Sso\">https://open.epic.com/launchpad/OAuth2Sso</a> </p>\n<p><em>If you are writing a web-based application that you intend to embed in Epic, you may find that your application may require minor modifications. We offer a simple <a href=\"https://open.epic.com/Tech/TechSpec?spec=TestingHarness.zip&amp;specType=tools\">testing harness</a> to help you validate that your web application is compatible with the embeddable web application viewer. As embedding your application in Hyperspace may not behave the same as presenting it in a browser, ensure that your app works with the testing harness and that you can run multiple instances of the app at the same time within the same session.</em></p>\n<p>The \"simple testing harness\" is a windows executable that recreates the Hyperspace embedded browser and is specifically provided to help developers in your scenario.</p>",
        "id": 214358595,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1603482971
    },
    {
        "content": "<p>Hi, <span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span> </p>\n<p>Thank you very much! It seems that it helps a lot. I will test my app on this browser!</p>",
        "id": 214443383,
        "sender_full_name": "Ilya Beda",
        "timestamp": 1603565754
    }
]