[
    {
        "content": "<p>I apologize if this is a redundant question. What authentication framework does patient-centric apps like Apple Health follow? Is it the SMART App Launch framework #1 (Patients apps that launch standalone), where the app expects the Patient FHIR ID in the JWT response token?</p>",
        "id": 207422252,
        "sender_full_name": "Aju Jacob",
        "timestamp": 1597850677
    },
    {
        "content": "<p>Yes, they use patient stand-alone launch. Note that the FHIR patient ID is not _inside_ the token (that does not have to be a JWT by the way), it is in the token response</p>",
        "id": 207424774,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1597851876
    },
    {
        "content": "<p>I will stress a point in Michele's response above, since there's confusion there: in OAuth the token is opaque to the app and you don't want to break that open/expect any format :) Make sure you're looking at the claims returned during token issuance instead (in their own fields in the token response)... otherwise you'll get broken</p>",
        "id": 207445837,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1597862536
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> and <span class=\"user-mention\" data-user-id=\"191356\">@Jenni Syed</span>. This is very helpful. You're right, I meant including the FHIR Patient ID in the claims returned during token issuance.</p>",
        "id": 207450140,
        "sender_full_name": "Aju Jacob",
        "timestamp": 1597864721
    },
    {
        "content": "<p>Thanks so much for the \"stressed point.\" I've read <a href=\"http://hl7.org/fhir/smart-app-launch/scopes-and-launch-context/index.html#launch-context-arrives-with-your-access_token\">\"3.3. Launch context arrives with your access_token\"</a> dozens of times, and I've been confused. On a careful reading <em>with</em> your <code>access_token</code>, not <em>in</em> your <code>access_token</code>, but it's easy to miss.</p>\n<p>For <code>launch/patient</code>, I understand that the Auth server will include the <code>PatientId</code> in the token response. This is possible because the <code>PatientId</code> can be linked to the login identity; for example, with a custom attribute. <br>\nURL: /token?scope=launch/patient<br>\n{<br>\n  access_token: &lt;jwt&gt;<br>\n  Patient: 123<br>\n}</p>\n<p>However, for <code>launch/encounter</code> and the pending <a href=\"https://github.com/HL7/smart-app-launch/pull/308/files\"><code>launch/appointment</code></a> PR, how would the Auth server know which encounter or appointment to use?</p>\n<p>Is the encounter or appointment supposed to be passed in the token request URL?<br>\nURL: /token?scope=launch/encounter&amp;encounter=123<br>\n{<br>\n  access_token: &lt;jwt&gt;<br>\n  Encounter: 123<br>\n}</p>",
        "id": 208714370,
        "sender_full_name": "Ryan Harrison",
        "timestamp": 1598978319
    },
    {
        "content": "<p>It is up to the server. It can ask the user to select one, or pick it up from current context in the case of embedded apps (that is the common use cases for those kind of scopes I guess)</p>",
        "id": 208720696,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1598981420
    },
    {
        "content": "<p>If the patientId is not within the <code>access_token</code> how will the Resource Server know what this user has access to?</p>\n<p>If the patientId is not in the <code>access_token</code> I presume the Resource Server must query the AuthZ Server to get further required user information</p>\n<p>Toy example: I get an access token from my AuthZ server and the SMART client app queries the Resource Server with <code>/Patient/{yourId}</code> instead of <code>/Patient/{myId}</code>. How does the Resource server 'block' the SMART client from doing this?</p>",
        "id": 212607337,
        "sender_full_name": "Robert Smayda",
        "timestamp": 1602098756
    },
    {
        "content": "<p>as far as the standardization is concerned, smart is entirely about the relationship between the app and the EHR. We don't try to provide any requirements about how the different components of the EHR interact with each other.</p>",
        "id": 212607766,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1602098969
    },
    {
        "content": "<p>These components might agree on a token format such as json web tokens, or they might share a database where the resource server can look up information.</p>",
        "id": 212607797,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1602098985
    },
    {
        "content": "<p>We do recommend that the authorization server support a token introspection endpoint; and indeed this has become a requirement for any certified EHR under onc rules.</p>",
        "id": 212607895,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1602099008
    },
    {
        "content": "<p>We are working on some guidance to make it clear how the patient ID can be discovered from this token introspection endpoint.</p>",
        "id": 212607913,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1602099019
    },
    {
        "content": "<p>let me share a link to the draft guidance...</p>",
        "id": 212607939,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1602099031
    },
    {
        "content": "<p><a href=\"https://github.com/HL7/smart-app-launch/pull/306/files?short_path=c16e67a#diff-c16e67ab61d8d337cea376b288ffdf99\">https://github.com/HL7/smart-app-launch/pull/306/files?short_path=c16e67a#diff-c16e67ab61d8d337cea376b288ffdf99</a></p>",
        "id": 212608194,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1602099153
    },
    {
        "content": "<p>Got it just to confirm - from SMART client point of view the contract is:</p>\n<ul>\n<li>When user is authorized the SMART client will have an <code>access_token</code> and any required context (i.e. patient id for launching patient information)</li>\n<li>This required context will live outside of the <code>access_token</code> from the AuthZ response, but it may also be inside of the <code>access_token</code> (based on discretion of AuthZ server).</li>\n<li>When SMART client makes request to Resource Server they add the <code>access_token</code> as the auth header and that additional context is either in the FHIR url (<code>/Patient/{id}</code>)or not provided to the Resource Server</li>\n</ul>\n<p>Thanks for looking this over!</p>",
        "id": 212613946,
        "sender_full_name": "Robert Smayda",
        "timestamp": 1602101913
    },
    {
        "content": "<p>That's right! To be specific</p>\n<ul>\n<li>\n<p>the patient context is communicated to the client in a \"patient\" property, which is a sibling of the \"access_token\" property of the access token response. And</p>\n</li>\n<li>\n<p>the access token is included in an authorization header (but it's not the whole header; it's prefixed with <code>Bearer </code>)</p>\n</li>\n</ul>",
        "id": 212614848,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1602102427
    },
    {
        "content": "<p>Given that this is a kind of frequently asked question, I've recorded a video explaining some of this: <a href=\"https://www.youtube.com/watch?v=X2lmbHAeOMg\">https://www.youtube.com/watch?v=X2lmbHAeOMg</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"X2lmbHAeOMg\" href=\"https://www.youtube.com/watch?v=X2lmbHAeOMg\"><img src=\"https://i.ytimg.com/vi/X2lmbHAeOMg/default.jpg\"></a></div><p>(I know some people really like this kind of video format and some people really don't! If you prefer text, please note that the expanded video description includes a write-up of the important takeaways under \"TL;DR\".)</p>",
        "id": 212871860,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1602275201
    },
    {
        "content": "<p>Nitpick: can you avoid 'EHR'? ...because then we fall into the 'I am a payer, this stuff does not apply to me' kind of deal</p>",
        "id": 212879418,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1602280185
    },
    {
        "content": "<p>(Also: thanks for doing this!)</p>",
        "id": 212879537,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1602280248
    },
    {
        "content": "<p>it's a good point. I can update the description and in the video itself I talk about EHR or Health Data system when I first bring it up, but it's just such a mouthful to say every time. Maybe I could try to settle on words like fhir server instead.</p>",
        "id": 212879663,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1602280335
    }
]