[
    {
        "content": "<p>SMART is currently very EHR-oriented. Has there been any work on its use in other contexts? <br>\nThe particular issue I have is wanting to be able to launch an App with a specific resource instance as the context (there's no \"current patient\"). <br>\nA secondary requirement would be a POST-based launch where I'm supplying the Resource as the POST body (although this is probably simpler - there's no need to agree on what the parameter name is)</p>",
        "id": 160847471,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1552626171
    },
    {
        "content": "<p>what's a POST based launch look like? I don't follow that</p>",
        "id": 160847534,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1552626288
    },
    {
        "content": "<p>but I do firmly endorse the need for any kind of resource as a launch context</p>",
        "id": 160847543,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1552626303
    },
    {
        "content": "<p>Hey Michael, even from the EHR-oriented SMART launches, the ability to add additional contextual information as \"SMART launch parameters\" alongside the access_token is common. Ultimately, as long as it can be expressed as simple values, the user's session context should be presented to the app during the launch in these key/values pairs as the response from the authorization server's /token endpoint.</p>",
        "id": 160847674,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1552626509
    },
    {
        "content": "<p>Well, with a POST-based launch I might have a template / partially authored resource (or one obtained via some off-line mechanism) and I want to pass it to the App ; maybe its a Bundle of Meds for curation into a current-meds list, or maybe its a template ValueSet (with boilerplate publisher, copyright, etc) as a starter for authoring a new ValueSet.</p>",
        "id": 160849024,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1552628385
    },
    {
        "content": "<p>Hey Michael, I draw the line on contextual launch parameters at \"simple\" parameters. If the contextual information can be expressed as a single, discrete value, then it's appropriate to send in an app launch. Alternatively, if the information is represented in a complex/hierarchical form, it should be accessed via a web service and not as a launch parameter.</p>",
        "id": 160849285,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1552628791
    },
    {
        "content": "<p>Of course, the SMART launch itself enables further web service use by providing the app with the OAuth2 access_token.</p>",
        "id": 160849286,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1552628793
    },
    {
        "content": "<p>The challenge I have is that the \"complex\" information (FHIR Resource) is not available via a web API; it's sitting in a web browser's internal state.  The browser can do an XHR to the SMART App, but it can't field requests itself.</p>",
        "id": 160849673,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1552629433
    },
    {
        "content": "<p>What is the use case/workflow this is trying to solve for?</p>",
        "id": 160873754,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1552656201
    },
    {
        "content": "<p>I have two clients, one is a specialised tool that creates transient and minimal ValueSets (normally these are POSTed to <code>$expand</code>), the other is a more complete authoring tool (Snapper, which is a SMART on FHIR app).  I want to be able to hand off the partially-authored ValueSet to Snapper for complete authoring.<br>\nEither I create it on a FHIR server then launch (GET request) Snapper with a reference to the newly  created thing (not great, since the resource is bare-bones, won't have a URI, etc) or I pass it directly to Snapper (POST request).<br>\nClearly I have control of both clients so can solve this in several ways, but I'd rather build on a std interaction pattern.</p>",
        "id": 161016799,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1552859901
    },
    {
        "content": "<p>I think this also relates to the idea of template resources that has been discussed in relation to use-cases like prescribing - handing a template resource back to the EHR for completion.  In my use-case, I'm wanting to hand off a resource template from one SMART App to another SMART App rather than back to the host EHR.</p>",
        "id": 161606384,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1553476408
    },
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"191343\">@Michael Lawley</span> , upon consideration, I think that the best fit in FHIR for a \"POST-based launch\" is actually the Questionnaire/QuestionnaireResponse stuff. See the larger diagram on the <a href=\"http://hl7.org/fhir/us/sdc/index.html#workflow\" target=\"_blank\" title=\"http://hl7.org/fhir/us/sdc/index.html#workflow\">Structured Data Capture's workflow section</a>. This \"SDC\" integration is quite similar to both IHE's RFD profile and the many ad-hoc POST-based launch integrations in the wild.</p>",
        "id": 161891486,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1553714038
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span> , I've had a look at the sequence/flow diagram but it's not clear to me how it relates?</p>",
        "id": 162115005,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1553940962
    }
]