[
    {
        "content": "<p>We've got a ballot reconciliation window open right now for SMARTv2 and for Bulk Data -- one  question is whether we should take this opportunity to <em>move</em> the \"Backend Services Authorization\" page from Bulk Data --&gt; SMARTv2.</p>\n<p>This would help by:</p>\n<ul>\n<li>Consolidating authorization profiles in one place (SMARTv2)</li>\n<li>Clarifying that backend services authorization is useful beyond Bulk Data</li>\n</ul>\n<p>Anybody think this is a bad idea?</p>",
        "id": 241417920,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1622738647
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> is this a \"transfer\" of a page that we can do during reconciliation of these two STU specs?</p>",
        "id": 241418313,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1622738850
    },
    {
        "content": "<p>From an HL7 perspective, it's not really a transfer, it's adding rules to one spec and removing rules from another spec.  Formally, there'd be no transfer of 'ballot experience' from the original page to the new page, but from an FMG you could finesse that if it ever became an issue</p>",
        "id": 241432924,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1622745034
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>!  I guess I want to figure out is... should I try this? I think it'd be the right thing outcome-wise, but if there are deep procedural concerns I'd just skip it.</p>",
        "id": 241450605,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1622753322
    },
    {
        "content": "<p>FWIW, +1 to moving it.  It feels odd to link to the Bulk Data IG in order to talk about SMART Backend Auth, and it's harder to discover.</p>",
        "id": 241452033,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1622753804
    },
    {
        "content": "<p>Is the spec the content being removed from normative?  If it were, you might have to deprecate it rather than remove it.  Other than that, I can't think of any procedural issues.</p>",
        "id": 241486021,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1622776023
    },
    {
        "content": "<p>It's all STU content</p>",
        "id": 241486034,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1622776055
    },
    {
        "content": "<p>I think this is a great idea, does it mess up the intent of published regulation?</p>",
        "id": 241587318,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1622837489
    },
    {
        "content": "<p>Existing regs point to specific versions.</p>",
        "id": 241587914,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1622837835
    },
    {
        "content": "<p>And clearly nothing about moving this page would change impact intent; ok less sure if it could create other procedural issues</p>",
        "id": 241588005,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1622837883
    },
    {
        "content": "<p>I expect the change in bulk data would be to point to where the content went...</p>",
        "id": 241733056,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1623046378
    },
    {
        "content": "<p>Yes, that's the thought -- replace the content with a reference</p>",
        "id": 241783653,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1623075741
    }
]