[
    {
        "content": "<p>I’m just wondering if it’s a correct use of SMART standard to schedule appointments. The idea is to bring a SMART App from a “scheduling” server, populate with data from the local EMR and send data back to the “scheduling” server or even third-party server to book the appointment.<br>\nThis is somehow different what SMART is originally intended to do (handling and processing local EMR data). Also, there is an IHE mRFD profile that describes quite similar use case but it’s implemented differently.</p>",
        "id": 179638949,
        "sender_full_name": "Shamil Nizamov",
        "timestamp": 1572624439
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> <span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span></p>",
        "id": 179639552,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1572624811
    },
    {
        "content": "<p>This is the main thing I use SMART for, everybody i've run the idea by who knows a thing or two about SMART has said it's good.</p>",
        "id": 179643662,
        "sender_full_name": "Tim Berezny",
        "timestamp": 1572627620
    },
    {
        "content": "<blockquote>\n<p>This is the main thing I use SMART for</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"193959\">@Tim Berezny</span> Any link to a similar use case where a SMART app is used?</p>",
        "id": 179644440,
        "sender_full_name": "Shamil Nizamov",
        "timestamp": 1572628146
    },
    {
        "content": "<p>Hey Shamil, your description sounds very much like a good use for SMART. I wouldn't say that there are \"correct\" uses of SMART, rather, the SMART app launch protocol is appropriate when the user's identity is known the EHR*, the app is user-facing and the app might want to interact with the EHR's apis. </p>\n<p>*where EHR is short-hand for any system with an oauth and probably fhir server.</p>",
        "id": 179645610,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1572628938
    },
    {
        "content": "<p>Overall, it's extremely common for a SMART app to interact with sources of data other than the EHR/FHIR server associated with the SMART server.</p>",
        "id": 179645682,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1572629005
    },
    {
        "content": "<p>Lastly, my understanding of IHE's mRFD is that it's intended to describe HL7's SMART on FHIR in an IHE profile.</p>",
        "id": 179645692,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1572629011
    },
    {
        "content": "<blockquote>\n<p>Overall, it's extremely common for a SMART app to interact with sources of data other than the EHR/FHIR server associated with the SMART server.</p>\n</blockquote>\n<p>I see it as the case when the app is prepopulated with data from EMR which (data) then sent to some third-party (external) destination this SMART server is associated with. It's obviously can be done with SMART but is there rational of doing it if EMR may HTTP POST such data directly?</p>",
        "id": 179646090,
        "sender_full_name": "Shamil Nizamov",
        "timestamp": 1572629328
    },
    {
        "content": "<p>I don't understand the bolded part:</p>\n<blockquote>\n<p>the app is prepopulated with data from EMR which (data) then sent to some third-party (external) destination <strong>this SMART server is associated with.</strong></p>\n</blockquote>\n<p>but, otherwise, the rationale for using an app in-between the EHR and the scheduling system would be to provide additional UI and workflow as part of the submission of the appointment data to the scheduling system. If the SMART app is simply proxying information from the EHR to the scheduling system and doesn't need the user to interact with it's UI, I'd think that this integration isn't a great use for a SMART app launch.</p>",
        "id": 179646858,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1572629806
    }
]