[
    {
        "content": "<p>Our team is working on adding the capability to launch our first-party FHIR-based app as a SMART app. We have, however, discovered some wrinkles, specifically around Value Sets. Our app, in it's first-party context, uses a number of value sets, including some that incorporate aspects of SNOMED and ICD-10. We have spent a fair bit of time ensuring that our own server has all the value sets we need, however we're realizing that we can't expect that the external FHIR server have any terminology support at all, much less more complex sets that incorporate SNOMED.</p>\n<p>What, if any, is the current best practice for a SMART on FHIR app that utilizes value sets? Should we first attempt to pull them from the external server? Should we come up with a solution that pulls the value sets from our own server? Should we ship them as objects in our front-end application? Curious as to how others have handled this situation. Would appreciate any and all feedback.</p>",
        "id": 242108161,
        "sender_full_name": "Joe Jordan",
        "timestamp": 1623262712
    },
    {
        "content": "<p>No best practice that I know of, but yes, you cannot count on the server you are connecting to having the terminology support you need. I'd say pull it from your own server or embed the data you need (we do a combination of the two for our apps)</p>",
        "id": 242111967,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1623264520
    },
    {
        "content": "<p>I'd generally <em>not</em> try to rely on an EHR as a source of standards-based terminologies. If your app wants to use SNOMED or ICD-10 to <em>interpret</em> data coming from an EHR, then you'd want to manage terminology updates and access on your own schedule (and to manage them independently of the many different EHRs you interact with).</p>\n<p>Of course, if you're <em>writing</em> data to an EHR that cares about valuesets, then you need to understand what valuesets the EHR accepts.</p>",
        "id": 242122473,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1623269241
    },
    {
        "content": "<p>I assume general FHIR server would support SNOMED and ICD codes</p>",
        "id": 242123176,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1623269577
    },
    {
        "content": "<p>FHIR, as a standard and by extension all servers, support ALL POSSIBLE codes via the CodableConcept Code system: <a href=\"https://www.hl7.org/fhir/terminologies.html#4.1\">https://www.hl7.org/fhir/terminologies.html#4.1</a></p>\n<p>This does not mean that all servers must have a way of providing more information on the codes, including SNOMED and ICD, but instead that they provide a way for the consumer to look up the values.</p>\n<p>My company pays to get SNOMED and ICD code updates provided to us and we store these codes in our local database for enrichment purposes. Alternative to this, though, you should be able to look up the codes from appropriate databases/services on an as-needed basis.</p>",
        "id": 242213081,
        "sender_full_name": "Matt Printz",
        "timestamp": 1623334480
    },
    {
        "content": "<p>If you can, you could hit a dedicated terminology server, either separate to your main FHIR server or set up to be delegated to by the main FHIR server.</p>",
        "id": 242955131,
        "sender_full_name": "Jim Steel",
        "timestamp": 1623885265
    }
]