[
    {
        "content": "<p>Dear all,</p>\n<p>At the last Dutch HL7 WGM  <span class=\"user-mention\" data-user-id=\"195911\">@Bram Wesselo</span>  organized a brainstorm session on using SMART for research &amp; quality  purposes. The number of institutions with a FHIR server setup for these purposes is growing rapidly in NL. Before every institute reinvents the wheel we'd like to make a proposal that hospitals can follow and that preferably follows the SMART on FHIR standard, to not end up with a country-specific architecture.</p>\n<p>The brainstorm can be summarized with two main observations:<br>\n1) We can use a custom launchcontext (for example <code>launch=ResearchStudy/123456</code>) to indicate that a user has access to set of related patients. This does require manual implementation in the FHIR server of choice.<br>\n2) The current set of scopes is not fine-grained enough to ensure that researchers are blocked from viewing more information than they are entitled to.</p>\n<p>From a hospital and compliance perspective the researcher requests access to certain resources beforehand, these get approved and configured in the authentication/authorization server. For example, for a diabetes monitoring study, only Observations with LOINC code 2345-7 (serum glucose) should be retrievable. A nice way to model this would be to allow filtering on the scope level, along the lines of <code>patient/Observation?code=http://www\\.loinc\\.org|2345-7.read</code>. Allowing for parameter to the scope also allows for different data scrubbing for different users, for examepl </p>\n<p>We would love to hear some experiences of other implementers on how they managed to organize access control for research/quality settings. From a standards perspective, are there any plans to extend the scope system for these kind of usecases? And would folks be interested to discuss this in a breakout session during the next Fhir Dev Days in June '19?</p>",
        "id": 164977808,
        "sender_full_name": "Sebastiaan Knijnenburg",
        "timestamp": 1557145781
    },
    {
        "content": "<p>Let's see if we can do a \"pop-up session\" on this at DevDays. <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> ?</p>",
        "id": 164980017,
        "sender_full_name": "Rien Wertheim",
        "timestamp": 1557147925
    },
    {
        "content": "<p>I think we would like to participate too</p>",
        "id": 164980035,
        "sender_full_name": "Jim Steel",
        "timestamp": 1557147954
    },
    {
        "content": "<p>Some ancient talk around \"scopes\" touching upon this topic for those interested: <a href=\"#narrow/stream/179170-smart/topic/scopes\" title=\"#narrow/stream/179170-smart/topic/scopes\">https://chat.fhir.org/#narrow/stream/179170-smart/topic/scopes</a></p>",
        "id": 164980801,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1557148716
    },
    {
        "content": "<blockquote>\n<p>Let's see if we can do a \"pop-up session\" on this at DevDays. <span class=\"user-mention silent\" data-user-id=\"191315\">Josh Mandel</span> ?</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"197406\">@Sebastiaan Knijnenburg</span> and <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> let me know the title for this session and a few lines so participants will know what it's about. I will make sure to reserve a time block.</p>",
        "id": 166256789,
        "sender_full_name": "Rien Wertheim",
        "timestamp": 1558522601
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191354\">@Rien Wertheim</span>  <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> How about 'Exploring SMART on FHIR for research and quality purposes'? </p>\n<p>I'm speaking quite early on Monday morning (10:15) on FHIR &amp; Research, so I can mention the session there already, briefly introduce the attendees on the subject and invite them to attend the pop-up session if interested.</p>",
        "id": 166264524,
        "sender_full_name": "Sebastiaan Knijnenburg",
        "timestamp": 1558529949
    },
    {
        "content": "<blockquote>\n<p>Some ancient talk around \"scopes\" touching upon this topic for those interested: <a href=\"#narrow/stream/179170-smart/topic/scopes\" title=\"#narrow/stream/179170-smart/topic/scopes\">https://chat.fhir.org/#narrow/stream/179170-smart/topic/scopes</a></p>\n</blockquote>\n<p>Thanks for the reference, good readup on scopes and permissions! The user/read.$function approach mentioned by <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> definitley seems in line with the filtering/query approach we brainstormed about. Will keep this in mind for the pop-up session in June.</p>",
        "id": 166264833,
        "sender_full_name": "Sebastiaan Knijnenburg",
        "timestamp": 1558530194
    },
    {
        "content": "<p>Okay Sebastiaan. We'll add this to the schedule. Let you know the day/time.</p>",
        "id": 166267621,
        "sender_full_name": "Rien Wertheim",
        "timestamp": 1558532196
    }
]