[
    {
        "content": "<p>Hi, I'm building a SMART on FHIR confidential application. So chose dotnet MVC as SPAs using Angular will expose the client secret. Could you please suggest if this approach is correct? Also, could somebody help me with a reference/url to sample dotnet SMART on FHIR? Thanks</p>",
        "id": 203902084,
        "sender_full_name": "Sylvester S",
        "timestamp": 1594770407
    },
    {
        "content": "<p>I mean sample dotnet code as I found JavaScript code only. Thanks</p>",
        "id": 203942088,
        "sender_full_name": "Sylvester S",
        "timestamp": 1594811889
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> , could you please help me by pointing to a sample dotnet code for SMART on FHIR app as I found only JavaScript examples?</p>",
        "id": 205486644,
        "sender_full_name": "Sylvester S",
        "timestamp": 1596119993
    },
    {
        "content": "<p>It is the same as regular MVC application. You need rewrite the Javascript logic in .net controller.</p>",
        "id": 205492068,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1596122299
    },
    {
        "content": "<p>Actually launching and redirecting is getting a little bit trickier. So thought a sample app would help.</p>",
        "id": 205492822,
        "sender_full_name": "Sylvester S",
        "timestamp": 1596122649
    },
    {
        "content": "<p>If you don't have any luck, I'll add it to my list to write one.  It may be a couple of days before I can get to it though.</p>",
        "id": 205499381,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1596125844
    },
    {
        "content": "<p>Thank you very much <span class=\"user-mention\" data-user-id=\"222054\">@Gino Canessa</span> . That is a lot of help.</p>\n<p>However, I will keep trying and let you know if I could get it working. <br>\nTo give a sense of what I'm trying, I have an Angular front end and WebAPI back end. <br>\nThanks a lot again.</p>",
        "id": 205500599,
        "sender_full_name": "Sylvester S",
        "timestamp": 1596126416
    },
    {
        "content": "<p>There are many angular FHIR app. So what is your question or concern? I remember when I did that, CORS was a big headache. Other than that, I don't remember any special concerns for .net.<br>\nI noticed you have a similar topic in <a class=\"stream\" data-stream-id=\"179171\" href=\"/#narrow/stream/179171-dotnet\">#dotnet</a> stream. It is better to merge discussion there.</p>",
        "id": 205507714,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1596130353
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191506\">@Yunwei Wang</span> ,<br>\nYes there are many Angular apps. But their functionality is implemented on the front end only. For this, we use Smart API for handling all transactions.</p>\n<p>I'm trying to do Angular front end and WebAPI back end. Want to do everything on server side. I did some work already. But the context is getting lost in between launching the app and redirecting the app.<br>\nI was looking for a sample application in dotnet that kind of give some direction on this. But I found only JavaScript/Angular apps. Then <span class=\"user-mention\" data-user-id=\"192710\">@Kenneth Myhra</span>  from <a class=\"stream\" data-stream-id=\"179171\" href=\"/#narrow/stream/179171-dotnet\">#dotnet</a> shared his code. I'm looking into it.</p>\n<p>I'm new to this channel. Initially I posted the question here. When I didn't get a response, I posted a similar question in <a class=\"stream\" data-stream-id=\"179171\" href=\"/#narrow/stream/179171-dotnet\">#dotnet</a>.</p>",
        "id": 205518395,
        "sender_full_name": "Sylvester S",
        "timestamp": 1596135534
    },
    {
        "content": "<p>The initial url has a <code>state</code> parameter that is then passed as-is to the redirect, so put your state there (or save the state somewhere and put an id there so you can retrieve the state later)</p>",
        "id": 205520348,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1596136427
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> . Will try that</p>",
        "id": 205522767,
        "sender_full_name": "Sylvester S",
        "timestamp": 1596137793
    }
]