[
    {
        "content": "<p>Hello everyone,<br>\nDuring post login with launch/patient, when a patient has been chosen from patient picker and tokens have been issued, if user wants to switch the patient, what are the recommended options?<br>\nCan we display patient picker somehow on client app without performing oauth login again? How and when app can request that? <br>\nIs it something that app would generally use to trigger that oauth login flow to display patient picker?<br>\nAny suggestions?</p>",
        "id": 230038552,
        "sender_full_name": "Sagar Shah",
        "timestamp": 1615559759
    },
    {
        "content": "<p>App has to initiate a new authorization sequence. The token it has allow access only to the selected patient, so all the other patients are not accessible that prevent any patient-picker to be in the app itself</p>",
        "id": 230041455,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1615560865
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> . That was my thought too. Now, if the app also has user/Patient.read access and has a capability select patient from FHIR search API, can it have access to FHIR record of that patient without requesting for oauth login and access token (with patient field into it) flow?</p>",
        "id": 230043243,
        "sender_full_name": "Sagar Shah",
        "timestamp": 1615561470
    },
    {
        "content": "<p>Yes, app could use user scopes, and then typically not use <code>launch/patient</code> and do everything app-side: get all the accessible patient with a <code>GET [base]/Patient</code> query and do patient selection or get data for all of them<br>\nThe server must support user scopes and patient searches without any parameters<br>\nIt is a workflow that is not widely supported nor used (eg CARIN mandates only the patient one for example)</p>",
        "id": 230044571,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1615561918
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> for clarifying! I think from Cures 21 Century Act, we may need to support both patient and user scopes on FHIR servers</p>",
        "id": 230047290,
        "sender_full_name": "Sagar Shah",
        "timestamp": 1615562880
    },
    {
        "content": "<p>So, if I am an authorized representative, and I go through the launch scope, authenticate myself and select a patient. I can now see the content for that patient. Now, I want to select another patient - I need to go through the launch scope again, authenticate myself, provide consent again and select a different patient. Then if I want to go back to the previous patient, or go to a third patient, do I have to launch again, authenticate again, consent again and select different patient. Just trying to understand how SMART supports the authorized representative scenario. Thanks</p>",
        "id": 234886172,
        "sender_full_name": "Gary Sole",
        "timestamp": 1618591552
    },
    {
        "content": "<p>Would a GET [base]/Patient not just get the resource for the requested or token based patient.  To get multiple patients, you need multiple tokens since each token only has reference to one patient.</p>",
        "id": 234886484,
        "sender_full_name": "Gary Sole",
        "timestamp": 1618591675
    },
    {
        "content": "<p>An app can opt into either behavior:</p>\n<ol>\n<li>Request <code>patient/</code> scopes and re-launch for each patient</li>\n<li>Request <code>user/</code> scopes and launch just once</li>\n</ol>",
        "id": 234887560,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618592139
    },
    {
        "content": "<p>If the app user is an authorized rep user/ scopes - launched once - how is the patient selected.  Does the RelatedPerson resource need to contain a list of all available patients for the user?</p>",
        "id": 234919274,
        "sender_full_name": "Gary Sole",
        "timestamp": 1618606509
    },
    {
        "content": "<p>Suggestion for SMART v2 - allow launch context for authorized rep with response that includes multiple patient identifiers - app make API calls for all supplied patients with the same scope granted by the patients during the authorized representative process created by the EHR</p>",
        "id": 234919831,
        "sender_full_name": "Gary Sole",
        "timestamp": 1618606797
    },
    {
        "content": "<p>In the user scope, launch just once case the app does a 'give me all patients' search (GET [base]/Patient)  that returns all patient that the user can access</p>",
        "id": 234920235,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1618606869
    },
    {
        "content": "<p>Thanks - does the app need to know the user is an authorized rep rather than a patient?</p>",
        "id": 235185962,
        "sender_full_name": "Gary Sole",
        "timestamp": 1618841248
    },
    {
        "content": "<p>In the general case, the app might not even need to know who the user is. But if the app does need to know who the user is, the <code>openid fhirUser</code> Scopes can request this information. It should be clear whether the user is the patient or not by comparing the patient ID received versus the fhir user received.</p>",
        "id": 235188117,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618842001
    }
]