[
    {
        "content": "<p>In the context of the 2021 CMS Patient Access rule, is there a requirement around how long the payer-issued token should be valid (refresh token)?</p>",
        "id": 208950927,
        "sender_full_name": "Aju Jacob",
        "timestamp": 1599131470
    },
    {
        "content": "<p>I don't think there is a requirement from CMS. ONC rule has three months. Current CMS BlueButton refresh tokens never expire - so I'd say either never expire or long (&gt;= 3 months). We are doing 1 year</p>",
        "id": 208959020,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1599136287
    },
    {
        "content": "<p>And to be clear for the ONC rule: while individual refresh tokens need to last at least three months, the time resets when the refresh tokens are exercised so that an app can maintain persistent access until the user decides to stop this.</p>",
        "id": 208963482,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1599138483
    },
    {
        "content": "<p>This is good information. Thanks <span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> and <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>!</p>",
        "id": 208969503,
        "sender_full_name": "Aju Jacob",
        "timestamp": 1599141034
    },
    {
        "content": "<blockquote>\n<p>the time resets when the refresh tokens are exercised</p>\n</blockquote>\n<p>Josh, Guys -- I was trying to re-validate this recently. Could you point to language in the rule that explicitly says this? </p>\n<p>The <a href=\"https://www.federalregister.gov/d/2020-07419/p-3465\">actual regulation text</a> doesn't actually say this.</p>",
        "id": 209565575,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1599683741
    },
    {
        "content": "<p>Let's see... It's subtle, so thanks for bringing this up:-)</p>\n<p>As background, the clearest articulation is in commentary provided in the <a href=\"https://www.federalregister.gov/documents/2019/03/04/2019-02224/21st-century-cures-act-interoperability-information-blocking-and-the-onc-health-it-certification\">proposed rule</a>:</p>\n<blockquote>\n<p>For example, if an application were issued a refresh token that was good for three months upon its first-ever connection and then subsequently connected to the FHIR server one month later, the FHIR server would need to enable that connection to occur without re-authentication and re-authorization, and it would need to issue a new refresh token for a new three-month period from that access date.</p>\n</blockquote>\n<p>Now in the final rule, the <a href=\"https://www.federalregister.gov/documents/2020/05/01/2020-07419/21st-century-cures-act-interoperability-information-blocking-and-the-onc-health-it-certification#p-3465\">key language is here</a>: for \"Subsequent connections...\", the client <strong>\"must be issued a new refresh token valid for a new period of no less than three months.\"</strong></p>",
        "id": 209566348,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1599684165
    },
    {
        "content": "<p>The term \"new period\" here is what clues you in to the fact that access periods are chained together indefinitely.</p>",
        "id": 209566498,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1599684252
    },
    {
        "content": "<p>I'm trying to answer the question -- what are the choices that a patient should have for length of persistent access during authorization?</p>\n<p>The rule imagines that apps will only get a new refresh token when the user uses their app, but there's no technical method to enforce this and obviously won't be the case in reality. Most apps will likely simply ensure that persistent access is maintained for as long as possible, regardless. </p>\n<p>Without an additional authorization decision by the patient, I don't understand how this jives with the patient's ability to determine the length of time an app should be able to access their data (unless the only choice presented to the patient is [] forever).</p>",
        "id": 209568604,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1599685521
    },
    {
        "content": "<p>You can give the patient all kinds of choices; the ONC rule requires that patients <em>can</em> choose to enable persistent access.</p>",
        "id": 209568758,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1599685593
    },
    {
        "content": "<p>And honestly, explaining to a patient \"this app will be able to access your data until you withdraw permissions\" and then sending periodic reminders like \"Hey, the following apps have access to your record\" is probably more effective than trying to explain this stuff about \"Well, it's at 3 months, unless the app chooses to extend it, in which case it's longer...\"</p>",
        "id": 209568853,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1599685655
    },
    {
        "content": "<p>Josh, are you really saying the rule doesn't allow a patient to specify the total amount of time an app can access their data? (But instead, can only legally control the amount of time that an app has to renew it's access?!?)</p>",
        "id": 209570810,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1599686758
    },
    {
        "content": "<p>I'm not saying that at all!</p>",
        "id": 209570874,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1599686778
    },
    {
        "content": "<p>The rule requires that patients be <em>able</em> to grant persistent access.</p>",
        "id": 209570890,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1599686787
    },
    {
        "content": "<p>The rule is a floor, not a ceiling: certified EHR products can offer additional options / capabilities that allow users to apply additional restrictions (beyond SMART scopes, beyond basic time limits, etc).</p>",
        "id": 209570940,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1599686823
    },
    {
        "content": "<p>where persistent means forever, yes, agreed. Do you agree that other valid options, for example, presented to the patient could be : 1 year, 3 months, 2 weeks, today ... ?</p>",
        "id": 209570993,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1599686855
    },
    {
        "content": "<p>My recommendation would be to make it easy to approve long-term sharing, and keep users informed about their choices over time.</p>",
        "id": 209570999,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1599686858
    },
    {
        "content": "<p>and that those options would control how long an app could access the data and not merely, the amount of time between refreshes?</p>",
        "id": 209571081,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1599686891
    },
    {
        "content": "<p>for example, this is how Google keeps me informed about location sharing -- by default, I can share my location with you \"until I revoke it,\" but then every so often they remind me that I'm sharing my location with you. So it's low friction, but not quite set and <em>forget</em>, because you don't accidentally forget.</p>",
        "id": 209571115,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1599686916
    },
    {
        "content": "<p>\"amount of time between refreshes\" is a meaningless concept, from the consumer PoV. I wouldn't try to explain it.</p>",
        "id": 209571167,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1599686946
    },
    {
        "content": "<p>and yet, length of refresh is the only clear-cut patient-controlled aspect described:</p>\n<blockquote>\n<p>Refresh tokens are an OAuth 2.0 concept, and are largely opaque to the end user. However, we clarify that patients are not prohibited from changing the length of refresh tokens to the degree this option is available to them. </p>\n</blockquote>\n<p><a href=\"https://www.federalregister.gov/d/2020-07419/p-1254\">https://www.federalregister.gov/d/2020-07419/p-1254</a></p>",
        "id": 209571225,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1599686992
    },
    {
        "content": "<p>Specifically: it doesn't impact a consumer's decision, because the details of refresh token usage are unknown/unknowable to consumers (these are technical decisions implemented by an app, out of a user's control).</p>",
        "id": 209571282,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1599687005
    },
    {
        "content": "<p>Why do you say \"and yet\"? The excerpt you shared is 100% consistent with our discussion here.</p>",
        "id": 209571350,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1599687045
    },
    {
        "content": "<p>alright - I understand what you're saying, Josh. I wish the rule were a bit more clear or sophisticated about the refresh process, but I agree with your description of the intent -- patients must be able to enable persistent access and should be able to choose other lengths of time.</p>",
        "id": 209571620,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1599687224
    },
    {
        "content": "<p>I don't think the rule opines on the \"patients should be able to choose other lengths of time\" question. But certainly they <em>MAY</em>, in conformance language :-)</p>\n<blockquote>\n<p>patients are not prohibited</p>\n</blockquote>",
        "id": 209571819,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1599687349
    },
    {
        "content": "<p><span aria-label=\"thank you\" class=\"emoji emoji-1f64f\" role=\"img\" title=\"thank you\">:thank_you:</span></p>",
        "id": 209571966,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1599687434
    }
]