[
    {
        "content": "<p>I'm using <a href=\"https://launch.smarthealthit.org/\">https://launch.smarthealthit.org/</a> to test my smart-on-fhir (client) implementation. I'm requesting scopes for \"launch,openid,profile\" and successfully getting an access token... However, my access token does not include any claims related to the user's profile. I would expect that to be the case based on Smart's spec saying:<br>\n<code>Claims: The EHR SHALL support the inclusion of SMART’s fhirUser claim within the id_token issued for any requests that grant the openid and fhirUser scopes. Some EHRs may use the profile claim as an alias for fhirUser, and to preserve compatibility, these EHRs should continue to support this claim during a deprecation phase.</code><br>\nAny idea why the access token being returned does not include the claims related to the user's info like described above?<br>\nIn fact... I'm getting <em>very few</em> claims in the access token:</p>\n<div class=\"codehilite\"><pre><span></span><code>{\n  &quot;need_patient_banner&quot;: false,\n  &quot;smart_style_url&quot;: &quot;https://launch.smarthealthit.org/smart-style.json&quot;,\n  &quot;token_type&quot;: &quot;bearer&quot;,\n  &quot;scope&quot;: &quot;openid launch,openid,profile&quot;,\n  &quot;client_id&quot;: &quot;&quot;,\n  &quot;expires_in&quot;: 3600,\n  &quot;iat&quot;: 1590534137,\n  &quot;exp&quot;: 1590537737\n}\n</code></pre></div>",
        "id": 198832891,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1590534534
    },
    {
        "content": "<p>You should use spaces to separate scopes in your requests. Otherwise the server sees it  as one single scope \"launch,openid,profile\" and not three different ones. Since it is a demo server, it will grant you any scope you request. In other words, it doesn't know what \"launch,openid,profile\" is, but it assumes it is some unknown scope and you get it back as is.</p>",
        "id": 198834045,
        "sender_full_name": "Vladimir Ignatov",
        "timestamp": 1590535625
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193731\">@Vladimir Ignatov</span> see my thread on \"scope delimination\"</p>",
        "id": 198834889,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1590536286
    },
    {
        "content": "<p>I agree with your assessment, generally.. but the behavior seems wrong when I ask for space-delimited scopes</p>",
        "id": 198834916,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1590536325
    }
]