[
    {
        "content": "<p>Are there are recommendations/patterns for persisting user UI preferences in a SoF App?  My question is primarily regarding provider facing standalone SMART application that will be used by each user on many  desktop systems.  User preferences would be things like default color scheme, default clinical time ranges, etc..</p>",
        "id": 163684608,
        "sender_full_name": "Brian Wright",
        "timestamp": 1555616997
    },
    {
        "content": "<p>I expect you'd be looking at either Observations or Basic.  I don't think there's been much discussion of standardizing that sort of thing.</p>",
        "id": 163685108,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1555617349
    },
    {
        "content": "<p>There are only patterns for apps embedded in EHRs - so that they follow the same stylesheet/look-and-feel and appear seamless.<br>\nFor standalone, you're on your own. I would not expect FHIR to define anything here either (following the 80/20 rule).</p>",
        "id": 163685927,
        "sender_full_name": "Patrick Haren",
        "timestamp": 1555617864
    },
    {
        "content": "<p>Creation of resources isn't driven by the 80/20 rule.  But it is driven by \"is this a healthcare-specific solution space?\"</p>",
        "id": 163687527,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1555618992
    },
    {
        "content": "<p><a href=\"http://www.hl7.org/fhir/smart-app-launch/scopes-and-launch-context/#styling\" target=\"_blank\" title=\"http://www.hl7.org/fhir/smart-app-launch/scopes-and-launch-context/#styling\">http://www.hl7.org/fhir/smart-app-launch/scopes-and-launch-context/#styling</a></p>",
        "id": 163690228,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1555621166
    },
    {
        "content": "<p>I would say user preferences relevant to your smart app would belong in your smart app.</p>",
        "id": 163903511,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1555939560
    },
    {
        "content": "<p>Thank you for the replies.  My summarization:</p>\n<p>If you have a smart application with a backend API, using that API would be the preferred approach for providing cross device user preference management. </p>\n<p>If for some reason, you have a strong preference for a \"client only\" application with no app specific API, you could:<br>\n1) Write user preferences to your FHIR server using a standard FHIR resource (Observation or Basic).  This would require you to request write scope, which, depending on your environment, may seem overly broad.<br>\n2) Speaking with Christiaan Knaap, if you are using the Vonk server, this may be a good use case for Vonk support of custom resources (not for interoperability, avoids having to set up and maintain a separate persistence layer).<br>\n3) If this becomes a more common requirement in the future for a broader set of applications, something similar to smart_style_url may be appropriate.</p>",
        "id": 165280565,
        "sender_full_name": "Brian Wright",
        "timestamp": 1557429054
    }
]