[
    {
        "content": "<p>We plan to use Ory Hydra Open ID Connect, which has authorize and token endpoint as per OIDC specs. But it does not follow smart protocol and does not return patient context in the access token response. To handle this we have created a proxy component on top of the Open ID provider and we publish this proxy's auth and token endpoint on /.well-known/smart-configuration FHIR api. This solves the problem and this gives the token with patient context as well in the response ( as handled in proxy)</p>\n<p>What we recently came across is the need of token url could be used for backend services as well using jwks client assertions. We see a challenge here that signed assertion with proxy's token endpoint will always be invalidated by the underlying OpenID provider as audience claim in client assertion is not matching the actual OAuth token endpoint. Did anyone face similar issue before? What are the suggested ways to overcome this? Is it mandatory to prpovide token endpoint information on /.well-known/smart-configuration or can it be documented as different endpoint for authorization flow vs backend services flow?<br>\nPlease advise.</p>\n<p>Regards,<br>\nSagar</p>",
        "id": 249650909,
        "sender_full_name": "Sagar Shah",
        "timestamp": 1629149709
    },
    {
        "content": "<blockquote>\n<p>Is it mandatory to prpovide token endpoint information on /.well-known/smart-configuration</p>\n</blockquote>\n<p>This is mandatory, relative to the FHIR Server base URL. Keep in mind that this file doesn't necessarily need to be hosted on  the same domain as your authorization server; it's relative to your FHIR server.</p>",
        "id": 249652981,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1629150768
    },
    {
        "content": "<p>Thanks for clarying it quick!</p>",
        "id": 249654063,
        "sender_full_name": "Sagar Shah",
        "timestamp": 1629151362
    },
    {
        "content": "<p>We have hosted that on FHIR Server itself. but only issue we are facing here is with proxy's token endpoint being put in that smart config token endpoint instead of actual Auth token endpoint, We went this route challenge to support  returning the patient context in the access token response. It seems we need an alternative way to keep single token endpoint in place</p>",
        "id": 249654392,
        "sender_full_name": "Sagar Shah",
        "timestamp": 1629151560
    }
]