[
    {
        "content": "<p>I have a question about the role of CDexTask in the \"Request (Solicited Communication)\" [http://build.fhir.org/ig/HL7/davinci-ecdx/Request_(Solicited_Communication).html] flow. In the \"Solicited Communication With Task\" it talks about sending a Task to the Information Sender, but when I look at the structure definition for CDexTask [http://build.fhir.org/ig/HL7/davinci-ecdx/StructureDefinition-cdex-task.html] it says that the \"focus\" field must be a reference to a CDexCommunication. </p>\n<p>However, I do not understand where this Communication would come from as my understanding is that the purpose of this Task is to tell the Information Sender there is CommunicationRequest available to be fetched? My understanding is that the Communication would not exist until after the CommunicationRequest is fulfilled.  Also, where in the Task would I specify the ID of the CommunicationRequest for the Information Sender to fetch it from the Information Recipient?</p>",
        "id": 199620455,
        "sender_full_name": "Sam Schifman",
        "timestamp": 1591191665
    },
    {
        "content": "<p>First, be aware that CDex is being refactored based on feedback from the recent ballot, so the mechanisms currently defined in the spec are different than what's likely to be in the final published spec.  </p>\n<p>As currently written, the intention is that Task points to the request to be executed.  The 'filling' system then retrieves the CommunicationRequest to see what is being asked to be done and updates the Task to indicate acceptance/rejection and later to indicate status.  Once the data has been prepared, a Communication resource is created and the Task is updated to point to the Communication as an 'output'.  The requesting system (which is monitoring the Task by polling or subscription) can then query the Communication and any contained/referenced data.</p>",
        "id": 199649496,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591204975
    },
    {
        "content": "<p>Thanks! <br>\nSo I could assume that the \"focus\" field in the final CDexTask will either allow </p>\n<ol>\n<li>\n<p>either a reference to CDexCommunicationRequest or CDexCommunication <br>\n     or </p>\n</li>\n<li>\n<p>be optional and there will be another field to indicate the reference to the CDexCommunicationRequest</p>\n</li>\n</ol>\n<p>in the next release of the IG?</p>",
        "id": 199655787,
        "sender_full_name": "Sam Schifman",
        "timestamp": 1591207878
    },
    {
        "content": "<p>There will only be on CDex Task</p>",
        "id": 199657432,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591208730
    },
    {
        "content": "<p>The Task will always have a focus of the CommunicationRequest</p>",
        "id": 199657451,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591208743
    },
    {
        "content": "<p>It will be updated to point to the Communication as an 'output'.</p>",
        "id": 199657466,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591208753
    },
    {
        "content": "<p>Thanks, that makes sense.</p>",
        "id": 199657811,
        "sender_full_name": "Sam Schifman",
        "timestamp": 1591208905
    },
    {
        "content": "<p>@Lloyd - the CDex IG CI build doesn't appear to be new.  Where are the changes being documented?  <a href=\"http://build.fhir.org/ig/HL7/davinci-ecdx/\">http://build.fhir.org/ig/HL7/davinci-ecdx/</a><br>\n<span class=\"user-mention\" data-user-id=\"235325\">@Yan Wang</span> and I are interested in the CDex Task.  Where can we see this documented?</p>",
        "id": 206581075,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1597155821
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> We notice the new CDex task profile in here: <a href=\"http://build.fhir.org/ig/HL7/davinci-ecdx/StructureDefinition-cdex-task.html\">http://build.fhir.org/ig/HL7/davinci-ecdx/StructureDefinition-cdex-task.html</a></p>\n<p>But it doesn't appear that the CI IG in the FHIR IG registry has been updated.  Where is the guidance on the newly envisioned use of Task written up?</p>",
        "id": 206583081,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1597156732
    },
    {
        "content": "<p>HRex has a base profile and some examples for using Task to solicit data.  That's what I expect to be used as part of the upcoming connectathon.  CDex has not yet been updated to point to it.  (We're still discussing options with EHR vendors, so it's premature to update the spec.)</p>",
        "id": 207786283,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1598208863
    }
]