[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> the Filtered Query scenario in Connectathon 25 says<br>\nFiltered Query - Action: Data Consumer Payer creates a Task on the Data Source Payer's system soliciting the execution of a query that will return the patient's active medication orders then polls for updates to the Task.  When the Task is complete, the Data Consumer reads the <strong>document</strong> referenced via the Task.output</p>\n<p>I'm questioning if this should say:<br>\nFiltered Query - Action: Data Consumer Payer creates a Task on the Data Source Payer's system soliciting the execution of a query that will return the patient's active medication orders then polls for updates to the Task.  When the Task is complete, the Data Consumer reads the  <strong>referenced resources or SearchSet Bundle</strong> via the Task.output</p>",
        "id": 209717598,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1599776935
    },
    {
        "content": "<p>Updated</p>",
        "id": 209736582,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1599793070
    },
    {
        "content": "<p>One additional suggestion for you to consider:<br>\nCurrently says: Action: Data Consumer Payer creates a Task on the Data Source Payer's system soliciting the execution of a query that will return the patient's active medication orders then polls for updates to the Task.  When the Task is complete, the Data Consumer reads the search response Bundle referenced via the Task.output<br>\nSuggested change: Action: Data Consumer Payer creates a Task on the Data Source Payer's system soliciting the execution of a query that will return, <strong>for example,</strong>  the patient's active medication orders<strong>,</strong> then polls for updates to the Task.  When the Task is complete, the Data Consumer reads the search response Bundle referenced via the Task.output</p>",
        "id": 209768862,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1599823880
    },
    {
        "content": "<p>I think the intention was that, for testing purposes, we'd limit ourselves to the one query.  We didn't want test systems to have to support any arbitrary query, though obviously in production, the options would be wide open.  (We're not really concerned about testing the actual 'query' capability at connectathon, more the request and response mechanisms.  There are oodles of ways to test query using public test servers.</p>",
        "id": 209782317,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1599831917
    },
    {
        "content": "<p>Got it.  Thanks. Lloyd.</p>",
        "id": 209794484,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1599837717
    }
]