[
    {
        "content": "<p>With the profile that is built on top of another profile, do I need to include all elements from the source profile (e.g., extensions, slices) or only provide differences (additional constrains, secondary extensions, etc.)?</p>",
        "id": 182795904,
        "sender_full_name": "Shamil Nizamov",
        "timestamp": 1575661099
    },
    {
        "content": "<p>Hi Shamil, you can choose: the snapshot of a profile describes all elements including all elements of its parent, while the differential only describes the differences compared to its parent.</p>",
        "id": 185494470,
        "sender_full_name": "Lilian Minne",
        "timestamp": 1578923609
    },
    {
        "content": "<p>Hi all, I am new to profiling, I am trying to create a profile from scratch(base definition will be HL7) based on (inheriting) multiple existing parent profiles(same types), in other words I am trying to create a new merged profile based on two existing profiles  and both existing parent profiles are FHIR base profiles. This more about clinical data element comparison of two existing models based on FHIR and not about profiling tool.  I am trying to incorporate as maximum as possible variations from both parent profiles.  Is there any guideline or best practice or project i can refer to?</p>",
        "id": 195417681,
        "sender_full_name": "Kailash",
        "timestamp": 1587994734
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"263322\">@Kailash</span> ,<br>\nGood to hear you are trying out profiling. I'm not sure what your specific use case is here, but it might be worth looking in to logical models. <a href=\"https://simplifier.net/guide/ProfilingAcademy/Logicalmodels\" title=\"https://simplifier.net/guide/ProfilingAcademy/Logicalmodels\">https://simplifier.net/guide/ProfilingAcademy/Logicalmodels</a>. Also I think you might be better of posting this question in the <a class=\"stream\" data-stream-id=\"179166\" href=\"/#narrow/stream/179166-implementers\">#implementers</a>  stream. Hope the logical models help you on your way.</p>",
        "id": 195942139,
        "sender_full_name": "Matthijs van der Wielen",
        "timestamp": 1588323152
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"259036\">@Matthijs van der Wielen</span>  for the input !</p>",
        "id": 195952365,
        "sender_full_name": "Kailash",
        "timestamp": 1588332542
    }
]