[
    {
        "content": "<p>Is there a clear boundary between the several medicinal product definitional resources and medication / medicationknowledge?</p>",
        "id": 184005828,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1576925097
    },
    {
        "content": "<p>Implementers have asked whether to use MedicinalProduct or Medication, I see this as something possibly missing in terms of guidance.</p>",
        "id": 184005900,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1576925249
    },
    {
        "content": "<p>I have been defending some consistency between all things Product related - device, medicinal products, biologicals, nutrition... since it would help implementers know where to look for things.</p>",
        "id": 184005956,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1576925339
    },
    {
        "content": "<p>for our use case (implementing Dispense Record in FHIR) , I will advise medication, but I was triggered by the question.</p>",
        "id": 184006032,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1576925481
    },
    {
        "content": "<p>The boundary is mainly one of level of detail. But the level of detail is closely related to the use case. Day to day prescribing (by far the most common use case) needs hardly any detail. Regulatory use cases need lots and lots of detail. So generally, unless you know that you need MedicinalProductDefinition, then you probably don't. We may need to make this clearer in the documentation. We've been busy getting the resources approved and the documentation is probably lacking. And yes, the level of detail issue could in theory be done using profiles, but this would be difficult in practice since the most common use case would need only a tiny small subset of the full model.</p>",
        "id": 184011869,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1576936942
    },
    {
        "content": "<p>Thanks Rik!</p>",
        "id": 184012124,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1576937420
    },
    {
        "content": "<p>I think indeed documentation should be clearer (and the knowledge in these resources will help us define the xxxxProduct resources)</p>",
        "id": 184012186,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1576937560
    }
]