[
    {
        "content": "<p>IHE is taking baby steps toward full use of HL7 IG publication. However today I have them managing their conformance resources in GitHub. This is an intermediate step that will go away when we move to full IG publication. I would like to add the FHIR validator to pull requests. Not the whole IG build, just validator. Can someone walk me through how I can do this?    see our github repository <a href=\"https://github.com/IHE/fhir\" target=\"_blank\" title=\"https://github.com/IHE/fhir\">https://github.com/IHE/fhir</a></p>",
        "id": 164639886,
        "sender_full_name": "John Moehrke",
        "timestamp": 1556731466
    },
    {
        "content": "<p>Can you clarify what \"validator\" means here? What would be validated, what would the output be, and where would the output go?</p>",
        "id": 164658360,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1556745131
    },
    {
        "content": "<p>Is there a particular CLI invocation you do today to generate the output you have in mind ?</p>",
        "id": 164658377,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1556745156
    },
    {
        "content": "<p>if I knew those details, I likely would be much further along. I understand that within the IG build, it does a validation on the capabilityStatement, StructureDefinition, etc... to assure that they are well formed. That is, Valid relative to the FHIR schema. When they are not valid, the tool kicks out errors... like we see in the output of the IG build. However I don't have an IG, I just want to have the validator look at all of the files in that GitHub and validate them... this would be part of a Pull Request validation...</p>",
        "id": 164675776,
        "sender_full_name": "John Moehrke",
        "timestamp": 1556765027
    },
    {
        "content": "<p>you still need an IG. you just don't need to write any content</p>",
        "id": 164730519,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1556820219
    },
    {
        "content": "<p>I was thinking I could do that... but the struggle is that I want new xml files picked up automatically... AND the gitHub holds many ImplementationGuide.xml files... not just one.   and all I really want done is the validation with errors/warnings spit back.</p>",
        "id": 164733796,
        "sender_full_name": "John Moehrke",
        "timestamp": 1556822351
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193299\">@Luke Duncan</span> is thinking he can help automate it using hapi server validation?</p>",
        "id": 164733844,
        "sender_full_name": "John Moehrke",
        "timestamp": 1556822398
    },
    {
        "content": "<p>that would be a different stack</p>",
        "id": 164736770,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1556824667
    },
    {
        "content": "<p>but you can set up a single IG that picks up all the files automatically</p>",
        "id": 164736828,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1556824702
    },
    {
        "content": "<p>That is what I do.  There is limit to the number of files.  You can not validate 100 synthesis patient in one go. But it’s pretty slick</p>",
        "id": 164826269,
        "sender_full_name": "Eric Haas",
        "timestamp": 1556914411
    },
    {
        "content": "<p>what limit to file numbers?</p>",
        "id": 164842589,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1556932017
    },
    {
        "content": "<p>I run out of memory with too many files to validate.   Synthea creates thousands of files for 100 patients.  It still handles a bucketload of them at a time.</p>",
        "id": 164845485,
        "sender_full_name": "Eric Haas",
        "timestamp": 1556937297
    },
    {
        "content": "<p>hmm. ok. I'll investigate at some stage</p>",
        "id": 164855798,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1556956127
    },
    {
        "content": "<p>Well I could just bump up my heap size.</p>",
        "id": 164889916,
        "sender_full_name": "Eric Haas",
        "timestamp": 1557008942
    },
    {
        "content": "<p>what is it?</p>",
        "id": 164891195,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1557011257
    }
]