[
    {
        "content": "<p>I have several resource examples that point to additional content that I want to include as part of the examples (additional pages, basically). How do I get those into the build? I can add them to the [pages] section in the publish.ini, but that feels wrong since they are part of the examples for a particular resource. Is there a way to do this that I'm missing?</p>",
        "id": 153841980,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1470077327
    },
    {
        "content": "<p>If you want stand-alone pages to be published, the only way that happens is if they're in the publish.ini file.</p>",
        "id": 153841983,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1470079369
    },
    {
        "content": "<p>I'm not sure there's a way to have individual examples point to anything.  However, you can have a general introduction page for all of the examples that could include links to your custom pages</p>",
        "id": 153841985,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1470079406
    },
    {
        "content": "<p>Okay, and is there any restriction on the content types? I mean, can I just include .xml and .cql content directly?</p>",
        "id": 153841986,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1470079468
    },
    {
        "content": "<p>That I don't know.  If it's not HTML, you might want to list it as an image - that way no validation will be attempted on it.</p>",
        "id": 153842020,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1470104187
    },
    {
        "content": "<p>FYI, I ended up adding it in the [files] section, works fine for different types of content, just copies the file straight across.</p>",
        "id": 153842023,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1470109348
    },
    {
        "content": "<p>resource examples should be registered in the spreadsheet</p>",
        "id": 153842040,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1470126022
    },
    {
        "content": "<p>They are, they just reference non-FHIR resource content and I don't see a way to include that in the build other than through the publish.ini.</p>",
        "id": 153842065,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1470148294
    },
    {
        "content": "<p>no there probably isn't for the other content</p>",
        "id": 153842079,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1470170874
    }
]