[
    {
        "content": "<p>This subject came from <a href=\"#narrow/stream/179255-questionnaire/topic/URI.20for.20answerExpression.3F\" title=\"#narrow/stream/179255-questionnaire/topic/URI.20for.20answerExpression.3F\">https://chat.fhir.org/#narrow/stream/179255-questionnaire/topic/URI.20for.20answerExpression.3F</a>.  If a JIRA issue is resolved with \"change required\", but an important detail is left out about the specifics of the change that will made, what is the best way to get that added to ensure the change is made correctly?</p>",
        "id": 191799929,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1585164770
    },
    {
        "content": "<p>The real question is as follows: Right now, Jira prohibits regular users from making comments about issues once they've been resolved - on the grounds that such comments typically won't be seen/reviewed by anyone.  (Manager users can still make comments until something is marked as applied.)  Paul has proposed that we relax that constraint for \"change required\" issues on the premise that whoever is applying the change will see them - and can choose to act on them.  However, that's only valid if we're confident that whoever applies the tracker item will in fact read the comments, as opposed to just looking at the disposition.  The alternative would be for someone to petition for the tracker item to be re-opened by asking on Zulip or on the appropriate list server.</p>\n<p>Opinions, preferences?</p>",
        "id": 191801044,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585165308
    },
    {
        "content": "<p>If the issue is not marked as resolved until the change is applied, would that be a better solution? It is somewhat strange that something is \"resolved\" but the actual change is not made.</p>",
        "id": 191808209,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1585168884
    },
    {
        "content": "<p>That's actually somewhat orthogonal to the question.  Something gets marked as 'resolved' as soon as a resolution is present - even if that's only a proposed resolution.  That's just how Jira works.  In terms of the question, what really matters is the status.  If something is triaged or earlier (submitted, waiting for input), then any registered user can submit comments because no decision has yet been made.  Once a decision has been made (Duplicate, Deferred, Resolved No-change, Resolved Change Required), then the work group no longer looks at the item - unless the item gets re-opened, or in the case of Deferred, until the item gets returned to Triaged after the next release.  The question is whether it's appropriate for comments to be submitted against items where a change has been agreed but not yet been applied - which is primarily a question of whether we believe they'll be looked at.</p>",
        "id": 191813888,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585172010
    },
    {
        "content": "<p>What determines if JIRA issues are looked at? If setting the status to \"resolved\" means that notifications are not being sent any more, then there is no way to make sure that new comments are looked at. If a status of \"resolved\" with \"change required\" still sends notifications to all who are following the JIRA issue, (including making sure that getting to such a state requires that the issue is assigned to a specific person, presumably the one who will make the change), then it is very likely any comments will still be looked at.</p>",
        "id": 191815614,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1585173152
    },
    {
        "content": "<p>The status being 'resolved' shouldn't be impacting notifications</p>",
        "id": 191839949,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585197875
    },
    {
        "content": "<p>Though there's an issue with notification behavior that I need to dig into</p>",
        "id": 191839955,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585197888
    },
    {
        "content": "<p>The reality is that very few people have the bandwidth to monitor notifications for all issues in their WGs - the only folks who will see them is those who are actually 'following' the issue - which may not include <em>anyone</em> from the responsible WG.</p>",
        "id": 191839968,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585197939
    },
    {
        "content": "<p>Is it unreasonable to require that the status of \"resolved\" - \"change required\" will have the issue assigned to someone (to actually make the change)? And then make sure notifications go to that person in addition to the \"followers\".<br>\nAnother (additional) approach is to provide a report that shows if any \"resolved\" issues have new comments.</p>",
        "id": 191878511,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1585227002
    },
    {
        "content": "<p>It's definitely unreasonable.  It's very rare that when a WG votes and agrees to a change that they'll have a clue who will do the work (or when).</p>",
        "id": 191899904,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585236022
    }
]