[
    {
        "content": "<p>Does anyone use BitBucket as their IG repo?  Just wondering if it's possible or if I need to create a GitHub repo.   Thx.</p>",
        "id": 153922074,
        "sender_full_name": "Nathan Davis",
        "timestamp": 1511970269
    },
    {
        "content": "<p>you need to use GitHub if you're going to use the auto-builder. Which I strongly recommend. but it's not required</p>",
        "id": 153922093,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1511971664
    },
    {
        "content": "<p>Not required in general, but I believe it is required if it's an HL7 Int'l-maintained IG.  (Furthermore, you have to use HL7's GitHub IG if you're designing content that will be balloted through HL7 Int'l.)</p>",
        "id": 153922102,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1511973718
    },
    {
        "content": "<p>What's the process for using HL7's GitHub?  Does HL7 have any charges for doing so?  I am currently working on a project they may or may not want to be balloted.</p>",
        "id": 153922134,
        "sender_full_name": "Nathan Davis",
        "timestamp": 1511979938
    },
    {
        "content": "<p>No charges.  FHIR product family lead (Grahame) needs to have administrator privileges.  Is the project being driven by an HL7 work group?</p>",
        "id": 153922144,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1511984114
    },
    {
        "content": "<p>Sorry, I can't say much about the project without first talking with the project owners but it is not driven by any HL7 work group.  I'll set up a GitHub repo for them and let them know about the requirements for balloted IGs.  Thanks Lloyd and Grahame for the help!</p>",
        "id": 153922156,
        "sender_full_name": "Nathan Davis",
        "timestamp": 1511988285
    },
    {
        "content": "<p>if it's going to be balloted, it must be driven by a work group</p>",
        "id": 153922176,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1512005308
    },
    {
        "content": "<p>And if anyone is interested in extending the automated builder to support hooks from bitbucket, gitlab, gogs, etc, I'd be happy to talk you through the process and help get changes merged/deployed.</p>",
        "id": 153922230,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1512019913
    }
]