[
    {
        "content": "<p>My VRDR IG has many pages. One for each profile and then several for introductory and explanatory text. When I conduct a build the IG published but has a large number of \"broken links\". It seems to indicate that all links on every page are broken. However when I view the page all of the links work. I'm puzzled. There four errors that appear on every page, even pages with no links. They are: </p>\n<p>The link '<a href=\"http://hl7.org/fhir/STU3/\" target=\"_blank\" title=\"http://hl7.org/fhir/STU3/\">http://hl7.org/fhir/STU3/</a>' for \"null\" cannot be resolved<br>\nThe image source 'guide/VitalRecordsDeathReporting/files/styles/ballotable/fhir-logo.png?v=1d4ca6e6331a800' cannot be resolved<br>\nThe link '/' for \"Vital Records Death Reporting\" cannot be resolved<br>\nThe image source 'guide/VitalRecordsDeathReporting/files/styles/ballotable/hl7-logo.png?v=1d4ca6e6331a800' cannot be resolved</p>\n<p>The errors seem related to the FHIR and HL7 logos that appear on the top of each page. Has anyone else run into this error. What is the resolution?</p>\n<p>The remaining broken links on each page are links that are part of the expansion of structured definitions that include links to the HL7 FHIR pages for datatypes, value sets, resource definitions, etc.  Again when I click the links they work so I am confused as to why they are being reported as broken. Can someone give me guidance on how I might proceed with these errors? </p>\n<p>Thanks.</p>",
        "id": 159428274,
        "sender_full_name": "AbdulMalik Shakir",
        "timestamp": 1551191797
    },
    {
        "content": "<p>The parameter on your png is definitely the cause of one error.  In practice, the browser's probably dropping the parameter, which is why your link works.  However, the parameter is unnecessary and is probably confusing the link checker.  There may be a case issue with your FHIR link.  The link checker presumes that links are case-sensitive (because they often are).  The link checker expects the base URL for the standard to be \"stu3\" not \"STU3\"</p>",
        "id": 159430646,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551193534
    },
    {
        "content": "<p>(That's how it's defined in the package files the IGPublisher is grabbing.)</p>",
        "id": 159430715,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551193567
    },
    {
        "content": "<p>Lloyd..... Thanks your comment got me headed in the right direction. Removing the parameter on the PNG worked. Changing the case of STU to stu had no effect. However, changing the http: to https: did make a difference. And finally removing the unnecessary hyperlink \"href=\"/\" before the page title removed the final remaining error. </p>\n<p>I completed these change for one page and now need to make the same changes in all pages. THANKS!</p>",
        "id": 159438474,
        "sender_full_name": "AbdulMalik Shakir",
        "timestamp": 1551199825
    },
    {
        "content": "<p>http should be the link.  Not sure why your build is wanting https...</p>",
        "id": 159439270,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551200467
    }
]