[
    {
        "content": "<p>As part of the updates to the IG publisher, we've agreed to start exposing maturity levels on the IG as a whole as well as on the individual resources.  In core, we support the maturity levels by filling out a huge Google sheet.  I'm wondering how we want to manage quality assessments for HL7-balloted IG content.  Do we want to put it in an XML spreadsheet?  Some sort of XML syntax?  Something else?  Any suggestions on what would make doing this as pain-free as possible would be welcome.  (The reality is that tracking quality requirements on a per-artifact basis is going to come with a fair bit of pain and effort.  But, given that IG content often isn't all at the same level of maturity, individual tracking is rather necessary.)</p>",
        "id": 184342103,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1577478634
    },
    {
        "content": "<p>extension on each resource?</p>",
        "id": 184342633,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1577479346
    },
    {
        "content": "<p>That's possible, but that then imposes complexity on all of the resource editing tools (Forge, Trifolia, spreadsheets, etc.) to support maintenance of that content.  And it's the sort of thing where the details of the extension are likely to evolve over time.  So my leaning is to have it maintained in something else, even if we merge it into the resources as extensions as part of the publication process.</p>",
        "id": 184345037,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1577482375
    },
    {
        "content": "<p>Google Sheets are <a href=\"https://www.freecodecamp.org/news/cjn-google-sheets-as-json-endpoint/\" target=\"_blank\" title=\"https://www.freecodecamp.org/news/cjn-google-sheets-as-json-endpoint/\">JSON objects</a> - would that make it possible to use Google Forms and Google Sheets as the data entry tool, and use the JSON content for publishing?</p>",
        "id": 184347635,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1577486282
    },
    {
        "content": "<p>the conversion process from a google spreadsheet to a github artifact is a challenge. I don't want to have that anymore than we already do</p>",
        "id": 184349192,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1577488574
    }
]