[
    {
        "content": "<p>FYI We are moving the us-races and us-ethnicity extension out of the fhir spec so the externsions in the 'proband' patient example have been commented out since the build cannot recognize the extension url.   </p>",
        "id": 153868817,
        "sender_full_name": "Eric Haas",
        "timestamp": 1485194044
    },
    {
        "content": "<p>Realistically, in the CG profile, race and ethnicity information should probably be captured as observations rather than using the demographic extensions.  What codes are relevant will be different and the context is different - demographics is \"how the patient sees themselves\" and is often cultural.  Genomics cares more about ancestry than self-identification.</p>",
        "id": 153868820,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1485194639
    },
    {
        "content": "<p>we can restore these extensions specifically, and tell the build about them. <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> comment is more interesting - my impression is that you'll get demographics fields first, so including them in the examples with a comment about the limited usefulness of the data would be good</p>",
        "id": 153870114,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1486348492
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> This issue here is that a realm-independent profile shouldn't be pointing to US realm extensions.  We actually don't <em>want</em> the US realm extensions showing up in the core build - they were moved out deliberately.</p>",
        "id": 153870122,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1486349400
    },
    {
        "content": "<p>I disagree with this. We moved the definitions out deliberately, for good reason. But that doesn't mean that the core spec shouldn't mention them. And we can speciifcally mention them in examples when we mention them. And the US core extension for demographics are a FAQ enough that we should mention them to point people to the right place </p>",
        "id": 153870126,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1486349606
    },
    {
        "content": "<p>So I originally had a line in the introduction text to the extensions.html saying here is where you can find the us extensions and assumed this would be superseded by the registry link whenever that is ready.    I also had a an exaample and a section in the profiles that pointed to them but since the links were broken I took them out.  I would prefer to keep an example but I tend to agree with Lloyd that this muddies the waters.   Would like to strike a balance.   When is the extension registy going to be live.  </p>",
        "id": 153870136,
        "sender_full_name": "Eric Haas",
        "timestamp": 1486350677
    },
    {
        "content": "<p>well, the us-sore spec exists ,and has a place, and that is the place for this reference</p>",
        "id": 153870140,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1486352130
    },
    {
        "content": "<p>not sure on ETA for <a href=\"http://registry.fhir.org\" target=\"_blank\" title=\"http://registry.fhir.org\">registry.fhir.org</a></p>",
        "id": 153870141,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1486352138
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> This isn't about just the example, it's also about the profile.  They used to be part of the profile, but they can't be anymore because the profile is universal.  The example should be updated to align with the profile.</p>",
        "id": 153870175,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1486356316
    },
    {
        "content": "<p>how does it not align with the profiel? </p>",
        "id": 153870194,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1486362997
    },
    {
        "content": "<p>To clarify there were 2 examples in the build using US-Core extensions: </p>\n<ul>\n<li>A example specifically made to demo all the us-core extensions.  That now exists in the the US-Core profile</li>\n<li>Proband example - a CG workgroup product.  I had hoped they would have picked up this stream so I don't have to chase them down.  I agree with Lloyd re administrative vs tracing ancestry.  Slippery slope  that I think is gong to be hard to stop.</li>\n</ul>",
        "id": 153870204,
        "sender_full_name": "Eric Haas",
        "timestamp": 1486363959
    },
    {
        "content": "<p>The profile uses Observation to convey relevant information.  So the example should do the same.</p>",
        "id": 153870281,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1486389881
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191719\">@Gil Alterovitz</span> ?</p>",
        "id": 153870282,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1486389909
    }
]