[
    {
        "content": "<p>For those of you using spreadsheets for  profiles... hopefully just <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> and <span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span> - as of now, I am changing the spreadsheet rules a little</p>",
        "id": 153937342,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518609638
    },
    {
        "content": "<p>I assume you will list or point to the rule changes?  And what is the recommendation now for R4 profiling?</p>",
        "id": 153937343,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1518609886
    },
    {
        "content": "<p>now, for Observation.quantity[x], if you want to constrain it to a quantity, you just launch right into Observation.valueQuantity and constrain this. This implies that quantity is the only type</p>",
        "id": 153937344,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518610080
    },
    {
        "content": "<p>in the future, you will need to be specific that quantity is the only one allowed. That means that you must explicitly have an Observation.value[x]  with a type of Quantity</p>",
        "id": 153937345,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518610167
    },
    {
        "content": "<p>I <em>think</em> that this just applies to R4 profiles. I haven't started to trying to figure out how to isolate this change from R3.... nightmare....</p>",
        "id": 153937346,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518610253
    },
    {
        "content": "<p>no. changed my mind. This change is a mightmare....</p>",
        "id": 153937350,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518612328
    },
    {
        "content": "<p>I know there are some non-HL7 projects that were using spreadsheets for older release stuff and I doubt they're monitoring here.  (On the other hand, I'm not sure where they <em>would</em> be monitoring, so hard to say how best to communicate with them.)</p>",
        "id": 153937378,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1518619477
    },
    {
        "content": "<p>OK but I am confused if this change is happening or not... \"no. changed my mind. This change is a mightmare....\"</p>",
        "id": 153937394,
        "sender_full_name": "Eric Haas",
        "timestamp": 1518623288
    },
    {
        "content": "<p>at the moment, this change is not happening after all. But I reserve the right to change my mind again. This is a particularly difficult change to implement</p>",
        "id": 153937453,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1518634610
    }
]