[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> we need to change the CI build process now. we need to start building a bunch of implementation guides as well as the main build</p>",
        "id": 153838811,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468624554
    },
    {
        "content": "<p>there's some complexities here - the jar to build the IGs with is built by the main build. </p>",
        "id": 153838813,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468624607
    },
    {
        "content": "<p>so we take that jar, and use it to build a whole lot of igs, some of which are in github projects, not the main svn repository </p>",
        "id": 153838814,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468624638
    },
    {
        "content": "<p>changes to the main mean we need to rebuild all IGs, while changes in the IGS mean we need to rebuild by the dependencies declared in the IGs. </p>",
        "id": 153838815,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468624686
    },
    {
        "content": "<p>I don't know whether all that complexity is possible</p>",
        "id": 153838816,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468624697
    },
    {
        "content": "<p>OK! Is there a script that we should run, to group all of that logic together? (Or a script I should write?)</p>",
        "id": 153838921,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1468688599
    },
    {
        "content": "<p>we'll have to write one between us </p>",
        "id": 153838942,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468703397
    },
    {
        "content": "<p>one tricky question is about the terminology cache</p>",
        "id": 153838945,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468704477
    },
    {
        "content": "<p>it makes a massive speed difference, but occasionally has to be cleared out. I've moved it out of version control, into the users local directory, but i'm not sure that's working out</p>",
        "id": 153838948,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468704532
    },
    {
        "content": "<p>Are you suggesting that we'd trigger re-builds of each IG every time that the main repo changes? That seems... hard. Better, I think, for IGs to live their own separate lives and point to a specific revision of the main build. IG authors can update this explicitly when they're ready, and then their IGs can rebuild. We could provide IG authors a sample travis.yml file they can add to their project, for example.</p>",
        "id": 153838960,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1468716936
    },
    {
        "content": "<p>I think tying IGs to specific versions of the spec is good.  The tricky bit is what an IG does if they want to point to a frozen snapshot and have the links work.  I suspect we'll say we'll create snapshots for major connectathons or ballots, but other than that, during development, they'll have to live with certain links not working some of the time.  Inputs to the build process would presumably be a snapshot of the validation.xml.zip (or whatever it's called now) and the URL where the spec is located?</p>",
        "id": 153838964,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1468723619
    },
    {
        "content": "<p>I find the idea that IGs would point to specific versions of the spec really difficult indeed. </p>",
        "id": 153838967,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468740740
    },
    {
        "content": "<p>right now, the version of the spec is rolling over pretty quickly, and many changes are because of the IGs. Tieing IGs to a specific version of the spec just means that this has to be changed everytime the spec changes - seems like chasing your tail to me</p>",
        "id": 153838968,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468740808
    },
    {
        "content": "<p>also, right now, I've unhooked most of the IGs from the main build, and no one is getting notified when they don't build because the profiles need to change. '</p>",
        "id": 153838969,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468740853
    },
    {
        "content": "<p>of course, for IGs based on a stable release, that's different</p>",
        "id": 153838970,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468740875
    },
    {
        "content": "<p>right now, you build with the IG publisher for a specific build, and it contains all the internal knowledge that it needs. We can only support publication of IGs from supported forks (ones where I can produce an updated IG publisher)</p>",
        "id": 153838971,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468740955
    },
    {
        "content": "<p>and right now, the only supported fork is trunk </p>",
        "id": 153838972,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468740965
    },
    {
        "content": "<p>and. btw, the principal driver for me is that when I release a new IG publisher, I want to know whether I've broken anything</p>",
        "id": 153838982,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468746218
    },
    {
        "content": "<p>at the very least, we can run the test IG build</p>",
        "id": 153838985,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1468750093
    }
]