[
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"*\" data-user-id=\"*\">@all</span> I have just added a new feature for editors to worry about - sorry. From now, when the type of an element is a Reference and the target of the reference is the same type as the resource itself, you can now say whether the reference is allowed to point back to the same instance (transitively, that is. </p>\n<p>Two cases in point:</p>\n<ul>\n<li>patient.link.other can point to another patient that links back to the first patient - so definitely not heirarchical</li>\n<li>Location.partOf can't link back to the same location - a location can't be part of one location that is part of the first location</li>\n</ul>\n<p>This metadata is generated into element definitions (as an extension) and into the relevant search parameters to create the right modifiers. </p>\n<p>You can set this by putting the value 'true' or 'false' in the column \"Hierarchy\" in the spreadsheet for the data element. You can set this for types of either Reference(self) or canonical(self). It's ignored for any other types. </p>\n<p>I've gone ahead and populated the elements nominated in the task (<a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=8776\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=8776\">GF#8776</a>) and some other obvious ones, but I haven't done any others. You can see the list here: <a href=\"http://build.fhir.org/references.html#circular\" target=\"_blank\" title=\"http://build.fhir.org/references.html#circular\">build.fhir.org/references.html#circular</a>. If you have time, you can fill this out for anything listed as undescribed there. But I'm not requiring you to try to find  time between now and the deadline for ballot content (it's not a structural change, so you can still make it this week if you want to). I expect that MnM will push for it to be stated clearly by the time we publish R4</p>",
        "id": 153941995,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1520127056
    },
    {
        "content": "<p>.. and with that, I've made all the structural changes I've found in the tasks. with a few hours up my sleeve too ;-)</p>",
        "id": 153941996,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1520127148
    },
    {
        "content": "<p>if anyone has tasks they'd like me to take on, I'm happy to do so. Else I'm going to try and get the IG publishing going...</p>",
        "id": 153941997,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1520127172
    }
]