[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191328\">@Ewout Kramer</span> - I like the conformance module page, thanks. A couple of requests:<br>\n- can we add the link to the profiling page at the top of the page<br>\n- should we link to the implementation guide registry and the artifact registry anywhere?<br>\n- \"If a server acts as a repository of any conformance resource, it should provide read-only access\" - I think this should say something about managing content properly and ith published policy, rather than simply 'read-only'<br>\n- you've used 'capability statement' everywhere, but you never launched the discussion about renaming...<br>\n- we've regarded 'NamingSystem' as Terminology not conformance<br>\n- I think it would be good to call out the dependence on the terminology module </p>",
        "id": 153840722,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469258257
    },
    {
        "content": "<p>- and we should call out that \"ElementDefinition\" is not a resource - different from the other things at the top of the page</p>",
        "id": 153840723,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469258331
    },
    {
        "content": "<p>Yes, that profiling page deserves a quick link.....</p>",
        "id": 153840878,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1469433767
    },
    {
        "content": "<p>NamingSystem....makes sense, it was on the profiling.html page - I think I should update that page to be in sync with this and basically remove some things that are on the conformance page now.</p>",
        "id": 153840879,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1469433895
    },
    {
        "content": "<p>\"CapabilityStatement\", yes, wrote this text after we discussed renaming it on our call.......it will be renamed after the ballot, right?  I used the new name because the resource \"Conformance\" and \"Conformance resources\" were very easy to mix up in the conformance text, so I decided to jump ahead and use the new name. If I misunderstood, I'll change it back.</p>",
        "id": 153840880,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1469434025
    },
    {
        "content": "<p>Dependency on the terminology module - it's there (under the image when discussing the dotted resources), but I'll make it a bit more explicit.</p>",
        "id": 153840881,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1469434060
    },
    {
        "content": "<p>I think you'll have to call if \"conformance\" but you can note that there's a plan to rename it to \"CapabilityStattement\" after ballot </p>",
        "id": 153840882,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1469443709
    },
    {
        "content": "<p>Yes, I have indeed done that now. Commit will be in soon.</p>",
        "id": 153840885,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1469451465
    }
]