[
    {
        "content": "<p>I hate to ask (don't ask when you might not like the answer you get!) but it's been awhile and I'm doing some fixes in FHIR Core and I need to create a couple of code systems and value sets for example bindings.  Is it still required that I create these via the UTG process?</p>",
        "id": 230902616,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1616087372
    },
    {
        "content": "<p>I believe the proposed policy is there'd be a generic code system in UTG for grab-bag example codes that shouldn't be used in real instance.  <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span>, so you know where we're at with that?</p>",
        "id": 230903211,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616087574
    },
    {
        "content": "<p>For those of us who are trying to finish JIRA issues for R5, I suspect that won't be done in time, so I'm reading into what you said that I need to go create my codesystem/valueset in UTG now if I want it quickly?</p>",
        "id": 230903463,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1616087678
    },
    {
        "content": "<p>That isn't what was agreed - I understood that example value sets were going to be brought back into the FHIR Core build and out of UTG.</p>",
        "id": 230904550,
        "sender_full_name": "Melva Peters",
        "timestamp": 1616088086
    },
    {
        "content": "<p>I just tagged you in the final comment in the thread about example value sets</p>",
        "id": 230904820,
        "sender_full_name": "Melva Peters",
        "timestamp": 1616088174
    },
    {
        "content": "<p>Thanks Melva.  I vaguely remembered that but couldn't find it using my search skills.</p>",
        "id": 230904916,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1616088214
    },
    {
        "content": "<p>I was going to work with Grahame to figure out how to pull the example value sets back to FHIR core and eventually delete from UTG.</p>",
        "id": 230905158,
        "sender_full_name": "Melva Peters",
        "timestamp": 1616088286
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Sorry, for some reason missed this before.  We did talk about and I think provisionally agreed to create a \"grab-bag\" code system in UTG for example codes, but I don't recall that anyone was actually given a specific task to do it?  <span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span>  I believe we also agreed at the same time that it would be permissible to in addition have IG-specific example code systems labeled as <code>xxx-example</code> (or close to that - I would have to check minutes for the exact details).  I'm not too much in favor of creating a generic grab-bag example code system myself (whether it lives in THO or not).  For the core spec it's probably worth at least considering what <span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> is discussing (or has already discussed) with Grahame.</p>",
        "id": 231858421,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1616699078
    },
    {
        "content": "<p>The purpose of the 'grab bag' is that it's clear that it's codes that should never be used in production and have no semantic organization</p>",
        "id": 231860882,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616700030
    },
    {
        "content": "<p>I'm confused.  I thought that example value sets were coming out of UTG.  If a code system is created in THO, does that mean the example value set also lives in THO?  and we have to go through the UTG process to make changes for example value sets? That's what I thought we were trying to avoid.</p>",
        "id": 231869116,
        "sender_full_name": "Melva Peters",
        "timestamp": 1616703297
    },
    {
        "content": "<p>Given the freeze that is happening next week, I need a decision on what to do!  If I don't hear soon, I'm going to go ahead and recreate the example value sets  in FHIR core and then they can be removed from THO later.</p>",
        "id": 231869294,
        "sender_full_name": "Melva Peters",
        "timestamp": 1616703367
    },
    {
        "content": "<p>I have (at least) 12 new example value sets to do for ResearchStudy for R5.  I've read the thread above but I'm no clearer on the steps I should follow now.  Putting these through any particularly formal process at this point is inappropriate because some of them may not survive.  Do I just create new files of the form <code>codesystem-research-study-reason-xxx.xml</code> and <code>valueset-research-study-reason-xxx.xml</code>?  If not what do I do?</p>",
        "id": 232021252,
        "sender_full_name": "Hugh Glover",
        "timestamp": 1616787775
    },
    {
        "content": "<p>Value sets should generally always be FHIR unless you have reason to believe that they should be shareable - and are comfortable with others making changes to them.  Code systems vary in terms of where they should be.  For now, until the policy is more landed, defining them in FHIR is fine.</p>",
        "id": 232028828,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616791315
    },
    {
        "content": "<p>I just added the VS and CS into the folder, and I'm getting an error that the system doesn't exist, is there a step I'm missing, or is my CS/VS likely to not be right?</p>",
        "id": 240223240,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1621964099
    },
    {
        "content": "<p>(copied an existing CS/VS in the same folder that do work)</p>",
        "id": 240223281,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1621964116
    },
    {
        "content": "<p>Is this for core or for IG?</p>",
        "id": 240232617,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1621968344
    },
    {
        "content": "<p>you have to register in fhir.ini now I think</p>",
        "id": 240261704,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1621984168
    },
    {
        "content": "<p>Core, will check in there... Thanks.</p>",
        "id": 240264981,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1621986976
    },
    {
        "content": "<p>Thanks again, and yes, the fhir.ini is one place you can register the location, or you can get the filename right and it finds it properly <span aria-label=\"rolling eyes\" class=\"emoji emoji-1f644\" role=\"img\" title=\"rolling eyes\">:rolling_eyes:</span></p>",
        "id": 240270360,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1621993017
    }
]