[
    {
        "content": "<p>from \"Tasks Needed\"<br>\n<span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> , the current definition of the Definition pattern says \"A pattern to be followed by resources that represent a specific proposal, plan and/or order for some sort of action or service.\"  I think that's inline with what I said here.  So that would cover Questionnaire, but would not cover ValueSet.  I suppose it could cover StructureDefinition, though that would be interpretting \"pattern\" in a different way.  Happy to refine the definition to make it clear that StructureDefinition is excluded if you have a suggestion.</p>",
        "id": 153939728,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519316731
    },
    {
        "content": "<p>Reading this \"A pattern to be followed by resources that represent a specific proposal, plan and/or order for some sort of action or service.\" sounds like the Request pattern to me, not the Definition pattern.</p>",
        "id": 153939762,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1519321486
    },
    {
        "content": "<p>Definitions are not proposals, plans, or orders at all.</p>",
        "id": 153939763,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1519321511
    },
    {
        "content": "<p>The intention is that the definition is the pattern to be followed by proposals/orders/plans/events.  Happy to have a suggestion for better wording</p>",
        "id": 153939764,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519321636
    },
    {
        "content": "<p>How about \"A pattern to be followed by resources that represent the definition of Requests or Events. For example, a MedicationRequest is a Request resource representing a proposal for a medication to be given to a patient; an ActivityDefinition is a template for describing such a MedicationRequest, but in a way that could be applied to any patient.\"</p>",
        "id": 153939766,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1519322162
    },
    {
        "content": "<p>I'm ok with that.  Can you submit a change request?</p>",
        "id": 153939777,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519323430
    },
    {
        "content": "<p><a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=15608\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=15608\">GF#15608</a></p>",
        "id": 153939810,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1519329576
    }
]