[
    {
        "content": "<p>I had an issue before with trying to slice translations on codeableconcept by system  ( e.g. I wanted the first coding to be LOINC then you could optionally have has many  other codings as you wanted (more specific loinc, smomed, local etc)  could not do it since the slicing discriminator was not specific since I could not prescribe the additional code system? \"When a discriminator is provided, the composite of the values of the elements designated in the discriminator is unique and distinct for each possible slice and applications can easily determine which slice an item in a list is.\"   Is there a solution for this now?  Or do I have to descriminate at the code level?</p>",
        "id": 153818242,
        "sender_full_name": "Eric Haas",
        "timestamp": 1459005427
    },
    {
        "content": "<p>First - doing what you're trying to do - saying that specific coding repetitions need to appear in specific positions - is really bad practice.  It essentially says \"I don't care if you've got the data I need, I need you to specifically put the data in a specific order to talk to me, even though order is meaningless\"</p>",
        "id": 153818244,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1459005704
    },
    {
        "content": "<p>That said, all you should need to do is declare the first slice, say that slicing is ordered and the slicing is open.</p>",
        "id": 153818245,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1459005751
    },
    {
        "content": "<p>I don't care if it position 1 , 2 or 6  just want it to be there...</p>",
        "id": 153818246,
        "sender_full_name": "Eric Haas",
        "timestamp": 1459005836
    },
    {
        "content": "<p>In that case, declare the slicing as \"unordered\".  Though it would seem easier to just declare a fixed binding to \"all of LOINC\"?</p>",
        "id": 153818247,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1459005890
    },
    {
        "content": "<p>Iremember we has very long discussion on this for US Lab and that's what we did.  but If I have a code now it can be sliced right</p>",
        "id": 153818248,
        "sender_full_name": "Eric Haas",
        "timestamp": 1459005997
    },
    {
        "content": "<p>thanks for clearing the cobwebs</p>",
        "id": 153818249,
        "sender_full_name": "Eric Haas",
        "timestamp": 1459006016
    }
]