[
    {
        "content": "<p>Did I miss a communication that we should avoid editing resource spreadsheets in favor of the StructureDefinition?  Oddly enough, I was able to edit Condition's spreadsheet (adding a comment), but then I got a build error when renaming an element within Goal (so I am shifting to editing the StructureDefinition now).  If anyone has a link to the communication, I'd like to review it to see what else I might have missed.</p>",
        "id": 230422156,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1615844021
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span>   There are issues when you update the spreadsheet - which is still possible.  The element identifier doesn't get added to the xml.  There is a thread...I'll tag you on it....</p>",
        "id": 230423440,
        "sender_full_name": "Melva Peters",
        "timestamp": 1615844690
    },
    {
        "content": "<p>so I missed the transition to the new system in the FHIR core build... and am now trying to get some changes in.. Where is the explanation of when to use excel, and when not to?</p>",
        "id": 233213848,
        "sender_full_name": "John Moehrke",
        "timestamp": 1617649023
    },
    {
        "content": "<p>If you're comfortable not using Excel, don't.  If you want to use Excel, run the build to create the Excel, make your changes, then run the build again to generate the XML.</p>",
        "id": 233222082,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1617653077
    },
    {
        "content": "<p>I expected that editing the spreadsheet in excel was still the right step. I seem to get the right result. But I get a complaint about my spreadsheet \"not updated - open in excel\"</p>",
        "id": 233222172,
        "sender_full_name": "John Moehrke",
        "timestamp": 1617653116
    },
    {
        "content": "<p>so I should edit the structure definition and ignore the spreadsheet?</p>",
        "id": 233222281,
        "sender_full_name": "John Moehrke",
        "timestamp": 1617653168
    },
    {
        "content": "<p>(I would be comfortable with that, just not sure about the recommendation)</p>",
        "id": 233222312,
        "sender_full_name": "John Moehrke",
        "timestamp": 1617653190
    },
    {
        "content": "<p>If you edited the spreadsheet and closed the spreadsheet and ran the build, it should propagate your content into the XML file.</p>",
        "id": 233222470,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1617653277
    },
    {
        "content": "<p>It did seem to propagate.. it just throws the warning</p>",
        "id": 233222863,
        "sender_full_name": "John Moehrke",
        "timestamp": 1617653460
    },
    {
        "content": "<p>I'll admit that I don't know what the warning means.</p>",
        "id": 233223873,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1617654078
    },
    {
        "content": "<p>I have since made changes to the structure defintion, and I still get the warning (well, it doesn't say it is a warning, it just prints a message)</p>",
        "id": 233224000,
        "sender_full_name": "John Moehrke",
        "timestamp": 1617654150
    },
    {
        "content": "<p>can I just delete the spreadsheet now? it will get regenerated?</p>",
        "id": 233224039,
        "sender_full_name": "John Moehrke",
        "timestamp": 1617654183
    },
    {
        "content": "<p>There were some issues with making changes in the spreadsheet where the content doesn't get updated in the StructureDefinition - element identifiers are missing.  Also some issues with RIM mappings.  Not sure if those have been fixed.</p>",
        "id": 233233753,
        "sender_full_name": "Melva Peters",
        "timestamp": 1617658003
    },
    {
        "content": "<p>I found mappings were only in the structuredefinition</p>",
        "id": 233233814,
        "sender_full_name": "John Moehrke",
        "timestamp": 1617658036
    },
    {
        "content": "<p>Im happy never working on a spreadsheet again.. I am still not clear on the recommendation for editors</p>",
        "id": 233234283,
        "sender_full_name": "John Moehrke",
        "timestamp": 1617658284
    },
    {
        "content": "<p>My experience has been that if you edit the spreadsheet, it will produce the StructureDefinition (and it uses the timestamp file to know when to do what), but that the output sometimes misses the \"id\" element of the elements in the generated StructureDefinition. That seems to be the only thing, so if you have a bunch of new elements, you can just go in and set the id attribute and it works from there. I have had it mistakenly overwrite though, so at this point I don't use the spreadsheets at all anymore, and I delete the generated ones for structure defs I'm working on, just in case.</p>",
        "id": 233235151,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1617658741
    },
    {
        "content": "<p>So the recommendation for editors depends on the editor. If you're happy using spreadsheets, you can continue to do so (with the caveats Melva and I are noting). But if you're happy to edit the XML, have at it.</p>",
        "id": 233235309,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1617658828
    },
    {
        "content": "<p>Just don't commit the generated spreadsheets, the build drives off the StructureDefinition resource files now</p>",
        "id": 233235339,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1617658854
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191359\">Bryn Rhodes</span> <a href=\"#narrow/stream/179165-committers/topic/Edit.20Resource.20XLS.20or.20StructureDefinition.3F/near/233235339\">said</a>:</p>\n<blockquote>\n<p>Just don't commit the generated spreadsheets, the build drives off the StructureDefinition resource files now</p>\n</blockquote>\n<p>isn't there a .gitignore rule for this?</p>",
        "id": 233235915,
        "sender_full_name": "John Moehrke",
        "timestamp": 1617659211
    },
    {
        "content": "<p>Yes, they are generally ignored</p>",
        "id": 233236731,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1617659716
    },
    {
        "content": "<p>I also missed the transition. Is there a set of instructions on the non-Excel method? I found several pages on editing, including one on using Forge to edit the core spec, but I'm not sure where the new protocol is described.</p>",
        "id": 233311266,
        "sender_full_name": "Craig Newman",
        "timestamp": 1617712995
    },
    {
        "content": "<p>so, it seems that if you edit the structuredefinition, then you really should delete the spreadsheet to force the build to ignore and rebuild the spreadsheet.</p>",
        "id": 233329729,
        "sender_full_name": "John Moehrke",
        "timestamp": 1617719959
    },
    {
        "content": "<p>I don't think there's any formal documentation.  If you're comfortable editing the XML directly, that's easiest.  If you're adding examples or extensions, you'll need to add them to the IG or List resource that lists those.</p>",
        "id": 233347841,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1617725695
    }
]