[
    {
        "content": "<p>I want to create a valueset for ChargeItem.code. It's supposed to be an example binding to a valueset that contains just a handful of random billing codes from different regional/national billing catalogues. None of the catalogues' system urls will resolve to CodeSystems, and I don't think they should, because maintaining them is IMO up to the national FHIR affiliates. <br>\nQ1: is it legit to create a ValueSet that has e.g. 3 codes from a German billing system, 3 codes from a US catalogue and three from France? Of course that doesn't make sense for implementation but I think it's what an example valueset is supposed to do: To give an idea of possible usage...<br>\nQ2: How do I sneak this past the build validation?</p>",
        "id": 153870432,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1486455018
    },
    {
        "content": "<p>you need to define a code system that contains your imaginary codes. and then use them from a value set. And then bind to the value set, and label the binding and the resources as example / experimental. Then the build will just use the code systems</p>",
        "id": 153870443,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1486456899
    },
    {
        "content": "<p>ok. That's what I did. I was just thinking that maybe there's a way to avoid creating the bogus CodeSystem and point the system url in the valueset directly to the (external) source of the codes...</p>",
        "id": 153870449,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1486458684
    },
    {
        "content": "<p>And long-term, we'd prefer to not have such codes - even fake example ones - defined in FHIR.  This is one case where having a binding just to a description might be better.</p>",
        "id": 153870651,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1486510978
    },
    {
        "content": "<p>How do I do that: \"binding just to a description\" ?</p>",
        "id": 153870711,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1486551778
    },
    {
        "content": "<p>put 'unbound' in the binding type column</p>",
        "id": 153870716,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1486554468
    }
]