[
    {
        "content": "<p>Is it discouraged or allowed (with consultation) to create examples for a resource owned by another work group?  For example, <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> , if I wanted to create a new Patient example, can I do that?  I understand the burden it puts on the work group to maintain the example(s), but I'm asking anyway in the event we want a given Patient with some set of characteristics to align with another resource.  I don't know (yet) that we need to do this, just trying to understand the process if we come to that point....</p>",
        "id": 153868578,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1484919315
    },
    {
        "content": "<p>Or, do others not worry about whether the referenced Patient/Encounter functionally align with their examples?  I'm starting to think through the challenges of creating more CarePlan examples that could references a bunch of other resources -- and so it seems like we'd want those references to all cohesively tell the story of the care plan.</p>",
        "id": 153868580,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1484919805
    },
    {
        "content": "<p>It's allowed, but coordination with the owning WG committer is expected</p>",
        "id": 153868586,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1484923472
    },
    {
        "content": "<p>Due to the timelines, I think I am going to just use references with displays only, so I don't need to build out N-many additional examples that are referenced by CarePlan.</p>",
        "id": 153868592,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1484924145
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> , I'd be very happy if you provided additional clinically valid content for your needs.</p>",
        "id": 153868642,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1484931427
    },
    {
        "content": "<p>I haven't created new examples for resources outside Pharmacy - I choose an example for those referenced resources that seem reasonable, although that isn't always possible.  It just isn't possible to do this given the timelines :(</p>",
        "id": 153868660,
        "sender_full_name": "Melva Peters",
        "timestamp": 1484934663
    },
    {
        "content": "<p>this is an area where we could plan improvements for the next version. for now, we have to pragmatic - which it sounds like everyone is being.</p>",
        "id": 153870109,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1486348229
    },
    {
        "content": "<p>Another option is to create a contained example and make a comment that is for this example and the references are typically external.  I did that for Procedure request and a lame Task example</p>",
        "id": 153870137,
        "sender_full_name": "Eric Haas",
        "timestamp": 1486350915
    },
    {
        "content": "<p>We need to be cautious about creating contained examples - too many people are abusing \"contained\" already . . .</p>",
        "id": 153870176,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1486356415
    },
    {
        "content": "<p>Committing new examples is tough when your use case needs a new patient ( they are currently no women or infants or children in the  patients examples ) or a provenance or any of the event or request resource pattern additions that have a long list of elements that reference resources of which there are few if any useful coordinated examples in the build.     That is what I think Michelle is facing  - having aligned several resources to event and request.</p>",
        "id": 153870208,
        "sender_full_name": "Eric Haas",
        "timestamp": 1486364432
    },
    {
        "content": "<p>yes. it would be good for us to have better tooling, but that'll have to be in the future</p>",
        "id": 153870210,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1486365107
    },
    {
        "content": "<p>we could, for instance, edit the cases in clinfhir, but there's a series of things to do to make taht work that we haven't done yet </p>",
        "id": 153870211,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1486365132
    },
    {
        "content": "<p>That is one place I haven't mined for examples...  I should take a look.</p>",
        "id": 153870213,
        "sender_full_name": "Eric Haas",
        "timestamp": 1486365195
    },
    {
        "content": "<p>Growing pains... </p>",
        "id": 153870294,
        "sender_full_name": "John Moehrke",
        "timestamp": 1486393698
    }
]