[
    {
        "content": "<p>Please explain how we are to process this new FiveWs? Is it taking from our existing W5 column? Is there a more complete way to specify the FiveWs in the spreadsheet (assuming the same way the workflow patterns)? If so, then how? If so, then do we remove the W5 column?  I ask as I have had many problems understanding the W5 definitions, so am unclear on the W5. However the new FiveWs seems future pathway, and has better explanation.</p>",
        "id": 153938598,
        "sender_full_name": "John Moehrke",
        "timestamp": 1519054018
    },
    {
        "content": "<p>FiveWs is replacing W5, yes. For now, there's not a different mapping column, but I expect that there will be. It's work in progress - and yes, it will follow the workflow patterns. But I probably will make it an optional thing, instead of forcing editors to go through and replace all the W5 mappings - just convert them internally if the replacement doesn't exist. And yes, we are trying to make the W5 stuff more obvious</p>",
        "id": 153938653,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1519068992
    },
    {
        "content": "<p>so then we can't yet improve our FiveWs as it pulls from the W5 column? And therefore if we see a FiveWs that doesn't seem like what we were expecting we should do what? I ask because some of the names from W5 were not clear, where as the FiveWs seems to have better names with definitions. Decomposing the FiveWs into what W5 name it pulls from is not obvious.</p>",
        "id": 153938666,
        "sender_full_name": "John Moehrke",
        "timestamp": 1519069799
    },
    {
        "content": "<p>for the moment, complain, and I'll try and get to it soon</p>",
        "id": 153938669,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1519069915
    },
    {
        "content": "<p>no hurry. I just didn't want to have missed an opportunity for improvement that was ready for the taking.</p>",
        "id": 153938678,
        "sender_full_name": "John Moehrke",
        "timestamp": 1519072089
    },
    {
        "content": "<p>ok. what is being published is pretty much what I intended for FiveWs now</p>",
        "id": 153938908,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1519123997
    },
    {
        "content": "<p>It is clear that today there is a one-for-one between W5 and FiveWs. but the definitions in the FiveWs is not any help, as they are just restating the element name.  Not clear what the meaning of class, and grade? Not clear why there are so many 'who' elements.  I see your distinction, but why is that important for W5? In both Provenance and AuditEvent these are various kinds of agent by type.   How is context and whyReference different (context seems more specific, what else would be in whyReference?)</p>",
        "id": 153938942,
        "sender_full_name": "John Moehrke",
        "timestamp": 1519135552
    },
    {
        "content": "<p>the definitions are never going to be great because they are somewhat abstract. You're welcome to improve them. Class is always a problem. How many who: because that's what I saw looking through the resources, and it tracks what I think about the resources. I haven't really considered how these map to AuditEvent and provenance in detail - we should do that. Context is encounter/episodeofcare, where as why is something like condition or observation - they are quite different</p>",
        "id": 153939047,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1519154829
    }
]