[
    {
        "content": "<p>My understanding was that the committees would do their QA check using the FMM and speadsheet. By registering their assessment and FMM in that spreadsheet; that their resource would get marked with that FMM. Yet a week later and the Resources are still at zero. Was this my misunderstanding? Or is there some process (<span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> ) that is yet to happen?</p>",
        "id": 153874962,
        "sender_full_name": "John Moehrke",
        "timestamp": 1488805850
    },
    {
        "content": "<p>The spreadsheet is expected to be updated as of the end of this week.  The FMG will then review it, double-check against warnings in the build, etc.  At that point, the FMM levels will be propagated into the build for publication purposes</p>",
        "id": 153875031,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1488816066
    },
    {
        "content": "<p>okay... I was seeing other resource FMM change, so I was wondering about the procedure.</p>",
        "id": 153875042,
        "sender_full_name": "John Moehrke",
        "timestamp": 1488816850
    },
    {
        "content": "<p>You can edit the fhir.ini if you like, but whatever you put there will get overridden based on the FMG assessment of the spreadsheet in about a week's time.</p>",
        "id": 153875078,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1488828696
    },
    {
        "content": "<p>thanks. It would be best if we all moved at the same time, using the same system. I am getting all kinds of feedback about current build showing FMM seemingly random values. Would be better if they were all stuck at 0 until FMG action.</p>",
        "id": 153875080,
        "sender_full_name": "John Moehrke",
        "timestamp": 1488829182
    },
    {
        "content": "<p>next time round, I will ensure that both current and aspired levels are shown. Setting the levels to 0 conveys strong messages to implementers that are wrong</p>",
        "id": 153875084,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1488830122
    },
    {
        "content": "<p>I agree... but everyone got thrown to zero, and I have left them at zero waiting for process to bring them back. Others clearly went ahead of process and self-promoted their desired FMM.</p>",
        "id": 153875090,
        "sender_full_name": "John Moehrke",
        "timestamp": 1488830817
    }
]