[
    {
        "content": "<p>I have a pull request that I've been trying to merge for a day now.  The first few commits had an error that a full build on my local computer didn't reveal but once I fixed that, it's been a process of having the pull request pipeline take its time to build, me coming back after a couple of hours to find out that some other pull request has been merged and I now need to re-merge and start over again.  You can see four commits which is just merging the master branch into mine.  The page does say that I'm receiving notifications, but I'm not sure where those notifications are going as I'm not receiving any emails about it.  Is there something I haven't set up to receive notifications?  And is there any way that we can streamline some of these checks so that it doesn't seemingly take hours?</p>",
        "id": 254269710,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1632254777
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"248736\">@Mark Iantorno</span></p>",
        "id": 254291990,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632265945
    },
    {
        "content": "<ol>\n<li>You can change your notification settings in Github to better suit your needs. This can range from emails notifying you of anything happening to a repo (don't do this, it's horrible), to notifying you when PRs you have submitted are commented on, or approved.</li>\n</ol>",
        "id": 254415049,
        "sender_full_name": "Mark Iantorno",
        "timestamp": 1632335289
    },
    {
        "content": "<ol start=\"2\">\n<li>The build takes a while. I agree it's long, but right now, I'm not sure how to go about shortening that process because there's a lot going on.</li>\n</ol>",
        "id": 254415192,
        "sender_full_name": "Mark Iantorno",
        "timestamp": 1632335340
    },
    {
        "content": "<ol start=\"3\">\n<li>There's nothing we can do about merge issues. That's just the nature of open source projects with lots of contributors. I understand it can be frustrating, but we need to rebuild everytime a merge is completed. This is done to ensure the main branches are working. If someone makes commits while you are waiting on your build...you will have to rebuild. The best way to avoid these kinds of issues is to keep PRs alive as short as you possibly can.</li>\n</ol>",
        "id": 254415456,
        "sender_full_name": "Mark Iantorno",
        "timestamp": 1632335442
    },
    {
        "content": "<p>you shouldn't get merge conflicts that often... what files are you getting them on?</p>",
        "id": 254416009,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632335656
    },
    {
        "content": "<p>i wasn't getting merge conflicts but rather a notification that the master had changed and needed to be merged into my branch.  in a normal dev environment where pushing a change is seconds to at most a few minutes, that isn't painful.  with our environment where the checks take 1/2 hour, that is painful.</p>",
        "id": 254433411,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1632342402
    },
    {
        "content": "<p>my main problem appears to be no notifications.  i'll look into that in GitHub to see what's going on there</p>\n<p>I'm just wondering if we can apply more power to our build environments to get the build to take less time?</p>",
        "id": 254433491,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1632342441
    },
    {
        "content": "<p>You're going to get diminishing returns with that approach.</p>",
        "id": 254461190,
        "sender_full_name": "Mark Iantorno",
        "timestamp": 1632356923
    },
    {
        "content": "<p>Projects like this have a lot of things happening under the hood when they build, from external dependencies like terminologies, to actual copying/transferring of files.</p>",
        "id": 254461226,
        "sender_full_name": "Mark Iantorno",
        "timestamp": 1632356965
    },
    {
        "content": "<p>I can look into upping the power of the build machine, but I doubt that I can increase the speed that much.</p>",
        "id": 254461248,
        "sender_full_name": "Mark Iantorno",
        "timestamp": 1632356996
    },
    {
        "content": "<p>I have a powerful machine locally, and it still takes a while for me.</p>",
        "id": 254461303,
        "sender_full_name": "Mark Iantorno",
        "timestamp": 1632357012
    },
    {
        "content": "<p>The best option for you right now would be to configure your alerts to provide the info you want</p>",
        "id": 254461344,
        "sender_full_name": "Mark Iantorno",
        "timestamp": 1632357043
    },
    {
        "content": "<p>you will always need to rebuild on a merge though</p>",
        "id": 254461368,
        "sender_full_name": "Mark Iantorno",
        "timestamp": 1632357056
    },
    {
        "content": "<p><a href=\"https://mergequeue.com/\">https://mergequeue.com/</a> is an example of a tool designed to help with this problem and GitHub workflows. I have no experience with it, but I remember reading about it in a few months back.</p>",
        "id": 254528571,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632401179
    }
]