[
    {
        "content": "<p>processing <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13229\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=13229\">GF#13229</a>. Raise hint on any column that has data with a heading that includes 'mapping', and ignoring some common templates like ??? Mapping. Hint list:</p>\n<p>Ignored Column quick Mapping in sheet Data Elements in devicerequest-spreadsheet.xml<br>\nIgnored Column quick Mapping in sheet Data Elements in deviceusestatement-spreadsheet.xml<br>\nIgnored Column C154 Mapping in sheet Data Elements in immunization-spreadsheet.xml<br>\nIgnored Column V3 Model Mapping in sheet Data Elements in medicationdispense-spreadsheet.xml<br>\nIgnored Column HL7 v2 Mapping in sheet Data Elements in nutritionorder-spreadsheet.xml<br>\nIgnored Column RequestPattern Mapping in sheet Data Elements in servicerequest-spreadsheet.xml<br>\nIgnored Column quick Mapping in sheet Data Elements in servicerequest-spreadsheet.xml<br>\nIgnored Column Sept2016ServiceRequest Mapping in sheet Data Elements in servicerequest-spreadsheet.xml<br>\nIgnored Column OldServiceRequest Mapping in sheet Data Elements in servicerequest-spreadsheet.xml<br>\nIgnored Column Notes on R3-ReferalRequest-Mapping in sheet Data Elements in servicerequest-spreadsheet.xml<br>\nIgnored Column R3-ReferalRequest-Mapping in sheet Data Elements in servicerequest-spreadsheet.xml<br>\nIgnored Column CDISC define.xml 2.0 Mapping in sheet Data Elements in valueset-spreadsheet.xml<br>\nIgnored Column CMS 1500 Mapping in sheet Data Elements in claim-spreadsheet.xml<br>\nIgnored Column Existing Standard CDAnet v4 Mapping in sheet Data Elements in claim-spreadsheet.xml<br>\nIgnored Column CMS 1500 Mapping in sheet Data Elements in explanationofbenefit-spreadsheet.xml<br>\nIgnored Column CMS 1500 Mapping in sheet Data Elements in eligibilityrequest-spreadsheet.xml</p>\n<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> <span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> <span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span>. If they are not really errors, you can change the column header to not include 'mapping'. For now, I am doing that to the Immunization and ValueSet items</p>",
        "id": 153923580,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1512702557
    },
    {
        "content": "<p>Which resource(s) in that list did you think were mine?</p>",
        "id": 153923859,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1512777346
    },
    {
        "content": "<p>you created the task</p>",
        "id": 153923874,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1512786155
    },
    {
        "content": "<p>I'll fix the MedicationDispense one as Melva's on vacation</p>",
        "id": 153923877,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1512786638
    }
]