[
    {
        "content": "<p>Is there a way to browse change requests for profiles of resources on gForge? It's easy to filter by resource but I cannot find a way to filter by profile of resource. As an example, how do I filter for issues that only apply to the ObservationForGenetics profile?</p>",
        "id": 153833322,
        "sender_full_name": "Gaston Fiore",
        "timestamp": 1466083540
    },
    {
        "content": "<p>there's no way right now</p>",
        "id": 153833362,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1466108216
    },
    {
        "content": "<p>I've been reluctant to add the ability to filter by profiles because there's so darn many of them (and they keep changing).  The way gForge works, the complete list of allowed values has to be maintained by an administrator.  (And there's no API to load the contents from a file or something nice like that).  So at the moment, they all get lumped under (profile) and the work group they're assigned to.  In your case, given that CG doesn't own many profiles, that should hopefully be \"good enough\"?</p>",
        "id": 153833418,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1466139393
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> , yes, that's good enough, thank you for the thorough explanation. Is the assignment to the CG workgroup dependent only on the person that submits the change request? For example, if a person submits a change request for the ObservationForGenetics profile and doesn't assign it to the CGWG, will the administrator fix this? I'm asking so I know to look for potential change requests that people submitted but didn't assign to CG (so when I filter to CG they won't appear). Thanks!</p>",
        "id": 153833494,
        "sender_full_name": "Gaston Fiore",
        "timestamp": 1466171489
    },
    {
        "content": "<p><strong>Gaston Fiore</strong> - I do most of the categorization.  Anything that looks like it's dealing with a CG-owned profile should be assigned to CG.  (And if I mess up, whoever I do assign it to will likely assign it to where it's supposed to go</p>",
        "id": 153833685,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1466300706
    }
]