[
    {
        "content": "<p>Is there a way to signup for monitoring gForge other than: One-at-a-time, or All-of-FHIR. I would like to filter items on a topic, and ask for monitoring of all of them. I tried using the checkbox, but don't see a monitor ability. The monitor control in the left column seems to be all or nothing.</p>",
        "id": 153849922,
        "sender_full_name": "John Moehrke",
        "timestamp": 1474385842
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> Not built in.  I have a hack that's supposed to email you things \"of interest\" once a week, but I had to re-set up my Amazon instance because I lost the certificate for my old one and need to re-figure out how to set up email access (and ideally do it this time in a way that doesn't generally route to people's spam folders).  You can edit FHIR/Tracker/interestedParties.xml to indicate what you're interested in as an individual.  Once I get email working again, you'll get them.</p>",
        "id": 153850057,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1474420184
    },
    {
        "content": "<p>And of course, if/when we migrate from gForge, it might not need to be a hack anymore.</p>",
        "id": 153850058,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1474420206
    },
    {
        "content": "<p>okay. I really just wanted to make sure it wasn't something I was missing. I can live without it. It would be nice to be able to subscribe to updates on a workgroup basis, or Resource basis... thanks </p>",
        "id": 153850062,
        "sender_full_name": "John Moehrke",
        "timestamp": 1474423056
    },
    {
        "content": "<p>Well, for the work group items, there'll be an email coming out to co-chairs that lists what each work group is interested in, so you can see that there.</p>",
        "id": 153850065,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1474427164
    }
]