[
    {
        "content": "<p>I've just discovered a significant problem with the build process. The build process requires that you specify your dependencies in the ig.json file, but doesn't require that the same dependencies are found in the IG resource itself.</p>\n<p>And the package.tgz dependencies are populated from the IG resource, not the ig.json. </p>\n<p>I have 3 choices to ix this:</p>\n<ul>\n<li>require that the IG dependencies match the ig.json ones, or else halt the publication run</li>\n<li>require that the IG dependencies match the ig.json ones, or else put an error in qa.html</li>\n<li>populate the IG dependencies automatically</li>\n</ul>\n<p>Of these, I strongly prefer #3, and I'm going to implement it now, as a workaround, but if people want to argue for one of the others, here's your opportunit.y</p>",
        "id": 180391304,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1573438121
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <br>\nDoes option 3 mean that there is no need to include dependencies in the ig.json as what is in the implementation guide will drive all dependencies?</p>",
        "id": 180394251,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1573442930
    },
    {
        "content": "<p>no the other way around</p>",
        "id": 180394364,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1573443100
    },
    {
        "content": "<p>The the publisher will create an implementation guide with exactly the the dependencies found in the ig.json, and will ignore any dependency information in the source implementation guide.</p>",
        "id": 180395626,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1573445282
    },
    {
        "content": "<p>Just as happens with the FHIR version: the FHIR version in the ig.json becomes the FHIR version in the generated implementation guide.</p>",
        "id": 180395704,
        "sender_full_name": "Richard Townley-O'Neill",
        "timestamp": 1573445352
    },
    {
        "content": "<blockquote>\n<p>The publisher will create an implementation guide with exactly the the dependencies found in the ig.json, and will ignore any dependency information in the source implementation guide</p>\n</blockquote>\n<p>No. It will ensure that whatever is in ig.json is in the IG resource, but it will not delete anything from the IG</p>",
        "id": 180396350,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1573446170
    },
    {
        "content": "<p>The less we can look to the ig.json the better... so I would prefer the IG resource is used. If this isn't possible, then errors need to be thrown and the publisher should be stopped.</p>",
        "id": 180437333,
        "sender_full_name": "John Moehrke",
        "timestamp": 1573489588
    },
    {
        "content": "<p>it's transient anyway - we are moving to not use ig.json</p>",
        "id": 180451959,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1573500264
    }
]