[
    {
        "content": "<p>So in the interests of making sure we don't miss any steps taking an IG to ballot, I'd like to know what our steps are in the next week or so. </p>\n<p>For a CDA IG we always send the IG to the listserv of the sponsoring work group for them to check against a list of quality criteria (all templates have unique ids, examples, etc) - this is NOT a content review - it's just to make sure the IG is good enough to go to ballot. After that week's review the work group has to vote to approve the IG to go to ballot. So we'd send a SD sponsored CDA IG to the listserv on Thursday to make sure that we can get approval to go to ballot in time for the 19th...</p>\n<p>Is there an equivalent process for a FHIR IG? A list of quality criteria - or is that mostly taken care of by having a IG Publisher build with no (or close to no) errors?</p>\n<p>Would we send a link to the CI build page for the work groups to review (with a caveat that it will change slightly over the week).</p>\n<p>This is what I'm thinking right now:<br>\n1. Make sure CI IG Publisher build works (likely not error free at this point)<br>\n2. Send CI link to sponsoring workgroups for some kind of review &lt;insert criteria here?&gt;<br>\n3. Get approval from main sponsoring workgroup before the 19th<br>\n4. Make sure CI IG Publisher build is error free by the end of day on the 19th<br>\n5. <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> et al work their magic and publish to the ballot site</p>\n<p>Is there anything I've missed?</p>",
        "id": 153982828,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1533594021
    },
    {
        "content": "<p>we assume that the IG publisher handles a lot of the technical details. We ask the WG to review the IG as posted to the CI build site, and particularly to look at the qa.html page. I will look a the qa.html page next week and ask for justification of any errors in there - and particularly about broken links</p>",
        "id": 153982830,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1533594874
    },
    {
        "content": "<p>To hit FMM 3+, the work group(s) responsible for the resources being profiled must approve the profiles and extensions as well.</p>",
        "id": 153982832,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533595231
    },
    {
        "content": "<p>Ok, sounds good - thanks guys.</p>",
        "id": 153982833,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1533595904
    },
    {
        "content": "<p>What happens if qa.html is a mess? Do they get kicked off the island?</p>",
        "id": 153982844,
        "sender_full_name": "Eric Haas",
        "timestamp": 1533597497
    },
    {
        "content": "<p>(speaking metaphorically)</p>",
        "id": 153982845,
        "sender_full_name": "Eric Haas",
        "timestamp": 1533597513
    },
    {
        "content": "<p>FMG will probably let it go to ballot if it's \"for comment\" and it's in sufficient shape as to be useful for review.  If it's for STU, they could drop it down to draft.  At minimum they'll ask what the plan is to get it clean before publication.</p>",
        "id": 153982847,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533597839
    }
]