[
    {
        "content": "<p>I am working on the Implementation Guide version support. I am considering adding support for producing IGs for 1.0.2 (though it may be that we don't support code systems)</p>",
        "id": 153850804,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1474917372
    },
    {
        "content": "<p>please let me know if you think that would be good</p>",
        "id": 153850805,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1474917378
    },
    {
        "content": "<p>the other question is about 1.6.0 - I'm planning to orphan that version, and not support it any more as for today </p>",
        "id": 153850806,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1474917399
    },
    {
        "content": "<p>let me know if you think that's a mistake</p>",
        "id": 153850807,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1474917408
    },
    {
        "content": "<p>I would be very disappointed to lose 1.6.0 support.  I can sort of understand orphaning it once 3.0 is out and published, but at least once that's done, presumably future versions will allow conversion to 3.0 and if 1.6.0  to 3.0 conversion exists, that provides a hypothetical path for 1.6.0 to 3.x support.</p>",
        "id": 153850813,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1474921494
    },
    {
        "content": "<p>why? Who's using it? maintainig 1.6.0 support means yet another conversion for me to maintain. I'll do it if I have to, but it's work, and I'm not doing it just for the sake of it. </p>",
        "id": 153850919,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1474990013
    },
    {
        "content": "<p>do you have a client who'll put $$ on the table to support 1.6.0?</p>",
        "id": 153850920,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1474990028
    },
    {
        "content": "<p>and note that my question is specific to producing implementatino guides</p>",
        "id": 153850921,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1474990129
    },
    {
        "content": "<p>What are the practical issues.  I can still publish an IG using an old existing IG publisher for ver 1.6.0   or I can update the resources to v 1.7.0 or STU3  or whatever it will be and use the current IG publisher,  right?</p>",
        "id": 153850937,
        "sender_full_name": "Eric Haas",
        "timestamp": 1475004636
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> If you need me to do the updates to keep the 1.6.0 IG support, I'm willing to do that.</p>",
        "id": 153850961,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1475023913
    },
    {
        "content": "<p>it's not so easy, because I have to upgrade the convertor when I upgrade everything else. </p>",
        "id": 153850991,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475036129
    },
    {
        "content": "<p>Can you comment it out and I can put it back in when it's fixed?</p>",
        "id": 153851110,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1475094333
    },
    {
        "content": "<p>well, maybe. But I've been counting the cost more widely, and I've realised that's only the start of it. </p>",
        "id": 153851167,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475116706
    },
    {
        "content": "<p>you haven't indicated a specific need. And I'm not signing up to support every releases for ever. Not at all. </p>",
        "id": 153851168,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475116726
    },
    {
        "content": "<p>because I need to run a terminology server for every release, if we're going to get it right</p>",
        "id": 153851169,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475116744
    },
    {
        "content": "<p>The problem with 1.7 is it's a moving target. 1.6 gives a stable basis for the IGs I'm currently working on. So I'd like to see support for it, but I don't think that means we need to support building a 1.6 IG with 1.7 tooling, or convert between resources, I just need to continue to be able to build the 1.6 IGs. As long as that's still possible, I'm fine with discontinuing support for 1.6 in the 1.7 branch (and altogether once 3.0 is published).</p>",
        "id": 153851287,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1475167840
    },
    {
        "content": "<p>so you will continue to be able to build a 1.6 guide with the 1.6 IG publisher ... for about 1 week more </p>",
        "id": 153851288,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475168030
    },
    {
        "content": "<p>or maybe less</p>",
        "id": 153851289,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475168036
    },
    {
        "content": "<p>Then the existing tooling will break? Is that because there won't be a 1.6 terminology server to support it?</p>",
        "id": 153851290,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1475168143
    },
    {
        "content": "<p>yup. I'm about to make all the header changes so that everyone can stabilise their STU3 tooling</p>",
        "id": 153851291,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475168410
    },
    {
        "content": "<p>Okay, I'll just keep the guides up-to-date as changes happen in 1.7 then. The real kicker is that I have executable code in them and I can't execute on 1.7 until I get updated reference implementations from HAPI, so I'm pretty much stuck on 1.6, at least for the computable content.</p>",
        "id": 153851292,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1475168614
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span> versioning is getting harder since everyone wants all this cross-version support. What options are there for someone who wants to keep their HAPI up to date?</p>",
        "id": 153851294,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475168834
    },
    {
        "content": "<p>Hmm. Practically what does this mean? Like people want to have a version of HAPI with the very latest definitions? Or easier access to stable versions? Or both?</p>",
        "id": 153851296,
        "sender_full_name": "James Agnew",
        "timestamp": 1475168976
    },
    {
        "content": "<p>To be clear, I don't want cross-version support, I just want access to stable versions. I'm happy to upgrade the content as it changes, but with the computable content, I can't do that until I have a version of HAPI that supports the new version.</p>",
        "id": 153851297,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1475169094
    },
    {
        "content": "<p>well, in this case, the latest version is really the question. I don't think you want to release a HAPI branch everytime someone commits to the build </p>",
        "id": 153851298,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475169156
    },
    {
        "content": "<p>I think for my case, the lag would be acceptable (so the guide would be published as 1.7, and use 1.7 conformance resources), but the CQL content would reference 1.6 until the engines could be updated to run 1.7.</p>",
        "id": 153851299,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1475169157
    },
    {
        "content": "<p>So HAPI is currently at FHIR 1.6.0. Is the issue here that you want changes that exist in FHIR beyond 1.6.0?</p>",
        "id": 153851300,
        "sender_full_name": "James Agnew",
        "timestamp": 1475169298
    },
    {
        "content": "<p>yes. right now, there's 1 change. But there's about to be heaps</p>",
        "id": 153851301,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475169364
    },
    {
        "content": "<p>this is really editorial process support</p>",
        "id": 153851302,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475169391
    },
    {
        "content": "<p>more of us are getting HAPI code in stuff around the build (not the build itself)</p>",
        "id": 153851303,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475169410
    },
    {
        "content": "<p>And these are meaningful changes to data model stuff that's expected to land in STU3 final? If that's the case it's probably time for a fresh sync of the model into HAPI...</p>\n<p>It's not really a huge burden to do that- I typically push snapshot builds at regular intervals for the bleeding edge stuff in FHIR and try to tag final versions occasionaly (and especially when there's a FHIR release). I don't... think...? there is much value in holding on to the 1.6.0 release of FHIR in HAPI beyond a single release (which was HAPI 2.0)</p>",
        "id": 153851304,
        "sender_full_name": "James Agnew",
        "timestamp": 1475169541
    },
    {
        "content": "<p>What I am hearing is that we will need to update all our IGs from v 1.6 to 1.7.   But I don't know what that means on my end besides changing the version in the SDs and any updates in resources from 1.6 to 1.7</p>",
        "id": 153851305,
        "sender_full_name": "Eric Haas",
        "timestamp": 1475169582
    },
    {
        "content": "<p>I've actually already synced to the latest validator (did that 2 days ago), just need to do the model and conformance files</p>",
        "id": 153851306,
        "sender_full_name": "James Agnew",
        "timestamp": 1475169640
    },
    {
        "content": "<p>well, we're about to have a long stream of changes from tasks. Bryn and I are working over the metadata section of all the conforamnce and knowledge resoruces for consistency - that will be the most obvious change. But I'm also making what will be a painful structural change to valueset</p>",
        "id": 153851307,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475169690
    },
    {
        "content": "<p>oh boy :)</p>\n<p>So, I certainly don't mind to make a push to keep a snapshot of this stuff current over the next while as you do this. </p>\n<p>If we need even more realtime than that I could publish instructions for people to manually build their own local copy with more up-to-date definitions but I feel like that would be a lot of work for people with low value.</p>",
        "id": 153851308,
        "sender_full_name": "James Agnew",
        "timestamp": 1475170004
    },
    {
        "content": "<p>Yeah, I agree a local copy/manual build would be a lot of work, I don't see that as necessary for my use case at least. I'm happy with the lag, and if it's not too much work, that sounds like a good approach to just keep things refreshed after major/structural changes.</p>",
        "id": 153851314,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1475171190
    },
    {
        "content": "<p>ok I'll let James know when I think a useful clone point will be based on the editorial process</p>",
        "id": 153851315,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475171261
    },
    {
        "content": "<p>on a related subject, I'm making a new rule: irrespective of what is published in the specification, any IGs based on past versions will use the very  latest definitions of the v2 and v3 tables </p>",
        "id": 153851319,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475171609
    },
    {
        "content": "<p>cool cool</p>",
        "id": 153851326,
        "sender_full_name": "James Agnew",
        "timestamp": 1475173390
    },
    {
        "content": "<p>Grahame reminded me that I'm using 1.4, not 1.6, so I'm fine with there not being a conversion process for 1.6</p>",
        "id": 153851380,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1475189190
    },
    {
        "content": "<p>yes I'm not proposing to remove 1.4 support</p>",
        "id": 153851381,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475189533
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> by \"any IGs based on past versions will use the very latest definitions of the v2 and v3 tables\" do you mean just NEW IGs?</p>",
        "id": 153851548,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1475496299
    },
    {
        "content": "<p>well, IGs, when they are built, will be built using the latest versions of v2 and v3 terminology, irrespective of their FHIR version </p>",
        "id": 153851549,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475496901
    },
    {
        "content": "<p>I'm not sure what you mean by \"NEW IGS\"</p>",
        "id": 153851550,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1475496912
    }
]