[
    {
        "content": "<p>I cannot move JIRA FHIR tickets through the workflow. I click \"Change Applied\" on, for example, <a href=\"https://jira.hl7.org/browse/FHIR-24270\" target=\"_blank\" title=\"https://jira.hl7.org/browse/FHIR-24270\">https://jira.hl7.org/browse/FHIR-24270</a>, and I get the message:</p>\n<p>Change Category is required when IssueType is ChangeProposal and Resolution is Persuasive, Persuasive w/ Mod or Not Persuasive w/ Mod<br>\nIt seems that you have tried to perform an illegal workflow operation.<br>\nIf you think this message is wrong, please contact your Jira administrators.</p>",
        "id": 182814382,
        "sender_full_name": "Matthew Tiller",
        "timestamp": 1575674156
    },
    {
        "content": "<p>You may need to re-open it and fill in the change category, then move it through to applied.  I thought I had filled all of the change categories in before importing to Jira, but evidently not :(</p>",
        "id": 182829091,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1575695669
    },
    {
        "content": "<p>I clicked \"re-open\" so now the ticket is status \"triaged\", but I don't see anything that looks like \"change category.\" Is that the correct status to see \"change category\"? Or maybe I don't have the correct permissions?</p>\n<p>As a possibly-related aside, I can hit \"e\" on my keyboard to edit the issue when I have it selected as part of an issue search, but I can't edit it at all when I am looking directly at the issue.</p>",
        "id": 182849922,
        "sender_full_name": "Matthew Tiller",
        "timestamp": 1575733466
    },
    {
        "content": "<p>Click on \"Propose Disposition\" or any of the other disposition workflows and you should be able to set a field named \"Change Category\".</p>",
        "id": 182865789,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1575759239
    },
    {
        "content": "<p>Yes, thank you Lloyd. I didn't want to keep pushing the ticket around the workflow hoping to find the right place, so thank you for the info.</p>",
        "id": 182958704,
        "sender_full_name": "Matthew Tiller",
        "timestamp": 1575900934
    }
]