[
    {
        "content": "<p>The CG IG is starting to have more than one committer - which means that I can't (or at least shouldn't) just treat it like a weird version of SVN where I push every commit up to 'master' whenever I commit.</p>\n<p>Do any other WGs have conventions for managing an IG with multiple committers?  E.g. Use of branches and pull requests; whether code needs to be reviewed before pushing to 'master' and if so, by who; whether the CI build process should run on branch commits or not; branch naming convention/frequency; whether/when to use GitHub issues vs. tracker items vs. Zulip</p>\n<p>Happy for this thread to cover both \"what you're doing now\" as well as \"what should we be doing?\"</p>\n<p>(Obviously fully leveraging Git will be challenging until the IG spreadsheets get cleaned the same way the resource spreadsheets are - Grahame's promised to work on that once we've got the ballot out the door (or maybe even during the QA period).)</p>",
        "id": 153940196,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1519417162
    },
    {
        "content": "<p>For the CQF IGs, we only have a few committers, so haven't needed branches or PRs for any IGs yet. I can see the need arising for a larger IG or higher number of committers though. For issues, we use Github issues for everything but QI Core, for which we use the Tracker. We put a link to the issues page of the Github repository in the footer of the IG.</p>",
        "id": 153940211,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1519422885
    },
    {
        "content": "<p>we haven't used anything like either in any of the US guides</p>",
        "id": 153940212,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1519422916
    },
    {
        "content": "<p>Brett and I commit on IGs  and generally pull before working on it otherwise get a dreaded spreadsheet conflict.  OTher conflict in markdown and xml are relatively easy to resolve.</p>",
        "id": 153940225,
        "sender_full_name": "Eric Haas",
        "timestamp": 1519431349
    },
    {
        "content": "<p>Otherwise need to do a PR for each commit.  One issue I discussed with Josh is that its hard to have a published snapshot of all your cumulative commits since you may be way ahead of the upstream repo by several commits.  Or the PR reviewer wants to see the output. But he suggested its not a big deal so I'm OK with that answer for now.</p>",
        "id": 153940226,
        "sender_full_name": "Eric Haas",
        "timestamp": 1519431528
    }
]