[
    {
        "content": "<p>In reading through \"Using Codes in Resources\" again to answer the question on CodeableConcept, I'm realizing that we're still being inconsistent in how we describe and use the various reference types (at least in the terminology documentation).  In particular, we've used \"logical\" differently at times - sometimes synonymous with \"literal\" or \"direct\" or \"absolute\" and at other times synonymous with \"canonical\".  I tried to clean this up and make it consistent in the CodeSystem and ValueSet documentation, but I still didn't yet do it entirely the same as it currently is in \"Using Codes in Resources\" and in \"Resource References\".  I'm assuming that the latter (\"Resource References\") should (ideally) be the authoritative source on this as it's a general page (not terminology specific) and a normative candidate?</p>\n<p>Before I made my latest changes, the R4 Draft for Comments version in the CodeSystem introduction, for example, had this:</p>\n<blockquote>\n<p>Each code system has 2 different URLs that can be used to reference it - its logical identifier, and its location.</p>\n</blockquote>\n<p>and</p>\n<blockquote>\n<p><a href=\"http://CodeSystem.id\" target=\"_blank\" title=\"http://CodeSystem.id\">CodeSystem.id</a>: the logical id on the system that holds the code system - this changes as it moves from server to server (this id, with the server address prepended, is called the 'literal identity' of the resource)</p>\n</blockquote>\n<p>As I said, I've already tried to clean some of this up, but the \"CodeSystem Identification\" section in the current build still says that <code>CodeSystem.id</code> is the <code>logical id</code>, which given the other guidance appears to be \"wrong\".  And since CodeSystem and ValueSet also are normative candidates, I think we had better try to get this cleaned up and make it consistent throughout the spec now.  Any further thoughts on how we need to do that and what changes are still needed are welcome.</p>",
        "id": 153944700,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1521015954
    },
    {
        "content": "<p>I just noticed that the \"Resource References\" page says this in two adjacent sentences:</p>\n<blockquote>\n<p>The canonical URI remains the same when the resource is copied from server to server, while the logical id of the resource - its local identifier - usually changes as the resource is copied. The canonical URI serves as a stable logical identifier for the conformance artifact, and <strong>is the preferred way to reference a conformance or knowledge resource</strong>.</p>\n</blockquote>\n<p>It seems that even here we're not being very logical about our use of the word \"logical\"!</p>",
        "id": 153944701,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1521016803
    },
    {
        "content": "<p>\" its logical identifier\" --&gt; \"it's canonical identifier\"</p>",
        "id": 153944705,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1521023944
    }
]