[
    {
        "content": "<p>Related to the great CI-build purge, I was just looking at the large amount of FHIR core branches that we have.  Some of those seem to be old or for a specific purpose.  Perhaps we could prune these branches as well?</p>",
        "id": 270239766,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1643732745
    },
    {
        "content": "<p>So, you're not happy with just breaking the IGs, you want to take down all of fhir?</p>",
        "id": 270240744,
        "sender_full_name": "David Pyke",
        "timestamp": 1643733104
    },
    {
        "content": "<p>go big or go home baby!</p>",
        "id": 270241195,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1643733250
    },
    {
        "content": "<p>103 branches and 43 are marked as Merged or Closed.  We can certainly delete those?  And there are another 20 that are classified as stale because they haven't been touched in a long time.</p>",
        "id": 270241452,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1643733361
    },
    {
        "content": "<p>There may be certain branches we will want to 'protect' from purges (e.g. R4B, though it's not vulnerable yet).  But I agree that merged branches and most branches that are untouched in 6+ months are fair game to toast.</p>",
        "id": 270249870,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643736064
    },
    {
        "content": "<p>If you're not using it already, there is a GitHub setting for \"protecting\" branches.  This lets you set up specific rules for specific branches -- so, for example, you could prevent the R4B from being deleted (or force pushed, or pushed without a PR, etc).  Relevant doc: <a href=\"https://docs.github.com/en/repositories/configuring-branches-and-merges-in-your-repository/defining-the-mergeability-of-pull-requests/about-protected-branches\">https://docs.github.com/en/repositories/configuring-branches-and-merges-in-your-repository/defining-the-mergeability-of-pull-requests/about-protected-branches</a></p>",
        "id": 270257083,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1643738525
    },
    {
        "content": "<p>I have been shocked by all the dead pull-requests. Killing them should be caseful, as someone might have moved the Jira ticket to applied, when they had not yet gotten their pull-request merged. This is not likely, but it is not likely that we would have 20 stale branches. so odds are not logical.</p>",
        "id": 270265447,
        "sender_full_name": "John Moehrke",
        "timestamp": 1643741776
    },
    {
        "content": "<p>Yes, that's definitely something that could have happened.  Someone creates the pull request and presumes it'll be handled (and maybe even marks the change as applied.)</p>",
        "id": 270274879,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643745308
    },
    {
        "content": "<blockquote>\n<p>If you're not using it already, there is a GitHub setting for \"protecting\" branches</p>\n</blockquote>\n<p>We do have branch protections on <code>main</code> and <code>R4B</code>. These include prohibition of deletes, as well as requirements on PR build status checks before merges.</p>",
        "id": 270279057,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1643746934
    },
    {
        "content": "<p>Could we do something similar with other CI-build instances that we want to keep alive? (e.g. templates)</p>",
        "id": 270287951,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643750174
    },
    {
        "content": "<p>no it's time to move everyone off current</p>",
        "id": 270289128,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1643750578
    }
]