[
    {
        "content": "<p>We've made a conscious decision that we will <em>not</em> maintain older versions of FHIR.  We make technical corrections in the cae of urgent security issues, but beyond that, if something is broken in an old release, it stays broken and gets addressed in the next \"official\" version of the spec.  Do we have the same policy for IGs, or would we consider going back and correcting old versions (e.g. of U.S. Core) instead of just fixing things in the next draft?  (This has implications for how we handle the identification of \"version\" in Jira - if we only fix things in the current version, then I can \"fix\" the declared issue version, because people can only raise issues about the current release.  That's what I do for core.  However, if issues can be raised and addressed in old releases, then I need to allow version to be asserted, though I might default to the current version.</p>",
        "id": 153974261,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531093562
    },
    {
        "content": "<p>I don't see how can we make substantiative changes to past versions?</p>",
        "id": 153974275,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1531120878
    },
    {
        "content": "<p>Not necessarily substantive changes.  But technical corrections could be possible.  It's hugely onerous to do for the core spec.  But it wouldn't necessarily be as painful for an IG.</p>",
        "id": 153974284,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531122878
    },
    {
        "content": "<p>I say current only.... Move forward or get out of the way..   :-)</p>",
        "id": 153974306,
        "sender_full_name": "John Moehrke",
        "timestamp": 1531141151
    },
    {
        "content": "<p>Well nice if you can get it, but the US and perhaps others like to declare specific versions in regulation which means that technical corrections at least may make substantive changes to versions other than the current.</p>",
        "id": 153974307,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1531141345
    },
    {
        "content": "<p>That problem tends to happen when regulators don't wait for NORMATIVE... thus a self-inflicted wound.    We need to get back to proper governance that recognizes \"Trial Use\" is different from \"Normative\"; that there is risk to using \"Trial Use\" that needs to be recognized and managed, and that \"Normative\" means no breaking changes without explicit identification (by named option, or versioning, or new IG).</p>",
        "id": 153974308,
        "sender_full_name": "John Moehrke",
        "timestamp": 1531141757
    },
    {
        "content": "<p>we are a standards organization here in HL7...  we should act like one</p>",
        "id": 153974309,
        "sender_full_name": "John Moehrke",
        "timestamp": 1531141823
    },
    {
        "content": "<p>I don't understand what it would mean to make substantiative technical corrections to past versions. what do you claim to conform to?</p>",
        "id": 153974391,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1531174511
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> it seems that you mean 'we should dictate to governments...'?</p>",
        "id": 153974392,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1531174538
    },
    {
        "content": "<p>The simplest situation would be to support non-substantive corrections or supplements that provide improved guidance without changing the technical expectations.  I'm not suggesting that substantive changes would be permitted.  And I'm not advocating to allow changes at all - I'm just raising the question.</p>",
        "id": 153974395,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531174850
    },
    {
        "content": "<p>@Grahame No, I am saying that HL7 should act like a standards organization that it is.    We should follow our governance. STU governance allows for breaking changes.  Any external use of STU takes on the risk associated with STU. That is true of government not listening to us and including STU in regulation, or a 2 person company choosing to develop an app on a STU.   Will it happen, most surely it will. But enabling it to happen is very different than sticking with SDO stated governance.</p>",
        "id": 153974398,
        "sender_full_name": "John Moehrke",
        "timestamp": 1531175091
    },
    {
        "content": "<p>well, now I'm confused about what we are talking about. We've already issued technical corrections to an IG like we made to FHIR itself</p>",
        "id": 153974402,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1531176432
    }
]