[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"*\">@all</span> The markdown format is about to change for R4. I'll be changing the markdown processor to GFM for the main build, and for all R4 implementation guides. R2 and R3 implementation guides will still use the old markdown format. note that what will drive the selection of syntax in the IG publisher is the stated version in the ig.json file </p>\n<p>In terms of what actually changes,  I haven't found any published comparison of the syntaxes. Weird. But it looks like nothing in the limited markdown we've used in the specs (mainly links and lists) changes. The custom [[[link]]] format doesn't change.</p>\n<p>I've checked most of the main build. Doing this threw up one difficult issue, for which I apologise. When excel is looking for line breaks in a cell, it looks for the characters \"&#10;\" in the xml, <em>not \\n</em>. The java xml library reads \"&#10;\" and converts them to \\n when saving - hence, in spreadsheets edited since the day before the NOLA meeting, end lines have been been lost in markdown, and I can't recover them. I've recovered them for all the spreadsheets not edited in that time.</p>",
        "id": 153938489,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1519007350
    },
    {
        "content": "<div class=\"codehilite\"><pre><span></span>&amp;#10;\n</pre></div>",
        "id": 153938491,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1519007565
    },
    {
        "content": "<p>that's what the characters \" \" is supposed to contain - just testing zulip</p>",
        "id": 153938492,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1519007584
    },
    {
        "content": "<p>Apologies for the sweeping changes to all the spreadsheets. Nailing down the markdown/excel bug... I should've tested a little more before committing. I think I have it right now</p>",
        "id": 153938507,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1519012375
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  What is the bottom line for committers do we need to go through the comments and description and update the text to replace  line breaks with  <code>&amp;#10; </code> ?</p>",
        "id": 153938628,
        "sender_full_name": "Eric Haas",
        "timestamp": 1519061015
    },
    {
        "content": "<p>no I think I found and fixed them all. The bottom line is: be alert for broken stuff in the markdown as you review</p>",
        "id": 153938655,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1519069034
    }
]