[
    {
        "content": "<p>@CDS people (<span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span>) - we are hoping to use PlanDefinition and ActivityDefinition to record a drug manufacturing protocol (a batch formula - a recipe basically).</p>\n<p>Most of what we need is there but it would be really useful if ActivityDefinition.product[x] could be a Reference(Ingredient) as well as a Medication and Substance as it is now.</p>\n<p>Also the subject of the whole PlanDefinition would be a particular type of product, that is being manufactured by this protocol. We would like PlanDefinition.subject to allow a reference to a MedicinalProductDefinition.</p>\n<p>Are these feasible changes please?</p>",
        "id": 206598416,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1597164121
    },
    {
        "content": "<p>Why not doing that in the medication definitional resources as an element? Basically saying \"this is the product, and here goes the formula\".<br>\nI'm thinking of magistral / officinal preparations, not sure if that is your use case. <br>\nI can't be precise on why  PlanDefinition  seems off, but I think it's because it puts emphasis on the set of actions and workflow - for making a drug you are not really defining the workflow, in \"decomposable actions\" but just a set of instructions.</p>",
        "id": 206604767,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1597167065
    },
    {
        "content": "<p>There are other groups that are already using PlanDefinition in this same way, and it seems like a good fit if you are trying to describe what happens in more detail. I'm certainly no expert in this area though, but the proposed changes sound reasonable to me <span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span> , submit some trackers?</p>",
        "id": 206607070,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1597168075
    },
    {
        "content": "<p>Thanks Bryn, will do that. If you can point me at others doing the same that would be great</p>",
        "id": 206613610,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1597171062
    }
]