[
    {
        "content": "<p>Hey all, I have a quick question about the policy around code systems and value sets published by FHIR.  Specifically, I am curious about the inclusion of systems that cannot be expanded without licensing.  One example (there are many) is <a href=\"https://www.hl7.org/fhir/cpt.html\">CPT</a>.</p>\n<p>I can't remember where I read the policy, and have the vague thought that it was only for sets with <code>required</code> bindings, so thought I would ask the experts.</p>\n<p>(it came up because some internal tooling was complaining about sets it could not expand from the core package when processing the spec)</p>\n<p>Thanks!</p>",
        "id": 233571248,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1617833434
    },
    {
        "content": "<p>In general, for UV specs, we don't mandate use of terminologies that aren't freely available world-wide.  For US-specific specs, we would avoid mandating use of terminologies that weren't either free-for-use in the US context or that weren't already mandated for use by regulation.  I.e. we don't want to be in a situation where complying with an HL7 standard forces the incursion of terminology licensing fees that would not otherwise be incurred.</p>",
        "id": 233590367,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1617846878
    },
    {
        "content": "<p>is that also true of HL7 published IG? IG published by other organizations would fall under that organizations policy.</p>",
        "id": 233639314,
        "sender_full_name": "John Moehrke",
        "timestamp": 1617882743
    },
    {
        "content": "<p>Right.  This only holds for HL7 International-published IGs (including accelerators).  IGs published by other organizations can do as they please.</p>",
        "id": 233665319,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1617893306
    },
    {
        "content": "<p>Thanks Lloyd, so just to make sure - it's fine that these Code Systems and Value Sets are defined in the FHIR core packages, they just can't be <em>used</em> in the FHIR core packages.  Right?</p>",
        "id": 233666305,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1617893635
    },
    {
        "content": "<p>They can be used - as example or preferred bindings.  But they can't be used with extensible or required bindings without getting special permission.</p>",
        "id": 233676956,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1617896523
    }
]