[
    {
        "content": "<p>Grahame did a lot of work getting the IGPublisher to re-write the spreadsheets so they're actually \"mergeable\" - i.e. you can look at a diff and understand what changes occurred and actually have a chance of doing a merge and having it work.  However, that requires that:<br>\na) you run a local build up to the schema-generation phase before you commit; and<br>\nb) you don't have any of the relevent spreadsheets open when you run the build</p>\n<p>Right now, we have &lt; 50% compliance to that process.  (and I'm one of the ones who messes it up at least half the time).  One way to encourage better compliance would be to have the CI build fail if it encounters any spreadsheets that haven't been appropriately reprocessed.  Grahame asked me to raise the issue here to see what people think.</p>",
        "id": 153986523,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1534281641
    },
    {
        "content": "<p>IG publisher or the Build?</p>",
        "id": 153986534,
        "sender_full_name": "Eric Haas",
        "timestamp": 1534282480
    },
    {
        "content": "<p>build. Lloyd asked me to extend the arraaement to the IG publisher, and I said , what's the point? it's not working for the main build... but we will be going to GIT as soon as I and Josh see a chance...</p>",
        "id": 153986545,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534282866
    },
    {
        "content": "<p>I've certainly forgotten that sometimes (particularly about closing the spreadsheets).  I think it would be helpful and would result in less churn in the build if it did fail <strong>and also</strong> gave a clear and explicit error message about what was wrong and what file(s) were the cause.</p>",
        "id": 153986557,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1534284279
    },
    {
        "content": "<p>well, we'll try it out</p>",
        "id": 153986671,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1534300928
    },
    {
        "content": "<p>for Ig publisher -  I don't have a problem interpreting the error messages ( since I have made most of these errors enough times to remember ) and would rather keep the spreadsheets open.  So I personally don't see a need.</p>",
        "id": 153986996,
        "sender_full_name": "Eric Haas",
        "timestamp": 1534351246
    },
    {
        "content": "<p>This is a change for the core spec right now - though the intention is to have it in the IGPublisher too.  If you have multiple people working on spreadsheets, the committed spreadsheets need to be mergeable.</p>",
        "id": 153987051,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1534358812
    }
]