[
    {
        "content": "<p>Methodologically, how do we fix the inconsistencies between our different resources that handle \"product\" and \"product definition\" and \"product knowledge\" and \"product kind vs instances\"?</p>",
        "id": 205668327,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1596264237
    },
    {
        "content": "<p>We have a Product pattern, and we have several WGs that are working on this. I try to keep an eye and I notice inconsistencies, and I have some reservations about some parts, but I'm sure the committees will get this in order. Just as an example - I appreciate how Pharmacy MedicationKnowledge became more and more consistent (even if I disagree with the name and the initial scoping and design caused me some issues that I exposed - but we did work on it, and it got better)</p>",
        "id": 205668426,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1596264399
    },
    {
        "content": "<p>I can handle keeping an eye on another discussion, and I'm happy we have many months before any of this goes normative (in my opinion this is still messy), but the issue seems like I had - I'm pointing my own flaws here:<br>\nWhen doing Catalogs, the resources did not support a graph-like structure that allows connecting medicationdefinitions to medicationdefinitions, to devicedefinitionss, to conditiondefinitions, etc. So we had a thing called CatalogEntry. I'm actually relieved CatalogEntry is on its way out, but how are we handling this?</p>",
        "id": 205668537,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1596264647
    },
    {
        "content": "<p>in that case, the committe agreed with CatalogEntry and I think it was given a chance to prove its worth. Is that the way we'll iterate? (i.e. the committee agrees because things make sense at a given time, but then we can always go back and say \"that was not our finest idea\"?</p>",
        "id": 205668546,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1596264706
    },
    {
        "content": "<p>I like that approach and I learned from it. But as we start looking at Catalogs and Inventory, we should have some consistency around handling the product concepts.</p>",
        "id": 205668611,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1596264827
    },
    {
        "content": "<p>To be clear, the problem I've seen (mea culpa again) is that local consensus is easy - and easily diverges across WGs and across days of the week.</p>",
        "id": 205668732,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1596265057
    },
    {
        "content": "<p>Hi José, it sounds like you have a general feeling of unease, and that is quite hard to address :-)</p>\n<p>What are the inconsistencies you speak of?</p>\n<p>A few issues that I am personally aware of (but I think these are acceptable because all proposed alternatives are worse):</p>\n<p>Some resources can be both instances and types, e.g. Medication.<br>\nYou can request one, you can dispense one, you can make a list and call it a formulary.<br>\nIt could have a moodCode, but we don't want to go there. <br>\nIn general instance vs type can be known from the context. <br>\nSystems don’t track it.<br>\nSo in the end a problem in theory but not in practice.</p>\n<p>Device vs DeviceDefinition. Here there is a clear distinction, instance vs type. But in fact both resources are virtually identical. <br>\nI would prefer them to be collapsed into one, and either allow the context to work itself out (probably) or have a \"definition\" flag (probably not).</p>\n<p>MedicinalProductDefinition is a \"detailed\" version of Medication, and one that is only a type not an instance. <br>\nMaybe ideally Medication would have been a profile of it. But with (mostly) different usage communities, and practical issues around the vastly numerically more common use needing to be as simple as possible (Medication), what we have was agreed (very much across workgroups, and FMG) as the best - least worst - solution.</p>\n<p>I don't see a need for CatalogueEntry because it seems better just to have a List of the actual resources, e.g. DeviceDefinitions, NutritionProducts for example.  </p>\n<p>Anything else - specifically - needs a fix? </p>\n<p>At the end of the day the implementers are the ones who decide, less so the methodologists. If people take these resources and build working software, that is a good sign, and that is in fact the FHIR methodology.</p>",
        "id": 205673914,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1596274684
    },
    {
        "content": "<p>Hi Rik. My question is where are these discussions taking place? I see you mention several points that we've discussed a few times. <br>\nSeveral years ago we started discussing \"kind vs instance\" and there was no specific place. Eventually OO took that and had been addressing Product discussions since.<br>\nMy preferences are similar to yours, but even if we think alike, if we work in different silos we will eventually diverge. I am looking at catalogs and supply, and identification of products (not only IDMP but including it). You have the regulatory aspects in sight.</p>",
        "id": 205674532,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1596275876
    },
    {
        "content": "<p>BTW, I agree with most of your details above but I disagree on others - but the point is - where should those discussions being handled? I would assume in 2 places: FHIR-IWorkflow has a Product pattern, would benefit from feedback. And we have a Product call on mondays.</p>",
        "id": 205674660,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1596276023
    },
    {
        "content": "<p>and it's not a matter of not agreeing or disliking some designs: <br>\nI didn't like the design of the initial IDMP resources, but I appreciate how they evolved. Same with MedicationKnowledge. <br>\nI'd have made different mistakes - and most likely i'd have been wrong, hence my appreciation for common discussions.</p>",
        "id": 205674733,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1596276186
    },
    {
        "content": "<p>4-5 years ago we did not see a need for \"kind vs instance\". Now we have it implemented differently.<br>\nSame with product catalogs and product definitions.</p>",
        "id": 205674796,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1596276287
    },
    {
        "content": "<p>We've tried to put those under the Product discussions. That is the point - we can and should iterate freely, but how do we align internally? I'm assuming the existin discussions are an OK place, but I may be mistaken.</p>",
        "id": 205674884,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1596276479
    },
    {
        "content": "<p>So it's about whether and how to discuss, not about particular issues. <br>\nAnd I suggest that everything that is Product-related (not the specifics like meds, or devices, or nutrition) continues to be discussed on the monday calls (and perhap a dedicated stream on Zulip?)</p>",
        "id": 205675197,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1596277044
    },
    {
        "content": "<p>A lot of the conversations were held over the course of a year or so, at meetings of Pharmacy, BR&amp;R, O&amp;O, DSS and FMG. </p>\n<p>Now we raise Jira tickets and discuss them on conference calls.</p>\n<p>Those are the places. And we can and do continue to talk on here, of course. </p>\n<p>If there are issues to discuss that are not getting the right audience why not suggest an agenda, with specific addressable items, for some joint workgroup calls?</p>\n<p>\"You have the regulatory aspects in sight\".<br>\nThat is a part of it, but the resources are \"medication definition\", and that includes identification, and the scope is not solely regulatory, but also pharmacopoeias etc., or any situation where you need to describe all the details of a medicinal products.</p>\n<p>\"IDMP resources\"<br>\nThere are no IDMP resources, only resources that have IDMP concepts in scope but are not limited to IDMP.</p>",
        "id": 205680660,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1596287183
    },
    {
        "content": "<p>Cross product family issues at O&amp;O seems a good fit, that is where we have discussed this before.</p>",
        "id": 205682299,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1596289821
    },
    {
        "content": "<p>Let's continue in OO then. I will ask in the next Product call when to meet - that was my question - how do we collaborate more smoothly and frequently.</p>",
        "id": 205682794,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1596290536
    },
    {
        "content": "<p>From a governance perspective, if we think there's a general rule that should apply across design in multiple resources, MnM is the place that should happen.  The FMG then vets the proposed rules from MnM and the proposed patterns from FHIR-I and decides how tightly to mandate them.  Ideally we can detect variation with tooling that catches stuff in the build.  The conversations and debates happen here on Zulip, via Jira, and at joint calls/meetings.</p>",
        "id": 205683491,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1596291588
    },
    {
        "content": "<p>I will bring it up in a OO call to catch up with what's out there. I presume then that <span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span> would wants / accept some of the resources in Medication definition to be added to that mix to that we can at least spot inconsistencies if any or learn from those resources.<br>\nI'm not too worried with the content, only with how easy it is to miss something important given all that's happening.<br>\nMaybe we have to revisit some resource scope proposals. <br>\nI understand that we can feed any info to MnM after discussing.</p>",
        "id": 205684762,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1596293666
    },
    {
        "content": "<p>About governance still, I'd add one suggestion (i mentioned it before): As this gets more mature, we should look at design validation. Looking at our designs, prove they meet the use cases, and they don't add unnecessary risks, etc.</p>",
        "id": 205684849,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1596293801
    },
    {
        "content": "<p>There are inconsistencies, and there are overarching things, such as how to make a list of products and what is an instance and what is a type. I think Jose you mean the latter, but Lloyd means the former - also important, but not what I thought the issue at hand was. <br>\nAll the MedDef resources are of course in scope of any MnM rules, which we already try to keep up with e.g. the switch to all CodeableConcept, and preferring CodeableReference to a choice of code|reference. That isn't where we need O&amp;O to decide perhaps, but all input welcome.</p>",
        "id": 205685461,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1596294744
    },
    {
        "content": "<p>(if those resources want to be used also for devices, perhaps that diverges from the initial scope . I'm not worried with the types and minor inconsistencies. It's more: we start designing a car and separetly a bike. All that looks fine. 2 years later, the car designers say \"we may abandon our requirement to not have 4 wheels\". and the bikers go \"we don't need to be engine-free\". Especially when someone was trying to say \"hey, what about motorcycles\"? and now we have 2 of them - which is fun, but that motorcycles guy now has to spot the same things that would have been avoided).</p>",
        "id": 205685849,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1596295429
    },
    {
        "content": "<p>Obviously, this is not a critique (and sorry Keith for the \"motorcycle guy\", it's obviously not you) but a challenge to see what can we do better</p>",
        "id": 205685890,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1596295473
    },
    {
        "content": "<p>Design validation is hard given that resources are supposed to be use-case agnostic.  The best we can do is checking that the resources don't make common use-cases hard or impossible.  And even then, not sure how you'd formally validate that.  Historically, HL7 has relied on ballot review to identify issues/flaws/inconsistencies.  If there are proposals for better/additional ways, certainly open to that.</p>",
        "id": 205686756,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1596297081
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191832\">@Jose Costa Teixeira</span> devices in product packages has always been in scope and does not conflict with Device/DeviceDefinition.</p>",
        "id": 205686960,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1596297435
    },
    {
        "content": "<p>I alread have an answer on the question on methodology, so, on that detail:<br>\nI'm looking for devices without relation to medication. Say a stent, or a catheter, or a pacemaker, or an infusion pump without any medication associated</p>",
        "id": 205687374,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1596298088
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179165-committers/topic/Product.20discussions.20.2B.2B/near/205686756\">said</a>:</p>\n<blockquote>\n<p>Design validation is hard given that resources are supposed to be use-case agnostic.</p>\n</blockquote>\n<p>It's always hard, especially because all designs should not be too tight to a few specific use cases.  And if /however we do it, it should be lean.</p>",
        "id": 205687670,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1596298544
    },
    {
        "content": "<p>Perhaps </p>\n<ol>\n<li>\n<p>the devices in product packages should just clearly state that they are only to be used if there is a medication involved in that definition. (which I'd challenge, I'd want it broader) <br>\nor </p>\n</li>\n<li>\n<p>We say that we realise these resources can be used beyond their initial scope - and in which case I suggest the process should include an impact /scope check - and discussing with the OO group that works on that to see if that is still ok</p>\n</li>\n</ol>",
        "id": 205687918,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1596298882
    },
    {
        "content": "<p>I assume you mean for 1 that we need to decide if that is allowed or not and document it. I agree. It is allowed now by the model and always has been. </p>\n<p>Some jurisdictions may want to treat devices as products, for consistency, so I don't see why not. It may appear to clash with the Device/DeviceDefinition resources, but I don't think so. Equally, I don't see that this would be very common.</p>\n<p>For 2, you have your answer about methodology already.</p>",
        "id": 205689479,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1596301219
    },
    {
        "content": "<p>TBD in the OO call</p>",
        "id": 205693195,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1596307167
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span> would you happen to know if this link <a href=\"https://www.ema.europa.eu/en/documents/regulatory-procedural-guideline/substances-products-organisations-referentials-spor-spor-api-v2-specification_en.pdf\">https://www.ema.europa.eu/en/documents/regulatory-procedural-guideline/substances-products-organisations-referentials-spor-spor-api-v2-specification_en.pdf</a> is the closest thing there is to a IDMP FHIR IG?</p>",
        "id": 208952758,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1599132628
    },
    {
        "content": "<p>yes it is. There is also the accompanying field by field \"IG\": <a href=\"https://www.ema.europa.eu/en/documents/regulatory-procedural-guideline/product-management-services-implementation-international-organization-standardization-iso-standards_en.pdf\">https://www.ema.europa.eu/en/documents/regulatory-procedural-guideline/product-management-services-implementation-international-organization-standardization-iso-standards_en.pdf</a></p>",
        "id": 208954646,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1599133732
    }
]