[
    {
        "content": "<p>1. Can a profile be used by multiple resources?</p>",
        "id": 153880093,
        "sender_full_name": "Julie Evans",
        "timestamp": 1490718186
    },
    {
        "content": "<p>2. Can an extension be used by more than one profile (that isn't based on the same resource)? Thanks.</p>",
        "id": 153880094,
        "sender_full_name": "Julie Evans",
        "timestamp": 1490718237
    },
    {
        "content": "<p>1. Which resources? <br>\n2. Sure - if the extension definition can operate in those resource types (context)...</p>",
        "id": 153880150,
        "sender_full_name": "David Hay",
        "timestamp": 1490731740
    },
    {
        "content": "<p>1. In general, can a profile be used by multiple resources - no particular resources in mind.  </p>",
        "id": 153880420,
        "sender_full_name": "Julie Evans",
        "timestamp": 1490899670
    },
    {
        "content": "<p>2. Not clear on what you mean by \"if the extension definition can operate in those resource types (context)\". Would you mind giving me an example? Thanks!</p>",
        "id": 153880421,
        "sender_full_name": "Julie Evans",
        "timestamp": 1490899732
    },
    {
        "content": "<p>A profile can be referenced by multiple resource instances.  A profile can only apply to a single resource or data type though - you can't define a profile on Observation and then apply it to Procedure, for example.</p>",
        "id": 153880430,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1490900735
    },
    {
        "content": "<p>1. A profile is a 'profile on a resource' and other resources may refer to a resource of the type addressed by a profile. For example, Latvia may create a nation profile on Patient, then in their implementation guides on other resources wherever the Patient resource is referred to they indicate to use the Latvian profile on Patient.<br>\n2. While some extensions are resource-specific, others such as 'race' or 'birthplace' or a 'non-Gregorian calendar' may be appropriate to use on many resources.  Essentially it would be appropriate to use an extension wherever the context in the resource matches the defined context-of-use of the extension.</p>",
        "id": 153881075,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1491459699
    }
]