[
    {
        "content": "<p>Hi Guys,</p>\n<p>After a slightly spluttery start I think we’ve got a process that will work for the review.</p>\n<p><strong>If you are a reviewer:</strong><br>\nComplete the review and return the document to me, preferably indicating the resources that your review covered (saves me from looking this up!). If you’re not sure, just let me know &amp; I’ll take it from there.</p>\n<p>What I will do is to copy the reviewed document into a shared folder (within dropbox) for the owning committee/s.</p>\n<p><strong>If you are a committer:</strong><br>\nContact me to get a login for your shared folder (Actually, it will be to the ‘root’ of the shared folders – you can access any of them). There's a 'readme' in the root with a list of resources/committee</p>\n<p>As documents appear in ‘your’ folder (ie the committee you are working for) then process them, and mark them as being complete by prefixing the filename with DONE. That way we can keep an eye on progress, but also have a (rather primitive) audit trail of changes.</p>\n<p>I’ll do my very best to be as accurate as possible, but if you think I’ve made a mistake then either contact me, or copy the file into the appropriate committee folder.</p>\n<p>Happy to consider enhancements to this, but I think the overall process is OK, and we do need to get on with the review.</p>\n<p>BTW – if you are a reviewer, but you’re confident that you know where a document should go then feel free to copy directly into the committee folder (adding your name to the filename to avoid collisions) – contact me for a login. I'm happy to do this though...</p>\n<p>And again, thanks for helping out with this! We’ll look to streamline it a bit for the next release!</p>\n<p>Cheers...</p>",
        "id": 153874473,
        "sender_full_name": "David Hay",
        "timestamp": 1488483272
    },
    {
        "content": "<p>Looking to help with applying QA, how can I tell when something's been started? Or do I assume anything not marked done_ is fair game?</p>",
        "id": 153877882,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1489785308
    },
    {
        "content": "<p>for fhir-i yes that is the case</p>",
        "id": 153877883,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1489785571
    },
    {
        "content": "<p>BTW - If you need access to the review documents - reach out to me or lloyd - you need an invite from the site to access it...</p>",
        "id": 153877911,
        "sender_full_name": "David Hay",
        "timestamp": 1489793380
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191370\">@Richard Ettema</span>  if you are working on FHIR-I QA make sure you  prepend the file in the folder with \"pending_\"  while you are applying the change so we don't work on the same thing twice.  when done then rename the file to \"done_\"</p>",
        "id": 153878006,
        "sender_full_name": "Eric Haas",
        "timestamp": 1489864381
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> Done. Thanks for the reminder.</p>",
        "id": 153878010,
        "sender_full_name": "Richard Ettema",
        "timestamp": 1489865271
    }
]