[
    {
        "content": "<p>Just double-checking, changes from reconciliation for R4B ballot comments can be applied to the R4B branch, yes?</p>",
        "id": 243088777,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1623966085
    },
    {
        "content": "<p>y</p>",
        "id": 243088882,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1623966136
    },
    {
        "content": "<p>For the Citation resource specifically, can the changes from R5 be applied to R4B?</p>",
        "id": 243093138,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1623968746
    },
    {
        "content": "<p>without being balloted as part of R4B?</p>",
        "id": 243093662,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1623969041
    },
    {
        "content": "<p>Trying to figure that out, I don't think so.</p>",
        "id": 243094223,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1623969386
    },
    {
        "content": "<p>The challenge is Citation structure has evolved significantly but it doesn't look like the changes in R5 since R4B are supported by ballot comments on R4B.</p>",
        "id": 243094261,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1623969421
    },
    {
        "content": "<p>well, i think that needs committee opinion, and FMG decision making. I'm not making any ruling on that</p>",
        "id": 243094317,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1623969467
    },
    {
        "content": "<p>Makes sense</p>",
        "id": 243094390,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1623969505
    },
    {
        "content": "<p>To provide some context:</p>\n<ol>\n<li>Shortly after the due date for R4B freeze the Citation Resource had a near-complete restructuring as CDS WG revisited the Resource Proposal and triggered the message to send the Resource Proposal to FMG.</li>\n<li>There is an R4B Ballot comment (<a href=\"http://jira.hl7.org/browse/FHIR-31865\">FHIR-31865</a>) created 2021-04-13 to not have Citation in FHIR. The FMG provisionally approved Citation Resource proposal on 2021-04-14 with the discussion noting addition to description to distinguish use from Provenance Resource. Comments in <a href=\"http://jira.hl7.org/browse/FHIR-31865\">FHIR-31865</a> notes this change in <a href=\"http://jira.hl7.org/browse/FHIR-31973\">FHIR-31973</a> which was applied to R5 and the phrasing aligns with Citation Resource structure in R5.  The R4B Ballot comment <a href=\"http://jira.hl7.org/browse/FHIR-31865\">FHIR-31865</a> was resolved as Not Persuasive with Modification on 2021-05-05.</li>\n<li>Another R4B Ballot comment (<a href=\"http://jira.hl7.org/browse/FHIR-31643\">FHIR-31643</a>) seeks an example for the Citation Resource.  There are no comments yet and that ballot tracker could be used to propose the following concepts as a proposed disposition.</li>\n<li>There is no expectation from any group to use or develop the current R4B version  of the Citation Resource and there is substantial use and development of the current  R5 version of the Citation Resource.  There is no interest in creating an example for the R4B version that will not be used, and we have hundreds of examples that could be added for the R5 version.</li>\n<li>SOA WG for the FAIR4FHIR project voted at the WGM to seek an IG using R4B but would like to use the R5 version of Citation rather than the R4B version in this IG. We agreed in the SOA meeting to bring this issue to CDS and FMG to see what we could do.  CDS has not met on this yet as there have not been meetings since the WGM.</li>\n<li>For the EBM community that is new to using FHIR Resources for new spaces (Citation, Evidence, EvidenceReport, EvidenceVariable) where the R4B version of Citation is neither used nor supported (and is at maturity level 0), it would be much better to remove it than have it out there to cause confusion and non-interoperable system developments</li>\n<li>With all these considerations the proposed resolution in order of preference could be:<br>\na. Replace the R4B version of Citation with the R5 version of Citation and document whatever is necessary for explanation in the \"Trial Use Note\" so the change is explicit and compliant with any ANSI or other expectations.  It may not be the balloted version but let it be stated explicitly and the change is part of response to balloted comments.<br>\nb. Replace the R4B version of Citation with a note to direct people to the R5 version of Citation and not have an R4B version of Citation.<br>\nc. Place a note at the top of the R4B version of Citation stating it will not be maintained or supported and users should consider the R5 version of Citation to use the resource.  Citation is not really supported in R4.<br>\nd. Keep it in R4B but add a note that examples and refinements will only be applied if implementers identify that they are using it, aware of the issues above, and have specific reason to use it in R4.</li>\n</ol>",
        "id": 243250776,
        "sender_full_name": "Brian Alper",
        "timestamp": 1624110392
    },
    {
        "content": "<p>well, it's a process question, so TSC has jurisdiction. There's no technical reason why not to copy the R5 structure over to R4B</p>",
        "id": 243267603,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1624134685
    },
    {
        "content": "<p>Process-wise, you're allowed to make substantive (and even breaking) changes as part of ballot resolution, but there's an expectation that what's published is largely consistent with what went to ballot.  If you're making radical changes, then the expectation is that you go back to ballot.</p>",
        "id": 243721816,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624487878
    },
    {
        "content": "<p>Obviously going back to ballot here is going to create some angst within the BR&amp;R group as the whole point of R4B was to have a 'quicker' release than they could achieve with R5.  In theory you could get in an NIB for Sept. ballot cycle and get this out and reviewed again, but we don't have a way to publish an R4 release.  However, we might be able to make an exception and just send people to some sort of frozen snapshot of the CI build if you promise to not make changes to that page for the duration of the ballot?  (Reality is we can't put out formal publication of R4B until end of Sept. anyhow, so a ballot in August might not delay publication.)  <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> - thoughts?</p>",
        "id": 243722110,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624488105
    },
    {
        "content": "<p>well, one would hardly expect a ballot reconciliation to be that quick</p>",
        "id": 243731511,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1624496470
    },
    {
        "content": "<p>I think it's possible we could get another ballot for R4B out while I'm on the road - that's a much lower mountain to climb than a full release for many reasons</p>",
        "id": 243731544,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1624496509
    },
    {
        "content": "<p>I certainly would rather avoid balloting again though. BR&amp;R &amp; TSC have to decide what's 'radical changes' but I think that on the whole the processes we have exist to stop committees doing this kind of thing</p>",
        "id": 243731612,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1624496590
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  and <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  I fully share your concerns in term of process and deadlines. <br>\nI was however also wondering what should be the changes that would require a new ballot for a draft resource (FMM 0). <br>\nI don't see here - for example - any change in scope, but  a better way to address the business requirements that have been identified during this period. <br>\nI was also wondering  if in general it is worth to publish a version that might be somehow used by stakeholders or a thing that born dead. (without creating burden and delays in the publication)</p>",
        "id": 243937363,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1624637596
    },
    {
        "content": "<p>There's no point publishing something born dead.  Definitely not asking for that.  Just saying that if there's a complete revamp of a resource between what was commented on at ballot and what is eventually published, we can't legitimately call the published thing as 'balloted as STU'.</p>",
        "id": 243977342,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624659541
    },
    {
        "content": "<p>I see three possibilities:</p>\n<ul>\n<li>determination made that the changes aren't sufficiently radical to invalidate the ballot review that's happened; proceed to publish as STU</li>\n<li>determination made that the changes <em>are</em> sufficiently radical<br>\n-- go back to ballot, then publish as STU<br>\n-- don't go back to ballot, publish as draft, and go STU in R5</li>\n</ul>",
        "id": 243977456,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624659630
    },
    {
        "content": "<p>The Citation Resource in R4B is not valid to be presented as a standard for trial use. The issue is a desire by FAIR4FHIR project to create an IG where there is a desire to use R4 for the IG to allow an earlier IG but also a desire to use the R5 version of Citation.</p>",
        "id": 244024534,
        "sender_full_name": "Brian Alper",
        "timestamp": 1624727284
    },
    {
        "content": "<p>Which of the three options above do you want to pursue?</p>",
        "id": 244034025,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624741081
    },
    {
        "content": "<p>Seems like publishing the updated content from R5 but as draft in R4B makes the most sense and provides the most continuity and options.</p>",
        "id": 244080639,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1624821318
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191359\">Bryn Rhodes</span> <a href=\"#narrow/stream/179165-committers/topic/R4B.20Changes/near/244080639\">said</a>:</p>\n<blockquote>\n<p>Seems like publishing the updated content from R5 but as draft in R4B makes the most sense and provides the most continuity and options.</p>\n</blockquote>\n<p>I agree... <br>\nto summarize a reasonable solution might be : Citation included in 4b with FMM 0 and the content updated from R5.</p>",
        "id": 244110419,
        "sender_full_name": "Giorgio Cangioli",
        "timestamp": 1624865626
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> If we replace the R4B version of Citation with the R5 content (FMM 0), would it be acceptable for FAIR4FHIR IG to ballot the IG using R4B?  Can that be done if the R4B itself is not sent back to ballot and is considered published as draft?</p>",
        "id": 244279207,
        "sender_full_name": "Brian Alper",
        "timestamp": 1624973008
    },
    {
        "content": "<p>You can ballot against R4B.  What you can't generally do is call profiles against draft core content STU in the IG.</p>",
        "id": 244279451,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624973093
    },
    {
        "content": "<p>If Citation content is replaced in R4B and not a \"profile\" does this solve the problem?</p>",
        "id": 244279576,
        "sender_full_name": "Brian Alper",
        "timestamp": 1624973149
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  If Citation content is replaced in R4B and not a \"profile\" does this solve the problem?</p>",
        "id": 244279960,
        "sender_full_name": "Brian Alper",
        "timestamp": 1624973271
    },
    {
        "content": "<p>I was referring to a FAIR4FHIR profile.  If FAIR4FHIR is using Citation, I assumed they'd profile it.  If they don't profile it, no impact.</p>",
        "id": 244284684,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1624975065
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> So we can now replace the R4B Citation content with the R5 Citation content, and FAIR4FHIR can use it in descriptive terms with no impact if they do not profile it. Does this need approval by FMG or TSC, or is this sufficient for us to make the changes?</p>",
        "id": 244630572,
        "sender_full_name": "Brian Alper",
        "timestamp": 1625175768
    },
    {
        "content": "<p>If you're comfortable dropping the status of the artifact from STU to draft, you're fine to make the change.  If you wanted to keep it as STU, FMG might need to evaluate how substantive the changes were.</p>",
        "id": 244631518,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1625176400
    }
]