[
    {
        "content": "<p>Is there planned to be a point version of R5 for the September WGM? (or 4.1 or whatever it would be)</p>",
        "id": 174896929,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1567613384
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span></p>",
        "id": 174899228,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1567615111
    },
    {
        "content": "<p>I had no plan for that</p>",
        "id": 174917674,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1567627485
    },
    {
        "content": "<p>What my project could do with is a cut of the reference implementations that supports the work done since December. Ideally that would be pinned to some labelled release, and I was expecting September (only just noticed there was not May either...). Currently hapi for instance has nothing done this year, and no plan to have it rolled in any time very soon.</p>",
        "id": 174918406,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1567627995
    },
    {
        "content": "<p>I think others will definitely be interested in using this, too (either in the Connectathon or beyond it) - but the time before Atlanta is now quite short.</p>",
        "id": 174919606,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1567628787
    },
    {
        "content": "<p>HAPI is about to be updated</p>",
        "id": 174919641,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1567628814
    },
    {
        "content": "<p>For me Atlanta timeframe itself isn't necessary. Would definitely use the HAPI update. Would be great if it was tied to something slightly more concrete than a build number. I appreciate that a full (point) release is not a trivial undertaking.</p>",
        "id": 174920193,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1567629165
    },
    {
        "content": "<p>Also, if not September, can I ask if one is planned for January 2020? That would give some reassurance that there will be an online version to point at in the not too distant future.</p>",
        "id": 174936136,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1567645083
    },
    {
        "content": "<p>yes we will expect to start milestones from then on as we march towards R5</p>",
        "id": 174937435,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1567647296
    }
]