[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <br>\nThe Contributor DataType was created to be used in multiple resources. But other group(s?) (maybe it was just the CDS WG) decided that it would be better to replace it with other elements instead of Contributor so they planned to phase it out and remove Contributor from FHIR altogether. The last resource that used it was the Evidence resource, which Contributor is now removed from. And now it says \"Contributor is used in the following places: (not used as yet)\" for that DataType. </p>\n<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> referred me to ask for permission first. Can I remove the Contributor DataType from the FHIR build and then make a pre-applied Jira FHIR tracker item to the FHIR-I WG?</p>\n<p><a href=\"http://build.fhir.org/metadatatypes.html#Contributor\">http://build.fhir.org/metadatatypes.html#Contributor</a><br>\nAnd I believe the ContributorType value set would also be removed in this process: <a href=\"http://build.fhir.org/valueset-contributor-type.html\">http://build.fhir.org/valueset-contributor-type.html</a></p>",
        "id": 206807139,
        "sender_full_name": "Khalid Shahin",
        "timestamp": 1597320753
    },
    {
        "content": "<p>I don't think that you should remove it. There's additional discussion about it, so leave it in</p>",
        "id": 206807312,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1597320875
    },
    {
        "content": "<p>That additional discussion doesn't currently haven an official home, so we're going to hijack this thread for that discussion.  Specifically: there is a proposal to remove the ContributorType data type from the FHIR spec on the grounds that it's no longer used as part of the knowledge resource pattern and \"best practice\" is to have distinct, independently constrainable elements for relevant participants.  Does anyone see a reason why we should retain the type?</p>",
        "id": 207884765,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1598296691
    },
    {
        "content": "<p>Speaking of stale trackers, I have it on my list to remove this type as the resolution for <a href=\"https://jira.hl7.org/browse/FHIR-21220\">21220</a>, but this conversation is newer than the resolution date on that tracker. Should we re-open that tracker and leave the Contributor type, or should I follow through with applying this tracker?</p>",
        "id": 254132290,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1632179372
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 254132304,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1632179381
    },
    {
        "content": "<p>Well, given that the conversation is now over a year old and, as yet, no one has spoken in favor of keeping contributor, it seems that following through on both this tracker and yanking 'contributor' is completely in order.</p>",
        "id": 254138583,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632183554
    }
]