[
    {
        "content": "<p>Did I miss an announcement related to \"removing UTG Content from core build\"?  Following <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> 's changes a couple weeks ago, <a href=\"https://github.com/HL7/fhir/commit/5c0494aacfd0b8bd52bc72c587aa89d0a64246f8#diff-7d6112d906f06fde02ecf08edc8a67c8\">https://github.com/HL7/fhir/commit/5c0494aacfd0b8bd52bc72c587aa89d0a64246f8#diff-7d6112d906f06fde02ecf08edc8a67c8</a>, it seems like the codesystem files have been removed from the source resource folders.  Are work groups still able to update the code systems?  If so, how?  For example, I am trying to apply <a href=\"http://jira.hl7.org/browse/FHIR-26464\">J#26464</a> to update the definitions of codes, but I can't find the codesystem file that I would have previously edited.</p>",
        "id": 210773358,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1600709255
    },
    {
        "content": "<p>you have to work through the UTG process now</p>",
        "id": 210773993,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1600709527
    },
    {
        "content": "<p>Can you help me locate the process documentation?<br>\nI found <a href=\"https://confluence.hl7.org/display/VOC/UTG+Education+and+Rollout+Plan\">https://confluence.hl7.org/display/VOC/UTG+Education+and+Rollout+Plan</a>, but that page is pretty recent, so I'm not sure if they have rolled out the education yet.</p>",
        "id": 210776048,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1600710565
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span></p>",
        "id": 210776151,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1600710606
    },
    {
        "content": "<p>Pharmacy has a number of codesystems and value sets that we were going to work on during the WGM.  We will document these in our notes but we obviously will need to learn how to create/modify needed code systems.</p>",
        "id": 210811299,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1600729574
    },
    {
        "content": "<p>so some pointer to the process would be nice.  There is some information on the UTG Confluence pages, but I'm not sure where to start and it looks daunting</p>",
        "id": 210811729,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1600729944
    },
    {
        "content": "<p>if some other WG has done this, that would be great to know their experience</p>",
        "id": 210811806,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1600730032
    },
    {
        "content": "<p>ths simplest way for now is to get a copy of UTG - it's a FHIR IG - and just do what you were going to and build UTG locally. it takes about the same time as the main build anyway</p>",
        "id": 210822133,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1600740633
    },
    {
        "content": "<p>or work in a brnach and commit the branch to github, and the ci-build will publish it</p>",
        "id": 210822145,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1600740658
    },
    {
        "content": "<p>if we make changes/additions to exemplar code systems (i.e. code systems that are created purely to show the types of concepts to use on a coded field in core), will we need to go through the whole UTG approval process?</p>",
        "id": 210822219,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1600740736
    },
    {
        "content": "<p>Those code systems probably shouldn't be in UTG because they're not 'real' codes - though the name of the code system should make that clear</p>",
        "id": 210822532,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600741249
    },
    {
        "content": "<p>hmm, it looks like all code systems where brought lock, stock, and barrel into UTG</p>",
        "id": 210823023,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1600742044
    },
    {
        "content": "<p>It was according to the long standing UTG agreement, where the only code systems that remain in FHIR are those used in a required binding to a element of type code - those stay in FHIR; everything else goes to UTG</p>",
        "id": 210823050,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1600742129
    },
    {
        "content": "<p>Stuff should have only gone to UTG if it was FMM3+</p>",
        "id": 210823233,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600742476
    },
    {
        "content": "<p>The stuff that's FMM2 and below is often temporary throw-away stuff</p>",
        "id": 210823240,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600742490
    },
    {
        "content": "<p>E.g. stuff that might result in a new LOINC or SNOMED code - once we're sure of what we want and it actually makes sense to ask...</p>",
        "id": 210823262,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600742524
    },
    {
        "content": "<p>The problem with locking all this stuff into UTG now is we've got a bunch of codes that are now 'official' and have to be maintained as such, even though they shouldn't be</p>",
        "id": 210823288,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600742571
    },
    {
        "content": "<p>Granted, a bunch of the v3 stuff is similarly immature, so it's not like the junky FHIR codes will be in poor company...</p>",
        "id": 210823300,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600742604
    },
    {
        "content": "<p>i would also have argued that code systems that are created purely to provide example codes should never have gone into UTG</p>",
        "id": 210823303,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1600742605
    },
    {
        "content": "<p>That wasn't the in the scope of the agreement. Maybe it should have been. But if something is used as an example or is experimental, then UTG governance should be appropriate</p>",
        "id": 210823352,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1600742667
    },
    {
        "content": "<p>it it turns out that this isn't possible, then I'll support defining examples and drafts elsewhere</p>",
        "id": 210823361,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1600742705
    },
    {
        "content": "<p>np, i understand.  now we (core spec committers) just need to figure out how to manage the UTG process</p>",
        "id": 210823363,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1600742709
    },
    {
        "content": "<p>well, that was necessary anyway.</p>",
        "id": 210823367,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1600742731
    },
    {
        "content": "<p>is this going to apply to HL7 FHIR IGuides as well?</p>",
        "id": 210823374,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1600742751
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191316\">Grahame Grieve</span> <a href=\"#narrow/stream/179165-committers/topic/Removing.20UTG.20Content.20from.20core.20build/near/210823361\">said</a>:</p>\n<blockquote>\n<p>it it turns out that this isn't possible, then I'll support defining examples and drafts elsewhere</p>\n</blockquote>\n<p>I'm sure it will be possible, I'm more worried about the timing/effort to create content that is never intended to be official.  Time will tell...</p>",
        "id": 210823481,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1600742921
    },
    {
        "content": "<p>That's an open discussion. It looks to me, based on current discussion, that, </p>\n<ul>\n<li>\n<p>for ValueSets, IGs will be able to define their own value sets, but shared ones will be in UTG. note, though, that HTA has jurisdiction over external code system usage</p>\n</li>\n<li>\n<p>for Code systems, I don't yet have a sense of that. IG authors would like to be able to do whatever they want, but I think that an additional quality process is justified for non-draft/experimental code systems. Whether that's UTG... I'm not clear yet</p>\n</li>\n<li>\n<p>for Concept Maps: we haven't had enough discussion for me to have any sense about this</p>\n</li>\n</ul>",
        "id": 210823557,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1600743029
    },
    {
        "content": "<blockquote>\n<p>I'm sure it will be possible</p>\n</blockquote>\n<p>I meant: If it isn't possible to have appropriate governance for experimental / draft value sets &amp; code systems</p>",
        "id": 210823570,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1600743074
    },
    {
        "content": "<p>ah, then we meant the same thing.  we are on the same page. :)</p>",
        "id": 210823576,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1600743096
    },
    {
        "content": "<p>Part of the issue is that FHIR itself hasn't had great governance over experimental/draft artifacts.  We don't properly differentiate what's fake/temporary/work-in-progress from what's well baked and stable.  (In my IGs I've recently started dumping all my 'temp' codes into a single code system with the id 'temp' and a description that makes very clear that \"these codes are expected to move somewhere official, once we're sure that a) they say what we want; and b) that we gain consensus on where the appropriate long-term home is\".  I suspect that the vocab WG would be much less anxious about a single massive FHIR 'temp' code system full of miscellaneous junk.  We could then enforce a build rule that artifacts with FMM3+ weren't allowed to point to 'temp'.</p>",
        "id": 210823799,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600743425
    },
    {
        "content": "<p>The IG-publisher could force something similar - at least for IGs using the HL7 template.</p>",
        "id": 210823810,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600743474
    },
    {
        "content": "<p>Time allowing, we could perhaps discuss on the joint call.</p>",
        "id": 210823856,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600743493
    },
    {
        "content": "<p>that is another concern - how to do experimental/draft.  Slightly different from my worry around governance of example codes.</p>",
        "id": 210823869,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1600743532
    },
    {
        "content": "<p>dang it, now I'm going to want to go to the Vocab/MnM joint :)</p>",
        "id": 210823874,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1600743547
    },
    {
        "content": "<p>One of the other challenges with our mass migration is that some of that stuff probably <em>should</em> be in LOINC</p>",
        "id": 210823877,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600743550
    },
    {
        "content": "<p>We could say that example bindings to temp are always fine</p>",
        "id": 210823881,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600743573
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span> this is definitely something we need to talk about</p>",
        "id": 210823928,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1600743606
    },
    {
        "content": "<p>The fact that the code system URL says \"<a href=\"http://...../tempCodesDoNotUse/\">http://...../tempCodesDoNotUse/</a>...\" would hopefully discourage use in production... :)</p>",
        "id": 210823929,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600743612
    },
    {
        "content": "<p>Something similar might be appropriate.  But a large \"grab bag\" code system full of draft / experimental \"junk\" sounds fairly frightening, actually!</p>",
        "id": 210823930,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1600743613
    },
    {
        "content": "<p>Agree that url may help.</p>",
        "id": 210823941,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1600743640
    },
    {
        "content": "<p>Less frightening than a bunch of individual code systems that look legit but are in fact still junky?</p>",
        "id": 210823943,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600743648
    },
    {
        "content": "<p>that would be an interesting switch - right now, we keep creating code systems with the example codes and then a value set that is just \"all codes in this fake code system I just made\".  if we could make a \"grab bag\" code system that had hierarchy, that might be more manageable.  (said with my user voice that asserts anything I don't understand must be easy)</p>",
        "id": 210823957,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1600743684
    },
    {
        "content": "<p>The \"doNotUse\" would be a bit strong - perhaps one for example only?  The low-maturity ones we'd actually want to be used, just for implementers to be aware that we're going to switch them at some point, so be ready and don't whine when that happens.</p>",
        "id": 210823966,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600743712
    },
    {
        "content": "<p><a href=\"http://hl7.org/fhir/examples/CodeSystem/xxx\">http://hl7.org/fhir/examples/CodeSystem/xxx</a></p>",
        "id": 210824012,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1600743757
    },
    {
        "content": "<p>we could allow that and enforce that they are marked experimental = true</p>",
        "id": 210824019,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1600743778
    },
    {
        "content": "<p>And prohibit value sets that draw from them from having a binding strength other than example?</p>",
        "id": 210824073,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600743862
    },
    {
        "content": "<p>For examples, I'd actually like the URL to say \"examples-do-not-use\".  I'm concerned that \"examples\" isn't concrete enough to stop people from using them in production.</p>",
        "id": 210824095,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600743912
    },
    {
        "content": "<p>i suspect that even \"examples-do-not-use\" won't be enough <span aria-label=\"grinning\" class=\"emoji emoji-1f600\" role=\"img\" title=\"grinning\">:grinning:</span></p>",
        "id": 210824103,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1600743943
    },
    {
        "content": "<p>making warnings in the validator seems to be enough for many people. OTOH, nothing is enough for some</p>",
        "id": 210824150,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1600743986
    },
    {
        "content": "<p>Not all folks in production will use the validator.  I'm just worried about those who copy &amp; paste from example instances and use that as the basis for their code.  Inevitably, some of the codes will make it into production.  However, when we point to the \"do-not-use\" in the code system URL, I'm hoping they'll have the good grace to at least look sheepish...</p>",
        "id": 210824972,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600745307
    },
    {
        "content": "<p>What about <a href=\"http://example.com/blah/\">http://example.com/blah/</a>....</p>",
        "id": 210837926,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1600761535
    },
    {
        "content": "<p>Sorry I have not been on this thread been buried with other burning crises...where to begin...we have both the flag for experimental and the version ID element to clearly and processably indicate whether something is 'temporary' or not.     The UTG system and process is live, about a half dozen proposals have gone completely through the consensus process and been implemented to the source of truth for the UTG ci build.    The documentation for everything is on Confluence, and it would probably be best to start at <a href=\"https://confluence.hl7.org/display/VOC/Vocabulary+Maintenance+at+HL7\">https://confluence.hl7.org/display/VOC/Vocabulary+Maintenance+at+HL7</a> from where all the documentation and training stuff can be found.  We have not yet made final decisions on removal of stuff that has been published for years in v3 and v2, and we know that some of the experimental stuff from FHIR has been imported; we may either remove this or sequester it somewhere, or flag it so it can be excluded from production builds.     Folks can begin putting changes through the process and we will do our very best in supporting them if any difficulties are encountered.  We will have discussions on much of this in the UTG and FHIR-I/Vocab sessions this week.</p>",
        "id": 210913731,
        "sender_full_name": "Ted Klein",
        "timestamp": 1600800023
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  said</p>\n<blockquote>\n<p>It was according to the long standing UTG agreement, where the only code systems that remain in FHIR are those used in a required binding to a element of type code - those stay in FHIR; everything else goes to UTG</p>\n</blockquote>\n<p>PC has some required bindings to an element of type CodeableConcept (I know you love that....not).<br>\nDoes the data type really make a difference here or should/could the agreement be updated to exempt those required bindings to an element of type CodeableConcept?<br>\nExample:  Condition clinicalStatus and verificationStatus</p>",
        "id": 211334204,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1601083136
    },
    {
        "content": "<p>well I can say that the agreement did apply to them. I'm not sure whether the committees would agree to move them back. It would change the URL for the systems if we did.</p>",
        "id": 211334280,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1601083272
    },
    {
        "content": "<p>I thought it was a recent change you just applied a couple weeks ago....so is the URL change impactful if it is only a 'change' in the current build no one has implemented yet?  (still trying to catch up on these changes and new processes for making changes)</p>",
        "id": 211334483,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1601083608
    },
    {
        "content": "<p>the URL is published in R4 as a UTG URL. So changing it to something other than living in UTG will be a change from R4</p>",
        "id": 211340815,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1601093040
    },
    {
        "content": "<p>Of course, if you change them back to code, then a change to the URL won't matter... :)</p>",
        "id": 211341325,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1601093923
    },
    {
        "content": "<p>I hate to bring this up again, but I have 5 FHIR Jira issues that involve creating example bindings with example value sets.  I don't know if I can do this in the build or if the example bindings/value sets need to go through UTG.  Can someone please clarify?    <span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span> <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 214228036,
        "sender_full_name": "Melva Peters",
        "timestamp": 1603391093
    },
    {
        "content": "<p>Are they also example code systems (or are the codes from an existing standard code system)?</p>",
        "id": 214230328,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1603392097
    },
    {
        "content": "<p>Yes, for many of them.  We will need to create example code systems and then value sets that are basically \"include all from code system\".</p>",
        "id": 214231321,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1603392561
    },
    {
        "content": "<p>This is for particular IG(s)?</p>",
        "id": 214242163,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1603397449
    },
    {
        "content": "<p>Value sets <em>never</em> need to be defined in UTG.  They <em>can</em> be defined in UTG if there's an expectation that they'll either be shared by IGs that won't have a dependency on the originating IG or will be shared by artifacts across product families.</p>\n<p>If the maturity level of the IG/referencing profile is &lt;3, code systems don't need to be in UTG, though they should have an id that makes clear that they are temporary.  For more mature artifacts, I believe we'd agreed to add a special 'examples' code system to UTG where we'd have a lighter-weight process for introducing content.  The code system would have a URL that would make it clear the codes shouldn't ever be used in production.</p>",
        "id": 214243638,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1603398358
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> I don't believe that this is something vocab has agreed to</p>",
        "id": 214245440,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1603399291
    },
    {
        "content": "<p>Which part?  I know we discussed both at the WGM</p>",
        "id": 214247188,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1603400219
    },
    {
        "content": "<p>oh yes, we did. <span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span> do we have minutes for that session?</p>",
        "id": 214251088,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1603402456
    },
    {
        "content": "<p>Just this morning all the vocab chairs came to consensus agreement for new temporary URIs for external code systems that are still in work by HTA for final authoritative URI values would be: <br>\n<a href=\"http://terminology.hl7.org/temporary-uri/codeSystem/xxx\">http://terminology.hl7.org/temporary-uri/codeSystem/xxx</a> for code systems, and <br>\n<a href=\"http://terminology.hl7.org/temporary-uri/valueSet/xxx\">http://terminology.hl7.org/temporary-uri/valueSet/xxx</a> if it is needed for value sets.   We did not move the discussion further as to whether this refers to any new code system that it is unknown if it will live or be temporary for examples, etc. (we got tied up in other related discussions).   Thus I do think we need to come to agreement on whether or not to use this for the example IG items that this thread began asking about.   I could not get decision on the process and steps (yet) for what these string values should be for IG developers to use so they know how to move forward, despite my getting very unpleasant on the caller being too implementation-focussed.    Perhaps <span class=\"user-mention\" data-user-id=\"195036\">@Carol Macumber</span> <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> <span class=\"user-mention\" data-user-id=\"192130\">@Carmela Couderc</span> and <span class=\"user-mention\" data-user-id=\"191333\">@Reuben Daniels</span> can weigh in on what we can declare as decided and done since this needs to be solved now (see the urgency of the IG developers' request above in this thread) for such exanple things and IG development.   I want very badly to put this to bed and move on to our other priorities ASAP.</p>",
        "id": 214254304,
        "sender_full_name": "Ted Klein",
        "timestamp": 1603404643
    },
    {
        "content": "<p>I think the 'example' code system approach should be different.  Codes under the temporary-uri are expected to be moved elsewhere eventually.  On the other hand, 'example' codes aren't expected to be moved anywhere, ever.  Personally, I'm not totally clear on the value of putting example codes in UTG at all - I think the value of a single code system containing a grab bag of arbitrary examples from a wide range of IGs is likely to be quite limited - and that we'd be better off saying that such things can simply be defined within the referencing IG, with the only requirement that the URL make very clear that the codes should never appear in production systems.</p>",
        "id": 214259965,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1603409619
    },
    {
        "content": "<p>(Enforcing tight change control and quality management on such codes seems of limited value...)</p>",
        "id": 214260040,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1603409647
    },
    {
        "content": "<p>I think that FHIR core committers who need to create code systems (and a corresponding include all value set) to provide example bindings in their resources should not need to create these in UTG.  I see zero value in doing so.  As Lloyd said, these are not going to be real codes that will move to some real code system in the future.  These are purely fake codes being created to show examples of codes in a resource.</p>",
        "id": 214263406,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1603413427
    },
    {
        "content": "<p>Agree</p>",
        "id": 214263710,
        "sender_full_name": "Ted Klein",
        "timestamp": 1603413795
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> no, it's for our base resources.  We have to have at least an example binding</p>",
        "id": 214266465,
        "sender_full_name": "Melva Peters",
        "timestamp": 1603417697
    },
    {
        "content": "<p>it's the example question that hasn't been ruled on by vocab.</p>",
        "id": 214266765,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1603418144
    },
    {
        "content": "<p>and I think I moved a bunch of examples into UTG since that was the applicable policy</p>",
        "id": 214266777,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1603418161
    },
    {
        "content": "<p>Core spec should presumably follow the same principle - example 'fake' codes should be a FHIR-specific fake code system that isn't in UTG.</p>",
        "id": 214266902,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1603418300
    },
    {
        "content": "<p>Do we know when this decision is going to be made by Vocab?  I have a bunch of changes to apply that all need change to value sets or addition of example bindings.</p>",
        "id": 216150364,
        "sender_full_name": "Melva Peters",
        "timestamp": 1604960433
    },
    {
        "content": "<p>Where should this topic be raised so that we can get a decision?  It is holding up changes to the core specification!  <span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span> <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 216361556,
        "sender_full_name": "Melva Peters",
        "timestamp": 1605109273
    },
    {
        "content": "<p>The vocab chairs had an active call on this yesterday.    I doh't believe we yet have a firm decision.    On the one hand, keeping bogus content and dross out of THO is wise, but on the other hand the whole purpose of standing yup the web pages IG for it is so folks can share and not always have to create their own, with a single place to look for stuff.     My PERSONAL OPINION is that we should have a tab for Example content on THO, and for code systems whose entire content is only to support examples and is never intended to be used in a production system we have a CodeSystem.status code value to indicate Example not for production use (which seems to me to be in the similar semantic space as something like 'experimental' which exists as a code in the PublicationStatus code system).   For the ValueSet resources which are only Example content, I would opine we do the same with an appropriate code added to PublicationStatus  that then can be used in ValueSet.status the exact same way.</p>",
        "id": 216364381,
        "sender_full_name": "Ted Klein",
        "timestamp": 1605110517
    },
    {
        "content": "<p>If adding such a code is not a breaking change, it could possibly be done for 4B</p>",
        "id": 216364468,
        "sender_full_name": "Ted Klein",
        "timestamp": 1605110548
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span> this isn't in IG's, this is in FHIR core.  We have to have an example binding for any attribute that is a CodeableConcept.  We try to point to SCT where we can and where there is a valid hierarchy to use, but if that isn't possible and there isn't another option, we have been creating valuesets as the example.</p>",
        "id": 216366463,
        "sender_full_name": "Melva Peters",
        "timestamp": 1605111568
    },
    {
        "content": "<p>Not sure what you mean about doing it for 4B</p>",
        "id": 216366571,
        "sender_full_name": "Melva Peters",
        "timestamp": 1605111614
    },
    {
        "content": "<p>There's no need to \"look for stuff\" if it's example content.  There's no need for re-use, and in general, we don't <em>want</em> re-use because the codes themselves are bogus and tuned for specific use-cases.  Putting the content in UTG forces an overhead cost on the designers without providing any benefit to the implementer community.</p>",
        "id": 216369334,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605113024
    },
    {
        "content": "<p>My preferred policy would be as follows:</p>\n<ul>\n<li>if the value set is used only in elements of type 'code' (which by definition requires a 'required' binding, then the code system can be defined in core/in the IG and need never go into UTG.  (E.g. status, gender, etc.)</li>\n<li>if the value set is only used with a binding strength of example, then the code system can be defined in core/in the IG but must have a URL that follows an approved convention and makes it obvious that the codes are example-only and should not be used in production.  The validator will spit out warning if it sees them, warning that they can't be used in production</li>\n<li>if the value set is being used only in artifacts with maturity of FMM 2 or less (core or IG) , the code system can be a core/IG-specific code system.  However, that code system must follow a URL pattern that clearly marks the codes as 'temporary'.  The validator will throw an error if a binding to that code system appears in any artifact with a maturity of FMM 3+</li>\n</ul>\n<p>The outcome of this is:</p>\n<ul>\n<li>no overhead for purely example codes</li>\n<li>no overhead for low maturity codes</li>\n<li>we still get codes into UTG for the codes that matter</li>\n</ul>",
        "id": 216370769,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605113694
    },
    {
        "content": "<p>Mostly agree Lloyd, but Melva's Use Case is an example value set which includes real SCT codes.   We do have to explore the corner cases here.</p>",
        "id": 216378589,
        "sender_full_name": "Ted Klein",
        "timestamp": 1605117783
    },
    {
        "content": "<p>If there's no codes to define, should be no issue.  Valuesets <em>never</em> have to be defined in UTG.  Work group needs to consciously decide that the value set is intended to be shared for that to happen.</p>",
        "id": 216380002,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1605118549
    },
    {
        "content": "<p>I didn't say it contained real SCT codes.  I said we use SCT where we can for example bindings, but where there isn't a valid hierarchy, we create a value set with example codes in it.</p>",
        "id": 216380071,
        "sender_full_name": "Melva Peters",
        "timestamp": 1605118564
    },
    {
        "content": "<p>Has there been any decision on this?  We have a bunch of Jira issues that we can't apply because we don't know if our example value sets have to go through UTG. <span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span> <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 217949642,
        "sender_full_name": "Melva Peters",
        "timestamp": 1606345750
    },
    {
        "content": "<p>I've expressed my opinion but I don't know when/where the decision is going to be made.</p>",
        "id": 217949816,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1606345913
    },
    {
        "content": "<p>This is becoming problematic, and I suspect we're heading towards an executive decision outside vocab if it doesn't progress. <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> can you please convey this to vocab co-chairs</p>",
        "id": 217951885,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1606347812
    },
    {
        "content": "<p>We have a Vocab co-chairs call and an additional \"External code system identifier subgroup\" call scheduled on Monday.  We can further discuss it then.  Personally, I think we may be making this problem to some degree larger than it really needs to be.  Along with Ted, I'm largely in agreement with Lloyd's preferred policy suggestions.  I'm not quite sure, though, if the items that he described as \"must\" might not alternatively be \"should\" - at least for now, until we do come to an agreement on Lloyd's suggestions (or something similar) as being the official policy.  And in the meantime, is it really beneficial to hold up the changes that are needing to be made by Melva and others in the core spec?  And if it happens to end up taking a while longer to decide on the final policy, and the changes that were made under the current \"rules\" would end up making it into R4B (wherever that may be applicable) - then maybe we could agree that we can live with that, and then begin applying the new finalized policy for whatever further changes will be made from that point forward which will end up in R5 (or later)?  <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span> <span class=\"user-mention\" data-user-id=\"195036\">@Carol Macumber</span> <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> <span class=\"user-mention\" data-user-id=\"192130\">@Carmela Couderc</span> <span class=\"user-mention\" data-user-id=\"191333\">@Reuben Daniels</span></p>",
        "id": 217959742,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1606357181
    },
    {
        "content": "<p>I don't think these are rules that belong in the core spec at all.  They're methodology rules on HL7 IG developers, not something relevant to implementers.</p>",
        "id": 217960609,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1606358509
    },
    {
        "content": "<p>As I brought up on the Monday evening \"external code system identifier\" call, I believe it will be true that <strong>most</strong> (not all) instances of creating new code systems and value sets that are bound as example will still likely be in the core spec.  When you are developing an <strong>implementation</strong> guide, you are going to typically want to constrain the existing example bindings in the core spec to at least preferred (or stronger), whenever possible, and you probably won't (or shouldn't be) creating very many (or any) <strong>new</strong> code systems and value sets that are bound as example, because by definition those are meant to be only examples and are not intended to be implemented.</p>",
        "id": 217962742,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1606361908
    },
    {
        "content": "<p>Not necessarily.  The example bindings in the core spec might only contain 3 or 4 codes.  The bindings needed in an IG might not overlap at all with those - so you may well create IG-specific codes</p>",
        "id": 217963028,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1606362259
    },
    {
        "content": "<p>However, it's reasonable that all example codes defined in an IG be drawn from a single code system</p>",
        "id": 217963036,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1606362285
    },
    {
        "content": "<p>(Same for all temporary codes, though that should be a different system from the example system - because they might reasonably show up in production.)</p>",
        "id": 217963044,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1606362312
    },
    {
        "content": "<p>Well, I did make a point of saying \"not all\". :)</p>",
        "id": 217963048,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1606362330
    },
    {
        "content": "<p>Any decision made on this???  No discussion since November 25th!  Can we please get a decision!!!  <span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span> <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 218634642,
        "sender_full_name": "Melva Peters",
        "timestamp": 1606951338
    },
    {
        "content": "<p>When's the next vocab call?  And is this on the agenda?</p>",
        "id": 218636255,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1606952527
    },
    {
        "content": "<p>Next Main call is next Thursday.  FHIR Tracker call is tomorrow (3:30 PM Eastern).  We might be able to spend a few minutes on it tomorrow, if needed.  It's pretty much been constantly on the agenda, and I think things are converging toward a consensus (seems to be).</p>",
        "id": 218639565,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1606954997
    },
    {
        "content": "<p>This is holding up applying changes!  It needs to be resolved soon!!!!</p>",
        "id": 218651796,
        "sender_full_name": "Melva Peters",
        "timestamp": 1606968432
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> FYI</p>",
        "id": 219865003,
        "sender_full_name": "Melva Peters",
        "timestamp": 1607962923
    },
    {
        "content": "<p>Based on discussions among the Vocab chairs and after the TSC discussion this am the vocab chairs agree to the following: </p>\n<div class=\"codehilite\"><pre><span></span><code>Example content does not need to be included in the THO publication process or go through UTG at this time.\nWe reserve the right to improve upon this with a more nuanced approach in the future.\n</code></pre></div>\n<p>We remained concerned regarding the process by which this will be achieved and any resulting downstream impacts that might have for a more complete solution on how terminology content is defined and managed in FHIR artifacts. It is our assumption in making this decision on only a piece of the problem,  all options for the future are still open in crafting a solution <strong>all are happy with.</strong><br>\n<span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> <span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span> <span class=\"user-mention\" data-user-id=\"195036\">@Carol Macumber</span> <span class=\"user-mention\" data-user-id=\"192130\">@Carmela Couderc</span> <span class=\"user-mention\" data-user-id=\"191333\">@Reuben Daniels</span> <span class=\"user-mention\" data-user-id=\"279658\">@Austin Kreisler</span> <span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 219890816,
        "sender_full_name": "Robert McClure",
        "timestamp": 1607974178
    },
    {
        "content": "<p>Thank you.  Happy to participate in discussions of future evolution</p>",
        "id": 219894075,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1607975811
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 230904761,
        "sender_full_name": "Melva Peters",
        "timestamp": 1616088151
    }
]