[
    {
        "content": "<p>Almost a year ago now we had some discussions around renaming RequestGroup. A lot has happened since then, but actually applying this change to the spec didn't, and I'd like to revisit this to make sure we _really_ want to rename this resource, given the issues that arise when resources are renamed between spec versions. Is the benefit of renaming this resource worth the cost, or can the issues raised be addressed with documentation? Here is the resolved issue: <a href=\"http://jira.hl7.org/browse/FHIR-24619\">J#24619</a></p>",
        "id": 210880097,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1600785867
    },
    {
        "content": "<p>RequestOrchestration is not great but it's clearer than request group. At least people don't look at it and think 'that's a group of requests'</p>",
        "id": 210892674,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1600790700
    },
    {
        "content": "<p>.. whether the change is justified....</p>",
        "id": 210892756,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1600790740
    },
    {
        "content": "<p>Is RequestGroup/ RequestOrchestration overlapping with CarePlan?</p>",
        "id": 210896439,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600792311
    },
    {
        "content": "<p>I look at Request group, and first I thought \"that's a group of requests\" but then I scrolled down and thought this seems deja vu..</p>",
        "id": 210896642,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1600792397
    },
    {
        "content": "<p>RequestOrchestration could be used by CarePlan.  Key difference is that the former provides formal orchestration - and that's all it does.  CarePlan describes a set of actions and current progress as well as goals.</p>",
        "id": 210897157,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600792617
    },
    {
        "content": "<p>Key thing is that RequestOrchestration defines timing and co-occurrence constraints.</p>",
        "id": 210897231,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600792653
    },
    {
        "content": "<p>I'm in favor of renaming.  I don't think RequestGroup is widely implemented yet, so the cost of renaming right now is relatively low.</p>",
        "id": 210897279,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600792680
    },
    {
        "content": "<p>My biggest concern with renaming is the challenge it causes with tooling, as soon as we rename, it becomes significantly more difficult to talk about that resource across versions. Agree it's not widely implemented, so that cost is almost exclusively on the tooling/editor side right now.</p>",
        "id": 210897943,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1600792988
    },
    {
        "content": "<p>Is there a lot of tooling that deals with RequestGroup?</p>",
        "id": 210901699,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1600794693
    },
    {
        "content": "<p>no. it's just making the change, as far as I know.</p>",
        "id": 210903675,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1600795455
    },
    {
        "content": "<p>The problem we consistently encounter with resource renames is that references to those resources don't survive (and actually block) the version round-trip the tooling makes. So if we have a Library that talks about ServiceRequest, the DataRequirement that gets persisted blows up when that library tries to down-convert to STU3. We don't have a solution to that at this point, and so we basically can't publish STU3 content that talks about ProcedureRequest. We don't have that issue today with RequestGroup/RequestOrchestration, but it will come up.</p>",
        "id": 210922816,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1600804448
    },
    {
        "content": "<p>that's not because the name was changed, but because 2 different resources were collapsed into 1, with no way for the conversion to decide which one</p>",
        "id": 210922907,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1600804495
    },
    {
        "content": "<p>So a straight resource rename wouldn't cause that issue?</p>",
        "id": 210922958,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1600804525
    },
    {
        "content": "<p>no</p>",
        "id": 210922967,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1600804529
    },
    {
        "content": "<p>Okay, I'll proceed with the rename as planned.</p>",
        "id": 210923089,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1600804582
    }
]