[
    {
        "content": "<p>ok. I'm getting somewhere. Frustratingly slowly, but somewhere.</p>",
        "id": 221832256,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1609972122
    },
    {
        "content": "<p>FYI, here's a copy of the retooled spreadsheets</p>",
        "id": 221832278,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1609972132
    },
    {
        "content": "<p><a href=\"/user_uploads/10155/QvNXOCi3OAeghK3yUcfSvyIf/sheets.zip\">sheets.zip</a></p>",
        "id": 221832290,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1609972140
    },
    {
        "content": "<p>they're a little different, since there's some changes under the hood.</p>",
        "id": 221832453,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1609972267
    },
    {
        "content": "<p>are these the ones that can be converted back and forth to StructureDefs?</p>",
        "id": 221841811,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1609978560
    },
    {
        "content": "<p>I presume there would also be a spreadsheet for defining the valuesets...? <br>\nPossibly the Profiles tab will be added as well, I presume.<br>\nAnd final question, when can we play with it? I want to create a DeviceDispense resource and I'll gladly give this a try if that is somehow useful.</p>",
        "id": 221842025,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1609978687
    },
    {
        "content": "<p>no. valuesets and code systems are done natively as resources once I introduce this.</p>",
        "id": 221859390,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1609998301
    },
    {
        "content": "<p>so are profiles</p>",
        "id": 221859394,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1609998306
    },
    {
        "content": "<p>Natively, as in editing JSON files for each resource?</p>",
        "id": 221979692,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1610043363
    },
    {
        "content": "<p>Or XML, I hope...</p>",
        "id": 221985092,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1610045888
    },
    {
        "content": "<p>ok. this is now committed and live, so the editing process has changed.</p>",
        "id": 222844331,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1610709005
    },
    {
        "content": "<p>up until now, the master definition of the resources has been in a bunch of xml files that are excel spreadsheets. All of the resources part of the build was generated from these spreadsheets</p>",
        "id": 222844426,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1610709102
    },
    {
        "content": "<p>well, no more. From today, the master definitions will be stored as a series of resources:</p>\n<ul>\n<li>a structure definition for the resource itself</li>\n<li>a bundle of search parameters for the search parameters</li>\n<li>3 lists, for examples, operations, profiles</li>\n<li>a series of operation definitions, value sets and code systems that support these</li>\n</ul>",
        "id": 222844560,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1610709207
    },
    {
        "content": "<p>These are committed to version control instead of the old xml spreadsheets, which have been removed (for the resources; the data type spreadsheets have not been changed)</p>",
        "id": 222844657,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1610709273
    },
    {
        "content": "<p>However, you can still edit the resources using excel. The way this works is that when you run the build, it reads the master definition resources, and creates an excel spreadsheet on the fly (unless it's already open in excel, in which case the file is locked)</p>",
        "id": 222844807,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1610709364
    },
    {
        "content": "<p>then, when you run a build, the build will check the date of the spreadsheet; if it's been changed since it was written, it will read it, merge the information in it back into the master resources, and then use the updated resources.</p>",
        "id": 222844855,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1610709416
    },
    {
        "content": "<p>you don't need to close excel for that to happen. (though you do need to close it if you do a pull, and need the excel spreadsheet updated from new definitions, and I have no way to check on this automatically)</p>",
        "id": 222844923,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1610709478
    },
    {
        "content": "<p>the format of the spreadsheets has changed a little. The biggest change is that you no longer can define code systems / value sets for required bindings in the spreadsheet; you do it as native code system and value set resources. The same applies for profiles, extensions etc - these are defined in the native resource format. There's some more subtle changes in the element definitions - the spreadsheet is much more aligned with the formal definitions of the resources now, so you might not really notice the other changes</p>",
        "id": 222845106,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1610709606
    },
    {
        "content": "<p>you can edit the master resources directly, if you prefer.</p>",
        "id": 222845118,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1610709621
    },
    {
        "content": "<p>the spreadsheets are never committed to github</p>",
        "id": 222845126,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1610709633
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> a question about R4B, since I'm now working on that - should that be worked on in a branch of the main repo, or should it get it's own repo? </p>\n<p>My preferred answer is: it should have it's own repo, and it's own ci-build.</p>",
        "id": 222908786,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1610737708
    },
    {
        "content": "<p>Certainly your call. The nice thing about using a branch is that the existing infrastructure would just keep working; what are the advantages to a separate repository?</p>",
        "id": 222909260,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1610737866
    },
    {
        "content": "<p>It's certainly easier to keep the same infrastructure for the infrastructure maintainers, sure. But I don't think it's easier for the editors.</p>",
        "id": 222910494,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1610738335
    },
    {
        "content": "<p>for editors, the flow should be the same: commit -&gt; PR to main -&gt; checked PR ok -&gt; commit to master. <br>\nIts not the same group of editors either - a smaller subset.</p>",
        "id": 222910728,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1610738414
    },
    {
        "content": "<p>Sure, but substitute <code>r4b</code> for <code>main</code> in the flow above, and it's identical for committers. Re: smaller subset of editors, we've never enforced this kind of restriction before but if desired we could manage and enforce this with branch level restrictions like:</p>\n<p><a href=\"/user_uploads/10155/FH50f7ELpVQeSLSItjRhaW7Z/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/FH50f7ELpVQeSLSItjRhaW7Z/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/FH50f7ELpVQeSLSItjRhaW7Z/image.png\"></a></div>",
        "id": 222917800,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1610741277
    },
    {
        "content": "<p>(I'm not set against making a separate repo, but I want to make sure we've thought it through.)</p>",
        "id": 222917886,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1610741295
    },
    {
        "content": "<p>well, the principle issue, so far as I can see, is that as far as I know, the ci-build doesn't post r4b to <a href=\"http://build.fhir.org\">build.fhir.org</a>. At least it doesn't at the moment. I guess if that happened, it wouldn't make much difference which repo it is</p>",
        "id": 222932132,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1610748473
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> ping on this - need resolution in the next few days</p>",
        "id": 223163895,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1611004057
    },
    {
        "content": "<p>Note about an R4B limitation: the example value set valueset-nhin-purposeofuse.xml includes a concept map, and the R5 build can't read that as a value set, since concept map has been changed. so that value set won't be listed with other value sets, though it will still appear as an example against the value set resource</p>",
        "id": 223163991,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1611004125
    },
    {
        "content": "<p>Interesting -- I'm out for the holiday weekend but back tomorrow.  I'd expect r4b to appear in the branch build at /branches, unless there's something causing it to break.</p>",
        "id": 223164315,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1611004463
    },
    {
        "content": "<p>I didn't know about /branches and couldn't find any reference to it. Can we update the PR build notification to include the link?</p>",
        "id": 223164367,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1611004523
    },
    {
        "content": "<p><a href=\"http://build.fhir.org/branches/gg-big-rework\">http://build.fhir.org/branches/gg-big-rework</a> is building, but I'm not sure which branch contains \"r4b\" (not seeing an active branch with that name); can you include a link here?</p>",
        "id": 223185482,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1611029037
    },
    {
        "content": "<p>I haven't committed it yet. It will be r4b once I do</p>",
        "id": 223185987,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1611029871
    },
    {
        "content": "<p>Oh, OK -- well, I'm hoping it will \"just work\". When you wrote earlier:</p>\n<blockquote>\n<p>as far as I know, the ci-build doesn't post r4b to <a href=\"http://build.fhir.org\">build.fhir.org</a>.</p>\n</blockquote>\n<p>... obviously it doesn't post r4b to the build site until you push r4b to github ;-))</p>",
        "id": 223259840,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1611076909
    },
    {
        "content": "<p>Branch builds go poof after 30 days of no new commits, right?  Will that be an issue here?</p>",
        "id": 223260161,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1611077028
    },
    {
        "content": "<p>We can set rules as needed.</p>",
        "id": 223260860,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1611077263
    },
    {
        "content": "<p>I'm not expecting r4b is going to go inactive for &gt;1mo anytime very soon though; first thing is to get it <em>started</em>.</p>",
        "id": 223260920,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1611077282
    },
    {
        "content": "<p>ok, tomorrow I'm committing an update to the main build (master) which does 2 things:</p>\n<ul>\n<li>fixes up a bunch of outstanding issues with the retooled R5 candidate (the master branch)</li>\n<li>also is able to run the R4B branch</li>\n</ul>\n<p>I'll also be committing the R4B branch tomorrow - that's the R4 equivalent using the new formats. e.g. you stilll get spreadsheets if you build locally, just as it works for the R5 branch.</p>\n<p>However, you don't build the R4B branch using the java code in R4B itself. Instead, you use the R5 java code to run it. Once I commit, you'll be able to run R4B by hacking the R5 build (which is how I'm doing it now). However, <span class=\"user-mention\" data-user-id=\"248736\">@Mark Iantorno</span> is working on moving the java code out of the FHIR repo all together, and instead we'll use a FHIR publisher jar (like the IG publisher, based on similar infrastructure) to run on either R5 or R4B. Mark will provide updates as he gets that infrastructure in place (though for users + ci-build, it'll be just the same as now: run publish.bat/publish.sh)</p>\n<p>One consequence of all this is that we won't have a ci-build for R4B until Mark gets his changes in place</p>",
        "id": 223352713,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1611137354
    },
    {
        "content": "<p>note that the R4B build has many broken links, and many validation failures. I've set it to run to completion irrespective of this, until I can address all the issues after the WGM.</p>",
        "id": 223353054,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1611137606
    },
    {
        "content": "<p>ok R4B branch now exists. And will be built by the code in the master branch</p>",
        "id": 223464125,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1611197396
    },
    {
        "content": "<p>ok. <span class=\"user-mention\" data-user-id=\"248736\">@Mark Iantorno</span>  here's where I am now:</p>\n<ul>\n<li>I have fixed a few things in the test cases - these will need releasing before fhir.core is next released</li>\n<li>fhir.core needs a release to support the publisher</li>\n<li>the java code in the gg-r4b-work-2 branch of fhir.main is the code that will publish both R4B and R5. The PR for that fails because fhir.core needs a release - I think. It works for me locally. </li>\n<li>the branch R4B in fhir.main has the source for R4B that will build with the java code in gg-r4b-work-2 branch, and is the base for R4B. It can't pass ci-build until you commit changes for it to build with the jar you are working on</li>\n<li>All this works for me and is committed, but is waiting for you to resolve build/release/new jar in order to complete</li>\n</ul>",
        "id": 223466745,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1611200511
    },
    {
        "content": "<p>I will take care of all this tomorrow. Thanks for letting me know.</p>",
        "id": 223467008,
        "sender_full_name": "Mark Iantorno",
        "timestamp": 1611200866
    },
    {
        "content": "<p>everyone, we have a name clash that has suddenly become confusing</p>",
        "id": 223467075,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1611200926
    },
    {
        "content": "<p>we have the 'core build' or 'fhir core' which is either the spec at <a href=\"http://hl7.org/fhir\">http://hl7.org/fhir</a> or the source repo, or the process that builds it, and we also have 'fhir core' which is the java code that sits underneath the validator, the ig publisher, hapi and smile-cdr, and also the 'fhir core' java code. </p>\n<p>As you can see, that's suddenly confusing now that we're re-organizing things.</p>",
        "id": 223467172,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1611201094
    },
    {
        "content": "<p>I'm not sure what the right solution to that is</p>",
        "id": 223467178,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1611201107
    },
    {
        "content": "<p>Well, the bit that publishes core should probably be the \"fhir core publisher\".</p>",
        "id": 223467461,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1611201505
    },
    {
        "content": "<p>I think context will generally make clear whether someone's talking about the spec or the code when referring to \"fhir core\".  When you refer to the 'fhir core' java code - do you mean the 'model' Java files and other stuff generated from the core spec?</p>",
        "id": 223467568,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1611201605
    },
    {
        "content": "<p>Could refer to those as the \"fhir core java release\" files - given that they vary from one release to another.</p>",
        "id": 223467588,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1611201648
    },
    {
        "content": "<p>I haven't seen anyone posting about this in regard to the way spreadsheet editing works now, so maybe I'm doing something wrong with it (although I don't think so?).  From <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> :</p>\n<blockquote>\n<p>However, you can still edit the resources using excel. The way this works is that when you run the build, it reads the master definition resources, and creates an excel spreadsheet on the fly (unless it's already open in excel, in which case the file is locked)</p>\n<p>then, when you run a build, the build will check the date of the spreadsheet; if it's been changed since it was written, it will read it, merge the information in it back into the master resources, and then use the updated resources.</p>\n<p>you don't need to close excel for that to happen. (though you do need to close it if you do a pull, and need the excel spreadsheet updated from new definitions, and I have no way to check on this automatically)</p>\n</blockquote>\n<p>I'm working with <span class=\"user-mention\" data-user-id=\"192504\">@François Macary</span> on updates to ObservationDefinition, and what I'm seeing with the build doesn't seem to be matching this process.  Francois has updated the new version of the spreadsheet for ObservationDefinition with the desired changes - several new and re-organized elements and updated text including definitions and comments.I have an up-to-date and clean build before trying to make the changes.  I then replace the previously generated observationdefinition-spreadsheet.xlsx file with the updated version from Francois.  This change appears to be detected correctly by the build, as it triggers a partial build of observationdefinition as expected.  But what's happening next isn't what I expected.  The build successfully completes, but the result is that rather than picking up and merging the updates from the spreadsheet into the StructureDefinition, the StructureDefinition is left unchanged and instead the spreadsheet file is being regenerated with the contents that it previously had (matching the StructureDefinition) and the updates to the resource do not get made.  I have been closing the spreadsheet before running the build (as I still have had that habit from before).  I wouldn't think that could cause a problem, but who knows.  I'm not seeing anything obvious that I can do differently that would make this work - any advice is appreciated.</p>",
        "id": 226763536,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1613622490
    },
    {
        "content": "<p>the build uses a timestamp to determine if the spreadsheet is newer than the structure definition or not.  so if the file that you get from Francois doesn't have a proper timestamp, then the build doesn't treat it as new.</p>",
        "id": 226765033,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1613624165
    },
    {
        "content": "<p>yes I had not anticipated that work flow, and I think Jean is right</p>",
        "id": 226765856,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1613624914
    },
    {
        "content": "<p>How could Jean be right? :)  Actually, I certainly agree with Jean that the build uses a timestamp to determine if the spreadsheet is newer than the structure definition, which is what I thought I described in my post.  That part seemed to work, as when the spreadsheet was updated that triggered the partial build, presumably because it <strong>did</strong> recognize the timestamp.  I don't understand the last part of the comment about the file from Francois \"doesn't have a proper timestamp\", as my assumption was that the timestamp that the build saves for comparison (in observationdefinition-spreadsheet.datestamp) was being compared with the time that the file was modified in the filesystem - which is independent of any of the file contents.  So if that's not the timestamp that is being compared then I don't know which one it is that needs to be \"proper\" (unless you are referring to meta.lastUpdated, which I <strong>don't</strong> think would make sense).  So, as I said, the partial build was actually triggered by the spreadsheet update, but the behavior still was different than I expected.  And to me this <strong>does</strong> seem to me to be a typical workflow that we should expect to handle.  So what else am I still missing?  <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span></p>",
        "id": 226882084,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1613682950
    },
    {
        "content": "<p>File timestamps between computers can be.... tricky.</p>",
        "id": 226882585,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1613683152
    },
    {
        "content": "<p>Yes, I agree with that.  But I think this is all done locally (nothing checked into GH), so the timestamps should be consistently comparable?</p>",
        "id": 226882906,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1613683274
    },
    {
        "content": "<p>I think the problem is in the \"replace the file with the one from Francois\" step.  File timestamps can be mangled / changed / removed / etc.  How are you getting that updated version?</p>",
        "id": 226883121,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1613683375
    },
    {
        "content": "<p>Not sure if it helps, but when I was rinning a build, I saved my xlsx right after saving the StructureDef, and of course that gave me an issue.,</p>",
        "id": 226883402,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1613683507
    },
    {
        "content": "<p>Also - are timestamps universal across timezones? I presume François is in another timezone - so if François saves a file now, and you change it in 3 hours, François's file is perhaps still saved \"later\" than yours</p>",
        "id": 226883467,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1613683539
    },
    {
        "content": "<p>You can try running <code>touch</code> to modify file creation dates (just from a debugging perspective; once we understand what's going on, we can presumably refine the workflow)</p>",
        "id": 226883474,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1613683542
    },
    {
        "content": "<p>One example (even in a single Windows system) is that the NTFS filesystem stores everything in UTC and the FAT filesystem stores everything in system local time.</p>\n<p>Edit: Note: this gets more complicated when changing operating systems.</p>",
        "id": 226883510,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1613683557
    },
    {
        "content": "<p>I forget if you're on a Mac, Rob. I just read <a href=\"https://apple.stackexchange.com/a/187673\">https://apple.stackexchange.com/a/187673</a> and am always impressed with how much I don't know :-)</p>",
        "id": 226883679,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1613683615
    },
    {
        "content": "<p>Yes, I see what you mean.  If Francois updated the spreadsheet on his machine and then uploads it (to Skype in this case), and then I download it and save it on my machine it would be keeping the timestamp from Francois' machine unless I actually make an additional update to the file locally?  That could be the reason, and I can try to test that.  And yes, I'm on a Mac (and I expect Francois is on Windows).</p>",
        "id": 226883762,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1613683659
    },
    {
        "content": "<p>I'd just open, add whitespace and save again</p>",
        "id": 226883943,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1613683751
    },
    {
        "content": "<p>That's exactly what I was getting ready to try right now.</p>",
        "id": 226883999,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1613683780
    },
    {
        "content": "<p>On the mac, this <a href=\"https://superuser.com/questions/428452/how-can-i-touch-a-file-from-the-mac-ui\">StackOverflow</a> answer looks helpful - essentially an automation to update the file time.</p>",
        "id": 226884014,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1613683789
    },
    {
        "content": "<p>Did you notice the {resourcename}-spreadsheet.timestamp files? I assumed that was the key to this.</p>",
        "id": 226885716,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1613684559
    },
    {
        "content": "<p>Yes, to all of it.  That was in fact the issue.  Making a local update to the file solves that problem.  It's just a bit of a pain and not terribly obvious that it needs to be done, though.  Appreciate everyone's suggestions.</p>",
        "id": 226885989,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1613684695
    }
]