[
    {
        "content": "<p>A while back, I'd introduced shading of the lines in the snapshot view to show which elements were \"mustSupport\" vs. not.  General feedback was that it was too busy, so we changed to the bright \"S\" icons.  The same need to differentiate between \"mustSupport\" and other elements also exists on the data dictionary page (the one with all of the definitions).  I don't think the icon approach will work  there, as you actually want to visually distinguish the complete set of text.  (And we also don't use icons on those pages).  I think the shading would be much less busy because you won't have close-proximity alteration of background color.  Does anyone object to me making the change so we can see how it looks?  (Worst case, I can roll it back.)</p>",
        "id": 153845160,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1472161284
    },
    {
        "content": "<p>it seems to me that this is something that is only appropriate for terminal profiles - as in, implementable profiles that are not expected to be constrained further</p>",
        "id": 153845161,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1472161379
    },
    {
        "content": "<p>and not for stuff in the spec. </p>",
        "id": 153845162,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1472161389
    },
    {
        "content": "<p>So I think that this should be configurable. Two options come to mind:<br>\n- a setting in the IG control file <br>\n- surfacing this is a class on the &lt;tr&gt; in the generated html so it can be in the css </p>",
        "id": 153845163,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1472161477
    },
    {
        "content": "<p>I'm not sure what constitutes a terminal profile.  I would expect it to be useful for things like DAF - it's not necessarily terminal, but it's still useful to be able to go through and quickly scan \"what I have to worry about\" vs not.  We're not removing the content.  If you want to look at the not-supported stuff, you can, but it'd just obvious what are the parts that are \"important\" in the context of this particular profile.</p>",
        "id": 153845165,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1472163128
    },
    {
        "content": "<p>That said, I'm ok with the css approach.  IGs can then make the decision.  I might make it a distinct color in the default IG so that publishers are even aware it's an option, they can then override it back if they want.</p>",
        "id": 153845166,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1472163193
    },
    {
        "content": "<p>better to document it than make it the default</p>",
        "id": 153845182,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1472178952
    },
    {
        "content": "<p>I think having a way to toggle between the must support elements and the full snapshot in the definitions page would be nice.   So is easier to  filter out the none must supports and all the DomainResource stuff</p>",
        "id": 153845294,
        "sender_full_name": "Eric Haas",
        "timestamp": 1472279671
    }
]