[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> , <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> , I've added proposed Shareable and Publishable patterns in a draft PR: <a href=\"https://build.fhir.org/branches/br-32632-shareable-publishable-patterns/shareable.html\">https://build.fhir.org/branches/br-32632-shareable-publishable-patterns/shareable.html</a>, <a href=\"https://build.fhir.org/branches/br-32632-shareable-publishable-patterns/publishable.html\">https://build.fhir.org/branches/br-32632-shareable-publishable-patterns/publishable.html</a>. I've never added a pattern to the build, so I'm not sure whether I've done it properly, feedback welcome.</p>",
        "id": 271162086,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1644341349
    },
    {
        "content": "<p>I think you should identify that this pattern is intended to only apply to Canonical resources.  Also, experimental should be optional - but we should probably add a meaningIfMissing on experimental that if missing, the resource is presumed to be non-experimental.  </p>\n<p>The definition of \"shareable\" as a code is tautological.  All resources are, by definition, 'shareable'.  You need to better qualify the name.  (And perhaps change the label, though I realize that's problematic at this stage.)</p>\n<p>Publishable calls out a bunch of elements that don't (and won't) exist as discrete elements on ay resource.  The patterns should align with the way resources will actually express these elements...</p>",
        "id": 271166164,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644343144
    },
    {
        "content": "<p>ShareableCanonical?</p>",
        "id": 271166571,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1644343284
    },
    {
        "content": "<p>What do you actually mean by \"Shareable\"?  Discoverable?  Referenceable?</p>",
        "id": 271166799,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644343373
    },
    {
        "content": "<p>A canonical isn't really shareable without a URL, otherwise you can't identify it across servers, so that's really what it's focused on, just enough information that the resource can be shared and consumers know what it is, what it basically does (or is supposed to do), and who they can talk to with questions about it.</p>",
        "id": 271167032,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1644343460
    },
    {
        "content": "<p>We separated it out as a pattern because in the authoring phase, we routinely need to share draft content that doesn't yet have all the metadata that would be expected to be present for a full publishable artifact.</p>",
        "id": 271167123,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1644343498
    },
    {
        "content": "<p>It's shareable.  It's just not referencable.</p>",
        "id": 271168340,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644343991
    },
    {
        "content": "<p>Everything is 'shareable' (can be passed from one to the other).</p>",
        "id": 271168402,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644344025
    },
    {
        "content": "<p>And the metadata you've include for 'publishable' is pretty much all optional.  I think what you're really getting at there is what information might be of interest in a literature-type publication where stuff like editors, contributors, etc. matters.</p>",
        "id": 271168729,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644344153
    },
    {
        "content": "<p>Well, the term Shareable in this sense has been in use since STU3, so I think that's just a matter of making sure we're clear about what we mean by that.</p>",
        "id": 271173452,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1644346079
    },
    {
        "content": "<p>And for Publishable, not just literature-type, but a clinical content repository where that sort of information is critical to providing consumers with the justification and tools they need to make use of the content. Who built it, on what grounds, who endorsed it, what evidence supports it, and so on.</p>",
        "id": 271173663,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1644346167
    },
    {
        "content": "<p>Actually, I would say none of that information is needed to make use of the content.  However, it might be needed to evaluate the appropriateness of using it.  So it's more about \"evaluation\" than it is about \"publication\".</p>",
        "id": 271183357,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644350724
    },
    {
        "content": "<p>Key considerations being: fit for purpose, trustworthy, accurate?</p>",
        "id": 271183443,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644350761
    },
    {
        "content": "<p>yes need to stick with the term shareable here, but the intent is that the resources have enough metadata to make sharing them through a public registry reliable</p>",
        "id": 271184079,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1644351050
    },
    {
        "content": "<p>I'm not dead-set on changing the terms.  (Though if it's feasible, that would be desirable.)  The critical ask is for the definitions to be clearer and more precise.</p>",
        "id": 271184347,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644351178
    },
    {
        "content": "<p>I'm applying this feedback and I don't understand this statement:</p>\n<blockquote>\n<p>Publishable calls out a bunch of elements that don't (and won't) exist as discrete elements on ay resource. The patterns should align with the way resources will actually express these elements...</p>\n</blockquote>\n<p>Can you be more specific about which elements you're referring to?</p>",
        "id": 271364377,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1644449945
    },
    {
        "content": "<p>I guess I lied.  I was referring to editor, reviewer and endorser.  All three of these seem like things that should be extensions for most if not all metadataresources, but they're explicit in the pattern.  (I have a hard time believing that 80% of the systems that will deal with PlanDefinitions and ActivityDefinitions will have all of these things.  May be relevant for registries, but not for most use.)</p>",
        "id": 271365987,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644451004
    },
    {
        "content": "<p>Okay, updates applied: <br>\n<a href=\"https://build.fhir.org/branches/br-32632-shareable-publishable-patterns/shareable.html\">https://build.fhir.org/branches/br-32632-shareable-publishable-patterns/shareable.html</a><br>\n<a href=\"https://build.fhir.org/branches/br-32632-shareable-publishable-patterns/publishable.html\">https://build.fhir.org/branches/br-32632-shareable-publishable-patterns/publishable.html</a></p>",
        "id": 271464428,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1644513913
    }
]