[
    {
        "content": "<p>There have been some meetings with IHTSDO to review SnoMed content in the FHIR resources.  From a Pharmacy perspective, they raised an issue where we have bound to multiple hierarchies (value set is in MedicationAdministration for reason not given (Value Set <a href=\"http://hl7.org/fhir/ValueSet/reason-medication-not-given-codes\" target=\"_blank\" title=\"http://hl7.org/fhir/ValueSet/reason-medication-not-given-codes\">http://hl7.org/fhir/ValueSet/reason-medication-not-given-codes</a>).  Can anyone help with how we should do?  Given this is exemplar, should we just point to one hierarchy?</p>",
        "id": 153979558,
        "sender_full_name": "Melva Peters",
        "timestamp": 1532982812
    },
    {
        "content": "<p>in principle it's not wrong to bind to multiple heirarchies but in particular cases it could be a very bad idea. I don't have an opinion on this particular value set</p>",
        "id": 153979560,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1532982910
    },
    {
        "content": "<p>are you aware of when you should post questions like this this?  <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span></p>",
        "id": 153979561,
        "sender_full_name": "Melva Peters",
        "timestamp": 1532983008
    },
    {
        "content": "<p>Did you mean \"where you should post questions like this?\"  If so, I think the best place for this would be the terminology stream.</p>",
        "id": 153979562,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1532983209
    },
    {
        "content": "<p>I'll look at it again and post a reply.</p>",
        "id": 153979563,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1532983334
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> is there a specific stream for the Snomed on FHIR discussions?</p>",
        "id": 153979564,
        "sender_full_name": "Melva Peters",
        "timestamp": 1532983855
    },
    {
        "content": "<p>Yes, there is the <a href=\"#narrow/stream/89-snomed\" title=\"#narrow/stream/89-snomed\">snomed</a> stream - that probably is the best place (wouldn't hurt to ping the terminology stream, too, and direct to the snomed discussion).  The snomed stream used to be automatically cross-posted to the SNOMED Int. chat site, but that wasn't used much and isn't working now as they're moving to Slack (it would be good to post something there, too).</p>",
        "id": 153979567,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1532984118
    },
    {
        "content": "<p>I posted in the Snomed stream and copied to the Terminology chat.</p>",
        "id": 153979573,
        "sender_full_name": "Melva Peters",
        "timestamp": 1532987089
    },
    {
        "content": "<blockquote>\n<p>in principle it's not wrong to bind to multiple heirarchies but in particular cases it could be a very bad idea. I don't have an opinion on this particular value set</p>\n</blockquote>\n<p>It's not wrong to use content from multiple hierarchies, though caution is needed.   It will be necessary to use multi-hierarchy concepts to fulfil real world use cases.  The ValueSet, as it stands, doesn't include any concepts from different (numerous) hierarchies because it defines is-A 242990004 and there are no child concepts of 242990004 (and event) anyway.</p>",
        "id": 153985650,
        "sender_full_name": "Donna Truran",
        "timestamp": 1534139988
    }
]