[
    {
        "content": "<p>I'm working on the <code>$status</code> operation for <code>Subscription</code>, and am wondering if it is possible to restrict the parameters by usage type.  Specifically, at the <code>Resource</code> level, there is a parameter for <code>ids</code>, while that parameter is invalid at the <code>Instance</code> level.</p>\n<p>Other spreadsheets I found just include text saying it isn't valid at one/the other level - is there anything more, or just add the note and move on?</p>",
        "id": 199524484,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1591118309
    },
    {
        "content": "<p>Nothing more computable available at the moment</p>",
        "id": 199527179,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591119585
    },
    {
        "content": "<p>I guess you could define distinct OperationDefinition instances - one for each mode</p>",
        "id": 199527276,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591119618
    },
    {
        "content": "<p>Thanks Lloyd.  I thought about it, but they need to have different names (the tooling doesn't allow two operations with the same name), and I don't think I want to establish a pattern for that (e.g., <code>status-r</code> and <code>status-i</code> or some such).</p>\n<p>I've added the text for now, and will be happy to revisit later if a better option comes along.</p>",
        "id": 199528082,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1591120003
    },
    {
        "content": "<p>The tooling theoretically <em>should</em> allow the same name if the endpoints are different, but I accept that's the way things work now.  You might submit a change request?</p>",
        "id": 199528294,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591120120
    },
    {
        "content": "<p>Sure, I can file that.</p>",
        "id": 199528399,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1591120181
    },
    {
        "content": "<p>Created <a href=\"http://jira.hl7.org/browse/FHIR-27761\">FHIR#27761</a></p>",
        "id": 199529413,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1591120645
    }
]