[
    {
        "content": "<p>It's been pointed out by an \"infrequent\" committer that our expectation to activeliy monitor this stream is a bit much for some to manage.  (It's not uncommon to have 100+ posts a day, though most of those are posted by bots.  Our real intention with the \"if you want committer privileges, you must monitor this stream\" is:<br>\n1. check to make sure you didn't break the build<br>\n2. ensure you're up-to-date with any important announcements about tool changes, commit rule changes, freezes, deadlines, etc.</p>\n<p>For #1, you only need to actively monitor during the time-period you're doing commits.  #2 could be moved to a separate \"committer announcements\" stream which would be lower traffic (probably &lt;5 messages/week on average).  The main stream would be used for things like \"tx server is down\" or \"I have this bug\" and similar discussions as well as the standard bot-notification streams. </p>\n<p>Thoughts/opinions on making such a split?</p>",
        "id": 153990633,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1535066409
    },
    {
        "content": "<p>I think that would be awesome - I have a very hard time keeping up...</p>",
        "id": 153990637,
        "sender_full_name": "Sarah Gaunt",
        "timestamp": 1535067645
    },
    {
        "content": "<p>I agree.  If I've been gone for a week, I just \"read all\" because there is too much noise to find the signal</p>",
        "id": 153990640,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1535067880
    },
    {
        "content": "<p>an alternative is to puch all the bot notifications to committer-bots and leave this one as is</p>",
        "id": 153990672,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1535074735
    },
    {
        "content": "<p>Ignoring the bots is easy, zulip allows you to grab a stream and mark all read.  The hard to catch are the inspiration found within a discussion about how to unbreak the build. No idea how to capture those unless those participating can summarize their ah-ha moment onto a dedicated thread for those.</p>",
        "id": 153990745,
        "sender_full_name": "John Moehrke",
        "timestamp": 1535111921
    },
    {
        "content": "<p>There's still 20-30 comments a day that aren't bot-generated and 95%+ of that is not useful to people who aren't actively committing.  There are absolutely situations where a problem that someone had isn't relevent to you but becomes relevent to you when you run into the same problem 3 months later, but I'm not sure that's sufficient justification to tell people they must read all of the discussion - because the reality is they won't, and when they \"mark read\" they miss the important announcements too.</p>",
        "id": 153990772,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1535124923
    },
    {
        "content": "<p>Unfortunately sometimes those discussions have happened in the bot threads...</p>",
        "id": 153990781,
        "sender_full_name": "John Moehrke",
        "timestamp": 1535126275
    },
    {
        "content": "<p>My preference is to leave as is.  I'd rather look in one stream that have another one to monitor.  Agree with <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> sometimes discussions happen in bot threads and also happen in other streams where they shouldn't be happening.</p>",
        "id": 153990785,
        "sender_full_name": "Melva Peters",
        "timestamp": 1535126917
    },
    {
        "content": "<p>We can shut down discussions happening in the bot threads if we decide that's problematic.  I think the first question we need to answer is \"what are our expectations for non-frequent committers in terms of actually reading content - what do they HAVE to read?\"  The second question is \"How do we make it easy for them to read that without having to read everything else?\"</p>",
        "id": 153990791,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1535128765
    },
    {
        "content": "<p>I think reviewing the thread for information that might be useful is okay, if I can find it of course, but it does not replace the need for some resource that committers should be familiar with and thoroughly read prior to committing. This thread is long and chances that I will find all I need to properly commit are slim especially when working on tight timelines. However, reading a set of guidelines, rules, best practices and regularly reviewing such a document, would not be onerous for a sporadic committer like me.</p>",
        "id": 153990819,
        "sender_full_name": "Claude Nanjo",
        "timestamp": 1535135484
    },
    {
        "content": "<p>so, where did we end up with this?</p>",
        "id": 153992511,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1535773246
    },
    {
        "content": "<p>Seems to be a balance of opinions in favor and against.  I don't really understand the issue with splitting the stream - for those who want to monitor everything, it doesn't change the amount of effort and it's no harder to track the same content split to multiple places.  We'll have to police to make sure \"important\" stuff is on the key-info stream and general debate/discussion is on the other.  If you want to influence what happens, you need to be on both.  If you just want to know the rules, you can just be on the low traffic one.</p>",
        "id": 153992535,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1535777476
    },
    {
        "content": "<p>One of the criticism was that discussions end up mixed in on the status topics. Is it possible to create a read-only stream for the build status, and force discussion back here?</p>",
        "id": 153993119,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1536087896
    },
    {
        "content": "<p>No.  But we can nudge people to post in the right place (like we do with announcements)</p>",
        "id": 153993123,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536088121
    },
    {
        "content": "<p>Why isn't it possible? This would be a nice idea, to add a <code>#committers/notifications</code> stream or such-like.</p>",
        "id": 153993124,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1536088202
    },
    {
        "content": "<p>Are there concerns about this? We could migrate all notifications over to the new channel, and save this one for discussions among humans...</p>",
        "id": 153993125,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1536088231
    },
    {
        "content": "<p>Our objective with the split is to have the discussion somewhere that most people don't monitor</p>",
        "id": 153993126,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536088248
    },
    {
        "content": "<p>No -- to have it somewhere that's monitored _differently_.</p>",
        "id": 153993127,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1536088260
    },
    {
        "content": "<p>And to only have key announcements rule changes in the low-volume one</p>",
        "id": 153993128,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536088269
    },
    {
        "content": "<p>I'm confused.  Let's back up for a sec: today, #committers is used for important announcements like rule changes, and also for trivial automated announcements like \"build #19824 succeeded\".</p>",
        "id": 153993129,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1536088331
    },
    {
        "content": "<p>People will have to monitor the low volume one all the time - or read everything when they want to catch up and start publishing again.  The high volume one will only need to be monitored if you're actively publishing.</p>",
        "id": 153993130,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536088337
    },
    {
        "content": "<p>This makes it hard for people to monitor properly</p>",
        "id": 153993131,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1536088339
    },
    {
        "content": "<p>So <span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span> was asking to split this stream accordingly; are you saying we should do that, or we shouldn't, <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> ?</p>",
        "id": 153993132,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1536088371
    },
    {
        "content": "<p>If you're only publishing for a couple of months out of the year, you don't want to see the notifications, but you also don't want to see non-critical discussion</p>",
        "id": 153993133,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536088398
    },
    {
        "content": "<p>(e.g. like this thread :))</p>",
        "id": 153993134,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536088404
    },
    {
        "content": "<p>Right... I think we agree on this.</p>",
        "id": 153993135,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1536088421
    },
    {
        "content": "<p>So why not split the channel accordingly?</p>",
        "id": 153993136,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1536088429
    },
    {
        "content": "<p>That's the proposal - but read-only isn't going to help us.  We want discussions on the \"busy\" thread, but we'll need non-automated posts to the \"low-volume critical\" thread, so neither can be read-only.</p>",
        "id": 153993145,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536090153
    },
    {
        "content": "<p>seems those of us involved in 'committers' should be aware enough to not post into the bot stream ... right? do we really need to somehow mark it readonly?</p>",
        "id": 153993146,
        "sender_full_name": "John Moehrke",
        "timestamp": 1536090892
    },
    {
        "content": "<p>Posting on the bot stream won't be an issue.  The thing we'll have to manage is \"no discussion in the low-bandwidth stream\".</p>",
        "id": 153993148,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536091245
    },
    {
        "content": "<p>And the other thing we'll have to watch for is \"hey, that's important - can you please copy it to the low-bandwidth stream?\"</p>",
        "id": 153993149,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536091277
    },
    {
        "content": "<p>OK. I heard \"read-only\" as less literal than you did (especially since Zulip doesn't have a concept like that). I heard it as \"a place where most of the posting is from automated bots\".</p>",
        "id": 153993161,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1536093654
    },
    {
        "content": "<p>That won't fix the issue.  We need to split the discussion part from the rules part.  The non-frequent committers don't want to wade through 600 posts of discussion about how the build works and various build errors to glean the few tidbits of \"rules you must follow\" or \"hints you should know\".  Frequent committers will care about the bot stuff and discussion stuff in equal measure.</p>",
        "id": 153993183,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536094856
    },
    {
        "content": "<p>sounds to me like we should have committers/notifications and committers/announce</p>",
        "id": 153993184,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1536094926
    },
    {
        "content": "<p>why  fix what isn't broke , in for a dime in for a dollar and don't whine about committers channel.</p>",
        "id": 153993246,
        "sender_full_name": "Eric Haas",
        "timestamp": 1536099965
    },
    {
        "content": "<p>well, some people are not in for a dollar. And I don't think that we should say all or nothing in a volunteer organization. Also, IG authors are definitely not in for a dollar on the main build</p>",
        "id": 153993249,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1536100274
    },
    {
        "content": "<p>And the reality is that if the streams are too busy, people will just mark them as \"all read\" and miss the (few) critical pieces they should have seen.</p>",
        "id": 153993251,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536100516
    },
    {
        "content": "<p>I forgot about the IG Authoring bit,  I'd migrate the ig-build bot to the #<strong>IG Creation</strong> stream.</p>",
        "id": 153993272,
        "sender_full_name": "Eric Haas",
        "timestamp": 1536103856
    },
    {
        "content": "<p>IG Creation is of interest to lots of folks who aren't involved in committing HL7 content.  I think it's better to leave that one where it is.</p>",
        "id": 153993289,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536105219
    },
    {
        "content": "<p>I think the suggestion was to keep the discussion where it is and to also move the notifications over there (or to a distinct, related stream).</p>",
        "id": 153993314,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1536117688
    },
    {
        "content": "<p>My preference is the following: Add a new committers-annouce stream.  Sign up every person who has committer access to the main build or to an IG to that stream with an expectation that all committers SHALL keep up and read every post - perhaps by turning on notifications.  It will be used <em>only</em> for high-priority notifications around freezes, tooling and similar issues.  Require that discussion about such posts occur on the regular committers thread.  Keep the committers list as it stands with all bot notifications and commentary discussion and allow discussion to happen within what topics the users wish.  I.e. ig-build remains right where it is.</p>",
        "id": 153993315,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536118154
    },
    {
        "content": "<p>ok, </p>\n<ul>\n<li>Lloyd, you know who, so please create a committers/announce stream, and subscribe the appropriate parties</li>\n<li>Josh, you care for the bots... please create a committers/notifications stream and move the 3 bots there</li>\n</ul>",
        "id": 153993357,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1536134960
    },
    {
        "content": "<p>Perfect. Will do.</p>",
        "id": 153993391,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1536151253
    },
    {
        "content": "<p>Zulip gave me the option of just adding everyone from the existing committers stream - where everyone should already have been - so I did that instead.</p>",
        "id": 153993482,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536159124
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> We don't want the notifications coming to the /announce stream.  We want them on a separate /notification stream</p>",
        "id": 153993514,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536164156
    },
    {
        "content": "<p>I know -- working on it.</p>",
        "id": 153993515,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1536164337
    },
    {
        "content": "<p>There.</p>",
        "id": 153993519,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1536164810
    },
    {
        "content": "<p><a class=\"stream\" data-stream-id=\"142\" href=\"/#narrow/stream/142-committers.2Fnotification\">#committers/notification</a></p>",
        "id": 153993520,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1536164814
    },
    {
        "content": "<p>Can you subscribe everyone who's on committers?  All committers should be subscribed, though some might choose to mute the stream</p>",
        "id": 153993525,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1536167144
    },
    {
        "content": "<p>Hmm, there's a way to do it when creating a new stream. I'm looking for how to bulk update membership after the fact.</p>",
        "id": 153993526,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1536169205
    },
    {
        "content": "<p>Delete and re-created with 175 users from here.</p>",
        "id": 153993530,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1536169719
    },
    {
        "content": "<p>thanks both</p>",
        "id": 153993572,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1536177526
    },
    {
        "content": "<p>Would it be possible to split out the tracker notifications from <a class=\"stream\" data-stream-id=\"142\" href=\"/#narrow/stream/142-committers.2Fnotification\">#committers/notification</a>? I have no interest in check ins or builds, but find it interesting to see what tracker items are submitted. It probably doesn't need to be under the committers/* hierarchy. </p>\n<p>Or is the switch to Jira imminent and this could be done at the same time?</p>",
        "id": 154018641,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1542237016
    },
    {
        "content": "<p>Imminent is relative, but should be within the next 2 months.</p>",
        "id": 154018703,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542268100
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> is it easy to make it a new stream?</p>",
        "id": 154018722,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1542272137
    },
    {
        "content": "<p>We can make it a new stream, though I'd prefer ot cover this at the same time as the Jira changeover.  Also a quick note  <span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span> if you really have no interest in checkins or builds, you can always mute those topics.</p>",
        "id": 154019069,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1542357305
    },
    {
        "content": "<p>(Er, though I see -- not so easily because some of these topics are named after individual PRs, so you can't preemptively mute them.)</p>",
        "id": 154019070,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1542357353
    },
    {
        "content": "<p>Should we plan to make the new stream (when we changeover) called <code>committers/tracker-items</code> or some-such?</p>",
        "id": 154019071,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1542357403
    },
    {
        "content": "<p>We tend to end up with a topic per branch, which makes muting hard...</p>",
        "id": 154019072,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1542357452
    },
    {
        "content": "<p>it's actually really annoying to have a topic per PR</p>",
        "id": 154019090,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1542359358
    },
    {
        "content": "<p>but I assume this is a zulip decided thing.</p>",
        "id": 154019091,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1542359369
    },
    {
        "content": "<p>I'm ok to wait for changeover, though this is a convenience issue?</p>",
        "id": 154019092,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1542359388
    },
    {
        "content": "<p>Could we look at whether we could have a single committers/notification topic for pull requests, like we do for tracker items and build status?</p>",
        "id": 154019158,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1542376191
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> Thanks. This isn't an urgent need, I don't mind waiting.</p>",
        "id": 154019197,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1542387440
    }
]