[
    {
        "content": "<p>The FMG plans to put out a <em>limited scope</em> FHIR STU ballot.  I.e. The ballot will not cover everything in the core specification that was part of the May ballot.  Instead, it will be limited to those resources or pages that have undergone sufficient significant change that the responsible work group feels an additional ballot is necessary prior to publication of R4.  Note that we will only have about 4 weeks from the close of the WGM to content freeze for QA for R4 (and you'll need to get reconciliation complete before you can make your changes).  So it's in your interest to only ballot those things that really need it.  Please reply to this thread if there is content in your area of responsibility that you feel needs to be included in the Sept. ballot - preferrably before Wednesday afternoon :)</p>",
        "id": 153974393,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531174657
    },
    {
        "content": "<p>Pretty sure that VerificationResult and ProductPlan (soon to be renamed InsurancePlan once PA votes on the change - and gets FMG approval)</p>",
        "id": 153974561,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1531291194
    },
    {
        "content": "<p>ResearchStudy will have some minor changes: change condition element from a reference; add BRIDG mappings to mappings.</p>",
        "id": 153975014,
        "sender_full_name": "Julie Evans",
        "timestamp": 1531429466
    },
    {
        "content": "<p>Process question on this, if we don't say something is up for ballot, does that mean that we can't make changes to anything that wasn't balloted?</p>",
        "id": 153975179,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1531507315
    },
    {
        "content": "<p>And I know the deadline for this was Wednesday, is it too late (we're discussing this on CQI now).</p>",
        "id": 153975180,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1531507355
    },
    {
        "content": "<p>We'd like Measure and MeasureReport and Quality Reporting topics available to make sure we can support the DaVinci work.</p>",
        "id": 153975183,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1531507650
    },
    {
        "content": "<p>Substantive changes are allowed after an STU ballot without going back to ballot.  It's up to the WG to decide whether the degree of change has been sufficient to require an additional formal review.</p>",
        "id": 153975186,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1531507990
    }
]