[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> <span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> <span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> <span class=\"user-mention\" data-user-id=\"196523\">@Hugh Glover</span> <span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> <span class=\"user-mention\" data-user-id=\"191380\">@Elliot Silver</span> <span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> I've just created a series of tracker items (<a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=19510\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=19510\">GF#19510</a> - <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=19518\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=19518\">GF#19518</a>) that request the same set of changes to a bunch of request and event resources.  These changes were approved by workflow some time ago.  The first is most critical - changing 'context' to 'encounter' to ensure consistency with Observation for a rather important element.  The second change of adding the notion of 'reported' would still be good but isn't as critical.  Note that the first may also involve tweaking search parameters.  Substantive changes are supposed to be complete by EOD on Nov. 1.  If you don't have a call before then but feel the change will be non-controversial within your workgroup, feel free to pre-apply.</p>",
        "id": 154012061,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1540438621
    },
    {
        "content": "<p>Pharmacy has already added the \"reported\" element to MedicationRequest but needs to be updated to match pattern.  I expect that we can vote on the context change on Monday.</p>",
        "id": 154012187,
        "sender_full_name": "Melva Peters",
        "timestamp": 1540482629
    },
    {
        "content": "<p>OO changed all context to encounter</p>",
        "id": 154012246,
        "sender_full_name": "Eric Haas",
        "timestamp": 1540492858
    },
    {
        "content": "<p>OO to consider these as an event-extension for all OO resources will bring up  Oct 30th call.  I did not see an event extension present....</p>",
        "id": 154012248,
        "sender_full_name": "Eric Haas",
        "timestamp": 1540493153
    },
    {
        "content": "<p>Extension doesn't exist yet.  It will.  Just note what resources you want to be in the context for it.</p>",
        "id": 154012283,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1540498966
    },
    {
        "content": "<p>I don't like the name \"reported[x]\" since that overlaps with whether the item has been reported on.<br>\nAlso, how do we record Encounter for a resource which could be created as part of multiple events. Specifically, if a patient visits the department twice for the same imaging study or lab order (imaging with and without contrast; blood panel fasting and not fasting, etc.). Should encounter be 0..*?</p>",
        "id": 154012730,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1540582711
    },
    {
        "content": "<p>The encounter for a lab order is generally the encounter it's created in, not the encounters used to fulfill it.  If reported[x] doesn't work for your work group, you can use something different.  (It won't get in for Observation this round anyhow - and that's probably where it would be most problematic.)</p>",
        "id": 154012731,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1540582833
    },
    {
        "content": "<p>Actually, the reported[x] concept is weird for ImagingStudy. What does it mean? \"I told you I had images done, but you don't have records for them\"? \"Here are images done elsewhere, so we should flag them as hearsay imaging\"?</p>",
        "id": 154012732,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1540582942
    },
    {
        "content": "<p>Totally fine if that's not core (or even an extension) for ImagingStudy.  Essentially you need to answer the question of how would existing systems deal with a patient saying \"I had an X-Ray done over at such-and-such a hospital last week\".  If they'd create an ImagingStudy instance, then you need 'reported'.  If they'd capture it as a note or just nod their head and say \"that's nice\" without recording anything, no need for the element.</p>",
        "id": 154012734,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1540584177
    },
    {
        "content": "<p>ImagingStudy aside, I'd like the \"reported\" element renamed to something less likely to conflict with other uses of \"report\" (like, this X has been reported on). If this change is for any normative resources, we need to discuss now, otherwise it can wait.</p>",
        "id": 154012749,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1540590231
    },
    {
        "content": "<p>We already have reportedBy on quite a few resources</p>",
        "id": 154012752,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1540591210
    },
    {
        "content": "<p>Just an FYI that I'm running this by the Patient Care co-chairs to get a feel for how controversial it may be...</p>",
        "id": 154012771,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1540594839
    },
    {
        "content": "<p>One of the reasons for the change is that you might want to tie a record to both an Encounter and multiple episodes of care.  Right now, that's not possible.  With the change, you can.</p>",
        "id": 154012790,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1540598705
    },
    {
        "content": "<p>If they really feel that linking to episodeOfCare is core for some of their resources (i.e. most systems currently support that), they could add a core element for that too.</p>",
        "id": 154012791,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1540598753
    },
    {
        "content": "<p>Hos won’t of reported work for medstatemeht procedure observation?  I’m starting to think that it is already covered  medstatemnt. And observation.  I’m struggling to see it being used for media or task need to look at devicestatement.</p>",
        "id": 154012848,
        "sender_full_name": "Eric Haas",
        "timestamp": 1540646820
    },
    {
        "content": "<p>Procedure may need it but I’m just guessing</p>",
        "id": 154012849,
        "sender_full_name": "Eric Haas",
        "timestamp": 1540646852
    },
    {
        "content": "<p>How would it be reported not ‘hos won’t ‘</p>",
        "id": 154012850,
        "sender_full_name": "Eric Haas",
        "timestamp": 1540646949
    },
    {
        "content": "<p>Where is this element defined and used now?</p>",
        "id": 154012851,
        "sender_full_name": "Eric Haas",
        "timestamp": 1540647039
    },
    {
        "content": "<p>What's \"hos won't\"?</p>",
        "id": 154012859,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1540652057
    },
    {
        "content": "<p>How would</p>",
        "id": 154012866,
        "sender_full_name": "Eric Haas",
        "timestamp": 1540659663
    },
    {
        "content": "<p>iPhone :-)</p>",
        "id": 154012867,
        "sender_full_name": "Eric Haas",
        "timestamp": 1540659681
    },
    {
        "content": "<p>For Med statement, you might have a code that differentiated \"reported\" vs. \"inferred\" statements.  For Observation, probably outside the 80%, but I can see \"reported\" being used to distinguish direct device/clinician measurements from deferred patient reporting (e.g. when patient is on holiday or leave of absense).  For procedure, it'd be the difference between recording a surgery, councelling, etc. based on clinical knowledge of occurrence vs. patient or care provider reporting \"this happened\".</p>",
        "id": 154012934,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1540668637
    },
    {
        "content": "<p>In O.  If the  performer == patient RelatedPerson. Then it’s reasonable to infer its was reported depending on the use case eg an ehr</p>",
        "id": 154012962,
        "sender_full_name": "Eric Haas",
        "timestamp": 1540672621
    },
    {
        "content": "<p>I’m not seeing an extension very useful  since you would have to keep track of both for consistency.   And it would be potentially confusing</p>",
        "id": 154012964,
        "sender_full_name": "Eric Haas",
        "timestamp": 1540672774
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  I'm in the process of pre-applying the change from context to encounter on all PC resources.  I see the event-episodeOfCare extension, but is it OK to use the \"event\" extension for \"request\" resources (and non-workflow resources - like CareTeam)?</p>",
        "id": 154013007,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1540704457
    },
    {
        "content": "<p>@Eric - it depends on the context of the observation.  If it's a white blood cell count, almost certainly.  If it's weight and the patient has a dedicated device that auto-reports into their iPhone app, not necessarily.</p>",
        "id": 154013042,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1540743102
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span> That'll be fine for now.</p>",
        "id": 154013043,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1540743151
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Patient Care voted to approve the first half of the tracker (to change context to encounter), but didn't tackle the second half of the tracker (reported element).  Just wanted to confirm that I should leave the tracker in a Deferred status, pre-applied = yes, leading up to R4.  The alternative was splitting the tracker into 2 separate trackers where one is Applied and the other is Deferred.</p>",
        "id": 154014945,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1541112266
    },
    {
        "content": "<p>yes pre-applied and deferred</p>",
        "id": 154014948,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1541112485
    },
    {
        "content": "<p>2 trackers would actually be cleaner in terms of reporting substantive changes for each release...</p>",
        "id": 154014950,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1541112687
    }
]