[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> I have 65 workflow warnings to suppress for PC, but I noticed a couple things that I wanted clarified before I commit the changes because it is very tedious and I want to get this right the first time....  <br>\nMy questions stem from the observation that the workflow report attached to the tracker (<a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14446\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=14446\">GF#14446</a>) has different text for the same issue as compared to the latest workflow report you emailed.  Does the text need to be an exact match for the warning to get suppressed?</p>\n<ul>\n<li>If so, then it sounds like I need to reconcile all of the \"issues\" from the old XML (attached to the tracker) with the latest version and use the text from the latest report version.</li>\n<li>If not, then how is uniqueness guaranteed?  severity+pattern+path+issue isn't unique without resource.<br>\nI don't see others specifying the resource with the issue in suppressed-workflow-warnings.  This leads me to believe the text needs to be unique, but text is a moving target between versions of the workflow report.</li>\n</ul>",
        "id": 153941865,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1520034795
    },
    {
        "content": "<p>I sure hope I don't have to spend a few more hours doing this again too</p>",
        "id": 153941867,
        "sender_full_name": "Eric Haas",
        "timestamp": 1520034948
    },
    {
        "content": "<p>I'm not sure if this is the <em>only</em> difference, but examples are things like:</p>\n<ul>\n<li>FROM \"add to the ignore list\" TO: \"add to the 'suppressed-workflow-warnings' file\"</li>\n<li>FROM \"added to the 'workflow-warning-ignore' file\" TO \"added to the 'suppressed-workflow-warnings' file\"</li>\n</ul>",
        "id": 153941869,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1520035152
    },
    {
        "content": "<p>Unfortunately the answer is \"yes, the text needs to match exactly\".  If you can do a search &amp; replace, that should work.</p>",
        "id": 153941882,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1520036388
    },
    {
        "content": "<p>you got to be kidding me.   i'll just add the entire resource warnings to the suppress file.   keeping the old stuff in there should not matter right?</p>",
        "id": 153941883,
        "sender_full_name": "Eric Haas",
        "timestamp": 1520037439
    },
    {
        "content": "<p>Keeping the old stuff creates noise, but I can weed it out later</p>",
        "id": 153941885,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1520037802
    },
    {
        "content": "<p>what is the deadline for these warnings substantive freeze</p>",
        "id": 153941887,
        "sender_full_name": "Eric Haas",
        "timestamp": 1520037868
    },
    {
        "content": "<p>If the list of type mismatches or cardinality issues change, we want you to have to re-look at the warning, thus the need for string match.  The impact of the change to make the instruction text more consistent was unintentional.</p>",
        "id": 153941888,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1520037868
    },
    {
        "content": "<p>I'm sure was not intentional but this was a loads of work... I mean hours of work.  but updating them shouldn't be that bad</p>",
        "id": 153941889,
        "sender_full_name": "Eric Haas",
        "timestamp": 1520037937
    },
    {
        "content": "<p>when is the last list before the deadline?</p>",
        "id": 153941893,
        "sender_full_name": "Eric Haas",
        "timestamp": 1520038736
    },
    {
        "content": "<p>Planning to debug the transform and run it again tomorrow.</p>",
        "id": 153941902,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1520042381
    }
]