[
    {
        "content": "<p>I already made note of this on the conformance stream, but I will cross post. It would be nice if it was possible to break the build up a little into the various components. Something like having a core \"main\" build and then an ancillary's build (for things like profiles and the like).That way someone doesn't break the entire build because of a profiling mistake. Alternatively, it would be nice to build an individual item, such as a profile, on the fly(e.g. if I have the full build compiled and just want to test out some changes to a profile).</p>",
        "id": 153817380,
        "sender_full_name": "Corey Spears",
        "timestamp": 1458684812
    },
    {
        "content": "<p>yes we would like to do that. It's explicit policy that we need to do that </p>",
        "id": 153817381,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458685088
    },
    {
        "content": "<p>but it's a massive task. </p>",
        "id": 153817382,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458685096
    },
    {
        "content": "<p>it's on my list to do, and I've been chipping away at for months</p>",
        "id": 153817383,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458685140
    },
    {
        "content": "<p>Any way we can assist? I hate to ask for things or complain without offering any help I could possibly offer.</p>",
        "id": 153817394,
        "sender_full_name": "Corey Spears",
        "timestamp": 1458685718
    },
    {
        "content": "<p>I don't think so - testing once I have it split out</p>",
        "id": 153817395,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458686117
    },
    {
        "content": "<p>OK, well let me know if there is any testing I could assist with.</p>",
        "id": 153817437,
        "sender_full_name": "Corey Spears",
        "timestamp": 1458689947
    },
    {
        "content": "<p>A couple questions....  </p>\n<p>1) My local build initially succeeded and then upon a second rebuild locally (white space change in the resource file) the build failed because I hadn't updated an example.  Is this another implication of partial builds?  Is there a way to force a full build locally to catch all errors before I commit?  It seems inconsistent whether the local build succeeds or fails.  </p>\n<p>2) The reason I did the second build locally, with only a whitespace change, is because when I viewed the  \\publish profiles, I didn't see the changes I made to the base resources reflected in the local profile html pages.  Is that a known issue?  I tried to modify the profile spreadsheets, but I still don't see the local profile html reflect the base resource changes.</p>\n<p>If the additional context helps:  my changes in the base resources included things like a) allowing a choice of data types, and b) splitting apart an element that previously had a choice of data types into two elements so cardinality can be 0..*</p>",
        "id": 153817836,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1458771593
    },
    {
        "content": "<p>partial builds are unreliable. You can run with the parameter -nopartial to prevent them from happening</p>",
        "id": 153817848,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458773218
    },
    {
        "content": "<p>both issues sounds like partial build problems, though maybe I can investigate the second</p>",
        "id": 153817849,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458773253
    }
]