[
    {
        "content": "<p>I would like to hold a committers town hall meeting while we are in New Orleans. The main subject of the town hall meeting will be svn --&gt; GIT. I don't know whether we will have made the transition before then - we are supposed to - or we will still be working on it. But whether we have or not, we will be discussing new procedures, integrations etc - both describing decided things, and deciding other things.</p>\n<p>Attendance is, well, not exactly mandatory, but if you want to retain commit rights, you either need to attend the town hall, or nominate a delegate who is responsible for reporting the outcomes to you (e.g. so you learn about changed procedures).</p>\n<p>If you don't commit to the main FHIR svn, but you maintain a FHIR IG (or will), you should also attend.</p>\n<p>Finding a time in New Orleans will be difficult, I know. With that in mind, please fill out this doodle: </p>\n<p><a href=\"https://doodle.com/poll/f5ndydpt5rh4pyrq\" target=\"_blank\" title=\"https://doodle.com/poll/f5ndydpt5rh4pyrq\">https://doodle.com/poll/f5ndydpt5rh4pyrq</a></p>",
        "id": 153923882,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1512799843
    },
    {
        "content": "<p>Should I be looking at this in US/Central timezone to see the correct local times as they will be? (just checking)</p>",
        "id": 153923887,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1512811683
    },
    {
        "content": "<p>yes</p>",
        "id": 153924000,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1512886270
    },
    {
        "content": "<p>This will be Monday Lunch</p>",
        "id": 153926011,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1513624222
    },
    {
        "content": "<p>it will be hosted by FMG</p>",
        "id": 153926017,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1513625654
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"*\">@all</span> - reminder that lunch today is the committer's town hall meeting. Please join us at Parish once you have your lunch</p>",
        "id": 153932964,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517247717
    },
    {
        "content": "<p>you are the target of the town hall meeting if you commit content to any HL7 FHIR repository, whether svn or github</p>",
        "id": 153932965,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517247750
    },
    {
        "content": "<p>though we are principally interested in specification and IG editors</p>",
        "id": 153932966,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517247775
    }
]