[
    {
        "content": "<p>ok. after scheming with Josh, I came up with a system for handling tx-cache files that means they'll no longer be in git / github. Here's how things are going to work:</p>\n<ul>\n<li>there'll still be a tx-cache, and it will live in {user.home}\\.fhir\\tx-cache</li>\n<li>there'll be separate caches in that folder by {org}\\{repo}\\{branch}</li>\n<li>if the IG being built isn't linked to github, then the tx-cache will be in {root}\\temp\\tx-cache, and the expectation is that you don't commit to whatever version control you're using</li>\n<li>when the build runs (both main FHIR build, and IG build), it will look at the location for the tx-cache, and if the cache is out of date (combination of version flag in the code and on <a href=\"http://tx.fhir.org\">tx.fhir.org</a>), it will wipe it. </li>\n<li>when the build runs (both main FHIR build, and IG build), if the IG is linked to GH, and the cache is empty, it will initialise the cache from <a href=\"http://tx.fhir.org/tx-cache/{org}/{repo}/{branch}.zip\">http://tx.fhir.org/tx-cache/{org}/{repo}/{branch}.zip</a>, and if that doesn't exist, it'll try <a href=\"http://tx.fhir.org/tx-cache/{org}/{repo}/default.zip\">http://tx.fhir.org/tx-cache/{org}/{repo}/default.zip</a>. If neither are found, it will run with an empty cache</li>\n<li>when the ci-build runs, at the end of a successful run, it will update <a href=\"http://tx.fhir.org/tx-cache/{org}/{repo}/{branch.zip}\">http://tx.fhir.org/tx-cache/{org}/{repo}/{branch.zip}</a> with the cache it built.  If it's for main or master, will also update the default.zip</li>\n<li>Then anyone doing a build will pick that up <em>if they start with an empty cache</em></li>\n<li>there's a log of what's getting posted to the server at <a href=\"http://tx.fhir.org/tx-cache/log.txt\">http://tx.fhir.org/tx-cache/log.txt</a></li>\n<li>there's 450GB on the server for the cache. If it starts getting too big, I'll start pruning old caches, but the biggest cache I've seen so far is 9MB zipped, so I think that's a wee way off in the future</li>\n</ul>",
        "id": 260949971,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1636524944
    },
    {
        "content": "<p>Note: this system isn't fully operational yet - another day or two, and then we'll beta test it on the main build - once I'm happy with that, I'll roll it out to the IG build too.</p>",
        "id": 260950056,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1636525020
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> It looks like this is not happening yet for IGs?  When I rebuild the IG (IPS in this case) with an absent .fhir\\tx-cache and input-cache/txcache, it still rebuilds the cache in input-cache/txcache.  And I don't see a log entry being added for it.</p>",
        "id": 265764640,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1640146523
    },
    {
        "content": "<p>I haven't got to that yet</p>",
        "id": 265764856,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1640146865
    },
    {
        "content": "<p>Ok.  I assume that will happen at some point.  In the meantime, does it make sense with an IG to still commit the txcache files - or not?  If we remove the txcache from version control, then everyone needs to maintain their own.  But maybe that's not a bad idea?</p>",
        "id": 265765088,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1640147157
    },
    {
        "content": "<p>i never commit the txcache files for my IGs.  I admittedly don't have IGs the size of US Core or UTG, but I've built US Core before and it wasn't a hassle not having the txcache.</p>",
        "id": 265765447,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1640147631
    },
    {
        "content": "<p>That makes sense.  I think I will start doing the same.  I've just set it up and have been in the habit of committing them as that was the recommendation before.</p>",
        "id": 265765659,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1640147970
    }
]