[
    {
        "content": "<p>There are a bunch of JIRAs logged (across multiple work groups) stating that various value set OIDs are not available in HL7 OID registry.  Are we expected to be adding those value set OIDs to the registry?</p>",
        "id": 189894654,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1583503207
    },
    {
        "content": "<p>Individual work groups definitely are not.  It's not clear if it's something we'll bother doing in bulk.  <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> ?</p>",
        "id": 189901546,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1583507237
    },
    {
        "content": "<p>I don't know. would HL7 have to pay itself? <span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span> do we have a policy on this?</p>",
        "id": 189929367,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1583525197
    },
    {
        "content": "<p>We auto-import new v3 code systems and value sets.  Presumably that would be possible for FHIR content too.  My hope/expectation is that the OID registry will get sucked into UTG using the same change request approach as everything else</p>",
        "id": 189938204,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1583531511
    },
    {
        "content": "<p>Note sure about the OID registry itself Lloyd.  But we do have a policy at HL7 that OIDs created by HL7 WGs for objects in balloted HL7 published IGs and Standards (those in work that will become this when finished) are no charge whoever registers them.  As far as OIDs for FHIR project items, for any that fall under the above policy, we can import them in bulk (a simple matter of a wee bit of data manipulation); we have done this in the past for things like batches of Affiliate OIDs.   For FHIR connectathon projects done by non-HL7 groups, then that would have to be ruled on by HQ.</p>",
        "id": 189942496,
        "sender_full_name": "Ted Klein",
        "timestamp": 1583535012
    },
    {
        "content": "<p>Tactically, how should we handle all the JIRAs logged, such as <a href=\"http://jira.hl7.org/browse/FHIR-26405\" target=\"_blank\" title=\"http://jira.hl7.org/browse/FHIR-26405\">J#26405</a>, <a href=\"http://jira.hl7.org/browse/FHIR-26401\" target=\"_blank\" title=\"http://jira.hl7.org/browse/FHIR-26401\">J#26401</a>, <a href=\"http://jira.hl7.org/browse/FHIR-26400\" target=\"_blank\" title=\"http://jira.hl7.org/browse/FHIR-26400\">J#26400</a>?  Do we change the assigned work group if the registration will be done in bulk instead of by each of the respective WGs?  If so, should the work group be changed to Publishing or Vocab?</p>",
        "id": 190168555,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1583845328
    },
    {
        "content": "<p>Work group should be vocab.</p>",
        "id": 190180174,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1583851581
    },
    {
        "content": "<p>And yes, I'd suggest vocab discuss the issue once and then do a block vote on the rest</p>",
        "id": 190180232,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1583851607
    }
]