[
    {
        "content": "<p>Eric: the thing that's missing from the vital signs write up - which is otherwise great - is the idea that \"you must conform to this profile\"</p>",
        "id": 153818402,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1459186596
    },
    {
        "content": "<p>but it would good if we can move the examples into the spec. If you don't have time to do that, we could just make a note that we will do that</p>",
        "id": 153818403,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1459186638
    },
    {
        "content": "<p>i'm working on examples but I don't think can get it all done.  we already have some and need to update those to conform.   The existing examples also include a lot of other stuff to demonstrate the Observation resource as a whole so that may be confusing.  </p>",
        "id": 153818405,
        "sender_full_name": "Eric Haas",
        "timestamp": 1459190812
    },
    {
        "content": "<p>to clarify - \"you must conform to these profiles if you use FHIR\"  or if you claim conformance to the FHIR vitals profile you got to adhere to it?  </p>",
        "id": 153818406,
        "sender_full_name": "Eric Haas",
        "timestamp": 1459191272
    },
    {
        "content": "<p>I want to go for the first. </p>",
        "id": 153818407,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1459191316
    },
    {
        "content": "<p>\"you must conform to this profile if you do vital signs in FHIR\"</p>",
        "id": 153818408,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1459191338
    },
    {
        "content": "<p>i thought so  - and where we put that in the profile is too hidden.  We need a section in Observation?</p>",
        "id": 153818409,
        "sender_full_name": "Eric Haas",
        "timestamp": 1459191440
    },
    {
        "content": "<p>maybe. Or a comment where we link to it, and in the header of the profile</p>",
        "id": 153818410,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1459191472
    },
    {
        "content": "<p>I am assuming this is first instance where FHIR would be profiling a resource and requiring conformance</p>",
        "id": 153818411,
        "sender_full_name": "Eric Haas",
        "timestamp": 1459191544
    },
    {
        "content": "<p>yes</p>",
        "id": 153818413,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1459192097
    },
    {
        "content": "<p>OK let me know what you think after the next commit.  I will make the appropriate trackers next.</p>",
        "id": 153818420,
        "sender_full_name": "Eric Haas",
        "timestamp": 1459195711
    },
    {
        "content": "<p>What about systems that convert arbitrary v2 data to Observation instances and can't tell if they're dealing with vital signs or something else?</p>",
        "id": 153818431,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1459198333
    },
    {
        "content": "<p>they'll have to start thinking about it </p>",
        "id": 153818440,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1459198515
    },
    {
        "content": "<p>If the OBX doesn't use a code system they recognize (or worse, doesn't use a code system at all), thinking about it isn't going to help much.</p>",
        "id": 153818442,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1459198581
    },
    {
        "content": "<p>Sorry just picked this up so may have the \"wrong end of the stick\" - but is this thread talking about mandating certain profiles in FHIR?</p>",
        "id": 153818445,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1459198605
    },
    {
        "content": "<p>It appears to be :)  I think this sort of thing needs pretty broad discussion.</p>",
        "id": 153818446,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1459198651
    },
    {
        "content": "<p>yes. That's why we're putting it in - to generate the dsicussion</p>",
        "id": 153818447,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1459198698
    },
    {
        "content": "<p>We could make the requirement contingent on use of a specific Observation.category.  </p>",
        "id": 153818448,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1459198699
    },
    {
        "content": "<p>I would hope so - The reason I picked it up is we are just creating some vital signs profiles ourselves</p>",
        "id": 153818449,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1459198712
    },
    {
        "content": "<p>well, check what we've done. We're establishing a floor; you can go beyond that. We'll be interested if oout minimal rules are a problem for someone</p>",
        "id": 153818450,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1459198755
    },
    {
        "content": "<p>I think \"picking it up\" needs to be very directed - I don't recall there being any previous statements in FHIR about going in this direction. Where do i see the profile? and is it only \"Vital Signs\"</p>",
        "id": 153818451,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1459198797
    },
    {
        "content": "<p>I was planning on this as part of a set of things to look at once the freeze is done</p>",
        "id": 153818452,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1459198841
    },
    {
        "content": "<p>here: code.extension[</p>",
        "id": 153818453,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1459198869
    },
    {
        "content": "<p>here: <a href=\"http://hl7-fhir.github.io/observation-vitalsigns.html\" target=\"_blank\" title=\"http://hl7-fhir.github.io/observation-vitalsigns.html\">http://hl7-fhir.github.io/observation-vitalsigns.html</a></p>",
        "id": 153818454,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1459198877
    },
    {
        "content": "<p>Well that's going to be problematic for us - we would not use LOINC</p>",
        "id": 153818456,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1459198995
    },
    {
        "content": "<p>why would you not use LOINC, and why would it be problematic? </p>",
        "id": 153818457,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1459199026
    },
    {
        "content": "<p>note that the profile doesn't say: you must only use LOINC. It just says, you must provide at least these LOINC codes</p>",
        "id": 153818458,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1459199073
    },
    {
        "content": "<p>Our choice of terminology is a national decision made independently of our \"messaging standards\".</p>",
        "id": 153818459,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1459199088
    },
    {
        "content": "<p>We would not use \"LOINC\" at all</p>",
        "id": 153818460,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1459199126
    },
    {
        "content": "<p>It should be rather easy to tell whether you have a \"vital sign\" if we define one for the purpose of this profile as being an observation with an Observation.code that is one of the codes listed in 4.31.15.1 Vital Signs Table.  As soon as we go beyond that, though, I think it's going to be significantly more difficult to determine and there won't be complete consistency.  If that's not OK, then I defnititely think we need further discussion.  And Richard just gave a good example - not everyone does or can use LOINC (even for just a few codes).</p>",
        "id": 153818461,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1459199147
    },
    {
        "content": "<p>well, understand this: if we cannot agree on a common profile, there will be no way to share vital signs through social media. </p>",
        "id": 153818462,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1459199154
    },
    {
        "content": "<p>When do  we want to move this discussion to implementers chat and OO.  Imagining it will get a bit of traffic.</p>",
        "id": 153818463,
        "sender_full_name": "Eric Haas",
        "timestamp": 1459199191
    },
    {
        "content": "<p>Adding a LOINC code in addition to whatever codes you would otherwise use seems like a small price to pay to allow everyone to share vital signs</p>",
        "id": 153818464,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1459199195
    },
    {
        "content": "<p>everyone *can* use LOINC. </p>",
        "id": 153818465,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1459199218
    },
    {
        "content": "<p>yes, in regard to licensing, that't true</p>",
        "id": 153818466,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1459199241
    },
    {
        "content": "<p>Hmm - I think we are straying way of territory now.  As you know we already have some questions re FHIR in England. These sort of decisions are going to fuel that debate.</p>",
        "id": 153818467,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1459199300
    },
    {
        "content": "<p>and yes, it's probably appropriate to move the discussion to implementers channel</p>",
        "id": 153818468,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1459199317
    },
    {
        "content": "<p>well, Richard, the core question for you o consider is: do we believe that patient's have a right to share data? </p>",
        "id": 153818469,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1459199336
    },
    {
        "content": "<p>and if so, do we think that we'll pursue a UK only strategy that ensures that no tools from outside england can be used with patient's data?</p>",
        "id": 153818470,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1459199369
    },
    {
        "content": "<p>I don't see how the choice of LOINC makes it  UK approach (or not). There are a whole heap of Information Governance laws locally here that would pose far more barriers that the inclusion of  LOINC code or not.</p>",
        "id": 153818471,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1459199548
    },
    {
        "content": "<p>well, what we're trying to introduce here is a floor that will make all vital signs interoperable to some degree. We could have defined our own fixed codes, but we might as well us LOINC. We're trying to create at least the possibility that patients and providers will be able to share data and/or tools that moniter vital signs across jurisdictions. </p>",
        "id": 153818473,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1459199677
    },
    {
        "content": "<p>I realise that we're all accostumed to thinking of our borders as inviolate, but it's not the case any more. </p>",
        "id": 153818474,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1459199707
    },
    {
        "content": "<p>it may well be that we can't get everyone to agree on even such a simple base as this</p>",
        "id": 153818475,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1459199727
    },
    {
        "content": "<p>but that will have lasting consequences for patients and providers</p>",
        "id": 153818476,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1459199742
    },
    {
        "content": "<p>Agreed. Would love to see everyone agree on the same codes for something like Vitals. The value would be obvious and might spur interoperability in other areas. </p>",
        "id": 153818477,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1459199877
    },
    {
        "content": "<p>It seems like there ought to be other possible ways of handling that.  Presumably any sharable NHS vital signs data coded in SNOMED CT (or Read codes) could be rather easily translated to the equivalent LOINC codes, if that's what's required for sharing (via social media or otherwise).  But it might not be the NHS that would do that encoding/translating.  And if the NHS (as only one example) doesn't do the LOINC bit, hopefully they will still be able to use FHIR for this data with the SNOMED CT (or Read) codes.</p>",
        "id": 153818478,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1459199884
    },
    {
        "content": "<p>Rob, yes, maybe. But it would still mean that no smart on fhir apps that do vital signs could be used in the NHS</p>",
        "id": 153818481,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1459199951
    },
    {
        "content": "<p>without that translation layer. </p>",
        "id": 153818482,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1459199966
    },
    {
        "content": "<p>I hear what you are saying but that is such a edge case at the moment in out \"geography\" the burden of FHIR mandating information models and terminology is an unexpected direction of travel. We'll have to have a think about that.</p>",
        "id": 153818483,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1459199969
    },
    {
        "content": "<p>ok. well, that's what I pushed to add it for - the spur the debate and the consideration of the consequences. </p>",
        "id": 153818484,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1459200007
    },
    {
        "content": "<p>the idea we have is that requiring a few fixed LOINC codes in addition to whatever else you are doing is a small price to pay to enable interoperability at a higher level</p>",
        "id": 153818486,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1459200044
    },
    {
        "content": "<p>Grahame, yes, that would be a consequence - and if it becomes compelling enough, then the NHS (and others in a similar situation) might decide to change their position on it</p>",
        "id": 153818487,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1459200092
    },
    {
        "content": "<p>That's basically what Continua did with the personal health monitoring report. Required IEEE codes in addition to whatever any region required. Worked well. </p>",
        "id": 153818488,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1459200096
    },
    {
        "content": "<p>I don't concur - if a system wants to make use of SMART on FHIR then that would be a providers choice and they could \"choose\" to use LOINC to enable that. We have many, many other information flows where there is no such requirement. The NHS is not one system it is a federated network of systems. Forcing it on the whole would be painful and I'm not sure people would accept the pain.</p>",
        "id": 153818493,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1459200274
    },
    {
        "content": "<p>it's that painful? As far enabling it, sure. You can always enable it at the distal end of a workflow - for greater cost. </p>",
        "id": 153818497,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1459200426
    },
    {
        "content": "<p>but you should think through this, because obviously it will be a longer discussion - there will be plenty of people like Rick who really want us to get a base profile that everyone agrees to. </p>",
        "id": 153818498,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1459200478
    },
    {
        "content": "<p>ok  - we'll leave it for now. We are having \"a lot\" of conversations about the operational impact of FHIR at the moment and message size is under a lot of scrutiny. As well as the ITS, mandated elements that offer no value (in specific use cases) we overlay carrying terminology codes that offer no value (in our use cases). It all adds up. Perhaps it is the nature of the NHS but we have systems that peak at very high transaction levels and it all counts. We'll have to assess this further(and not at 10:30pm :-) )</p>",
        "id": 153818500,
        "sender_full_name": "Richard Kavanagh",
        "timestamp": 1459200888
    },
    {
        "content": "<p>ok sure. madated elements that offer no value - make sure these get reviewed by the relevant committee to ensure that they're not erroneously mandated</p>",
        "id": 153818502,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1459200996
    },
    {
        "content": "<p>I've moved this stream to implementers chat here <a href=\"https://chat.fhir.org/#narrow/near/7801/stream/committers/topic/vital.20signs\" target=\"_blank\" title=\"https://chat.fhir.org/#narrow/near/7801/stream/committers/topic/vital.20signs\">https://chat.fhir.org/#narrow/near/7801/stream/committers/topic/vital.20signs</a></p>",
        "id": 153818505,
        "sender_full_name": "Eric Haas",
        "timestamp": 1459201179
    },
    {
        "content": "<p>can keep this for build stuff</p>",
        "id": 153818507,
        "sender_full_name": "Eric Haas",
        "timestamp": 1459201192
    },
    {
        "content": "<p>@GG  its loaded so you can see how I made the profile link prominent in the resource as well as the fact that is required.  maybe a bit heavyhanded but  I think it will get noticed.</p>",
        "id": 153818519,
        "sender_full_name": "Eric Haas",
        "timestamp": 1459201666
    },
    {
        "content": "<p>I'm going to trim the table to remove BSA , body length - which rolls up into body height, and  change  a few more to methodless.</p>",
        "id": 153818591,
        "sender_full_name": "Eric Haas",
        "timestamp": 1459206470
    }
]