[
    {
        "content": "<p>I have some vocabulary (e.g. AuditEvent) that got migrated to <a href=\"http://terminology.hl7.org\">terminology.hl7.org</a> (THO). This was not done by the security wg that owned these codeSystems. I am not sure by what process it was decided to migrate some but not others... However I am now stuck with the result, as I am sure others are as well.</p>",
        "id": 245186283,
        "sender_full_name": "John Moehrke",
        "timestamp": 1625667204
    },
    {
        "content": "<p>a) Is there a way to revert these back? I have some examples where the codeSystem is very tied to the FHIR model or the standards upon which the FHIR model is derived (e.g. AuditEvent.outcome). These codes come from DICOM, which got them from SYSLOG.</p>",
        "id": 245186547,
        "sender_full_name": "John Moehrke",
        "timestamp": 1625667317
    },
    {
        "content": "<p>b) When I get a Jira CR filed aginst FHIR that is asking to revise the codeSystem that is now managed in THO... What is the process for handling this? I Presume there is some responsibility by the originally owning workgroup. But I understand that the Jira ticket to change THO has to be in the THO project (??). Presume there is some conversion or linkage?</p>",
        "id": 245186889,
        "sender_full_name": "John Moehrke",
        "timestamp": 1625667452
    },
    {
        "content": "<p>Surely others have figured this out. I am just now faced with it, and don't recall where to find guidance instructions (or help).</p>",
        "id": 245187025,
        "sender_full_name": "John Moehrke",
        "timestamp": 1625667497
    },
    {
        "content": "<p>a) Those should be in THO as an externally hosted terminology.  They're obviously useable outside a specific resource because we got them from outside, so they shouldn't be maintained as a FHIR-specific terminology<br>\nb) No Jira ticket.  You submit a UTG ticket to change the code system.  Ask <span class=\"user-mention\" data-user-id=\"195036\">@Carol Macumber</span> for guidance on how to do that</p>",
        "id": 245206783,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1625675223
    },
    {
        "content": "<p>Happy to help from an HTA perspective. Also copying <span class=\"user-mention\" data-user-id=\"196635\">@Jessica Bota</span></p>",
        "id": 245210588,
        "sender_full_name": "Carol Macumber",
        "timestamp": 1625676981
    },
    {
        "content": "<p>isn't a UTG ticket a Jira ticket?</p>",
        "id": 245215251,
        "sender_full_name": "John Moehrke",
        "timestamp": 1625679093
    },
    {
        "content": "<p>what do I do with the Jira ticket that someone has already logged against the FHIR specification?</p>",
        "id": 245215364,
        "sender_full_name": "John Moehrke",
        "timestamp": 1625679142
    },
    {
        "content": "<p>Mark it persuasive with Mod in favour of the UTG ticket</p>",
        "id": 245215434,
        "sender_full_name": "David Pyke",
        "timestamp": 1625679180
    },
    {
        "content": "<p>It can't really be 'in favor of'.  The Spec Feedback ticket can't be marked as 'applied' until the related UTG ticket has been applied.</p>",
        "id": 245223443,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1625682872
    },
    {
        "content": "<p>so is there an automated way? Seems there is a linkage feature in jira but I am not aware of how to use it for this or if it is accepable.</p>",
        "id": 245224180,
        "sender_full_name": "John Moehrke",
        "timestamp": 1625683187
    },
    {
        "content": "<p>a UTG ticket is a Jira ticket within the UP project</p>",
        "id": 245228551,
        "sender_full_name": "Jessica Bota",
        "timestamp": 1625685193
    },
    {
        "content": "<p>No automated way.  Two separate processes living in the same tool.  The best you can do is link one to the other for traceability purposes.</p>",
        "id": 245235030,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1625688267
    },
    {
        "content": "<p>Minimal chance of us ever trying to introduce an automated way either.  That's a scary notion...</p>",
        "id": 245235072,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1625688293
    }
]