[
    {
        "content": "<blockquote>\n<p>The intention is that info and warning messages that haven't been suppressed should be paid the same attention as error.  Every single one of them needs to be dealt with - whether that's by fixing the source or by saying \"yeah, that's fine\" and putting it into the suppression file.  (Note: Don't suppress messages that are caused by tooling issues - or no one will ever get around to fixing them.)</p>\n</blockquote>\n<p>After Rob's ICD-10 fix, my build finally ran to completion.  I'm suppressing all of the warning and information messages just so I can see the details, but the two summary lines were eye-opening:<br>\n Errors=0, Warnings=34082, Information messages=5544<br>\n Errors: 0 Warnings: 1004 Hints: 1087</p>\n<p>Basically, if I take what <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> at face value that every message needs to be treated as an error, that means we have a woefully poor quality build right now with over 35k warninsg and 6500 information messages.  As well, there are a bunch of miscellaneous error-like messages spit out throughout the build, eg. Missing IsModifierReason on AppointmentResponse.participantStatus, Unresolved value set reference: <a href=\"http://www.rsna.org/RadLex_Playbook.aspx\" target=\"_blank\" title=\"http://www.rsna.org/RadLex_Playbook.aspx\">http://www.rsna.org/RadLex_Playbook.aspx</a>, No value set at Group.code, etc.</p>\n<p>Do we have a plan on fixing all of these or reviewing the error check to see if it is something that we really care about?</p>",
        "id": 169037892,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1561560556
    },
    {
        "content": "<p>Even more exciting, some of the information and warning messages really should be treated as error messages.  The challenge we've had is that there's never a good time to strictly enforce the rules and break the build until everyone goes through and fixes their stuff.  There's always an upcoming connectathon or IG publication or something that trumps getting stuff fixed - which is a problem.  (Spitting stuff out to the console rather than raising trackable errors/warnings/etc. is also a problem and is easier to address.  We <em>do</em> also have problems where on occasion some of the messages can be spurious - as <span class=\"user-mention\" data-user-id=\"191369\">@Andy Stechishin</span> mentioned.  I do agree that we really need to get these things fixed.</p>",
        "id": 169038438,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1561560893
    },
    {
        "content": "<p>But no, there currently isn't a plan.</p>",
        "id": 169038453,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1561560900
    }
]