[
    {
        "content": "<p>I want to change some valueset values in ResearchStudyStatus. Do I need to submit a tracker? I'm going to commit an updated version of ResearchStudy with the updated valueset, but don't know if I also need to submit a tracker. Thx.</p>",
        "id": 153916974,
        "sender_full_name": "Julie Evans",
        "timestamp": 1509471058
    },
    {
        "content": "<p>It's always good practice to submit a tracker if you are going to make a change, so I would go ahead and do that.  It definitely helps with keeping track of all the changes, whether it's vocabulary or anything else.</p>",
        "id": 153916979,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1509472217
    },
    {
        "content": "<p>Thanks! Does submitting a tracker for vocab changes fill the requirement for the deadline to \"submit all initial vocabulary proposals\" by November 3rd?</p>",
        "id": 153916980,
        "sender_full_name": "Julie Evans",
        "timestamp": 1509472604
    },
    {
        "content": "<p>I'm not sure what deadline that is.  The submission deadline for initial vocabulary and other harmonization proposals was Oct. 28, and I'm not thinking of anything for vocabulary on Nov. 3.  Can you provide additional detail (and maybe jog my memory)?</p>",
        "id": 153916983,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1509473079
    },
    {
        "content": "<p>I'm looking at this page: <a href=\"http://wiki.hl7.org/index.php?title=FHIR_Ballot_Prep\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=FHIR_Ballot_Prep\">http://wiki.hl7.org/index.php?title=FHIR_Ballot_Prep</a> with these dates (see last line of dates for 3 Nov date):</p>\n<p>Ballot schedule<br>\nJanuary 2018 Cycle</p>\n<p>Single FHIR Core 'For Comment' Ballot, possible IG R3-based STU ballots, possible IG R4-based 'For Comment' ballots</p>\n<p>The purpose of this ballot is to provide an early review of candidate normative content to ensure quality is in place and identify as many substantive issues as possible in advance of the normative ballot. It also provides a QA point for other resources as we prepare for the May STU ballot. Tracker items received as a result of this ballot don't require formal resolution or change application prior to the opening of the following ballot, though work groups should do their best - prioritizing normative - to resolve what they can. Unresolved comments will carry forward but will not carry ballot weight unless someone references them in a subsequent ballot.</p>\n<div class=\"codehilite\"><pre><span></span>2017-10-18 - Deadline for connectathon proposals to FMG\n2017-10-25 - Work groups inform the FMG of any implementation guides they&#39;d like to ballot in Dec. cycle (strong preference to not ballot against R3 at this time unless essential for regulatory or similar reasons)\n2017-11-03 - Initial vocabulary proposals are due\n</pre></div>",
        "id": 153916984,
        "sender_full_name": "Julie Evans",
        "timestamp": 1509473293
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> that date looks like an error to me</p>",
        "id": 153916989,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1509483062
    },
    {
        "content": "<p>Yes, it's an error.  Both dates are wrong for the initial and final harmonization proposals (and it doesn't mention harmonization specifically).  I'll update the page if that's OK.</p>",
        "id": 153916994,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1509484687
    },
    {
        "content": "<p>please do</p>",
        "id": 153916995,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1509484929
    },
    {
        "content": "<p>done</p>",
        "id": 153916996,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1509485274
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192947\">@Julie Evans</span> So the initial vocabulary harmonization proposal deadline has already passed, but if you do have proposals that need to be submitted there still may be a possibility of getting them included for this cycle, prior to the final deadline on the 25th.  If you have something, we could possibly bring it to the Vocabulary WG call this Thursday (at least to start the process).</p>",
        "id": 153916999,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1509485521
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> , what do I need to do to bring the proposals to the vocab WG call this Thursday?</p>",
        "id": 153917186,
        "sender_full_name": "Julie Evans",
        "timestamp": 1509558801
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192947\">@Julie Evans</span> The first thing I think I would suggest is to send what you have to me and let me take a look.  Then I can get back with you with what I think would make the most sense to do - likely we can have some agenda time tomorrow if we need it.</p>",
        "id": 153917243,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1509572667
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> I've sent our proposals to your gmail account. Thanks!</p>",
        "id": 153917271,
        "sender_full_name": "Julie Evans",
        "timestamp": 1509593668
    }
]