[
    {
        "content": "<p>Grahame and I were chatting today about how to show implementers some of the common patterns for how resources may be used to solve business problems.  Something along the notion of \"Common Workflows\".  One of our concerns was how we'd make people aware that this page existed or was relevant.  My proposal was to add an automated section to each resource page titled \"Used in the following common workflows:\".  It would mean we'd need to capture a bit of metadata (workflow name and used resources) for each workflow, but it would significantly increase the number of people who were aware of the page.  What do others think about us adding this to the spec?</p>",
        "id": 153815866,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1458142324
    },
    {
        "content": "<p>I think this is a good idea - it helps give people a sense of how the resources are meant to be used. But note that this is not the same as adding prescriptive workflows to the spec</p>",
        "id": 153815893,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458161446
    },
    {
        "content": "<p>why are ther two tasks ( we like it so much we put it in twice :))</p>",
        "id": 153815900,
        "sender_full_name": "Eric Haas",
        "timestamp": 1458164580
    },
    {
        "content": "<p>two tasks? </p>",
        "id": 153815901,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458164696
    },
    {
        "content": "<p>One page documents the flow.  The resources would just include links to that page to help with discovery and also to provide an indication of some of the workflows the resource is associated with</p>",
        "id": 153815924,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1458167967
    },
    {
        "content": "<p>I like that idea, and I have several test resources in an example workflow that we've put together for the connect-a-thon track.</p>",
        "id": 153816024,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1458193775
    }
]