[
    {
        "content": "<p>From track plans in Jan (<a href=\"https://confluence.hl7.org/pages/viewpage.action?pageId=130482809\">https://confluence.hl7.org/pages/viewpage.action?pageId=130482809</a>):</p>\n<blockquote>\n<ol>\n<li>Trusted Dynamic Registration &amp; JWT-Based Authentication (Consumer Facing)<br>\nPrecondition: Client has user-level credentials for FHIR server and client's UDAP certificate is trusted<br>\nSuccess Criteria:  Client app successfully registers, authenticates, and obtains FHIR data leveraging a trusted certificate. Client should validate server metadata per UDAP Server Metadata profile.</li>\n</ol>\n</blockquote>\n<p>I'm confused by the language. Does the precondition mean that the client is asking for the user's credentials, and not doing an OAuth cdoe flow the way <a href=\"http://build.fhir.org/ig/HL7/fhir-udap-security-ig/consumer.html\">http://build.fhir.org/ig/HL7/fhir-udap-security-ig/consumer.html</a> documents? Or is this language just a bit confusing?</p>",
        "id": 263495579,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1638476588
    },
    {
        "content": "<p>Also for this track, when working with an endorsement: if the client doesn't participate in mutual TLS, how does the endorsement's <code>sub</code> get populated? <a href=\"https://www.udap.org/udap-certifications-and-endorsements.html\">https://www.udap.org/udap-certifications-and-endorsements.html</a> doesn't list the <code>sub</code> as optional, but the following suggests it's not required:</p>\n<blockquote>\n<p>To facilitate key rollover, binding using the sub claim URI is preferable to binding to a specific key.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"195299\">@Luis Maas</span></p>",
        "id": 263783030,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1638730348
    },
    {
        "content": "<p>And when presenting an endorsement at registration time, how is a client expected to demonstrate possession of one (or more) keys in the JWKS? The requirement is specified but I don't see any mechanism specified.</p>",
        "id": 263783062,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1638730397
    },
    {
        "content": "<p>Also <span class=\"user-mention\" data-user-id=\"195299\">@Luis Maas</span> I think I understand <a href=\"http://build.fhir.org/ig/HL7/fhir-udap-security-ig/registration.html#request-body\">http://build.fhir.org/ig/HL7/fhir-udap-security-ig/registration.html#request-body</a> but I don't understand  what the sections above (\"Client Credentials\" and \"Authorization Code\") are about. Are they copy/paste mistakes, or can you help me understand what they mean?</p>",
        "id": 263932365,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1638828788
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> mutual TLS is not required for certifications;  the client would use a URI from the subjectAltName extension of their signing cert to populate <code>sub</code>. The <code>sub</code> field is required. Binding to a specific key is done by including  the <code>jwks</code> claim in the certification; the comment re: rollover means that including the <code>jwks</code> is <em>not</em> preferred in certifications and endorsements; rather, binding of the client to the certification or endorsement JWT is done by confirming <code>sub</code> matches a URI entry in the subjectAltName extension of the client's certificate and that the certificate is from a trusted issuer.</p>",
        "id": 263935286,
        "sender_full_name": "Luis Maas",
        "timestamp": 1638830498
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> yes, the three introductory paragraphs one the page you noted (\"Client Credentials\" and \"Authorization Code\") are slated to be moved out of this section. Just haven't made the change yet ;)</p>",
        "id": 263935814,
        "sender_full_name": "Luis Maas",
        "timestamp": 1638830855
    },
    {
        "content": "<p>re: presenting the endorsement, the client still supplies a signed software_statement in the POST body to the registration endpoint; if the endorsement contains a <code>jwks</code> value, then the client must use one of the corresponding private key to sign the software_statement or the endorsement will not be accepted by the OAuth server processing the registration. Similarly, all JWTs used in subsequent token requests must also be signed using one of the corresponding private keys. Note that this is in addition to validating the endorsement <code>sub</code> matches one of the URIs in the client certificate's subjectAltName extension.</p>",
        "id": 263936766,
        "sender_full_name": "Luis Maas",
        "timestamp": 1638831431
    },
    {
        "content": "<p>sorry for answering out of order...<br>\nre:</p>\n<blockquote>\n<p>I'm confused by the language. Does the precondition mean that the client is asking for the user's credentials, and not doing an OAuth cdoe flow the way <a href=\"http://build.fhir.org/ig/HL7/fhir-udap-security-ig/consumer.html\">http://build.fhir.org/ig/HL7/fhir-udap-security-ig/consumer.html</a> documents? Or is this language just a bit confusing?</p>\n</blockquote>\n<p>Yes the language is confusing: It should say \"User has user-level credentials...\"</p>",
        "id": 263938147,
        "sender_full_name": "Luis Maas",
        "timestamp": 1638832227
    },
    {
        "content": "<p>Thanks for the responses! In your view is there a role for self signed certs on a software statement? (Looking at per device registration scenarios which I know are listed as future scoped, but wanted to build some prototypes. My take is that per device keys would be strictly better than a public client registration, and could work with self signed software statements and a locked down endorsement JWT )</p>",
        "id": 263943714,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1638836473
    },
    {
        "content": "<blockquote>\n<p>if the endorsement contains a <code>jwks</code> value, then the client must use one of the corresponding private key to sign the software_statement </p>\n</blockquote>\n<p>Ah, so \"one of\" is all that's intended. Ok, that's unclear.</p>",
        "id": 264009384,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1638887589
    },
    {
        "content": "<p>See <a href=\"#narrow/stream/179247-Security-and.20Privacy/topic/Trusted.20app.20instance.20registration.20and.20UDAP\">https://chat.fhir.org/#narrow/stream/179247-Security-and.20Privacy/topic/Trusted.20app.20instance.20registration.20and.20UDAP</a> with notes on this topic, given our deep dive last week.</p>",
        "id": 264914716,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1639510970
    }
]