[
    {
        "content": "<p>Hello All,<br>\nWe are in the process  of implementing of AllergyIntolerance Profile, the cardinality of the reaction.manifestation is 1..* and it is also considered as the USCDI element as \"reaction\" so considering cardinality and USCDI this would be mandatory element for Inferno Program Edition Test (USCAI-07) to pass under AllergyIntolerance i.e. it cannot be skipped or cannot be replaced by DAR.<br>\nIs our understanding correct about this element..? Looking forward to reply for better understanding. Thanks.</p>",
        "id": 259198428,
        "sender_full_name": "Nandan Sharma",
        "timestamp": 1635316884
    },
    {
        "content": "<p>In US Core v3.1.1, <code>AllergyIntolerance.reaction</code> is <code>0..*</code> and <code>AllergyIntolerance.reaction.manifestation</code> is <code>1..*</code>. That means if an AllergyIntolerance instance does NOT have <code>reaction</code> then it does not have to have <code>reaction.manifestation</code>.</p>\n<p>In case an AllergyIntolerance does have reaction but the manifestation is missing, US Core v3.1.1 does require DAR to be used for an mandatory element in <a href=\"http://hl7.org/fhir/us/core/STU3.1.1/general-guidance.html#missing-data\">the Missing Data</a></p>\n<blockquote>\n<p>For non-coded data elements, use the DataAbsentReason Extension in the data type<br>\n    Use the code unknown - The value is expected to exist but is not known.</p>\n</blockquote>",
        "id": 259246685,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1635344634
    },
    {
        "content": "<p>Thank you so much for the clarity, <span class=\"user-mention\" data-user-id=\"191506\">@Yunwei Wang</span> ...!!!<br>\nWe have another follow-up query to this, <br>\nIt means reaction.manifestation can be replaced with DAR as per Missing Data guidelines but AllergyIntolerance.reaction will be required and mandatory element as it is considered under USCDI v1 though it is marked as 0..* is US Core..?? Please guide. Thanks.</p>",
        "id": 259407073,
        "sender_full_name": "Nandan Sharma",
        "timestamp": 1635435369
    },
    {
        "content": "<p>No. AllergyIntolerance.reaction is not required.</p>",
        "id": 259413833,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1635438122
    }
]