[
    {
        "content": "<p>Hi our team is currently testing using the Inferno Program edition. We are running into an issue with \"BDE-09: Bulk Data Server returns requiresAccessToken with value true\".  I'm confused why Inferno is expecting this value to always be true? The Bulk spec says \"Value MAY be false for file servers that use access-control schemes other than OAuth 2.0, such as downloads from Amazon S3 bucket URLS\". Since we are using this method, shouldn't our value for requiresAccessToken = false?</p>",
        "id": 248858037,
        "sender_full_name": "James Bradley",
        "timestamp": 1628520865
    },
    {
        "content": "<p>Hello James: Inferno has a github issue raised on the same test (<a href=\"https://github.com/onc-healthit/inferno-program/issues/303\">https://github.com/onc-healthit/inferno-program/issues/303</a>). We are waiting for the clarification from ONC. You could send your own comments.</p>",
        "id": 248858927,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1628521222
    },
    {
        "content": "<p>Hello James,<br>\n     We are in the process of Inferno Certification and I happened to go through this thread. We also support Amazon S3 URLs for files exported in Bulk Export and we are facing this issue.<br>\n     I wanted to check with you, if you got any information from Inferno, as to 'requiresAccessToken' could be false and proceed with access control schemes of our file server?<br>\n    I look forward to your reply because it will be of great value to us. Any other suggestion is highly appreciated.<br>\nThanks,<br>\nSagar</p>",
        "id": 259055236,
        "sender_full_name": "Sagar Sarvankar",
        "timestamp": 1635228183
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"392120\">@Sagar Sarvankar</span>  I've posted some updates in the linked github thread. Seems that ONC is standing by that requiresAccessToken must be true.</p>",
        "id": 260696941,
        "sender_full_name": "Brian Forbis",
        "timestamp": 1636395272
    },
    {
        "content": "<p>Yes, thank you <span class=\"user-mention\" data-user-id=\"276585\">@Brian Forbis</span> .</p>",
        "id": 260752045,
        "sender_full_name": "Sagar Sarvankar",
        "timestamp": 1636431382
    }
]