[
    {
        "content": "<p>Hello,<br>\nWe are trying to understand how to demonstrate this Inferno test. It is part of \"Visual and Inspection\" tests.<br>\n\"Health IT developer confirms the Health IT module does not cache the JWK Set received via a TLS-protected URL for longer than the cache-control header indicates.\"<br>\nOur authorization server is not caching the JWK Set that we get from Bulk Client. But I don't know how to demonstrate that to a proctor as part of Visual test. Any suggestions? <br>\nThank you in advance.</p>",
        "id": 255245089,
        "sender_full_name": "Lakshmi Bhamidipati",
        "timestamp": 1632846158
    },
    {
        "content": "<p>We're looking to issue two different calls to the token endpoint with JWTs signed using the same private key,  where those calls are more than &lt;cache control header&gt; seconds apart, and then show that the JWKS URL was hit both times.  If you are hosting the JWKS URL, you can show the web server logs that indicate it was hit when the product being certified attempted to do the JWT validation.  You may want to control for other callers of the JWKS URL by checking the client IP.</p>",
        "id": 255272957,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1632853486
    },
    {
        "content": "<p>Thank you. Are you also implementing the 2nd requirement in the authorization server? We are not caching the JWK Set. Is it required for certification? The does not specify \"SHALL\", so I was wondering if we need to do anything about it.</p>\n<p>1) The authorization server SHALL NOT cache a JWKS for longer than the client’s cache-control header indicates.<br>\n2) The authorization server SHOULD cache a client’s JWK Set according to the client’s cache-control header; it doesn’t need to retrieve it anew every time.</p>",
        "id": 255288841,
        "sender_full_name": "Lakshmi Bhamidipati",
        "timestamp": 1632859293
    },
    {
        "content": "<p>My read of the spec is that cache control handling is just recommended, not required.  The requirement is that you don't cache for too long if you do cache.</p>",
        "id": 255396013,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1632921226
    }
]