[
    {
        "content": "<p>Hi, we are looking into ways of automating Inferno tests, is there a way to export all test results in a structured format?</p>",
        "id": 243637862,
        "sender_full_name": "Guy Bertental",
        "timestamp": 1624447847
    },
    {
        "content": "<p>We don't currently support that, but it would be a nice feature to have. We'd need another rake task that fetched the results from the database and formatted them.</p>",
        "id": 243790532,
        "sender_full_name": "Stephen MacVicar",
        "timestamp": 1624543375
    },
    {
        "content": "<p>Hi,</p>\n<p>On the CLI version of inferno, is it possible to run all SMART on FHIR (US Core) test sequences?<br>\nwe are trying to figure out the input parameters per module, whether we need to generate the token outside inferno or provide credentials in the config file for Continuous Integration systems...</p>",
        "id": 245659033,
        "sender_full_name": "Guy Bertental",
        "timestamp": 1626078924
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"421859\">Guy Bertental</span> <a href=\"#narrow/stream/179309-inferno/topic/Continuous.20Integration.20Systems/near/245659033\">said</a>:</p>\n<blockquote>\n<p>Hi,</p>\n<p>On the CLI version of inferno, is it possible to run all SMART on FHIR (US Core) test sequences?<br>\nwe are trying to figure out the input parameters per module, whether we need to generate the token outside inferno or provide credentials in the config file for Continuous Integration systems...</p>\n</blockquote>\n<p>I meant SMART of FHIR tests and not the US Core tests as I mentioned in the parentheses.</p>",
        "id": 245812407,
        "sender_full_name": "Guy Bertental",
        "timestamp": 1626177045
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"421859\">@Guy Bertental</span> -- sorry for the slow response.  The challenging part of the SMART on FHIR tests is that it requires a browser to be driven by a script to click all the right buttons in the authorization UI.  We did experiment with this early on, and was able to get it to work, but found that it was too hard for others to configure and run so we haven't put effort into maintaining it.  I recommend passing the token to the US Core inferno tests, instead of trying to run the SMART sequences.  But if you are really interested in dusting off that capability and seeing if you can get it working, then I can check the current status (working?/almost working?/or completely broken?) and point you to the right spot so you can try it out.</p>",
        "id": 245974628,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1626275907
    },
    {
        "content": "<p>Many thanks for your response <span class=\"user-mention\" data-user-id=\"192576\">@Robert Scanlon</span>, we would have liked to make it work if it's possible, issuing the token outside inferno is exactly what we did eventually but manually with Postman because of the interactive nature of the authorization process, we failed to issue the token with REST calls (cURL tool) and authorization code grant type, This is something that we are missing and still trying to figure out, as this will enable a wide array of tests including SMART oriented tests to our FHIR implementation. but unfortunately, we don't have more time to invest in it now, maybe we will come back to this in the future.</p>",
        "id": 246078200,
        "sender_full_name": "Guy Bertental",
        "timestamp": 1626346508
    },
    {
        "content": "<p>Anyone knows if <a href=\"https://inferno.healthit.gov/validator/\">https://inferno.healthit.gov/validator/</a>   server is down?  I'm getting 504 (the server responded with a status of 504 (Gateway Time-out)) since yesterday when the online validator tried to fetch the drop-down list of IGs or Profiles.</p>",
        "id": 246108718,
        "sender_full_name": "Priscilla Hakel",
        "timestamp": 1626362021
    },
    {
        "content": "<p>Hello, does anyone know if inferno server is updated over the weekend? There are new requirements from last Friday to today and I was wondering if someone can inform us on that.<br>\nThanks.</p>",
        "id": 246524315,
        "sender_full_name": "Ozlem Kurt",
        "timestamp": 1626734517
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"192621\">@Ozlem Kurt</span> -- there haven't been any updates since <a href=\"https://github.com/onc-healthit/inferno-program/releases/tag/v1.6.1P\">June 11</a> to the ONC Certification tests.  What are you seeing that is different from last week?</p>",
        "id": 246533675,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1626743137
    },
    {
        "content": "<p>DocumentReference Tests - USCDR-13: Could not find content.attachment.url in the 5 provided DocumentReference resource(s). We have 5 clinical notes and all of them are plain text and coded as below:<br>\n \"content\": [<br>\n          {<br>\n            \"attachment\": {<br>\n              \"contentType\": \"text/plain\",<br>\n              \"data\": \"UHJvZ3Jlc3MgTm90ZSBUZXh0OiBEciBBbGJlcnQgRGF2aXMgZGlhZ25vc2VkIE1zIEhhcHB5IEtpZCB0byBiZSBzdWZmZXJpbmcgZnJvbSBGZXZlciBhbmQgc3VzcGVjdGVkIFBuZXVtb25pYSBhbmQgcmVjb21tZW5kZWQgYWRtaXNzaW9uIHRvIHRoZSBDb21tdW5pdHkgSGVhbHRoIEhvc3BpdGFscy4=\"<br>\n            },<br>\n            \"format\": {<br>\n              \"system\": \"<a href=\"http://ihe.net/fhir/ValueSet/IHE.FormatCode.codesystem\">http://ihe.net/fhir/ValueSet/IHE.FormatCode.codesystem</a>\",<br>\n              \"code\": \"urn:ihe:iti:xds:2017:mimeTypeSufficient\",<br>\n              \"display\": \"mimeType Sufficient\"<br>\n            }<br>\n          }<br>\n        ],<br>\nI am also comparing to reference server and when contentType is plain/text, it does not have attachment url but still  passing. We did not have tis issue last Friday as an example. There are couple more issues that I can list if you'd like.</p>\n<p>Thanks,<br>\nOzlem</p>",
        "id": 246598954,
        "sender_full_name": "Ozlem Kurt",
        "timestamp": 1626792181
    },
    {
        "content": "<p>Hello <span class=\"user-mention\" data-user-id=\"192621\">@Ozlem Kurt</span> Are you running tests on Inferno Program or Inferno Community?</p>",
        "id": 246634043,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1626807590
    },
    {
        "content": "<p>Hi, I am using program edition but I am not getting the same errors starting by 2:00pm yesterday. Nothing has changed on my side though.<br>\nThanks</p>",
        "id": 246720895,
        "sender_full_name": "Ozlem Kurt",
        "timestamp": 1626874913
    },
    {
        "content": "<p>Is there any chance there is variability in the data that you are sending back to Inferno?  Inferno only evaluates based on what it sees in a given test run, so if for some reason a different set of resources is returned then the results would be different.</p>",
        "id": 246725186,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1626876803
    },
    {
        "content": "<p>Note that US Core v3.1.1 requires systems to support BOTH \"url\" and \"data\" for this profile, so we need to see at least one example of using \"url\" in order for the test to pass.  This requirement is very likely wrong and buts us in a difficult position of either enforcing a wrong constraint or relaxing a stated requirement in a consensus standard.  So the tests not passing is the correct behavior in the case you gave.  I do not know why there is variability in results though.</p>",
        "id": 246725542,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1626876942
    },
    {
        "content": "<p>Hi Robert,<br>\nIt was exactly the same data and same application. <br>\nThanks,<br>\nOzlem</p>",
        "id": 246736756,
        "sender_full_name": "Ozlem Kurt",
        "timestamp": 1626881728
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"192621\">@Ozlem Kurt</span> Would you mind to save a testing session so we can further investigate this issue? Thanks.</p>",
        "id": 246745731,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1626885840
    },
    {
        "content": "<p>Hi Yunwei, can you please see the link below for both Single and Multi patients? <a href=\"https://inferno.healthit.gov/inferno/7HPsNTQzLLg/\">https://inferno.healthit.gov/inferno/7HPsNTQzLLg/</a><br>\nthe errors I mentioned started to occur again.</p>",
        "id": 247249257,
        "sender_full_name": "Ozlem Kurt",
        "timestamp": 1627327395
    },
    {
        "content": "<p>None of the DocumentReferences in that test session contain <code>content.attachment.url</code>.</p>",
        "id": 247252577,
        "sender_full_name": "Stephen MacVicar",
        "timestamp": 1627329061
    },
    {
        "content": "<p>Hello Stephen, we have only text attachment for document reference and reference server has the same type wit no url which had no issues. Does url accept any string null value?<br>\nThanks,Ozlem</p>",
        "id": 247268435,
        "sender_full_name": "Ozlem Kurt",
        "timestamp": 1627336207
    },
    {
        "content": "<p>Hello Stephen,<br>\nWe had this all passing with the same data under this url: <a href=\"https://inferno.healthit.gov/inferno/8XK8dwqrPKs/\">https://inferno.healthit.gov/inferno/8XK8dwqrPKs/</a><br>\nAs you can see there are no urls for Document reference when type is a plain text and it was still passing.<br>\nCan you please help to clarify the issue here?<br>\nThanks,<br>\nOzlem</p>",
        "id": 247274339,
        "sender_full_name": "Ozlem Kurt",
        "timestamp": 1627340243
    },
    {
        "content": "<p>Hi,<br>\nWe seem to have the same issue every Monday for some reason. For example, I was getting errors on Pulse Oximetry Test under this state: <a href=\"https://inferno.healthit.gov/inferno/7HPsNTQzLLg/\">https://inferno.healthit.gov/inferno/7HPsNTQzLLg/</a> on Monday and without any change to Observations I am getting no errors today on Tuesday. On Mondays, without any changes to server or data, our tests start failing. I wonder if they do some sort of maintenance on Saturdays like cypress does.<br>\nThanks,<br>\nOzlem</p>",
        "id": 247338828,
        "sender_full_name": "Ozlem Kurt",
        "timestamp": 1627395334
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192621\">@Ozlem Kurt</span> I would like to clarify your testing procedure. When you started a test on Tuesday, did you use \"Rerun Tests\" on the same test session or did you start a new test session?</p>",
        "id": 247344313,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1627397814
    },
    {
        "content": "<p>Hi Wang, <br>\nIt was the same session. You can see that we sent you this state on Monday (<a href=\"https://inferno.healthit.gov/inferno/7HPsNTQzLLg/\">https://inferno.healthit.gov/inferno/7HPsNTQzLLg/</a> ) was failing single and multi patient APIs and same state today with no change on Observations for Pulse Oximetry Test.<br>\nHope that helps.<br>\nThanks,<br>\nOzlem</p>",
        "id": 247347702,
        "sender_full_name": "Ozlem Kurt",
        "timestamp": 1627399102
    },
    {
        "content": "<p>Hello <span class=\"user-mention\" data-user-id=\"192621\">@Ozlem Kurt</span> Can you start a new test session from the beginning and send me the saved session no matter it is passed or failed. Thank you.</p>",
        "id": 247372428,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1627410697
    },
    {
        "content": "<p>Hi there, reviving this topic. We are also looking to parse test results from the inferno CLI in our CI pipeline.  Are there plans to  support outputting test results in a structured format (i.e. something that can be consumed by the Jenkins junit/xunit plugin)?</p>",
        "id": 260453935,
        "sender_full_name": "Yash Palkhiwala",
        "timestamp": 1636140798
    }
]