[
    {
        "content": "<p>I know that inferno is specifically designed for Read/Search flows and tests the responses against US Core specs. Is there a way if we take this further and have some kind of validation for Create/Update workflows?</p>",
        "id": 233309299,
        "sender_full_name": "ashoka p",
        "timestamp": 1617712081
    },
    {
        "content": "<p>Yes, though you would have to write your own tests.  See <a href=\"https://github.com/onc-healthit/inferno/wiki/Extending-Inferno\">https://github.com/onc-healthit/inferno/wiki/Extending-Inferno</a></p>",
        "id": 233327441,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1617719155
    },
    {
        "content": "<p>It is a bit involved, but we are working on improving this part of Inferno now.</p>",
        "id": 233327893,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1617719291
    },
    {
        "content": "<p>Is this in the context of an implementation guide?</p>",
        "id": 233327934,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1617719312
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"192576\">@Robert Scanlon</span>  . We are primarily trying to have inferno community edition as a comprehensive validation tool which along with US Core specs should also validate the base/custom specs that our FHIR server implements. <br>\nAnd we know how to add custom tests for a given sequence file. However we were looking for extending this beyond Read/Search and see if this can be helpful for CREATE/UPDATE as well. I see the main challenge of having a post body being required for a given test. Currently is there any support for such a use case?</p>",
        "id": 233644467,
        "sender_full_name": "ashoka p",
        "timestamp": 1617885352
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"361097\">@ashoka p</span>  posting this, extending inferno for create/update will definitely help, looking forward to get reply on this post, <span class=\"user-mention\" data-user-id=\"192576\">@Robert Scanlon</span> let us know if you have timeline or suggestion to extend.</p>",
        "id": 233766283,
        "sender_full_name": "Hozefa Jerapurwala",
        "timestamp": 1617942184
    }
]