[
    {
        "content": "<p>We are failing USCG-08 with the following error message: <strong><em>Could not find target, Goal.target.due[x]:dueDate in the 2 provided Goal resources(s).</em></strong></p>\n<p>We are returning this data absent reason primitive extension for Goal.target.dueDate since we don't have a target due date in the workflow for goals:</p>\n<div class=\"codehilite\"><pre><span></span><code>&quot;target&quot;: [\n      {\n        &quot;_dueDate&quot;: {\n          &quot;extension&quot;: [\n            {\n              &quot;valueCode&quot;: &quot;unknown&quot;,\n              &quot;url&quot;: &quot;http://hl7.org/fhir/StructureDefinition/data-absent-reason&quot;\n            }\n          ]\n        }\n      }\n    ],\n</code></pre></div>\n<p>This is on a locally hosted install of Inferno on version 1.6.0.</p>\n<p>Any ideas why this test is failing?</p>",
        "id": 255079416,
        "sender_full_name": "Jake Fisher",
        "timestamp": 1632760724
    },
    {
        "content": "<p>Inferno doesn't accept data absent reasons as evidence that a server supports a field.</p>",
        "id": 255098197,
        "sender_full_name": "Stephen MacVicar",
        "timestamp": 1632767823
    },
    {
        "content": "<p>Ugh.  This is basically a continuation of <a href=\"#narrow/stream/179175-argonaut/topic/US.20Core.20must-support.20-.20who.20is.20the.20.22Responder.22.3F\">this topic in #argonaut</a>.  It sounds like we really need ONC clarification that the Inferno requirements (inherited from US Core) should be limited to USCDIv1 content.  Eric Haas even said that in his first response on that topic, but I didn't fully digest what he said.</p>",
        "id": 255103018,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1632769642
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"279701\">@Jake Fisher</span> &amp; <span class=\"user-mention\" data-user-id=\"225612\">@Stephen MacVicar</span>  : I'm really sorry for jumping in here....!! Considering your question, we got the question that what is the difference between FHIR Validator &amp; Using the any Editions for resources validation...? We got this question because when we are trying the target due date along with the dataAbsentReason extension in FHIR Validator...It is actually not giving any error to us. <a href=\"/user_uploads/10155/ddCgt9TLW0-sqHBlnX1jVfgx/image.png\">image.png</a>.</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/ddCgt9TLW0-sqHBlnX1jVfgx/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/ddCgt9TLW0-sqHBlnX1jVfgx/image.png\"></a></div>",
        "id": 255106978,
        "sender_full_name": "Nihar",
        "timestamp": 1632771276
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"408624\">@Nihar</span> Inferno validator validates if an individual resource conforms a specific profile. Both FHIR spec and US Core IG allows resource to have DAR extensions. What <span class=\"user-mention\" data-user-id=\"279701\">@Jake Fisher</span> asked is test for MustSuppot which means the server shall be able to demonstrate that it support a MustSupport element in a meaningful way. We don't treat using DAR extension as a meaningful way to support an element.</p>",
        "id": 255220478,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1632837464
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191506\">@Yunwei Wang</span> : Thank you so much for clarification.  <br>\nWe are actually trying to validate those test cases (like USCG-08) using the FHIR Validator and that's what confusing us. <br>\nIn each resources we have inferno test case of Must Support Elements are returned or not. Now, there are certain elements that we don't have support for like Goal Target due date...<br>\nWhat we are trying is to pass the DAR for all such elements and validate under the FHIR Validator <br>\nOR<br>\nWe are trying to remove the entire node from the json and validate under the FHIR Validator</p>\n<p>As an output of above 2 cases, If FHIR Validator passes the resource json then we are assuming that DAR or 'No Node for element' is allowed for all such elements and same will be applicable when we test it under the Inferno Program Edition.<br>\nAre we considering the right approach in terms of usability of Inferno FHIR Validator for such validations? Please guide.</p>",
        "id": 255227472,
        "sender_full_name": "Nihar",
        "timestamp": 1632839920
    },
    {
        "content": "<p>Passing validator means the resource itself is valid.  You also need to demonstrate that your server support all MustSupport elements. Using DAR extension is not a reasonable way to demonstrate such support. Inferno tests \"MustSupport\" by checking that in resources returned from the server, there is at least one resource having that element populated</p>",
        "id": 255230125,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1632840908
    }
]