[
    {
        "content": "<p>Hello, <br>\nFor a patient app, during the Auth process, is it required that the authorization server display the individual scopes (to check/uncheck) for a patient to allow/deny individual resource access? The only scope we are thinking of allowing a user to check/uncheck is offline_access (for refresh token). We will have the ability for a 3rd party app to specify scopes at the time of registration. However, from a user experience perspective, we were wondering if it is required to support the ability to allow a user to individually select/unselect resource scopes during the authentication/authorization process. Thanks.</p>",
        "id": 232668599,
        "sender_full_name": "Lakshmi Bhamidipati",
        "timestamp": 1617226406
    },
    {
        "content": "<p>ONC requires the ability for patients to allow/deny individual resources, though you have wide latitude in what the authorization UI itself looks like.  From <a href=\"https://www.healthit.gov/test-method/standardized-api-patient-and-population-services#ccg\">the CCG</a>:</p>\n<blockquote>\n<ul>\n<li>As part of the “permission-patient” “SMART on FHIR Core Capability” in § 170.215(a)(3), Health IT Modules presented for testing and certification must include the ability for patients to authorize an application to receive their electronic health information (EHI) based on FHIR resource-level scopes. Specifically, this means patients would need to have the ability to authorize access to their EHI at the individual FHIR resource level, from one specific FHIR resource (e.g., “Immunization”) up to all FHIR resources necessary to implement the standard adopted in § 170.213 and implementation specification adopted in § 170.215(a)(2).</li>\n<li>Although Health IT Modules presented for testing and certification must include the ability for patients to authorize an application to receive their EHI based on FHIR resource-level scopes, Health IT Modules are not prohibited from presenting authorization scopes in a more user-friendly format (e.g. grouping resources under categories, renaming the scopes for easier comprehension by the end-user, using more granular scopes), as long as the ability for patients to authorize applications based on resource-level scopes is available, if requested by the patient.</li>\n</ul>\n</blockquote>\n<p>There has been <a href=\"#narrow/stream/179309-inferno/topic/offline_access.20requirement\">discussion recently</a> about the offline_access grant/deny 'requirement', which is unclear due to inconsistency between the rule language and the SMART specification.  ONC is reviewing that now and may clarify if that is a requirement or not.  But that is separate from the resource-level grant/deny requirement, which seems pretty clear.</p>",
        "id": 232694969,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1617244249
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"192576\">@Robert Scanlon</span></p>",
        "id": 232736522,
        "sender_full_name": "Lakshmi Bhamidipati",
        "timestamp": 1617273757
    }
]