[
    {
        "content": "<p>Hello,<br>\nWe are using  <a href=\"http://DocumentReference.content.attachment.data\">DocumentReference.content.attachment.data</a> (Data inline, base64ed) to display document data.  The contentType is \"application/pdf\" or \"text/plain\".<br>\nHowever one of the Inferno tests is failing because of this error -<br>\nUSCDR-13: All must support elements are provided in the DocumentReference resources returned.<br>\nCould not find content.attachment.url in any of the resources.<br>\nIs it something we must support or is there a way to get around this test?<br>\nThank you!</p>",
        "id": 228682999,
        "sender_full_name": "Lakshmi Bhamidipati",
        "timestamp": 1614811807
    },
    {
        "content": "<p>You need to have at least one DocumentReference resource with content.url</p>",
        "id": 228686533,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1614813417
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"191506\">@Yunwei Wang</span> . I was almost sure you would say that. I guess it goes with the \"must support\" requirement. Since our FHIR server is a facade, I don't know how we can specify urls. The data resides in the database. We read it, encode it and display it in the FHIR resource.</p>",
        "id": 228687376,
        "sender_full_name": "Lakshmi Bhamidipati",
        "timestamp": 1614813871
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191506\">@Yunwei Wang</span> -- Did you open a ticket regarding clarification on must support requirements for DocumentReference.content in US Core?   It doesn't mention that element in the <a href=\"http://hl7.org/fhir/us/core/STU3.1.1/StructureDefinition-us-core-documentreference.html#mandatory-and-must-support-data-elements\">must support description</a>.  I think we were looking initially at this because it did seem odd to require support for both representations.  Did you ask that question as well?</p>",
        "id": 228691588,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1614816156
    },
    {
        "content": "<p>I would think that either the data or uri elements need to be supported.  Requiring both seems strange to me.  But maybe there is a reason.</p>",
        "id": 228691664,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1614816198
    },
    {
        "content": "<p>Yes. I raised a JIRA ticket to US Core  that whole content attribute is not mentioned  in the must support narrative. <a href=\"http://jira.hl7.org/browse/FHIR-31364\">FHIR-31364</a>. <br>\nThere is ticket <a href=\"http://jira.hl7.org/browse/FHIR-30111\">FHIR-30111</a> which clarifies that </p>\n<blockquote>\n<p>Systems are not required to support both DocumentReference.content.attachment.url AND <a href=\"http://DocumentReference.content.attachment.data\">DocumentReference.content.attachment.data</a></p>\n<p>Make it clear although both marked MUST SUPPORT, systems may chose to only support one.</p>\n</blockquote>\n<p>This ticket is raised on the ballot version of US Core (3.2.0). Unless US Core backport this ticket  to next technical correction (if there is any),  we have to stick with current interpretation that both are must supported in 3.1.1.</p>",
        "id": 228699002,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1614820474
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"224800\">@Lakshmi Bhamidipati</span> The US Core state that </p>\n<blockquote>\n<p>If both data and url are provided, the url SHALL point to the same content as the data contains.</p>\n</blockquote>",
        "id": 228699873,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1614820955
    },
    {
        "content": "<p>Thank you for your reply. I hope US Core specification changes such that systems may chose to support only one.</p>",
        "id": 228701931,
        "sender_full_name": "Lakshmi Bhamidipati",
        "timestamp": 1614822293
    },
    {
        "content": "<p>Thanks for tracking that down <span class=\"user-mention\" data-user-id=\"191506\">@Yunwei Wang</span> -- is there any real talk of a technical correction or is everything going into v3.2.0?  It seems like the industry expectation is that v3.2.0 will be available for certification through the ONC Standards Version Advancement Process, and if that is the case there wouldn't be a need for a TC from a certification perspective.</p>",
        "id": 228755790,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1614857497
    },
    {
        "content": "<p>I think it depends on how regulator adopts US Core v3.2.0. One possibility is regulator adopts v3.2.0 as a Voluntary certification (v3.1.1 is Mandatory certification). In such case, vendor will have a chance to choose which certification to pass. I am not sure. We have to wait any instructions coming out about future US Core versions.</p>",
        "id": 228780865,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1614868055
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191506\">@Yunwei Wang</span> <span class=\"user-mention\" data-user-id=\"192576\">@Robert Scanlon</span>  - Regarding Document Reference, this is what the profile says - \"This profile sets minimum expectations for searching and fetching fetching patient documents including Clinical Notes using the DocumentReference resource.\" Is \"Clinical Notes\" the only type of document that is expected in the response? The category description says - \"The codes SHALL be taken from US Core DocumentReference Category; other codes may be used where these codes are not suitable\".<br>\nInclude all codes defined in <a href=\"http://hl7.org/fhir/us/core/CodeSystem/us-core-documentreference-category\">http://hl7.org/fhir/us/core/CodeSystem/us-core-documentreference-category</a>. However the code system has only 1 code - \"Clinical Note\". Thank you.</p>",
        "id": 228966464,
        "sender_full_name": "Lakshmi Bhamidipati",
        "timestamp": 1614956231
    },
    {
        "content": "<p>the profile merely indicates to use the clinical note code when looking for clinical notes. It says nothing about other uses (For which there are other implementation guides that do express other uses of DocumentReference and other document categories, types, formats, etc)</p>",
        "id": 228967278,
        "sender_full_name": "John Moehrke",
        "timestamp": 1614956465
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> Since we are working towards implementing the USCDI elements in the US Core Profile, I am assuming we should be displaying at least all the clinical notes in our system by setting the code system to  <a href=\"http://hl7.org/fhir/us/core/CodeSystem/us-core-documentreference-category\">http://hl7.org/fhir/us/core/CodeSystem/us-core-documentreference-category</a>.</p>",
        "id": 228978426,
        "sender_full_name": "Lakshmi Bhamidipati",
        "timestamp": 1614960645
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"224800\">@Lakshmi Bhamidipati</span> -- DocumentReference.category has an extensible binding to US Core Document Reference category (which only has that 1 code: Clinical Note).  An extensible binding means you are free to have other codes there, as long as they do not mean the same thing as 'Clinical Note'.  So essentially what this is saying is that you are free to use DocumentReference for things other than Clinical Notes, and you can categorize your DocumentReferences however you want, but for anything that is a \"Clinical Note\" as we define it, you MUST use the \"Clinical Note\" category.  And we then add some more rules around things that are \"Clinical Notes\" in guidance.</p>",
        "id": 228980844,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1614961396
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"192576\">@Robert Scanlon</span>.</p>",
        "id": 228981567,
        "sender_full_name": "Lakshmi Bhamidipati",
        "timestamp": 1614961649
    },
    {
        "content": "<p>For the required search without category, you can send things other than clinical notes (but it must also include all of your clinical notes).  All resources returned have to conform to the profile, because this is a general 'DocumentReference' profile.  For the required search WITH category, if you search by the \"Clinical Note\" category, you must return all references that are \"Clinical Notes\" as defined in this guide.  But users can search by other category codes, if you have other codes in your system.</p>",
        "id": 228981966,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1614961778
    },
    {
        "content": "<p>In our 'DocumentReference' profile set of tests, we may end up performing that category search with something other than that clinical note category, if you happen to return a different category code from the first (most general) search.  We have a separate test sequence for 'Clinical Notes Guidance' that actually ensures you have clinical notes in your system.</p>",
        "id": 228982343,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1614961883
    },
    {
        "content": "<p>Please pardon me for asking multiple questions on this topic. According to clinical notes guidance tests, the system must implement the US Core DiagnosticReport Profile for Report and Note exchange and to support a minimum of the three report categories - Radiology, Pathology and Cardilogy. My question is - If I represent a clinical note in DocumentReference in the binary format (either as text/plain or application/pdf), am I expected to display the same data in DiagnosticReport resource? Thank you.</p>",
        "id": 229030392,
        "sender_full_name": "Lakshmi Bhamidipati",
        "timestamp": 1614981027
    },
    {
        "content": "<p>According to the US Core 3.1.1 Clinical Notes Guidance, </p>\n<blockquote>\n<p>In order to enable consistent access to scanned narrative-only clinical reports the Argonaut Clinical Note Server SHALL expose these reports through both DiagnosticReport and DocumentReference by representing the same attachment url using the corresponding elements listed below</p>\n</blockquote>\n<p>and</p>\n<blockquote>\n<p>This guide requires servers implement the duplicate reference to allow a client to find a Pathology report, or other Diagnostic Reports, in either Resource.</p>\n</blockquote>\n<p>If the binary format is one of the Diagnostic Reports, then it shall be also attached in DiagnosticReport resource using <code>DiagnosticReport.presentedForm.url</code>.</p>",
        "id": 229312126,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1615215692
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"191506\">@Yunwei Wang</span></p>",
        "id": 229328800,
        "sender_full_name": "Lakshmi Bhamidipati",
        "timestamp": 1615220695
    },
    {
        "content": "<p>Hello, getting back to DocumentReference :) If I have documents that are NOT clinical notes in the DocumentReference Resource and I don't know how to categorize them, since it is a codeableconcept, if it okay for me to just populate \"Text\" element? Thank you.</p>",
        "id": 230050659,
        "sender_full_name": "Lakshmi Bhamidipati",
        "timestamp": 1615564047
    },
    {
        "content": "<p>According to FHIR binding rules, you are free to use either text or your own coding if concept is not covered by extensible binding. The receiving implementation may nor may not such resource with additional coding.</p>",
        "id": 230079921,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1615575332
    },
    {
        "content": "<p>Running  inferno locally on docker. Was running fine , but now giving “ internal server error” on launch - any clues how to fix this error ?</p>",
        "id": 230470347,
        "sender_full_name": "Santosh Pai",
        "timestamp": 1615880318
    },
    {
        "content": "<p>It's off-topic for the thread, but Santosh let us know he was able to get it working again. <span class=\"user-mention\" data-user-id=\"316810\">@Santosh Pai</span> -- feel free to open another thread in the <a class=\"stream\" data-stream-id=\"179309\" href=\"/#narrow/stream/179309-inferno\">#inferno</a> stream if you continue to have problems, or reach out by email.  Thanks for letting us know.</p>",
        "id": 230511684,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1615901448
    },
    {
        "content": "<p>Will do Rob. Thanks for the quick response.</p>",
        "id": 230512041,
        "sender_full_name": "Santosh Pai",
        "timestamp": 1615901603
    },
    {
        "content": "<p>note : we have docker desktop on a WVD ( windows virtual device) just wanted to let you know</p>",
        "id": 230512217,
        "sender_full_name": "Santosh Pai",
        "timestamp": 1615901670
    },
    {
        "content": "<p>Hello <span class=\"user-mention\" data-user-id=\"191506\">@Yunwei Wang</span> <span class=\"user-mention\" data-user-id=\"192576\">@Robert Scanlon</span>  - for US Core compliance and certification, is our FHIR server expected to support this  section under Clinical Notes - Determining Server Note Type Support Using The Value Set Expansion Operation ($expand)  ? Thank you.</p>",
        "id": 230738766,
        "sender_full_name": "Lakshmi Bhamidipati",
        "timestamp": 1616004088
    },
    {
        "content": "<p>No, that is an optional feature to support for servers, so we do not test it -- <a href=\"https://www.hl7.org/fhir/us/core/clinical-notes-guidance.html#using-expand\">see here</a></p>\n<blockquote>\n<p>A FHIR server claiming support to this guide SHOULD support the $expand operation.</p>\n</blockquote>\n<p>A few sentences before that, the guide states \"a client can determine the note and report types support by a server\", which I think is misleading because we usually interpret \"a client can/may\" as \"a server shall\", but that clearly isn't the case here.  What are your thoughts about that \"can\" there <span class=\"user-mention\" data-user-id=\"191506\">@Yunwei Wang</span>, is that something worth open a ticket to consider rephrasing?</p>",
        "id": 230741513,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1616005137
    }
]