[
    {
        "content": "<p>In the US Core profile, Encounter's reason for visit is must support. Our system supports this, but much like CCDA, it's \"text\" or narrative. This means the codeableConcept only has text filled in. I believe this meets the MS on the profile, but the inferno tests seem to be requiring there to be a coded value.</p>",
        "id": 204804565,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1595514603
    },
    {
        "content": "<p>Related: <a href=\"#narrow/stream/179175-argonaut/topic/Encounter.20Reason.20For.20Visit\">https://chat.fhir.org/#narrow/stream/179175-argonaut/topic/Encounter.20Reason.20For.20Visit</a></p>",
        "id": 204804578,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1595514609
    },
    {
        "content": "<p>Thanks Jenni -- taking a look now.  Have you tried validating the resource against the profile with the HL7 FHIR Validator?</p>",
        "id": 204809236,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1595516607
    },
    {
        "content": "<p>I'm having trouble replicating the issue -- at least on Inferno Program we do not provide failures or warnings if you have a text-only CodeableConcept in Encounter.reasonCode. Could you provide a few more details about what you are seeing on your end?</p>",
        "id": 204822796,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1595522859
    },
    {
        "content": "<p>Will check with the team to ensure they went through the entire flow, but the test data that is called out by the test procedure: <a href=\"https://github.com/inferno-community/uscore-data-sets/blob/master/uscore-testing-data-03-05-2020.zip\">https://github.com/inferno-community/uscore-data-sets/blob/master/uscore-testing-data-03-05-2020.zip</a> contains SNOMED codes.</p>",
        "id": 204824455,
        "sender_full_name": "Drew Torres",
        "timestamp": 1595523664
    },
    {
        "content": "<p>Testing bodies may take that as an explicit declaration to test as part of certification.</p>",
        "id": 204824489,
        "sender_full_name": "Drew Torres",
        "timestamp": 1595523689
    },
    {
        "content": "<p>I have a question out to ONC to clarify the intent currently.</p>",
        "id": 204824503,
        "sender_full_name": "Drew Torres",
        "timestamp": 1595523699
    },
    {
        "content": "<p>On the Inferno team, our intent was to provide a complete and realistic synthetic data set that conforms to the requirements of (g)(10), but it isn't the only data set you can use to demonstrate conformance to the criteria using Inferno.  I don't think that prevents Testing bodies from adding that requirement themselves (use some specific data set), and if that is the case then you may be able to make a case that forcing a code there is too strict by the definition of MUST SUPPORT for CodeableConcepts with extensible bindings.  Good to get confirmation through the official channel.</p>",
        "id": 204826747,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1595524912
    }
]