[
    {
        "content": "<p>Hello,<br>\nAt the connect-a-thon, we brought up an issue on the Device resource requiring both AIDC and HRF carriers. The human readable section for must support elements has shown below and it allows OR between AIDC and HRF:<br>\nEach Device must support:<br>\nA Unique Device Identifier (UDI) numeric or alphanumeric code<br>\neither as the Human Readable Form (HRF) string representation of the barcode<br>\nor the Automatic Identification and Data Capture (AIDC) representation.</p>\n<p>Based on the conversation, I was assigned to ask the question to FDA if they require both or individual carrier for systems. Here is their answer:</p>\n<p>The UDI rule does not specify what AIDC (automatic identification and data capture) technologies may be used, because the most appropriate technology will vary depending on the type of device and its intended uses, and because the available technologies are likely to evolve and advance over time. The AIDC technology may be a bar code or any other technology that conveys the UDI or DI in a form that can be entered into an electronic patient record or other computer system via an automated process.</p>\n<p>Based on both FHIR specs and FDA response, what action Inferno is planning to take regarding to Device resource failure issue if both AIDC and HRF is not provided?</p>\n<p>Best Regards,<br>\nOzlem</p>",
        "id": 211281871,
        "sender_full_name": "Ozlem Kurt",
        "timestamp": 1601051745
    },
    {
        "content": "<p>Thanks Ozlem!  I think I'm interpreting the human readable section different than you though.  It says that \"Each Device must support either HRF or AIDC\", not \"The system sending the data must support either HRF or AIDC\".  Inferno's certification tests allows any given resource to have either, but it won't pass the system until it has shown both, somewhere (they can be in different resources).  That is also consistent with the machine-readable must-support flags on the individual elements.</p>",
        "id": 211297236,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1601059205
    },
    {
        "content": "<p>If the intent is for a system to support one or the other (both allowed but not required), I think US Core should be updated.  I believe US Core could remove the 'must support' flags on the 3 sub-elements of udiCarrier, and let the cardinality constraint on deviceIdentifier and the us-core-12 invariant enforce the per-device requirement stated in the description.</p>",
        "id": 211298456,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1601059792
    },
    {
        "content": "<p>Thoughts <span class=\"user-mention\" data-user-id=\"191410\">@Brett Marquard</span>?  I could be missing something here.</p>",
        "id": 211298860,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1601059991
    },
    {
        "content": "<p>Another thing that could be a good idea is to provide feedback directly to ONC on this, because if the answer here isn't clear cut I think ONC will need to provide guidance on how this is interpreted. You can do that here: <a href=\"https://inquiry.healthit.gov/support/plugins/servlet/desk/portal/2\">https://inquiry.healthit.gov/support/plugins/servlet/desk/portal/2</a></p>",
        "id": 211301017,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1601060899
    },
    {
        "content": "<p>I believe this is a pollicy question for ONC/FDA.  future US Core ballot updating must support may also be required. Please log a tracker</p>",
        "id": 211303118,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1601061476
    }
]