[
    {
        "content": "<p>It looks like the standalone launch verification has this validation: SPA-OSD-06 A SMART on FHIR server SHALL convey its capabilities to app developers by listing a set of the capabilities. The following capabilities are required: launch-ehr, launch-standalone, client-public, client-confidential-symmetric, sso-openid-connect, context-banner, context-style, context-ehr-patient, context-standalone-patient, permission-offline, permission-patient, permission-user</p>\n<p><a href=\"http://hl7.org/fhir/smart-app-launch/conformance/index.html#core-capabilities\">http://hl7.org/fhir/smart-app-launch/conformance/index.html#core-capabilities</a></p>",
        "id": 226015150,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1613059767
    },
    {
        "content": "<p>This was removed (along with context-ehr-patient) as a requirement for patient access: <a href=\"https://www.healthit.gov/test-method/standardized-api-patient-and-population-services#ccg\">https://www.healthit.gov/test-method/standardized-api-patient-and-population-services#ccg</a></p>",
        "id": 226015694,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1613059952
    },
    {
        "content": "<p>\"Health IT Modules will only be tested for the \"Patient Access for Standalone Apps\" and \"Clinician Access for EHR Launch\" scenarios described in the standard adopted at ยง 170.215(a)(3).\"</p>",
        "id": 226015804,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1613059994
    },
    {
        "content": "<p>So clinical access/provider APIs have to support those but the patient apps do <em>not</em></p>",
        "id": 226015888,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1613060025
    },
    {
        "content": "<p>This does look like an oversight in our test, because we should only check the capabilities that we know need to be supported at this particular endpoint given the scenario we have set up (stand alone patient app, confidential client, refresh token, openid, granted access to all USCDI data).  We intentionally allow implementations to use a different fhir &amp; authorization endpoint for the user/ehr launch, and if they do, they would advertise the user/ehr related capabilities at that endpoint instead.</p>",
        "id": 226025343,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1613063751
    },
    {
        "content": "<blockquote>\n<p>This was removed (along with context-ehr-patient) as a requirement for patient access:</p>\n</blockquote>\n<p>What are you referring to with 'This'?  A specific capability?</p>",
        "id": 226025460,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1613063802
    },
    {
        "content": "<p>I opened a ticket <a href=\"https://github.com/onc-healthit/inferno-program/issues/233\">onc-healthit/inferno-program#233</a> that we'll use to track  this as we update the test.  Did I capture the full scope of your concern?  Also, thanks for the pointing this out!</p>",
        "id": 226031332,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1613066116
    },
    {
        "content": "<p>Yes, that matches with the concerns. The original regulation <em>did</em> imply that launch-ehr and context-ehr-patient was needed for both patient and provider (as well as all the standalone features for both). But they clarified that in the CCG I quoted above.</p>",
        "id": 226050993,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1613074408
    }
]