[
    {
        "content": "<p>Hey all. I've heard from someone previously that Inferno Core is intended to be replacing Inferno Community Edition and most open source dev work is focused on Inferno Core instead of updating Inferno Community. I just tried out the alpha for Inferno Core and it seems like it's still missing a lot of the tests that Community has. I'm just curious what kind of timeline is planned/expected for upgrading Inferno Core to beta/release versions? I'm excited that it is adding a restful API because my team has a service that hacked around this by automating UI interactions with puppeteer. I would love to remove that puppeteer code and migrate as soon as Inferno Core has support for all the US Core tests.</p>",
        "id": 245229981,
        "sender_full_name": "Nathan Loyer",
        "timestamp": 1625685892
    },
    {
        "content": "<p>We're still working on implementing the basic features for Inferno Core. US Core is a big, complicated IG, and it will be months before we have a complete test suite for it.</p>",
        "id": 245339078,
        "sender_full_name": "Stephen MacVicar",
        "timestamp": 1625762592
    },
    {
        "content": "<p>Is there any means by which I can easily stay updated on progress that is made?</p>",
        "id": 247374634,
        "sender_full_name": "Nathan Loyer",
        "timestamp": 1627411784
    },
    {
        "content": "<p>Keeping an eye on releases (or PRs of you want even more details) in the repo is probably your best bet for now. It's still in an early enough state that we don't have much ceremony around releases. When development is further along, particularly in regards to things like US Core or g10 certification testing, I expect we'll be discussing it at our monthly tech talks.</p>",
        "id": 247614732,
        "sender_full_name": "Stephen MacVicar",
        "timestamp": 1627579636
    },
    {
        "content": "<p>ok, thanks</p>",
        "id": 247629830,
        "sender_full_name": "Nathan Loyer",
        "timestamp": 1627586956
    }
]