[
    {
        "content": "<p>Hello<br>\nI see Inferno 2.0 is now live on <a href=\"http://inferno.healthit.gov\">inferno.healthit.gov</a>. I have an EHR vendor preparing to test tomorrow and without release notes I can't force them to use 2.0. I see Inferno 1.9.0 is also still available on <a href=\"http://inferno.healthit.gov\">inferno.healthit.gov</a>. Is this instance of Inferno 1.9.0 fully functional?</p>",
        "id": 274433242,
        "sender_full_name": "James Threatte",
        "timestamp": 1646676536
    },
    {
        "content": "<p>Hi James -- yes v1.9 is fully functional and supported on <a href=\"http://inferno.healthit.gov\">inferno.healthit.gov</a>, and nothing should have changed for them (e.g. same URLs, etc).   If you plan to use the <a href=\"http://inferno.healthit.gov\">inferno.healthit.gov</a> instance for certification, could you please have them walk through everything just to ensure that nothing inadvertently changed?</p>",
        "id": 274433827,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1646676742
    },
    {
        "content": "<p>Hello. My name is Mat Davis<br>\nI am a Quality Analyst with Dynamic Health IT. </p>\n<p>I am writing today about the recent and unexpected updated Inferno versions below:</p>\n<ol>\n<li>(g)(10) Standardized API Test Kit</li>\n<li>(Legacy) Inferno Program Edition</li>\n</ol>\n<p>We are fully aware of the notifications of 1) \"Data is removed every Sunday...\" and 2) \"This URI is not guaranteed to be permanently accessible.\"<br>\nThe issue is that the update to the newer versions was so abrupt that there was no time to prepare or be aware that any changes of this nature were taking place.</p>\n<p>Q: Is the UI the same in the newer version? <br>\nA: No</p>\n<p>Q: Is the process the same? <br>\nA: Appears to be but we will need to test to confirm.</p>\n<p>Q: Are we required to use the new version or can we still use the Legacy version if we prefer? <br>\nA: This is not clear.</p>\n<p>Q: What is the reason for this change in / additional versions? <br>\nA: Unknown. As a daily user of Inferno, having an idea of this change would've been very informative and even exciting.</p>\n<p>Q: Will the saved URIs from previous testing be accessible? <br>\nA: No. Clicking previous links results in a page can't be found.</p>\n<p>While there is a clear notification that \"This URI is not guaranteed to be permanently accessible.\", there have been URI's being used and accessed by our team that were created as far back as Nov 2021.<br>\nThese URI's are used to easily access previous test, test results and test configurations.</p>\n<p>Q: Is there any recourse for users who use these URI's as a reference point?<br>\nA: I would hope so but if not, we can do what needs to be done to move on and continue using this super helpful tool.</p>\n<p>There are also no release notes associated with the (g)(10) Standardized API Test Kit version of Inferno which would be at the very least, a very helpful starting point for new adoption.</p>\n<p>While improvements are always welcome and even necessary, the point is that not having any notification of this change is disruptive, frustrating and just so unexpected.</p>\n<p>I look forward to your feedback and the feedback of others.</p>\n<p>Thanks - Mat</p>",
        "id": 274482303,
        "sender_full_name": "Mat Davis",
        "timestamp": 1646701378
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"380157\">@Mat Davis</span> --thanks for reaching out and letting us know about these issues / concerns, and how they are disruptive.  We are working on updating our language throughout our repos / sites to better explain the changes.  Bottom line is that v1.9 -&gt; v2.0 represents a major update to the technical foundation of these certification tests. While the test changes themselves are intended to be minimal, so much else is changing in v2.0 (including the name) that we will continue to support v1.9 for the near future.  You can still use Inferno Program Edition v1.9 at the same URL as before, and besides the fact that we reset the stored test data on the site this weekend everything else should be identical.</p>",
        "id": 274578612,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1646762107
    },
    {
        "content": "<p>Thanks so much for your reply Robert. Happy to hear my concerns and likely the concerns of others are heard and understood.</p>\n<p>Just for clarification, and based off the answer to James above, I'm assuming this will be yes,<br>\n<strong>Can v1.9 aka should v1.9 be used when certifying?</strong></p>\n<p>Any direct or acceptable answer would be appreciated here.</p>\n<p>I am more than happy to welcome, accept and use newer versions of Inferno with minor and major improvements. <br>\nI'll start tO use v2.0 and give some honest compliments and feedback after multiple uses.</p>",
        "id": 274581249,
        "sender_full_name": "Mat Davis",
        "timestamp": 1646763088
    },
    {
        "content": "<p>I do not speak for ONC officially, but the plan is to allow systems to use v1.9 for (g)(10) certification for some time to avoid disruption for anyone planning on certifying in the near future, and to give people a chance to try out v2.0+ and report any issues before retiring v1.9.x.  That is why we are now hosting both versions side-by-side on <a href=\"http://inferno.healthit.gov\">inferno.healthit.gov</a>.</p>",
        "id": 274581768,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1646763312
    },
    {
        "content": "<p>Hopefully I have something specific I can point to from them directly on this soon</p>",
        "id": 274582271,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1646763510
    },
    {
        "content": "<p>How critical is having the previous test data for you?  We may be able to recover it with some effort (I'm checking now), but we wanted to avoid having users rely on data persistence on the ONC-hosted site because it takes effort to maintain historic data.</p>",
        "id": 274583027,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1646763828
    },
    {
        "content": "<p>Regarding the release notes for v2.0, please see <a href=\"https://github.com/onc-healthit/onc-certification-g10-test-kit/releases/tag/v2.0.0\">https://github.com/onc-healthit/onc-certification-g10-test-kit/releases/tag/v2.0.0</a>.</p>",
        "id": 274583755,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1646764118
    },
    {
        "content": "<p>This makes perfect sense so thank you for answering to the best of your responsibility / purview.</p>",
        "id": 274588939,
        "sender_full_name": "Mat Davis",
        "timestamp": 1646766027
    },
    {
        "content": "<p>Thanks again on this front!</p>",
        "id": 274589018,
        "sender_full_name": "Mat Davis",
        "timestamp": 1646766060
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192576\">Robert Scanlon</span> <a href=\"#narrow/stream/179309-inferno/topic/Inferno.202.2E0/near/274583027\">said</a>:</p>\n<blockquote>\n<p>How critical is having the previous test data for you?  We may be able to recover it with some effort (I'm checking now), but we wanted to avoid having users rely on data persistence on the ONC-hosted site because it takes effort to maintain historic data.</p>\n</blockquote>\n<p>At this point, if it's possible, feel free to try or at least get whatever confirmation you feel comfortable pursuing. As of yesterday, I have focused on just building from scratch and building workflows that will save results to PDF or HTML to have a history of tests, results, configs, data (if possible)</p>\n<p>\"Avoiding having users rely on data persistence\" is a understandable and important goal to move toward from your end and in general. The roll out of the initiative overtime, by the end of the week, by the end of the month, any progressive manner overtime could've helped with that adoption. I will definitely be proactive and prepared on this front moving forward.</p>",
        "id": 274589981,
        "sender_full_name": "Mat Davis",
        "timestamp": 1646766393
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192576\">Robert Scanlon</span> <a href=\"#narrow/stream/179309-inferno/topic/Inferno.202.2E0/near/274583027\">said</a>:</p>\n<blockquote>\n<p>How critical is having the previous test data for you?  We may be able to recover it with some effort (I'm checking now), but we wanted to avoid having users rely on data persistence on the ONC-hosted site because it takes effort to maintain historic data.</p>\n</blockquote>\n<p>Hi Robert.</p>\n<p>As some additional notes to your comment above from other members of the team, accessing prior saved URI's have been very helpful in supporting our clients.<br>\nIt allowed our clients to know where they left off in regards to testing, how they improved or declined in testing as well as seeing when a resource was erroring due to data.</p>\n<p>This was especially helpful after an Inferno update to help determine if the issue was actually due to data or if it was due to recent changes in the test tool itself.<br>\nWe understand the URI's can disappear but our clients and ourselves have gotten really comfortable with using inferno as a helpful tool in development and implementation not only ONC testing.</p>",
        "id": 274618650,
        "sender_full_name": "Mat Davis",
        "timestamp": 1646779492
    },
    {
        "content": "<p>Hey everyone, wanted to post some information from ONC on this thread that may be helpful regarding the new Inferno Framework and (g)(10) Standardized API Test Kit. See below and thank you!</p>\n<p><strong>What is in the new release of Inferno?</strong></p>\n<p>This new release of Inferno is called the “Inferno Framework” and includes an upgrade of the overall platform which will allow ONC to better support standards conformance testing and development by supporting multiple versions of standards in tests to accommodate the <a href=\"https://www.healthit.gov/topic/standards-version-advancement-process-svap\">Standards Version Advancement Process</a>. It also includes new features, like a JSON API to help with tool integration, and a revised user interface to accommodate a variety of standards conformance testing use cases such as HL7 FHIR and supporting standards. ONC updated Inferno to make it easier for the health IT community to develop tests using the Inferno Framework without needing to directly engage with ONC. <a href=\"https://inferno-framework.github.io/inferno-core/\">Learn more</a> about the Inferno Framework and its features including Inferno Core, and Test Kits.</p>\n<p>Included in the Inferno Framework is the <a href=\"https://inferno.healthit.gov/onc-certification-g10-test-kit\">(g)(10) Standardized API Test Kit</a>, which supports testing for the § 170.315(g)(10) certification criterion adopted as part of the ONC Health IT Certification Program. ONC took special care to ensure that the test scenarios and tests in this new release are the same as the previous Inferno Program Edition (Release 1.9). </p>\n<p><strong>When was Inferno Framework released?</strong></p>\n<p><a href=\"https://www.healthit.gov/buzz-blog/healthit-certification/inferno-redesigned-easier-faster-extensible\">ONC announced</a> the release of Inferno Framework including the (g)(10) Standardized API Test Kit on March 8, 2022. To support this release, ONC will continue to host the previous Inferno Program Edition (Release 1.9) on <a href=\"https://inferno.healthit.gov/inferno\">inferno.healthit.gov/inferno</a> for approximately two months. ONC recommends Authorized Test Labs (ATLs) and developers continue to support Certification testing via the previous Inferno Program Edition (Release 1.9) for at least one month to help with the transition. </p>\n<p>To support the health IT community with the rollout of Inferno Framework, ONC will host a month of health IT developer Inferno office hours, where ONC will review the Inferno Framework and (g)(10) Standardized API Test Kit releases on 3/18, 3/25, 4/1 and 4/8 from 2:00 pm – 3:00 pm ET. Please subscribe to ONC Certification email updates by entering your email into the “Sign Up for Certification Email Updates” box on <a href=\"https://www.healthit.gov/topic/certification-ehrs/certification-health-it\">healthit.gov</a>. Instructions will also be posted on the <a href=\"https://groups.google.com/g/inferno-testing\">Inferno Google Group</a> and this thread on how to join these Inferno office hours.</p>\n<p><strong>What are the requirements for using Inferno Framework for ONC Health IT Certification?</strong></p>\n<p>Heath IT developers should consult with their Authorized Testing Laboratories (ATLs) for specific testing requirements for the § 170.315(g)(10) criterion, and ONC recommends that ATLs continue to support ONC Certification testing with Inferno Program Edition (Release 1.9) for at least one Inferno release cycle (one month). ONC will continue hosting Inferno Program Edition (Release 1.9.0) at <a href=\"https://inferno.healthit.gov/inferno\">inferno.healthit.gov/inferno</a> for approximately two months. All future enhancements for certification testing for the (g)(10) criterion will be made in the (g)(10) Standardized API Test Kit. We encourage health IT developers to begin using (g)(10) Standardized API Test Kit and provide any feedback on the <a href=\"https://github.com/onc-healthit/onc-certification-g10-test-kit\">(g)(10) Standardized API Test Kit GitHub page</a>. </p>\n<p><strong>Are the tests the same in previous Inferno Program Edition (Release 1.9.0) and the new (g)(10) Standardized API Test Kit in Inferno Framework?</strong></p>\n<p>Basically, yes. ONC took special care to ensure that the test scenarios and tests in this new release are the same as the previous Inferno Program Edition (Release 1.9). However, there may be small changes in test results for systems between the versions. The <a href=\"https://github.com/onc-healthit/onc-certification-g10-test-kit/releases/tag/v2.0.0\">release notes for the (g)(10) Standardized API Test Kit on GitHub</a> provide an overview of the updates in (g)(10) Standardized API Test Kit. Please report any discrepancies in <a href=\"https://github.com/onc-healthit/onc-certification-g10-test-kit/issues\">GitHub Issues section of the (g)(10) Standardized API Test Kit repository</a> so that they can be documented and fixed if necessary. For specific details on the changes and enhancements to the (g)(10) certification criterion tests, please review the <a href=\"https://github.com/onc-healthit/onc-certification-g10-test-kit/releases/tag/v2.0.0\">release notes</a>. </p>\n<p><strong>How do I learn more about Inferno Framework and (g)(10) Standardized API Test Kit?</strong></p>\n<p>ONC announced the release of Inferno Framework on the Health IT Developer Roundtable on March 9 and provided an overview on the Inferno Tech Talk on March 9. Please subscribe to the <a href=\"https://groups.google.com/g/inferno-testing\">Inferno Google Group</a> to receive notifications about future Inferno Tech Talks. </p>\n<p>ONC will host a month of health IT developer office hours where ONC will review the new release of Inferno Framework including the (g)(10) Standardized API Test Kit on 3/18, 3/25, 4/1 and 4/8 from 2:00 pm – 3:00 pm ET. Please subscribe to ONC Certification email updates by entering your email into the “Sign Up for Certification Email Updates” box on <a href=\"https://www.healthit.gov/topic/certification-ehrs/certification-health-it\">healthit.gov</a>. Instructions will also be posted on the <a href=\"https://groups.google.com/g/inferno-testing\">Inferno Google Group</a> and this thread on how to join these Inferno office hours.</p>",
        "id": 274750503,
        "sender_full_name": "Johnny Bender",
        "timestamp": 1646859071
    },
    {
        "content": "<p><strong>Inferno Office Hours Sessions for Health IT Developers</strong> </p>\n<p>The ONC Health IT Certification Program will be hosting a month of Inferno office hour sessions for health IT developers beginning this Friday, March 18, 2022.  These weekly sessions will occur on 3/18/2022, 3/25/2022, 4/1/2022, and 4/8/2022 from 2:00 pm – 3:00 pm ET. Health IT developers implementing and certifying to the ONC Certification criterion at 170.315(g)(10) are encouraged to attend. </p>\n<p>The Inferno team will cover the release of <a href=\"https://inferno-framework.github.io/inferno-core/\">Inferno Framework</a>, including <a href=\"https://inferno.healthit.gov/onc-certification-g10-test-kit/\">(g)(10) Standardized API Test Kit</a>. You can learn more about the changes that are part of this release by reading the release notes in the <a href=\"https://github.com/onc-healthit/onc-certification-g10-test-kit/releases/tag/v2.0.0\">(g)(10) Standardized API Test Kit GitHub repository</a>. The prior release of the Inferno Program Edition (Release 1.9) will be hosted on <a href=\"https://inferno.healthit.gov/inferno\">inferno.healthit.gov/inferno</a> for at least the next two months to support health IT developers’ transition to the new version of the tool. </p>\n<p>We encourage all Inferno users to visit and test the new Inferno Framework and please continue to provide feedback on the <a href=\"https://github.com/onc-healthit/onc-certification-g10-test-kit\">(g)(10) Standardized API Test Kit GitHub page</a>, engage the developer community on the <a href=\"#narrow/stream/179309-inferno\">chat.fhir.org Inferno page</a>, and send ONC any inquiries using the <a href=\"https://inquiry.healthit.gov/support/plugins/servlet/desk/portal/2\">ONC Health IT Feedback and Inquiry Portal</a>. </p>\n<p>For more information, including registration, please <a href=\"https://www.zoomgov.com/webinar/register/WN_WwVHNEX6Qim0sHD2DS_44g\">see here</a>.</p>",
        "id": 275269012,
        "sender_full_name": "Johnny Bender",
        "timestamp": 1647278204
    },
    {
        "content": "<p>Hi everyone! We ran into some technical difficulties with our Inferno Office Hours series today 3/18, so we are unfortunately cancelling the session today and will extend the office hours to 3/25/2022, 4/1/2022, 4/8/2022, and 4/15/2022 from 2:00 pm - 3:00 pm ET. Apologies for the inconvenience and looking forward to meeting with everyone!</p>",
        "id": 275843412,
        "sender_full_name": "Johnny Bender",
        "timestamp": 1647627680
    },
    {
        "content": "<p>Hey everyone,<br>\nWe're looking at the Inferno 2.0 tests for bulk patient Implantable Device profile (BDGV-10) and running into a strange issue. In Inferno 1.0 the same data / response passes the test, but in 2.0 the test result claims to be missing required fields. The fields in question, related to UDI-PI are, in fact, present in some of the resources returned. These fields are designated as must-support. Is there a known issue with this test in 2.0 or something different that we must provide related to those fields other than what is required for must-support fields?</p>\n<p>Even with the must-support fields present, Inferno 2.0 claims:<br>\nDevice: us-core-9: 'For implantable medical devices that have UDI information, at least one of the Production Identifiers (UDI-PI) SHALL be present.' Rule 'For implantable medical devices that have UDI information, at least one of the Production Identifiers (UDI-PI) SHALL be present.' Failed</p>",
        "id": 276636948,
        "sender_full_name": "Daniel Gabriel",
        "timestamp": 1648222650
    },
    {
        "content": "<p>Invariant (us-core-9 here) is enforced by FHIR validator. Every instance must valid against invariant rules. Can you check if any device in ndjson file does not have any of these UDI-PI elements populated:</p>\n<p>The following parsed Production Identifiers (UDI-PI) from the UDI<br>\nthe manufacture date<br>\nthe expiration date<br>\nthe lot number<br>\nthe serial number<br>\nthe distinct identifier (i.e., the distinct identification code)</p>",
        "id": 276639004,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1648223521
    },
    {
        "content": "<p>Yes, there are some instances that don't have all of those values available. In those cases we do not (cannot since it does not exist) provide a value. We do provide a data absent reason using an extension, like so:<br>\n\"_serialNumber\":{\"extension\":[{\"url\":\"http://hl7.org/fhir/StructureDefinition/data-absent-reason\",\"valueCode\":\"unknown\"}]}</p>",
        "id": 276640516,
        "sender_full_name": "Daniel Gabriel",
        "timestamp": 1648224030
    },
    {
        "content": "<p>In the case of provider-documented historical implants the UDI-PI fields may not be provided and therefore could not be present in the resulting FHIR object. Our test data contains examples which have the fields provided, which does demonstrate support of the must-support fields. I would understand the test failing if exactly none of the returned resources demonstrated support for the field, but that is not the case.</p>",
        "id": 276641142,
        "sender_full_name": "Daniel Gabriel",
        "timestamp": 1648224255
    },
    {
        "content": "<p>This is not about must support validation. <strong>Each resource must be valid against invariant rules</strong>. The rule is \"For implantable medical devices that have UDI information, at least one of the Production Identifiers (UDI-PI) SHALL be present.\" That means that if a device has UDI then it must have at least one of the UDI-PI. If you can send me a device resource that failed this test, I can manually check if that resource is valid using FHIR validator.</p>",
        "id": 276643387,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1648225152
    },
    {
        "content": "<p>This might make sense to submit as a US Core Jira, which we can mark as a patch fix to get industry agreement so Inferno can remove the invariant.  Invariants like this fall into my \"doesn't handle real world data\" bucket that I bring up as often as anyone will listen (see <a href=\"#narrow/stream/179166-implementers/topic/Period.20Datatype.20Invariant\">Period Datatype Invariant</a> and <a href=\"http://jira.hl7.org/browse/FHIR-25184\">FHIR-25184</a>).</p>",
        "id": 276648099,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1648227217
    },
    {
        "content": "<p>The other option is to just not provide a udiCarrier at all.  Depending on what you do have, I wonder if adding the DAR is actually what is triggering the invariant.</p>",
        "id": 276648186,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1648227247
    },
    {
        "content": "<p>This is what I was suspecting as well. Given that it passes in Inferno 1.0, I think something subtle could be happening here. For what it's worth the resource does pass the individual US Core Profile tests.</p>",
        "id": 276649284,
        "sender_full_name": "Daniel Gabriel",
        "timestamp": 1648227717
    },
    {
        "content": "<p>us-core-9 is removed and replaced by several paragraph of narrative in US Core v4.0. But I am still confused by the difference behavior between Infenro v1.9 and v2.0. We didn't make any intented validation logic change in v2.0. If they are truely difference, it could be side effect from other changes.</p>",
        "id": 276652590,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1648229176
    },
    {
        "content": "<p>I'm going to try running this without the DAR fields and see if that addresses the issue. Will report back. Thanks!</p>",
        "id": 276653609,
        "sender_full_name": "Daniel Gabriel",
        "timestamp": 1648229533
    },
    {
        "content": "<p>hey all, found another bug in inferno 2, just opened a ticket in github for it. This issue is fairly minor, but still leads to some confusion and would be good to address it</p>\n<p><a href=\"https://github.com/onc-healthit/onc-certification-g10-test-kit/issues/58\">https://github.com/onc-healthit/onc-certification-g10-test-kit/issues/58</a></p>",
        "id": 276916292,
        "sender_full_name": "Nathan Loyer",
        "timestamp": 1648493649
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"488673\">@Daniel Gabriel</span> <span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span> <span class=\"user-mention\" data-user-id=\"279806\">@Nathan Loyer</span>   There is new requirement in US Core 4.0 about Device UDI/UDI-PI</p>\n<p>Implantable medical devices that have UDI information SHALL represent the UDI code in Device.udiCarrier.carrierHRF.</p>\n<ul>\n<li>All of the five UDI-PI elements that are present in the UDI code SHALL be represented in the corresponding US Core Implantable Device Profile element.</li>\n</ul>\n<p>I created a ticket <a href=\"http://jira.hl7.org/browse/FHIR-36655\">FHIR-36655</a> for clarification. If you have any input, please add to that ticket.</p>",
        "id": 276932645,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1648502248
    },
    {
        "content": "<p>If it's an update for US Core 4.0, then that shouldn't affect the g10 test kit, right?</p>",
        "id": 276932979,
        "sender_full_name": "Nathan Loyer",
        "timestamp": 1648502427
    },
    {
        "content": "<p>That is correct.</p>",
        "id": 276933128,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1648502522
    },
    {
        "content": "<p>Thanks for looking into this! So it seems like the expectation is that all 5 UDI-PI fields will be provided, or none shall be provided?</p>",
        "id": 277003256,
        "sender_full_name": "Daniel Gabriel",
        "timestamp": 1648560015
    },
    {
        "content": "<p>In the situation where we have partial information, does that mean we are expected to exclude any UDI-PI fields which may be present, or exclude the UDI entirely?<br>\nIf I'm reading this correctly, unless we have all 5 UDI-PI fields, maybe we don't actually have UDI information provided as described.</p>",
        "id": 277005893,
        "sender_full_name": "Daniel Gabriel",
        "timestamp": 1648561250
    },
    {
        "content": "<p>My concern is that UDI, UDI-DI, and UDI-PI fields are marked as must support. In the case where we have partial results such that the described invariant would fail, can we exclude the information?</p>",
        "id": 277009641,
        "sender_full_name": "Daniel Gabriel",
        "timestamp": 1648562857
    },
    {
        "content": "<p>This might also be a matter of difference between US Core 3.1.1 and US Core 4.0.0. If we specify our devices as US Core 3.1.1 (which our resources should comply to) would the tests pass? <span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span></p>",
        "id": 277013517,
        "sender_full_name": "Daniel Gabriel",
        "timestamp": 1648564384
    },
    {
        "content": "<p>Here is a JIRA ticket asking US Core to clarify that requirement <a href=\"http://jira.hl7.org/browse/FHIR-36657\">FHIR-36657</a>. The previous one was closed due to workflow issue.</p>\n<p>US Core 3.1.1 asks for that \"Each Implantable Device must have\" at least one UDI-PI (invariant uscore-9) for each instance.</p>",
        "id": 277157658,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1648652222
    },
    {
        "content": "<p>Hey all, we've filed a bug in Inferno Core that looks to be related to the issue we're experiencing: <a href=\"https://github.com/inferno-framework/inferno-core/issues/154\">https://github.com/inferno-framework/inferno-core/issues/154</a></p>",
        "id": 277767404,
        "sender_full_name": "Daniel Gabriel",
        "timestamp": 1649093815
    },
    {
        "content": "<p>It appears that even when a specific US Core profile is passed as part of a validation run, Inferno Core will use the validator for the most recent version of that profile.</p>",
        "id": 277767568,
        "sender_full_name": "Daniel Gabriel",
        "timestamp": 1649093889
    },
    {
        "content": "<p>Here's another issue that I logged that if implemented would have helped us debug this instance failing that Dan linked to.</p>\n<p><a href=\"https://github.com/inferno-framework/inferno-core/issues/155\">https://github.com/inferno-framework/inferno-core/issues/155</a></p>\n<p>The proposal is to persist the HTTP requests to the fhir validator. I had tried forking and writing it myself, but ran into some issues and gave up on that.</p>",
        "id": 277780623,
        "sender_full_name": "Nathan Loyer",
        "timestamp": 1649099838
    },
    {
        "content": "<p>I have replied to issue-145. Inferno does use the correct profile version.</p>",
        "id": 277786291,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1649102748
    },
    {
        "content": "<p>Also, kind reminder, please raise new issue at onc-certification-g10-test-kit repo. (<a href=\"https://github.com/onc-healthit/onc-certification-g10-test-kit\">https://github.com/onc-healthit/onc-certification-g10-test-kit</a>). That is the main repo we are using for any g10 testing related issues no matter what the root cause is. It is easier for us to track and response in a timely manner.</p>",
        "id": 277787329,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1649103330
    },
    {
        "content": "<p>ah, ok. I figured it made more sense to put the issue in the repo that would address it</p>",
        "id": 277870609,
        "sender_full_name": "Nathan Loyer",
        "timestamp": 1649162182
    },
    {
        "content": "<p>Thanks for the feedback. I would say if the issue is related to g10 test, raise the issue in g10-test repo though the root cause may lays on somewhere else, ex Device resource failed with validator error. If the issue is not related to g10 test and more fundamentally affect other test kit, then raise it in corresponding repo, ex add logging for validation request. The reason is that we have all the tracking build in g10 repo. Any status change on an issue is reflected with label changes, such as \"will fix\", \"resolved\", \"release in v2.0\" etc. So it is easier for issue report to know the expectation. Also it is easier for us to estimate how many issues need to be addressed and prioritize g10 issues.</p>",
        "id": 277882042,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1649166950
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191506\">@Yunwei Wang</span> we are still experiencing this issue. Notably, we are able to get identical test data passing on Inferno Program Edition 1.9.0 but see the Implantable Device profile as failing on ONC Certification (g)(10) Standardized API V.2.0.0 build on Inferno 0.2.0. Should we open a ticket on <a href=\"https://github.com/onc-healthit/onc-certification-g10-test-kit\">https://github.com/onc-healthit/onc-certification-g10-test-kit</a>?</p>",
        "id": 277919686,
        "sender_full_name": "Daniel Gabriel",
        "timestamp": 1649181749
    },
    {
        "content": "<p>So just got through debugging this some more with the mocked out validator that we deployed. We have it just logging all the input data so we can debug it, and it looks to me like inferno is stripping out our data absent reasons from our resource before sending it to the validator.</p>",
        "id": 277923448,
        "sender_full_name": "Nathan Loyer",
        "timestamp": 1649183297
    },
    {
        "content": "<p>Yes. Please raise an issue at g10-test-kit repo with any details you may provide. If you have the ndjson data set without any PHI, please include that too. You can also send the dataset to me directly if you don't want to post on the github.</p>",
        "id": 277923681,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1649183377
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"279806\">@Nathan Loyer</span> That is interesting. Do you have an example of the original resource in the NDJSON and the modified resource sending to validator?</p>",
        "id": 277923849,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1649183428
    },
    {
        "content": "<p>details are in #154, I'll make a new ticket and link to that one</p>",
        "id": 277924699,
        "sender_full_name": "Nathan Loyer",
        "timestamp": 1649183716
    },
    {
        "content": "<p>Is that the \"modified\" resource that inferno sent to validator?<br>\nWhat is the original one in NDJSON?<br>\nDo you have an screenshot for the error message on UI?<br>\nThanks</p>",
        "id": 277924890,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1649183776
    },
    {
        "content": "<p><a href=\"https://github.com/onc-healthit/onc-certification-g10-test-kit/issues/67\">https://github.com/onc-healthit/onc-certification-g10-test-kit/issues/67</a></p>",
        "id": 277925365,
        "sender_full_name": "Nathan Loyer",
        "timestamp": 1649183940
    },
    {
        "content": "<p>it's the error message listed in the description of #154</p>",
        "id": 277925478,
        "sender_full_name": "Nathan Loyer",
        "timestamp": 1649183983
    }
]