[
    {
        "content": "<p>Is there any known issue (didn't see anything in github) where Inferno will sometimes pass tests when it shouldn't?  For example, maybe test results for one server is getting mixed up in the test results of another server?</p>\n<p>We have seen this intermittently.  There are some tests we know we should NOT be passing (yet).  For example, USCDR-13 (due to <a href=\"https://github.com/onc-healthit/inferno-program/issues/316\">https://github.com/onc-healthit/inferno-program/issues/316</a>).  However, somehow, we are passing on the public 1.6.2 version.</p>\n<p>Here is an example test session:  <a href=\"https://inferno.healthit.gov/inferno/e7X7MhhmJlv/test_sets/test_procedure/\">https://inferno.healthit.gov/inferno/e7X7MhhmJlv/test_sets/test_procedure/</a></p>",
        "id": 251728504,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1630594476
    },
    {
        "content": "<p>Historically it seems like it was intermittent, but we've been unexpectedly passing some tests for ~3 days in a row now, so recently it has seemed less intermittent.</p>",
        "id": 251728794,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1630594593
    },
    {
        "content": "<p>Tests we don't expect to pass:<br>\nUSCG-08<br>\nUSCDR-13<br>\nUSCID-08<br>\nUSCP-13</p>\n<p>Looking at these more closely, they all appear to be must-support checks.</p>",
        "id": 251729279,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1630594777
    },
    {
        "content": "<p><a href=\"https://github.com/onc-healthit/inferno-program/issues/340\">This issue</a> can cause the reference resolution tests to attempt to read references from the wrong server, but I'm not aware of any issues that would affect the MS tests. I will investigate further, but won't be able to get to it until next week.</p>",
        "id": 251736642,
        "sender_full_name": "Stephen MacVicar",
        "timestamp": 1630597612
    },
    {
        "content": "<p>Ah - I wonder if we might have been seeing two different things.  I bet the intermittent issues we saw were related to the race condition, but the must-support issue may be unrelated.  Do you want me to submit a github issue?</p>",
        "id": 251737747,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1630597991
    },
    {
        "content": "<p>Well, that race condition typically causes tests to intermittently fail rather than intermittently pass, because it's attempting to use ids from server A to read resources from server B.</p>\n<p>A github issue would definitely be helpful for tracking this.</p>",
        "id": 251738660,
        "sender_full_name": "Stephen MacVicar",
        "timestamp": 1630598320
    },
    {
        "content": "<p><a href=\"https://github.com/onc-healthit/inferno-program/issues/355\">https://github.com/onc-healthit/inferno-program/issues/355</a></p>",
        "id": 251762569,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1630607123
    }
]