[
    {
        "content": "<p>Hello, it's my first time trying to install Inferno and I'm having a little trouble getting Inferno to connect to my local FHIR server running on my machine (assuming that is possible).  I looked on the wiki for a description of the \"bind\" config option but I didn't see a description and wasn't sure if that was what I needed to change.   I have also setup the config file to point the \"localhost_reference_server\" to my local FHIR instance.</p>\n<p>My problem is that all of the tests fail with some flavor of either \"Failed to open TCP connection to locahost:80 (getaddrinfo: Name or service not known)\" or \"Failed to open TCP connection to LAPTOP-MB3K78O7:443 (getaddrinfo: No address associated with hostname)\" depending on how I have the \"uri\" parameter set in my local preset.</p>",
        "id": 208681660,
        "sender_full_name": "Fred Harmon",
        "timestamp": 1598964373
    },
    {
        "content": "<p>Hi Fred -- are you using Docker to run your local instance (e.g. <code>docker compose up</code>)?  If so, Inferno runs in its own container that acts like an isolated VM, so referencing <code>localhost</code> will essentially look for something running in that same VM.  The way we usually get around this is to point Inferno to the IP address of your host machine instead of relying on localhost or a host name.  Are you running this on Windows, Mac or Linux?</p>",
        "id": 208683572,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1598965467
    },
    {
        "content": "<p>Ah great point.  Yes, I am running this in Windows in Docker.  Trying now to replace localhost with my actual IP for my machine.  Will let you know.</p>",
        "id": 208683674,
        "sender_full_name": "Fred Harmon",
        "timestamp": 1598965550
    },
    {
        "content": "<p>That did the trick.  Thanks a lot <span class=\"user-mention\" data-user-id=\"192576\">@Robert Scanlon</span> .  Nice easy one to start the day.  <span aria-label=\"joy\" class=\"emoji emoji-1f602\" role=\"img\" title=\"joy\">:joy:</span></p>",
        "id": 208684179,
        "sender_full_name": "Fred Harmon",
        "timestamp": 1598965813
    },
    {
        "content": "<p>I was just dealing with this yesterday. If you don't want to keep track of your machine's actual IP, you should be able to use Docker's special 'host.docker.internal' DNS name to refer to the host machine. Works for me on Mac, and appears like it should work for Windows as well: <a href=\"https://docs.docker.com/docker-for-windows/networking/#use-cases-and-workarounds\">https://docs.docker.com/docker-for-windows/networking/#use-cases-and-workarounds</a></p>",
        "id": 208700564,
        "sender_full_name": "Bradley Strecker",
        "timestamp": 1598972837
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191577\">@Bradley Strecker</span>!  I believe we had issues using that at some point in the distant past (perhaps on Windows) and ended up just using direct IP addresses, but that certainly is a better solution if it works.</p>",
        "id": 208716185,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1598979159
    }
]