[
    {
        "content": "<p>Hello,</p>\n<p>Is it required to display a reference to Medication resource in MedicationRequest instance? We are displaying a medication using the CodeableConcept. This is what the resource is like<br>\n{<br>\n  \"resourceType\": \"MedicationRequest\",<br>\n....<br>\n  \"medicationCodeableConcept\": {<br>\n    \"coding\": [<br>\n      {<br>\n        \"system\": \"<a href=\"http://www.nlm.nih.gov/research/umls/rxnorm\">http://www.nlm.nih.gov/research/umls/rxnorm</a>\",<br>\n        \"code\": \"211874\",<br>\n        \"display\": \"aspirin 325 mg tablet\"<br>\n      }<br>\n    ],<br>\n    \"text\": \"aspirin 325 mg tablet\"<br>\n  },<br>\n...<br>\n}<br>\nThis is according to the specification -<br>\n18. MedicationRequest.medication[x]<br>\nDefinition  <br>\nIdentifies the medication being requested. This is a link to a resource that represents the medication which may be the details of the medication or simply an attribute carrying a code that identifies the medication from a known list of medications.</p>\n<p>However, I am getting this message in the Inferno tool - <br>\nUSCMR-11: Medication resources returned conform to US Core v3.1.1 profiles results...<br>\nMedicationRequests did not reference any Medication resources.</p>\n<p>Am we required to implement \"Medication\" resource and add  a reference to it in MedicationRequest?</p>\n<p>Thank you!</p>",
        "id": 227328745,
        "sender_full_name": "Lakshmi Bhamidipati",
        "timestamp": 1614024206
    },
    {
        "content": "<p>The status on this test result should be 'omit', which means that you have not 'opted into' the test by providing a reference to a Medication.  By providing a medication as a CodeableConcept,  we do not need to validate Medication resources because none exist.  You can think of an 'omit' as a pass.</p>",
        "id": 227329671,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1614024613
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"192576\">@Robert Scanlon</span> . It is good to know the concept of 'omit' .</p>",
        "id": 227335073,
        "sender_full_name": "Lakshmi Bhamidipati",
        "timestamp": 1614027061
    },
    {
        "content": "<p>I think there is an opportunity for us to make this more obvious for new users, thanks for the question.  Just to verify, if you hover over the icon in the result on the left side, does the flyover say 'omit'?  We definitely should make it so the result shows up when you copy/paste!</p>",
        "id": 227335347,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1614027175
    },
    {
        "content": "<p>Yes, it does. When I hover over it, the message is \"Test was omitted and does not affect passing or failed scores\".</p>",
        "id": 227500154,
        "sender_full_name": "Lakshmi Bhamidipati",
        "timestamp": 1614113042
    }
]