[
    {
        "content": "<p>Since Organization and Practitioner do not have a direct reference to the patient, should we only have to go 1 level deep to get a transitive reference for these types from the ones listed in the test which were  CareTeam, DiagnosticReport Lab, DiagnosticReport Note, DocumentReference, MedicationRequest<br>\nand Provenance for Organization.</p>",
        "id": 254610694,
        "sender_full_name": "Glenn Kersting",
        "timestamp": 1632433674
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 254610804,
        "sender_full_name": "Glenn Kersting",
        "timestamp": 1632433710
    },
    {
        "content": "<p>Currently our export for the patient in this section uses the patient compartment  which does not have the organization and practitioner resources in it so we are trying to determine what is expected as far getting these resources.</p>",
        "id": 254700995,
        "sender_full_name": "Glenn Kersting",
        "timestamp": 1632489126
    },
    {
        "content": "<p>That is correct. Encounter/Organization/Practitioner resource are collected through references in other US Core Resources.</p>",
        "id": 254702679,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1632489779
    },
    {
        "content": "<p>So when adding to the ndjson for Organization if  the CareTeam resource has an organization in it...add that to the file but we do not need to iterate any further.  Correct?</p>",
        "id": 254704335,
        "sender_full_name": "Glenn Kersting",
        "timestamp": 1632490468
    },
    {
        "content": "<p>What do you mean \"need to iterate any further\"?</p>",
        "id": 254705290,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1632490840
    },
    {
        "content": "<p>We know that CareTeam has a reference to Practitioner so that would go into the Practitioner Ndjson.<br>\nBut what about CareTeam has a reference to Practitioner and Practitioner has a reference to Organization. Would you expect that Organization to be in the Organization Ndjson? So we are basically looking for guidance on how far should we traverse the transitive references.</p>",
        "id": 254741409,
        "sender_full_name": "Glenn Kersting",
        "timestamp": 1632504444
    },
    {
        "content": "<p>My thoughts are if as we export the resource, we look and export any reference within that  resource. With that we should have all the data exported we need. Does that sound correct? Example we are exporting CareTeam if that CareTeam has a practitioner as a reference we export it.  If that CareTeam has an organization as a reference we export that organization.</p>",
        "id": 255071403,
        "sender_full_name": "Glenn Kersting",
        "timestamp": 1632757783
    }
]