[
    {
        "content": "<p>There's a test in inferno that fails if a new refresh token isn't supplied on token refresh... I assume that should be looking for a new access token... not a new refresh token? OAuth 2 states a server <em>can</em> create a new refresh token, but doesn't have to</p>",
        "id": 206189292,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1596743937
    },
    {
        "content": "<p>cc <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> to make sure I didn't miss something in SMART</p>",
        "id": 206189324,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1596743954
    },
    {
        "content": "<p>Test in question: \"SPD-TR-06: Server supplies new refresh token as required by ONC certification criteria\"</p>",
        "id": 206189363,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1596743975
    },
    {
        "content": "<p>I thought the only requirement from ONC was how long the refresh token was good for after refresh</p>",
        "id": 206189860,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1596744195
    },
    {
        "content": "<p>Agreed <span class=\"user-mention\" data-user-id=\"191356\">@Jenni Syed</span> -- this is a decision servers make. SMART says:</p>\n<blockquote>\n<p>The refresh token issued by the authorization server. If present, the app should discard any previosu (sic!) refresh_token associated with this launch, replacing it with this new value.</p>\n</blockquote>",
        "id": 206189893,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1596744215
    },
    {
        "content": "<p>This is very specifically an ONC requirement, not an OAuth or SMART requirement.  We isolated it into its own test to separate it from SMART &amp; OAuth reqs.</p>",
        "id": 206195969,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1596747472
    },
    {
        "content": "<p>Paragraph (10)(v)(A)(2)</p>\n<blockquote>\n<p>For subsequent connections, access must be granted to patient data in accordance with the implementation specification adopted in ยง 170.215(a)(3) without requiring re-authorization and re-authentication when a valid refresh token is supplied by the application. Additionally, an application capable of storing a client secret must be issued a new refresh token valid for a new period of no less than three months.</p>\n</blockquote>",
        "id": 206196099,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1596747543
    },
    {
        "content": "<p>And in the test procedure:</p>\n<blockquote>\n<p>The health IT developer demonstrates the ability of the Health IT Module to issue a new refresh token valid for a period of no shorter than three months without requiring re-authentication and re-authorization when a valid refresh token is supplied by the application according to the implementation specification adopted in ยง 170.215(a)(3).</p>\n</blockquote>",
        "id": 206196432,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1596747727
    },
    {
        "content": "<p>Ok, we'll log something for clarification with ONC. I assume the important part of that was how long the refresh token is good for. The spec doesn't require a new token get issued, and ours are already good for more than the required time.</p>",
        "id": 206196583,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1596747837
    },
    {
        "content": "<p>That sounds right Jenni!  I think the important functional requirement is: after a refresh, the app now has a refresh token with life of at least 3 months. Whether it's the same or different from the previous refresh token should be in implementation detail.</p>",
        "id": 206197604,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1596748387
    },
    {
        "content": "<p>Thanks Jenni -- providing feedback to ONC is the way to go so they can provide guidance if they think its necessary.  The inferno team did very intentionally write this test based on the language in the rule, knowing it is not an OAuth requirement.</p>",
        "id": 206198896,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1596749093
    }
]