[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191506\">@Yunwei Wang</span>  What was the in-work change you are planning for post 1.9?  That was related to reference resolution right?  And/or can you post the slides for the last Tech Talk where you talked about that (sorry, my memory is bad).</p>",
        "id": 269485354,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1643232591
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span>   Thanks for reminding me about that. After WGM, I cannot remember what my plan was. I will release the slide today. We just had a meeting today about post 1.9 schedule. Inferno will put more focus on releasing new Inferno 2.0 platform. There are 4 items currently on the to-do list of Inferno Program: PKCE support, Capability URLs for bulk data download, attachment download (this one was pull out of 1.9 because of the Capability URLs), and reference resolution. New plan is integrating those into 2.0 release instead of 1.x product line. We will finalize the plan before Feb's Inferno tech talk.</p>",
        "id": 269489213,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1643234468
    },
    {
        "content": "<p>Do you have a github issue you are using to track the future reference validation topic? It seems like <a href=\"https://github.com/onc-healthit/inferno-program/issues/330\">Issue#330</a>, but that one is closed.</p>",
        "id": 269493992,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1643236953
    },
    {
        "content": "<p>That is correct. I created an internal JIRA ticket to address that but I don't have a github issue to track. Would you mind to create one in Inferno Program repo? Thanks</p>",
        "id": 269591424,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1643298351
    },
    {
        "content": "<p><a href=\"https://github.com/onc-healthit/inferno-program/issues/431\">https://github.com/onc-healthit/inferno-program/issues/431</a></p>",
        "id": 269631665,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1643314653
    }
]