[
    {
        "content": "<p>I cannot see some of the mandatory test cases defined in the Community Edition US Core v3.1.0 Profiles under the Program edition.<br>\neg. CE US Core Profiles-Encounter-USCE-03 is not present under PE Encounter Tests.</p>\n<p>What is the reason for removing test cases like these from the Program Edition? My understanding was that even the Program edition makes use of US Core v3.1.0 IG validation.<br>\nFrom a (g)(10) certification perspective, do we need only pass the test cases defined under the Program Edition?</p>",
        "id": 205404372,
        "sender_full_name": "Ramachandran G",
        "timestamp": 1596051958
    },
    {
        "content": "<p>There isn't quite full alignment between USCDI v1 and US Core v3.1, so in practice the program certification requirements are slightly different than conformance requirements for US Core v3.1</p>",
        "id": 205405388,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1596052453
    },
    {
        "content": "<p>See the (g)(10) CCG for authoritative guidance on these discrepancies: <a href=\"https://www.healthit.gov/test-method/standardized-api-patient-and-population-services#ccg\">https://www.healthit.gov/test-method/standardized-api-patient-and-population-services#ccg</a></p>",
        "id": 205405496,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1596052523
    },
    {
        "content": "<p>In this particular case, Encounter isn't in USCDI v1, but is required as a must support reference to other USCDI-mapped US Core profiles.  So what is tested is READ on Encounter (for when it is referenced by other USCDI/US Core resources), but the searches are not tested.</p>",
        "id": 205405951,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1596052759
    },
    {
        "content": "<p>You can use the CE of the US Core IG tests to start, because it might be a little easier to run some of the tests, but be sure to test with PE once you are in the ballpark because the PE is explicitely built to the exact requirements of certification, taking into account USCDI, US Core, SMART App Launch, Bulk Data, etc.</p>",
        "id": 205407104,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1596053232
    },
    {
        "content": "<p>I'd like to circle back to our US Core tests in CE to perhaps have an option like 'USCDI strict-mode' or something similar.</p>",
        "id": 205407387,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1596053396
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"192576\">@Robert Scanlon</span> for the explanation.</p>",
        "id": 205422706,
        "sender_full_name": "Ramachandran G",
        "timestamp": 1596062847
    }
]