[
    {
        "content": "<p>For the Public Client Standalone Launch With OpenID Connect test case can the support of PKCE or using client_assertion using a JWT be added to Inferno? The way the current use case sits there are security risks outlined in RFC 6819, <a href=\"https://datatracker.ietf.org/doc/html/rfc6819\">https://datatracker.ietf.org/doc/html/rfc6819</a>. Section 5.2.3, <a href=\"https://datatracker.ietf.org/doc/html/rfc6819#section-5.2.3\">https://datatracker.ietf.org/doc/html/rfc6819#section-5.2.3</a>, lists some of the methods we can use to mitigate these risks. </p>\n<p>5.2.3.1 - don't provide secrets to public clients. We currently follow this and don't issue secrets to these clients.<br>\n5.2.3.7 - use strong client authentication. Absent PKCE, we also allow authorization by checking for a client_assertion using a JWT.</p>\n<p>Without these capabilities in the inferno test tool, we will not be able to meet our security requirements and pass the test case.  The security risks are far to great to let this be implemented as the test currently stands.</p>\n<p>Thanks!</p>",
        "id": 267768213,
        "sender_full_name": "Jason Vogt",
        "timestamp": 1642013046
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192576\">@Robert Scanlon</span> <span class=\"user-mention\" data-user-id=\"191506\">@Yunwei Wang</span> Do you guys have any feedback on the public client issue we are having?</p>",
        "id": 268640488,
        "sender_full_name": "Jason Vogt",
        "timestamp": 1642653266
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"270275\">@Jason Vogt</span>, sorry for the slow response here. ONC asked us to implement this as an option and we'll have it done by the end of March.  I can't say if ONC will allow this option for certification, as I don't speak for them and haven't seen any published clarification that they will allow it.  The reason why I defer to them on this matter is that for certification we do not allow servers to impose extra requirements on clients as a general rule.  This is a very reasonable extra requirement though (standardized, mentioned in SMART v1, encouraged as a best practice, etc).</p>",
        "id": 268705356,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1642691183
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193903\">@Johnny Bender</span> -- Can you say if ONC plans on putting out any clarification  on this publicly in the coming weeks or months?  Or has it already publicly stated that it is ok?</p>",
        "id": 268706218,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1642691514
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"270275\">@Jason Vogt</span> -- do you have a public sandbox with this enabled that we can use as we implement this functionality?  It is helpful to have some 3rd party systems to validate tests against (the more the better!)</p>",
        "id": 268707335,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1642691886
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192576\">@Robert Scanlon</span> Yes, we do have a public endpoint setup that we have been using to test all of the scenarios from the website and not just locally.  We would be able to assist with testing.</p>",
        "id": 268711636,
        "sender_full_name": "Jason Vogt",
        "timestamp": 1642693414
    },
    {
        "content": "<p>Great, we'll reach out when we have something to start trying on external systems (within a few weeks).</p>",
        "id": 268742792,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1642705989
    },
    {
        "content": "<p>To clarify: the plan is to add PKCE support.  I'm unsure about client_assertion.</p>",
        "id": 268743863,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1642706507
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193903\">@Johnny Bender</span> Do you have any thoughts on Robert's question?</p>",
        "id": 270743433,
        "sender_full_name": "Jason Vogt",
        "timestamp": 1643994373
    },
    {
        "content": "<p>Hi all. ONC has updated the <a href=\"https://www.healthit.gov/test-method/standardized-api-patient-and-population-services#ccg\">(g)(10) CCG</a> with a clarification relevant to this discussion. The clarification is copied below and please feel free to <a href=\"https://cloud.connect.hhs.gov/certification?email=\">sign up</a> for the ONC Health IT Certification Program listserv to keep up with future updates!</p>\n<p><strong>Clarification to Paragraph <a href=\"https://www.federalregister.gov/d/2020-07419/p-3464\">85 FR 170.315(g)(10)(v)(A)(1)</a> (ONC Cures Act Final Rule)</strong>:</p>\n<blockquote>\n<p>As described in the ONC Cures Act Final Rule, we encourage implementers to adhere to industry best practices to mitigate Cross-Site Request Forgery (CSRF) and other known security threats (<a href=\"https://www.federalregister.gov/d/2020-07419/p-1186\">85 FR 25742</a>). Proof Key for Code Exchange (PKCE) (<a href=\"https://datatracker.ietf.org/doc/html/rfc7636\">Internet Engineering Task Force Request for Comments 7636</a>) is an industry standard that can help mitigate CSRF and other known security threats. The ONC Health IT Certification Program will support the optional use of PKCE during authentication and authorization testing. Health IT developers that implement and require the use of PKCE should include documentation for their PKCE implementation as part of the API Documentation requirement at <a href=\"https://www.ecfr.gov/current/title-45/subtitle-A/subchapter-D/part-170/subpart-C#p-170.315(g)(10)(viii)\">45 CFR 170.315(g)(10)(viii)</a> and API Transparency Conditions at <a href=\"https://www.ecfr.gov/current/title-45/subtitle-A/subchapter-D/part-170/subpart-D#p-170.404(a)(2)\">45 CFR 170.404(a)(2)</a>.</p>\n</blockquote>",
        "id": 272423722,
        "sender_full_name": "Keith Carlson",
        "timestamp": 1645202113
    },
    {
        "content": "<p>Hello, on G10 Test 6.1.02, when I've launched the test pointed to the FHIR endpoint, the tool tries to get the authorization code from the FHIR endpoint instead of the authorize endpoint published in the smart-configuration and CapabilityStatement.  Why is that?</p>",
        "id": 277876675,
        "sender_full_name": "Chris Blair",
        "timestamp": 1649164630
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196383\">@Chris Blair</span> Did you run 6.1 test only or did you run whole \"ONC Certification (g)(10) Standardized API\" test suite?</p>",
        "id": 277879579,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1649165904
    },
    {
        "content": "<p>Just 6.1</p>",
        "id": 277880929,
        "sender_full_name": "Chris Blair",
        "timestamp": 1649166484
    },
    {
        "content": "<p>OK. I noticed that our UI is a little bit confusing. We are still making updates there. In that popup dialog, there are three \"Standalone FHIR endpoint\" entries. What we really mean is: the first one is the authorization endpoint. the second one is the FHIR endpoint. and the third one is the token endpoint. <a href=\"/user_uploads/10155/xG_dtCoYlq4r5nYhxLr-_3wZ/image.png\">image.png</a> <br>\nCan you verify your input for these three endpoint?</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/xG_dtCoYlq4r5nYhxLr-_3wZ/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/xG_dtCoYlq4r5nYhxLr-_3wZ/image.png\"></a></div>",
        "id": 277882887,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1649167228
    },
    {
        "content": "<p>Ah yes, I had put the same FHIR endpoint into all three prompts.  It's working better now.  Thanks for explaining that.</p>",
        "id": 277884141,
        "sender_full_name": "Chris Blair",
        "timestamp": 1649167676
    },
    {
        "content": "<p>Great to know that helps. Would you mind raise an issue at <a href=\"https://github.com/onc-healthit/onc-certification-g10-test-kit/issues\">https://github.com/onc-healthit/onc-certification-g10-test-kit/issues</a> so we could track that UI issue. Thanks.</p>",
        "id": 277887381,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1649169048
    },
    {
        "content": "<p>It looks like it would be a duplicate of issues 49 and 58...</p>",
        "id": 277887959,
        "sender_full_name": "Chris Blair",
        "timestamp": 1649169292
    },
    {
        "content": "<p>thanks</p>",
        "id": 277888296,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1649169441
    },
    {
        "content": "<p>yeah I picked up the main branch in our deployment this week and I can confirm that the prior PRs resolved this. So this should be all set in the next release</p>",
        "id": 277926360,
        "sender_full_name": "Nathan Loyer",
        "timestamp": 1649184300
    }
]