[
    {
        "content": "<p>In order to test Single Patient API, we are getting the token from the first tab - Standalone Patient -Full Access. When I look at the scopes in the token generation workflow, it does not have Related Person - \"launch/patient openid fhirUser offline_access patient/Medication.read patient/AllergyIntolerance.read patient/CarePlan.read patient/CareTeam.read patient/Condition.read patient/Device.read patient/DiagnosticReport.read patient/DocumentReference.read patient/Encounter.read patient/Goal.read patient/Immunization.read patient/Location.read patient/MedicationRequest.read patient/Observation.read patient/Organization.read patient/Patient.read patient/Practitioner.read patient/Procedure.read patient/Provenance.read\".  Is it expected? Our FHIR server code is returning 403 because the resource is not present in the scope list. Thanks.</p>",
        "id": 245331071,
        "sender_full_name": "Lakshmi Bhamidipati",
        "timestamp": 1625758525
    },
    {
        "content": "<p>Since I've not heard from anyone, I am assuming that \"RelatedPerson\" is a resource that can be made available in the scopes picklist. Thanks.</p>",
        "id": 245356789,
        "sender_full_name": "Lakshmi Bhamidipati",
        "timestamp": 1625770940
    },
    {
        "content": "<p>If you have RelatedPerson references then Inferno will follow them and will expect to have been granted access.  Since RelatedPerson is not a required resource, we do not by default include it in the scope list.  You can add it though.  So yes, that is fine.</p>",
        "id": 245460235,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1625845727
    },
    {
        "content": "<p>We validate that input and fail if we see something that is disallowed (namely, non-standard scopes). So if you pass the launch tests, whatever scope you used should be valid from our perspective.</p>",
        "id": 245460340,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1625845801
    },
    {
        "content": "<p>If your server supports it, you could put <code>patient/*.read</code> instead of all resource-specific scopes here, as an example of a scope string that looks quite a bit different but still is allowed.</p>",
        "id": 245460475,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1625845865
    },
    {
        "content": "<p>The data we have on the reference server has 'PractitionerRole' references, so if you look at the 'Inferno Reference Server' preset on <a href=\"http://inferno.healthit.gov/inferno\">inferno.healthit.gov/inferno</a> (using the dropdown below the 'start testing' input box) you'll see <code>patient/PractitionerRole.read</code> in the scope list when you start the first authorization tests.  If we didn't have that, then we'd get an access denied when trying to follow those references in the single patient api section.</p>",
        "id": 245460866,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1625846055
    }
]