[
    {
        "content": "<p>I'm playing around with the inferno tech-forum-demo: <a href=\"https://github.com/inferno-community/tech-forum-demo\">https://github.com/inferno-community/tech-forum-demo</a> and getting these: \"Skip profile validation since profile <a href=\"https://gematik.de/fhir/StructureDefinition/PatientSzenario1\">https://gematik.de/fhir/StructureDefinition/PatientSzenario1</a> is unknown.\"</p>",
        "id": 212713679,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1602173600
    },
    {
        "content": "<p>I assume this is because the validator module isn't aware about these profiles, the profiles added to the tech demo are only used to generate the tests and are not forwarded to the validator module.</p>",
        "id": 212713839,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1602173660
    },
    {
        "content": "<p>In order to enable profile validation i would add these to the validator-module manually and build a docker image locally.</p>",
        "id": 212714001,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1602173726
    },
    {
        "content": "<ul>\n<li>Can the internal validator also validate against IG profiles? How can i add profiles to the internal validator? </li>\n<li>Is the validation module using the validation wrapper, which itself uses the java validator? Or are these distinct projects?</li>\n</ul>",
        "id": 212714415,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1602173901
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> the profiles should get loaded into the validator as part of the startup tasks.  If you have a repo up somewhere I can take a look, otherwise I would check that the profiles in question are in the appropriate resource directory in Inferno and that the fullUrl matches.</p>\n<p>Also, I haven't updated the <code>master</code> branch, but it might be worth trying with the <code>use-development</code> branch to get the latest and greatest (<a href=\"https://github.com/inferno-community/tech-forum-demo/commit/bc66d80e4eacf639fe08178ede7b911dd0dcba43\">the change is simply to use the <code>development</code> branch of inferno</a>)</p>\n<p>This capability is still pretty new, but I'm happy to help debug with you more and this kind of feedback is helpful so that our team knows what to prioritize!</p>",
        "id": 212745146,
        "sender_full_name": "Reece Adamson",
        "timestamp": 1602189045
    },
    {
        "content": "<p>i tried the tech demo, generating inferno tests from an IG package. But i'll try to migrate (copy&amp;paste) these generated tests to the development brach of inferno.</p>",
        "id": 212830111,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1602252450
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197651\">@Reece Adamson</span> <br>\nThanks for your answer (which i didn't understood correct when writing my first reply)<br>\nSwitching to the dev branch enabled validation. Wich failed because my strucDefs didn't include Snapshots <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 213554525,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1602852272
    },
    {
        "content": "<p>Tried it with snapshots, now running into this error: <code>Patient/4876: Patient.birthDate: Value is '1972-01-01' but must be '1/1/72 12:00 AM'</code></p>",
        "id": 213555832,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1602852977
    },
    {
        "content": "<p>seems that the validator struggles with ISO date format?</p>",
        "id": 213555893,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1602853019
    }
]