[
    {
        "content": "<p>Inferno seems to force the use of the same connection settings for the Full Access Patient App and the Limited Access Patient App test procedures. After running the first procedure, the settings for the second procedure cannot be edited. If I use a lenient OAuth client definition (allowing all used resource scopes) the first procedure succeeds, but the second fails. If I use a restricted client definition (allowing only Patient, Condition and Observation) the first procedure fails and the second succeeds. So somehow I would have expected to be able to use a different set of connection settings for each procedure. Is this a valid expectation or am I doing this all wrong?</p>",
        "id": 208061578,
        "sender_full_name": "Abel Enthoven",
        "timestamp": 1598427970
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 208555221,
        "sender_full_name": "Abel Enthoven",
        "timestamp": 1598880057
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"221719\">@Abel Enthoven</span> This is intentional.  We are testing the ability of the authorization system to give the <strong>patient</strong> (not the app) the ability to grant/deny access to specific resource types.  The idea is that the app is always requesting full resource access, and the patient intervenes (during the authorization process) and limits access to a subset of those resources that were specified at the beginning of the test (which defaults to Patient, Condition and Observation).  We know which scopes are granted (vs requested) because it is provided when the code is exchanged for the token.</p>",
        "id": 208584727,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1598892326
    },
    {
        "content": "<p>Thank you for the explanation <span class=\"user-mention\" data-user-id=\"192576\">@Robert Scanlon</span> . We will build some UI into our test environment to make it happen</p>",
        "id": 208650713,
        "sender_full_name": "Abel Enthoven",
        "timestamp": 1598943586
    }
]