[
    {
        "content": "<p>I'm trying to figure out how to handle DAR(Data Absent Reason) for the Blood Pressure USCOBP-11 test for inferno.  If we only have a systolic observation we report a DAR value for the diastolic component and do the same in the systolic component if we only have diastolic.  However, I can't figure out under what circumstance we would be reporting a DAR on the main resource level to satisfy inferno's USCOBP-11 test case.  </p>\n<p>It looks like to report on the dataAbsentReason we have to satisfy the obs-6 and vs-2 invariant.  Vs-2 invariant says to fill out DAR on the resource if we have no components.  However, in what circumstance would there be a blood pressure observation with no systolic or diastolic values?  In our system if we have neither of those values its because an observation does not even exist.  It sounds like this has requirement has been relaxed in US Core 4 (as I see in someone's other topic on USCOBH-11), but I'm trying to figure out how people are currently implementing this issue currently to address inferno's requirement.  We could create a single fake observation that meets the requirements in order to pass the test case but it seems odd to game the system that way...</p>",
        "id": 248928301,
        "sender_full_name": "Stephen Nielson",
        "timestamp": 1628556931
    },
    {
        "content": "<p>I remember one of the use case considered is there are series of BP observations. One of them does not have value because a loosing cuff. And you want to report that as BP read is not available due to loosing cuff instead of BP is not measured</p>",
        "id": 248981091,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1628603403
    },
    {
        "content": "<p>Wait, did the tests actually require demonstrating a series of connected bp measurements as part of a clinical protocol?</p>",
        "id": 248981646,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1628603642
    },
    {
        "content": "<p>I think the change in US Core 4.0 clarifies the intention. The problem is that we cannot simply drop a US Core 4.0 fix into current certification test based on US Core 3.1.1. Please submit a comment to ONC through ONC feedback portal.<br>\nAnd if everyone think that Observation.value[x] shall always present, then US core should consider changing Observation.value[x] from optional to mandatory</p>",
        "id": 248982369,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1628603948
    },
    {
        "content": "<p>I imagine that even if we submit a comment to ONC it could be a few months before they would issue a change and we are hoping to get through certification before then.  I'm assuming the best place to submit that feedback is here: <a href=\"https://inquiry.healthit.gov/support/plugins/servlet/desk/portal/2\">https://inquiry.healthit.gov/support/plugins/servlet/desk/portal/2</a>?</p>\n<p>It sounds like the correct situation is to track in our system that an observation occurred but no value was read (the loose cuff scenario you describe).  Since most of our clinicians enter in the readings manually I imagine they will skip over entering in missing readings almost entirely, but our API users will at least be able to take advantage of the functionality and support the use case you are suggesting.  Thank you for the quick response.</p>",
        "id": 248986462,
        "sender_full_name": "Stephen Nielson",
        "timestamp": 1628605601
    }
]