[
    {
        "content": "<p>Hello, we're testing our Patient API using inferno and believe we've encountered an issue. Specifically for USCP-04 - we are passing in <code>Patient?birthdate=1900-01-01&amp;family=Ach</code> this returns a patient with the last name \"Achie\". The test fails because I assume its looking for an exact match - but the spec seems to indicate that the default mode is a \"starts with\" match <a href=\"http://hl7.org/fhir/R4/search.html#string\">http://hl7.org/fhir/R4/search.html#string</a> . Can someone confirm our understanding is correct?</p>",
        "id": 243164162,
        "sender_full_name": "James Bradley",
        "timestamp": 1624024735
    },
    {
        "content": "<p>Yes, the default is 'starts with' - but are you sure that the test is not failing due to the birthdate? It is a weird value to find matches for</p>",
        "id": 243172597,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1624028543
    },
    {
        "content": "<p>That was my thought first too, but in looking at the code it does seem like we do exact string matches on <code>family</code> unfortunately.  This is not required for ONC Certification, so only shows up in our 'Community' set of tests.  But we need to fix it.  Thanks for letting us know.</p>",
        "id": 243173815,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1624029172
    },
    {
        "content": "<p>(it isn't required for ONC certification, because <code>birthDate+family</code> is 'SHOULD', not 'SHALL' in US Core -- so we don't test it)</p>",
        "id": 243173926,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1624029238
    },
    {
        "content": "<p><code>birthDate+name</code> is required for certification, and I believe we do handle it correctly there. Could you confirm that you pass <del>BDE-04</del> USCP-04 (whoops, looked at wrong window) ?</p>",
        "id": 243174094,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1624029297
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"210024\">@James Bradley</span> -- I just realized something is a little off here.  Our <code>USCP-04</code> tests are searching by <code>birthdate+name</code>, not <code>birthdate+family</code>, and I do not think they exhibit this bug.  Our <code>USCP-06</code> tests (Community version only because it is optional to implement) do search by <code>birthdate+family</code>, and I believe they do exhibit this bug.  You stated <code>USCP-04</code> was searching by <code>birthdate+family</code> above, but that shouldn't be happening.  Could you confirm which test number, which search parameter (<code>family</code> or <code>name</code>), and which version of inferno ('community' or 'program') so I can make sure I understand the problem?</p>",
        "id": 243185282,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1624035158
    },
    {
        "content": "<p>Thanks for the response! I'm going to confirm with the team but I wouldn't be surprised if they were testing using the community edition (we've integrated the community version into our development process). Thanks for checking it out.</p>",
        "id": 243193180,
        "sender_full_name": "James Bradley",
        "timestamp": 1624039948
    },
    {
        "content": "<p>We've run into similar issues too, where we apply \"fuzzy\" logic to names and date of birth.  For example, if you search for John, we might return patients that have a name of Jon.  Similarly with date of birth, we support single digit transposition and off-by-one fuzziness to handle fat-fingering.  Per the base FHIR spec, this is acceptable based on this bit:  </p>\n<p><a href=\"http://build.fhir.org/search.html#Introduction\">http://build.fhir.org/search.html#Introduction</a></p>\n<div class=\"codehilite\"><pre><span></span><code>The server determines which of their resources meet the criteria contained in\nthe search parameters as described below. However, the server has the prerogative\nto return additional search results if it believes them to be relevant.\n</code></pre></div>\n<p>For the actual certification, we can just turn off our fuzzy matching logic, but since we expect most users to want it enabled, would it make sense to have Inferno accept fuzzy matches?</p>",
        "id": 243382031,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1624282286
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span> -- thanks for highlighting this, we are looking at how to address this next.  There is also explicit leniency given towards fuzzy matches on names: \"When searching whole names and addresses (not parts), servers may also use flexible match or a free-text style searches on names to achieve the best results.\" <a href=\"https://www.hl7.org/fhir/search.html#string\">ref</a>.</p>",
        "id": 247618249,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1627581146
    }
]