[
    {
        "content": "<p>Hello Team,</p>\n<p>I have a question on User-level access token in EHR Practitioner Launch. When the app is launched in the context of this FHIR Patient (launch/patient scope with patient selection screen to select one patient), the ID token sent back from authorization server will contain fhirUser claim which is the Url of patient FHIR resource (Inferno reference server has patient FHIR resource). Can this access token be used to pull resources of an other patient that a practitioner can access or it can only be used for the patient that is selected from patient selection screen?</p>\n<p>Thanks</p>",
        "id": 271162333,
        "sender_full_name": "Sumanth Bandaru",
        "timestamp": 1644341439
    },
    {
        "content": "<p>If user-level scopes were requested during the launch (e.g. <code>user/Patient.read</code>), then the user could access any of those resources that they are allowed to, not just those for the current patient. If the user should only be allowed to access resources for the current patient, then patient-level scopes need to be used. This distinction is true even if the user is a Patient, as there are cases where a patient could have access to more than just their own data (such as a parent and child).</p>\n<p>The <code>fhirUser</code> claim represents the current user, not the current patient.</p>",
        "id": 271173327,
        "sender_full_name": "Stephen MacVicar",
        "timestamp": 1644346030
    },
    {
        "content": "<p>Thank You very much Stephen. </p>\n<p>Related to fhirUser claim I found this ID token from Inferno reference server tests, this looks like a patient resource url. Here is the link to inferno EHR practitioner app launch tests I just ran.</p>\n<p><a href=\"https://inferno.healthit.gov/inferno/iikvUnq9I6r/\">https://inferno.healthit.gov/inferno/iikvUnq9I6r/</a></p>\n<p>Here is the ID Token from the tests</p>\n<p>eyJ0eXAiOiJKV1QiLCJhbGciOiJSUzI1NiJ9.eyJzdWIiOiIiLCJhdWQiOiJTQU1QTEVfQ09ORklERU5USUFMX0NMSUVOVF9JRCIsImlzcyI6Imh0dHBzOi8vaW5mZXJuby5oZWFsdGhpdC5nb3YvcmVmZXJlbmNlLXNlcnZlci9yNCIsImV4cCI6MTY3NTg3NTg3NiwiaWF0IjoxNjQ0MzM5ODc2LCJmaGlyVXNlciI6Imh0dHBzOi8vaW5mZXJuby5oZWFsdGhpdC5nb3YvcmVmZXJlbmNlLXNlcnZlci9yNC9QYXRpZW50Lzg1In0.R6pUgECP3qOPxgTpFAVaaEIuLwfd0ewb2GQwnnbpRwjGdAdgAHRJDZzD8tgRbhMHoRuJp8oWxACBW65FlwdHFizjFfnP_TfSa13GyI4ZrC-1gfNg5ER1m-xIxWB0Puy0hmW0nJEpTeWQ7ytjoTGKd0KTtOibf3Nq9e9wt8wxKxqOgBaz-_1fMVOqGm-19yPlOy7XvxIg_8RMlb-56CXP7wcsobA_H5jspxTNB90uU28mmoMlL6w0xvEbAkPgu1tguEqLwaGXonkBWJDd7e4IOJ4sA11AlZ2PUVhCQa9yx-r9GHfDY06h1rJpLhSOAcAZCumxhMZuovNcn3oaIrjk_g</p>\n<p>Let me know your thoughts here.</p>",
        "id": 271186175,
        "sender_full_name": "Sumanth Bandaru",
        "timestamp": 1644352070
    },
    {
        "content": "<p><code>fhirUser</code> could be a Patient, but doesn't have to be. The reference server is just for demonstration purposes. You should not infer any certification requirements from its data.</p>",
        "id": 271271273,
        "sender_full_name": "Stephen MacVicar",
        "timestamp": 1644411045
    },
    {
        "content": "<p>Ok Gotcha. Thanks for the clarity. I appreciate your help.</p>",
        "id": 271288965,
        "sender_full_name": "Sumanth Bandaru",
        "timestamp": 1644418265
    }
]