[
    {
        "content": "<p>Norsk vs Engelsk på dokumentasjon, noen tanker? Jeg har i utgangspunktet basert meg på engelsk, men noen oversettelser fra norsk til engelsk i FHIR er ikke alltid så greit for konsumentene å skjønne, så det kan være fint med norsk forklaring i tillegg. Er det gjort noen tanker rundt dette fra før av?</p>",
        "id": 201103981,
        "sender_full_name": "Stine Johansen",
        "timestamp": 1592373248
    },
    {
        "content": "<p>Synes det er litt rart at vi skriver så mye på norsk, når interoperabilitet er formålet. Dårlig engelsk forstås godt av (nesten) alle, mens godt norsk bare forstås av noen få. Jeg heier på at vi dokumenterer på et vis som gjør det mulig for flest mulig å forstå!</p>",
        "id": 201377553,
        "sender_full_name": "Ole Kristian Losvik",
        "timestamp": 1592565884
    },
    {
        "content": "<p>Jeg er helt enig, men det er vel noen norske konsepter, som blir oversatt til engelsk, og da kan den engelske oversettelsen være ukjent? Jeg er litt usikker her, dette kom opp som en kommentar fra en av helseforetakene når vi i SAFEST-prosjekt satt og så på FHIR-profilene som vi skal lage.</p>",
        "id": 201378098,
        "sender_full_name": "Stine Johansen",
        "timestamp": 1592566325
    },
    {
        "content": "<p>Er helt n00b på fhir-området altså :) Jeg tror engelsk som basis, supplert av norske forklaringer der det trengs kan være helt supert. Legemiddelområdet er jo svært internasjonalt,  også innenfor bivirkningsrapport-området som jeg jobber med! Er det bevegelse innen SAFEST igjen?</p>",
        "id": 201378766,
        "sender_full_name": "Ole Kristian Losvik",
        "timestamp": 1592566853
    },
    {
        "content": "<p>Da er vi to n00b'er! Ja det må vel bli noe sånt. <br>\nJa, jeg sitter på SAFEST Gjennomføring som skal levere Ernæring, datakvalitet, virkestoffordinering og produktkoder i slutten av året.</p>",
        "id": 201378971,
        "sender_full_name": "Stine Johansen",
        "timestamp": 1592566989
    },
    {
        "content": "<p>Er det planlagt noen FHIR-apier rundt legemidler i SAFEST? F eks produktkoder?</p>",
        "id": 201379156,
        "sender_full_name": "Ole Kristian Losvik",
        "timestamp": 1592567131
    },
    {
        "content": "<p>Jepp, all data SAFEST skal distribuere skal distribueres i FHIR API, utkast til profiler ligger publisert på simplifier: <a href=\"https://simplifier.net/safest\">https://simplifier.net/safest</a></p>",
        "id": 201379310,
        "sender_full_name": "Stine Johansen",
        "timestamp": 1592567278
    },
    {
        "content": "<p>Jeg synes engelsk er bra så langt det går. Vi prøvde oss på noen prinsipper der vi kun skulle bruke norske ord der det virkelig ikke fantes noe på engelsk, og vi har så langt bare funnet noe innen bostedsadresse/matrikkel, ikke helsefag.</p>",
        "id": 202078356,
        "sender_full_name": "Espen Stranger Seland",
        "timestamp": 1593170841
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"228499\">@Ole Kristian Losvik</span> Lag deg gjerne konto på <a href=\"https://github.com/HL7Norway\">https://github.com/HL7Norway</a> og bli med, all utvikling og standardisering ønsker vi så langt det lar seg gjøre at er transparent og mulighet for å delta for alle. Spørsmål, bugs etc. kan med fordel legges inn som \"issues\" f.eks. under SAFEST-prosjektet - da er vi sikre på at vi kan følge det opp.</p>",
        "id": 202078683,
        "sender_full_name": "Espen Stranger Seland",
        "timestamp": 1593171014
    },
    {
        "content": "<p>Takk for det, da har jeg lagt inn en issue på adverse events i SAFEST-repoet. Kansje er det lurt å skrive i READMEen at man liker issues, så ikke folk vegrer seg :) Ta gjerne en <a href=\"https://github.com/HL7Norway/SAFEST/issues/4\">titt</a> og/eller kommenter, <span class=\"user-mention\" data-user-id=\"192681\">@Espen Stranger Seland</span>  og <span class=\"user-mention\" data-user-id=\"246865\">@Stine Johansen</span></p>",
        "id": 202082816,
        "sender_full_name": "Ole Kristian Losvik",
        "timestamp": 1593174273
    }
]