[
    {
        "content": "<p>Hi all,</p>\n<p>Since I posted this to some other country-specific streams, I thought I'd ask the same question here too.</p>\n<p>Does any publicly available test server exist for testing any of the Norwegian FHIR profiles? We're running an International Patient Access track at the FHIR Connectathon in January, and are interested in collecting information on all international FHIR implementations.</p>\n<p>At the connectathon, our main goal is to test as many client and server implementations as possible, against each other. We're interested in all country-specific server implementations, <strong>even if people running those servers would not be able to join the connectathon or the IPA track</strong> - as long as there is a test server or a sandbox environment publicly available.</p>\n<p>More info on the IPA track is in <a href=\"https://confluence.hl7.org/display/FHIR/2022-01+International+Patient+Access\">https://confluence.hl7.org/display/FHIR/2022-01+International+Patient+Access</a>.</p>\n<p>Beyond the connectathon, we're also interested in listing information on country-specific FHIR implementations in the IPA Implementation Guide.</p>",
        "id": 265819864,
        "sender_full_name": "Mikael Rinnetmäki",
        "timestamp": 1640188458
    },
    {
        "content": "<p>Can't think of any. </p>\n<p>The test-servers from our main partner (NHN) are usually rather heavy on security and requires registration and access to a valid Oauth token. I can't even connect to the server I used a lot a year ago. But then that project is all set on making a proprietary REST interface instead, unfortunately. So they might have put the FHIR test server out of commission for that reason. Any Norwegian test servers  avaliable from the industry <span class=\"user-mention\" data-user-id=\"256280\">@Ingvar Sørlien</span> <span class=\"user-mention\" data-user-id=\"192710\">@Kenneth Myhra</span> <span class=\"user-mention\" data-user-id=\"209937\">@Andy Harrison</span> <span class=\"user-mention\" data-user-id=\"192484\">@Armann Helgason</span> ?</p>",
        "id": 266963060,
        "sender_full_name": "Thomas Tveit Rosenlund",
        "timestamp": 1641403001
    },
    {
        "content": "<p>Unfortunately there are no open test FHIR servers, that I know of, implementing any of the Norwegian profiles. I have these two test servers available, but they only implement the base FHIR spec:</p>\n<ul>\n<li><a href=\"https://spark.incendi.no/\">https://spark.incendi.no/</a> (R4)</li>\n<li><a href=\"https://spark-stu3.incendi.no/\">https://spark-stu3.incendi.no/</a> (STU3)</li>\n</ul>",
        "id": 267038292,
        "sender_full_name": "Kenneth Myhra",
        "timestamp": 1641459614
    },
    {
        "content": "<p>Sorry to say but we don't have public FHIR test servers in TietoEVRY that I know of.</p>",
        "id": 267064572,
        "sender_full_name": "Armann Helgason",
        "timestamp": 1641478175
    },
    {
        "content": "<p>We don't have any public FHIR-server with the norwegian profiles imported, but it is quite easy to set one up if required.</p>",
        "id": 267073928,
        "sender_full_name": "Ingvar Sørlien",
        "timestamp": 1641483272
    },
    {
        "content": "<p>Thanks for the feedback <span class=\"user-mention\" data-user-id=\"192710\">@Kenneth Myhra</span> <span class=\"user-mention\" data-user-id=\"192484\">@Armann Helgason</span> <span class=\"user-mention\" data-user-id=\"256280\">@Ingvar Sørlien</span> . </p>\n<p>The status is as i expected unfortunately. But still good to get it confirmed.</p>",
        "id": 267467896,
        "sender_full_name": "Thomas Tveit Rosenlund",
        "timestamp": 1641834152
    }
]