[
    {
        "content": "<p>Hei, tittet litt på <a href=\"https://simplifier.net/hl7norwayno-basis/nobasisprocedure\">no-basis-Procedure</a> som nylig ble godkjent. Er det riktig at ICPC-2 skal ha samme system som NKPK: <code>urn:oid:2.16.578.1.12.4.1.1.7275</code>? Burde ikke dette være <code>http://hl7.org/fhir/sid/icpc-2</code>slik definert i <a href=\"https://www.hl7.org/fhir/terminologies-systems.html\">specen</a>?<br>\n<a href=\"/user_uploads/10155/U6CHLUr2sUqru7V1BFfGaTQT/Untitled.png\">Untitled.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/U6CHLUr2sUqru7V1BFfGaTQT/Untitled.png\" title=\"Untitled.png\"><img src=\"/user_uploads/10155/U6CHLUr2sUqru7V1BFfGaTQT/Untitled.png\"></a></div>",
        "id": 259537228,
        "sender_full_name": "Eirik Myklebost",
        "timestamp": 1635519850
    },
    {
        "content": "<p>Bra catcha Eirik, den har sklidd gjennom hele QA-prosessen uten å bli oppdaget. Litt av problemet med å oppdage denne type feil er at vi opererer med OID-koder som er lite meningsbærende. <span class=\"user-mention\" data-user-id=\"192856\">@Thomas Tveit Rosenlund</span> <span class=\"user-mention\" data-user-id=\"192681\">@Espen Stranger Seland</span> - kan vi få etablert synonyme URL-er i OID-hierarkiene ti lDirektoratet - så kan vi få med NKPK også på URL? For ICPC-2 er det vel bare å oppdatere med URL-en fra spekken.</p>",
        "id": 259540532,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1635521218
    },
    {
        "content": "<p>Eh, vi endrer vel bare system for ICPC-2 til urn:oid:2.16.578.1.12.4.1.1.7170?</p>\n<p>Jeg legger i hvertfall ikke om til url definisjoner for alle refererte kodeverk nå <span class=\"user-mention\" data-user-id=\"192654\">@Øyvind Aassve</span>. </p>\n<p>Men du er velkommen til å lage en issue, knytte det til en feature branch og deretter lage en pull request. Så skal vi få lagt det i produksjon raskt.</p>",
        "id": 259808193,
        "sender_full_name": "Thomas Tveit Rosenlund",
        "timestamp": 1635714078
    },
    {
        "content": "<p>Litt mer langsiktig med NKPK ja, jeg legger inn issue</p>",
        "id": 259838518,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1635755923
    },
    {
        "content": "<p>Noen grunn til at vi i Norge vil bruke <code>urn:oid:2.16.578.1.12.4.1.1.7170</code> for å identifisere ICPC-2 istedenfor <code>http://hl7.org/fhir/sid/icpc-2</code> slik definert i <a href=\"https://www.hl7.org/fhir/terminologies-systems.html\">spesifikasjonen</a>? Dette blir nok en særnorsk greie, spesifikasjonen sier:</p>\n<blockquote>\n<p>If a URI is defined here, it SHALL be used in preference to any other identifying mechanisms</p>\n</blockquote>",
        "id": 259852990,
        "sender_full_name": "Eirik Myklebost",
        "timestamp": 1635766283
    },
    {
        "content": "<p>Vi må ta en prat med kodeverksfolkene i hvilken grad norske utgivelser bør identifiseres annerledes - generelt eller bare i de tilfellene man bruker utvidelser. Ser jo Nederland har lagt til sin på ICPC-1, men den kan være gammel (tror neppe de bruker ICPC-1 i dag).</p>",
        "id": 259859796,
        "sender_full_name": "Espen Stranger Seland",
        "timestamp": 1635771331
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"223185\">@Eirik Myklebost</span> Kortversjonen er at vi har identifisert kodeverk slik fra før FHIR eksisterte. Vi får lage en plan for en god overgang.</p>",
        "id": 259860259,
        "sender_full_name": "Espen Stranger Seland",
        "timestamp": 1635771605
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192681\">@Espen Stranger Seland</span>  hvilke problemer ser vi evnetuelt med å bruke URL på ICPC-2. Vi bruker det allerede på SNOMED CT - og det er kun fordeler på FHIR-siden. Hvis det er likegyldig - som jeg mener det i utgangspuntet bør være - om vi bruker URL eller OID, det viktigste er at det er en unik identifikasjon av kodeverket - så har det vel sine fordeler å benytte URL. <span class=\"user-mention\" data-user-id=\"192856\">@Thomas Tveit Rosenlund</span> -fordi om vi legger om til URL her trenger vi ikke gjøre det for alle andre kodeverk-referanser i andre profiler?  Kan eventuelt løfte dette til neste TSK-møte?</p>",
        "id": 259861807,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1635772580
    },
    {
        "content": "<p>Vi har en best practice side på dette, den må revideres, og vi bør ha en konsistent metode å henvise til kodeverk på.</p>",
        "id": 259863603,
        "sender_full_name": "Thomas Tveit Rosenlund",
        "timestamp": 1635773554
    },
    {
        "content": "<p>OK, og godt poeng at vi bør avklare om det er nødvendig å skille mellom en norsk versjon av ICPC-2 og den internasjonale. Forhåpentligvis er det ikke det - da blir all kodeverreferanse veldig mye mer komplisert ....... Men anbefalingen bør etter min mening fra vår side være at vi kommer oss over på URL så fort som mulig .</p>",
        "id": 259863826,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1635773673
    },
    {
        "content": "<p>Siden dette er første gang ICPC-2 blir innført i de norske baseprofiler tenker jeg vi burde benytte anledningen til å bruke URL fra starten av, å endre fra OID til URL senere blir tungt og vil skape en kjedelig overgangsperiode med begge deler. Dette argumentet er forsterket av at HL7-international påkrever (SHALL) at URL skal brukes for ICPC-2. For andre kodeverk uten ferdig-definert URL er situasjonen noe annet (fnr, org-nr, volven etc.)</p>",
        "id": 259869720,
        "sender_full_name": "Eirik Myklebost",
        "timestamp": 1635776653
    },
    {
        "content": "<p>Det er jo et poeng <span class=\"user-mention\" data-user-id=\"223185\">@Eirik Myklebost</span>. Men jeg føler at dette bør tydeliggjøres på best-practice siden om kodeverk <span class=\"user-mention\" data-user-id=\"192654\">@Øyvind Aassve</span> <span class=\"user-mention\" data-user-id=\"223185\">@Eirik Myklebost</span> <span class=\"user-mention\" data-user-id=\"192681\">@Espen Stranger Seland</span> </p>\n<p>Kan dere bli enige om en oppdatering av den siden. Den nye praksisen blir vel at internasjonale kodeverk bruker internasjonale url for å angi dette (det kan eventuelt opprettes namingsystem for å klargjøre flere eksisterende navn, for eksempel har ICPC-2 også en volven oid). Særnorske kodeverk på volven angis med oid. Det er kanskje det vi egentlig har skrevet? Uklarheten ligger vel mest der vi både har norsk oid og internasjonal url og oid.</p>\n<p>ICPC-2 har mange identifikatorer, og vi bør nok ha et namingsystem i tillegg.<br>\n<a href=\"http://hl7.org/fhir/sid/icpc-2\">http://hl7.org/fhir/sid/icpc-2</a><br>\n2.16.840.1.113883.6.139<br>\n2.16.578.1.12.4.1.1.7170</p>",
        "id": 259959980,
        "sender_full_name": "Thomas Tveit Rosenlund",
        "timestamp": 1635837248
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192856\">@Thomas Tveit Rosenlund</span>  Kan vi ikke også si at vi ønsker å gå over til url på nasjonale kodeverk, selv om det vil være en overgangsfase her? Og så informere Avdeling helsefaglige kodeverk og andre at vi ønsker at de lager URL-paraleller til OID-ene de har (kan ikke være store jobben)?</p>",
        "id": 259960186,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1635837471
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192654\">Øyvind Aassve</span> <a href=\"#narrow/stream/179226-norway/topic/ICPS-2.20i.20no-basis-Procedure/near/259960186\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"192856\">Thomas Tveit Rosenlund</span>  Kan vi ikke også si at vi ønsker å gå over til url på nasjonale kodeverk, selv om det vil være en overgangsfase her? Og så informere Avdeling helsefaglige kodeverk og andre at vi ønsker at de lager URL-paraleller til OID-ene de har (kan ikke være store jobben)?</p>\n</blockquote>\n<p>De url'ene må vel helst komme fra PKT og være resolvable på kodeverksdatabasen? Vi skal ikke finne på url'er for volvenkodeverk tror jeg.</p>",
        "id": 259960456,
        "sender_full_name": "Thomas Tveit Rosenlund",
        "timestamp": 1635837701
    },
    {
        "content": "<p>Jeg er enig med alle - vi skal ha URL som foretrukket CodeSystem-identifikator, MEN det er viktig at vi gjør det riktig. </p>\n<p>ICPC-2 tror jeg er grei, mens ved ICD-10 vet jeg variantene kan være såpass forskjelige - men vi tar praten. Vi har akkurat den diskusjonen nå rundt NKL/NPU, der det er en internasjonal del og en norsk del - skal vi bruke \"internasjonal kode\" for NPU og særnorsk kode for NKL, eller kode alt som NKL (namespace, id)?</p>\n<p>For Volven-kodeverkene er jeg enig med Thomas at vi bør vente til vi har en terminologitjeneste som kan \"sørve\" disse skikkelige som CodeSystem+ValueSet, og da få skikkelige persistente og resolvable URLer. Så lenge de ikke er resolvable tror jeg vi bare gjør oss en bjørnetjeneste å lage URL for de (det gir oss ikke så mye, og kommer fort til å bli feil).</p>",
        "id": 259972807,
        "sender_full_name": "Espen Stranger Seland",
        "timestamp": 1635846785
    },
    {
        "content": "<p>Måske i kan finde inspiration i det danske supplement på <a href=\"https://github.com/hl7dk/dk-core/blob/feature/icpc-supplement/input/resources/icpc2e-dk.xml\">https://github.com/hl7dk/dk-core/blob/feature/icpc-supplement/input/resources/icpc2e-dk.xml</a></p>",
        "id": 260030718,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1635874436
    },
    {
        "content": "<p>Og derfra så definere de valuesets som giver mening</p>",
        "id": 260030866,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1635874490
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191427\">@Jens Villadsen</span>  - sorry, husker ikke alle kodene i ICPC-2 ;). Representerer den danske versjonen endringer i kodeinnhold eller kun oversettelse? Hvis det kun er oversettelse, hvilke vurderinger har dere eventuelt gjort med tanke på å referere til den internasjonale versjonen. <span class=\"user-mention\" data-user-id=\"192681\">@Espen Stranger Seland</span> <span class=\"user-mention\" data-user-id=\"192856\">@Thomas Tveit Rosenlund</span>  - ser poenget med å vente på resolvable url. På den annen side hvis vi definerer og forankrer en URL nå burde det kanskje ikke være altfor vanskelig å simulere/ maskere terminologiserver med valgt stamme?</p>",
        "id": 260053664,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1635884952
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192654\">@Øyvind Aassve</span> - den er lavet som et CodeSystem <a href=\"https://www.hl7.org/fhir/codesystem.html#supplements\">supplement</a> , så til hver kode er der angivet den danske oversættelse. Hovedkodesættet bør kunne identifieres med url'en <a href=\"http://hl7.org/fhir/sid/icpc-2\">http://hl7.org/fhir/sid/icpc-2</a>. Så vidt jeg ved er ICPC-2 ret stabilt, men jeg kan da se at ændringer forekommer på <a href=\"https://www.ehelse.no/kodeverk/icpc-2e--english-version\">https://www.ehelse.no/kodeverk/icpc-2e--english-version</a></p>",
        "id": 260054700,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1635885457
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192654\">@Øyvind Aassve</span> Som ingeniør introduserer jeg ikke kompleksitet hvis det ikke gir merverdi. :-) </p>\n<p>Jeg tror det viktigste vi gjør nå er i bistå slik at vi får gode terminologitjenester for ICPC-2(e, no etc), NKL/NPU, Volven-settene etc. <br>\nSelv om det kan bli publisert på andre måter (IG, package, git) må det automatiseres.</p>",
        "id": 260100537,
        "sender_full_name": "Espen Stranger Seland",
        "timestamp": 1635927307
    }
]