[
    {
        "content": "<p>Heisann, Jeg er også noob... men sitter og forsøker å finne FHIR-ressurser som matcher koloskopidata som skal rapporteres inn til Tarmscreeningprogrammet som Kreftregisteret  administrerer. Akkurat nå sitter jeg og klør meg i hodet over dokumentasjonen av FHIR. Hvis man feks ser på Procedure, så har den en attributt som heter \"usedCode\". Beskrivelsen er syltynn. Er dette typisk FHIR, hadde jeg nær sagt? Vel, vi må kode proceduren vår med NCSP-koder (minst) , og finner sikkert en måte å gjøre det på. Men om dere har noen tips om hvordan man bør navigere i FHIR-jungelen, så fyr løs. Beskrivelsen av BackboneElement er litt i samme gata... man blir ikke umiddelbart grepet av AHA-følelsen!</p>",
        "id": 203005790,
        "sender_full_name": "Jon Aarbakke",
        "timestamp": 1594050460
    },
    {
        "content": "<p>Hei <span class=\"user-mention\" data-user-id=\"317452\">@Jon Aarbakke</span>, det er nok ikke fullt så enkelt å navigere de forskjellige ressursene og dokumentasjonen kan være tung å lese. Selv har jeg måtte lese tekstene på ressursene opptil flere ganger før jeg \"catcher\" essensen. Tidvis, etter å ha gjort ett forsøk på å skape meg en formening om brukskontekst for ressursen, har det vært nødvendig å konsultere i <a class=\"stream\" data-stream-id=\"179166\" href=\"/#narrow/stream/179166-implementers\">#implementers</a> eller en av de andre relevante strømmene.</p>\n<p>usedCode og usedReferences synes jeg var ganske greie å forstå, men det var kanskje ikke heller spørsmålet ditt. Jeg ser at usedCode bruker ett kodeverk som eksempel (Example) og dermed kan du benytte NCSP-kodene på dette attributtet. Det krever at du har kjennskap til <a href=\"http://hl7.org/fhir/profiling.html\">profilering</a> av FHIR-ressurser.</p>\n<p>BackboneElement skal du ikke ha behov for i denne konteksten. BackboneElement kan brukes dersom du lager en helt ny ressurs. Et eksempel på bruk av BackboneElement er det komplekse attributtet Procedure.focalDevice. Siden det ikke eksisterer en <a href=\"http://hl7.org/fhir/datatypes.html\">datatype</a> som passer attributtet focalDevice har man laget en \"custom\"/komplekst element ved hjelp av BackboneElement</p>",
        "id": 203115474,
        "sender_full_name": "Kenneth Myhra",
        "timestamp": 1594134772
    },
    {
        "content": "<p>Takk <span class=\"user-mention\" data-user-id=\"192710\">@Kenneth Myhra</span>  for hyggelig svar. Jeg tenker at jeg må innstille meg på ikke å komme til dekket bord her :-)<br>\nJeg funderer på å lage en kort beskrivelse av hva vi ønsker å oppnå i dokuments form ; dersom jeg gjør det kan jeg sikkert finne en måte å dele det med communitiet på? Google docs, kanskje. (antar det ikke finnes noen \"FHIR 101\" der ute?)</p>",
        "id": 203241475,
        "sender_full_name": "Jon Aarbakke",
        "timestamp": 1594195755
    },
    {
        "content": "<p>PS - jeg vet ikke hvordan man navigerer \"implementers\"; kan noen hjelpe meg å finne ut om det finnes en FHIR-dings for koloskopi/endoskopirapporter i verden \"out there\"?</p>",
        "id": 203243891,
        "sender_full_name": "Jon Aarbakke",
        "timestamp": 1594197650
    },
    {
        "content": "<p>Try <a href=\"#narrow/stream/179166-implementers/search/colonoscopy\">https://chat.fhir.org/#narrow/stream/179166-implementers/search/colonoscopy</a> ..</p>",
        "id": 203245422,
        "sender_full_name": "René Spronk",
        "timestamp": 1594198869
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span>  thanks a lot for that! The search did not return very much. But I shall not be defeated. Stay tuned...</p>",
        "id": 203247062,
        "sender_full_name": "Jon Aarbakke",
        "timestamp": 1594200337
    },
    {
        "content": "<p>Hei Jon, vi har ikke kommet ordentlig i gang her, men du kan jo legge ut lit info om aktiviteten på Aktiviteter i Norge <a href=\"https://github.com/HL7Norway/best-practice\">https://github.com/HL7Norway/best-practice</a>, og lenke til den i diskusjoner.</p>",
        "id": 203249358,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1594202252
    },
    {
        "content": "<p>Jeg har laget et offentlig dokument i Google som oppsummerer (håper jeg) problemstillingen. Alle med lenken kan redigere dokumentet.. Det er på engelsk. Hvor bør jeg evt legge det ut \"internasjonalt\"? <a href=\"https://docs.google.com/document/d/1FUY500hEiQsw8hiyjNShDtVY7lbPZrzygP3djl7ZPsY/edit?usp=sharing\">https://docs.google.com/document/d/1FUY500hEiQsw8hiyjNShDtVY7lbPZrzygP3djl7ZPsY/edit?usp=sharing</a></p>",
        "id": 203370700,
        "sender_full_name": "Jon Aarbakke",
        "timestamp": 1594290246
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> take a look at my document, linked above? :-)</p>",
        "id": 203437331,
        "sender_full_name": "Jon Aarbakke",
        "timestamp": 1594327171
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"317452\">@Jon Aarbakke</span> <br>\nSer ut til at du har god kontroll  på hvilke ressurser du trenger, men at det er selve oppbyggningen av ett komplett dokument og utvekslingen av dette du har spørsmål rundt.</p>\n<p>Du skriver at en ressursreferanse ikke er godt nok. Klarer du deg med en referanse som inneholder en <a href=\"http://hl7.org/fhir/references.html#Reference\">nasjonal identifikator (fnr)</a> + visningsnavn ved å bruke Reference.Identifier?</p>\n<p>Kanskje FHIR Documents er rette veien å gå i denne konteksten. Se <a href=\"http://hl7.org/fhir/documents.html\">FHIR Documents</a> for dokumentasjon på hvordan bygge ett FHIR Document og utveksle dette med en tredjepart via REST. Acknowledgement som du referer til i dokumentet vil da være en HTTP respons av type 200/201.</p>\n<p>Dersom du mener FHIR Documents/Documents exchange ikke passer ditt scenario så har du <a href=\"http://hl7.org/fhir/exchange-module.html#msg\">meldingsutveksling</a>, men det virker på meg som FHIR Documents er en farbar vei dersom du kan få opp et REST API.</p>",
        "id": 203472799,
        "sender_full_name": "Kenneth Myhra",
        "timestamp": 1594361824
    },
    {
        "content": "<p>Tusen takk <span class=\"user-mention\" data-user-id=\"192710\">@Kenneth Myhra</span> ; dette hjelper bra. Jeg må sjekke ut Document-ressursen. Det jeg mener med \"referanser ikke godt nok\" er kanskje upresist formulert. Det jeg tenker er at mottaker skal slippe å gjøre et kall tilbake til avsender for å få tak i Patient/Practitioner-ressursen. Det er forresten lite info om disse som trengs: for pasient er det fnr, for practitioner HPR-nummer, men jeg tenker at det er vel penere å sende en ressurs med noen minimumsattributter enn kun en identifier. Anyway - leser meg opp på Document!</p>",
        "id": 203475435,
        "sender_full_name": "Jon Aarbakke",
        "timestamp": 1594364974
    },
    {
        "content": "<p>Ved å bruke Reference.identifier og angi fødselsnummer her så vil avsender slippe å gjøre kall tilbake til avsender, penere er relativt.. Mitt syn er at jo færre ressurser man sender og jo mer man kan basere seg på unike nasjonale identifikatorer, særlig er dette relevant i kontekst av personer, jo bedre er det, men det er en lengre diskusjon som jeg ikke ønsker ta her..</p>\n<p>FHIR Documents er en Bundle av type 'document' med en Composition som første ressurs. Fra Composition så referer du til de andre ressursene du har inkludert i Bundle, men ja les deg opp.</p>",
        "id": 203476811,
        "sender_full_name": "Kenneth Myhra",
        "timestamp": 1594365964
    },
    {
        "content": "<p>Any Bundle would work, remember that the whole point of documents is a) persistence, and b) human readability. I haven't heard anything about these two things in the requirements. As such a bundle of type batch would work as well, or collection if you assume the receiver will persist the bundle. <span class=\"user-mention\" data-user-id=\"317452\">@Jon Aarbakke</span> I've looked at the document - some details you point out on procedures could be extensions, or captured as observations on the procedure resource. I'm aware of the Dutch national colonoscopy screening program (although I haven't been involved myself) - they've mapped their requirements to CDA [this is a couple of years ago], and not to FHIR. I'd encourage you to take your document to the #implementers channel, to see whether there are others working on similar things.</p>",
        "id": 203479761,
        "sender_full_name": "René Spronk",
        "timestamp": 1594368301
    },
    {
        "content": "<p>Yes agree that any Bundle would work. But then it is as I understand it from the documentation it is no longer Document exchange/FHIR Document</p>\n<p>From <a href=\"http://hl7.org/fhir/documents.html#content\">http://hl7.org/fhir/documents.html#content</a></p>\n<blockquote>\n<p>All documents have the same structure: a Bundle of resources of type \"document\" that has a Composition resource as the first resource in the bundle, followed by a series of other resources, referenced from the Composition resource, that provide supporting evidence for the document.</p>\n</blockquote>\n<p>Maybe I put too much into this part of Jon's document</p>\n<blockquote>\n<p>The entire set of information should be sent in one operation, as a self-contained, complete document.</p>\n</blockquote>",
        "id": 203482801,
        "sender_full_name": "Kenneth Myhra",
        "timestamp": 1594370515
    },
    {
        "content": "<p>He'll need to define quite what he means by using the word \"document\". That may very well not be in the strict sense of the meaning as defined by FHIR.</p>",
        "id": 203488095,
        "sender_full_name": "René Spronk",
        "timestamp": 1594374375
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> - what would you say would be a sufficient need of persistence to justify the use of Document for this report? We have been discussing this in a couple of other cases as well here in Norway. If this Coloscopi-report is signed by a clinician that would typical require use of Document instead of Bundle because you would like to preserve the integrity of the report?</p>",
        "id": 203513476,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1594391617
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span>  - an additional question out of curiosity. Have you implemented some FHIR Documents in the Netherlands or is the main track still CDA?</p>",
        "id": 203513642,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1594391688
    },
    {
        "content": "<p>The future direction is firmly FHIR, there actually have been very few CDA based projects. Documents = persistence, human readability, attested textual content. If you only want persistence, go for a bundle of type collection. Which could still contain a Composition, if you want to.</p>",
        "id": 203515653,
        "sender_full_name": "René Spronk",
        "timestamp": 1594392542
    },
    {
        "content": "<p>\"A structured report is first created in an EHR that supports structured reporting. That report is signed.\" - would this not qualify as \"attested texutal content\"? Or can you say this is a difference in that it rather contains attested structured content?</p>",
        "id": 203517606,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1594393432
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span></p>",
        "id": 203942554,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1594812260
    },
    {
        "content": "<p>Signed doesn't mean anything, because all bundles or resources could be signed. CDA defines these document characteristics: <br>\nPersistence – A document continues to exist in an unaltered state<br>\nStewardship – A document is maintained by an organization entrusted with its care.<br>\nPotential for authentication - A document is an assemblage of information that is intended to be legally authenticated.<br>\nContext - A document establishes the default context for its contents.<br>\nWholeness - Authentication of a document applies to the whole and does not apply to portions of the document without the full context of the document.<br>\nHuman readability – A document is human readable.</p>",
        "id": 203943112,
        "sender_full_name": "René Spronk",
        "timestamp": 1594812691
    },
    {
        "content": "<p>Thanks Rene, is the question then whether or not the Colonyscope report adheres to these characteristics? Is this information the project will need to answer,  for now we do not have information on what the planned business rules for handling this set of information will be?</p>",
        "id": 203943960,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1594813316
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span></p>",
        "id": 203969091,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1594826396
    },
    {
        "content": "<p>If it has all of those characteristics, then the best match would be a FHIR document. Human readability doesn't seem to be relevant in your use-case, which is a SHALL in a document. So that'd mean a collection would be closer to what you need than a document.</p>",
        "id": 203970185,
        "sender_full_name": "René Spronk",
        "timestamp": 1594826840
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> - do the same characteritics (as a CDA document) also apply to a FHIR document? The specification does not mention these requirements for use specifically.  \"The composition resource is the foundation of the clinical document. It:</p>\n<ul>\n<li>provides identity and its purpose, and sets the context of the document</li>\n<li>carries key information such as the subject and author, and who attests to the document</li>\n<li>divides the document up into a series of sections, each with their own narrative\"</li>\n</ul>",
        "id": 204052296,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1594883573
    },
    {
        "content": "<p>it says them under documents rather than against Composition which has wider usage than just documents</p>",
        "id": 204053521,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1594884740
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> - In the <a href=\"http://4.th\">4.th</a> paragraph under FHIR Documents it says: \"FHIR documents may be 'clinical' (focused on patient healthcare information) but may also serve non-clinical purposes (e.g. FHIR Implementation guides, practice guidelines, patient handouts, etc.)\" which makes it seem pretty broad. To me there seems there might be a difference between document requirements described under FHIR document and Compostion and the pretty strict characteristics for a document desribed for CDA &gt;  persistence, stewardship, context, human readbility, wholeness, potential for autentication.  With regards to this specific use-case - do you see any issues with choosing Bundle.type=document with use of Composition for a colonoscopy-report even in the case where possibly not all the CDA-requirements for a document are checked off?</p>",
        "id": 204062836,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1594892109
    },
    {
        "content": "<p>For all intends and purposes, FHIR Documents are the next version of CDA (without the C, given that the scope is wider than just clinical docs in FHIR). They may have reworded the principles, but those effectively remain the same.</p>",
        "id": 204091544,
        "sender_full_name": "René Spronk",
        "timestamp": 1594909975
    },
    {
        "content": "<p>well... you should check out SDA vs CDA, where the breadth comes from.</p>",
        "id": 204143640,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1594933910
    },
    {
        "content": "<p>actually, I thought that page quoted from the CDA wording</p>",
        "id": 204143716,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1594933930
    },
    {
        "content": "<p>but apparently not.</p>",
        "id": 204143788,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1594933979
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191407\">@Rick Geimer</span> can you provide an opinion?</p>",
        "id": 204143810,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1594933991
    },
    {
        "content": "<p>Thanks for running this discussion in my absence. To try to narrow it down, <span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> , if you were to create a discharge document (epikrise) in FHIR, would that be a Document? As for human readable - that is not a requirement in our case. I imagine JSON is not included in \"human readable\" :-)<br>\nEssentially, there is master source of information in the EHR and a copy is sent to a recipient. If/when a change occurs in the master, a new version is sent to the recipient.<br>\nSo we are pushing information.<br>\nI sometimes feel FHIR is more pull-oriented (read-only, read-and-display), and prefers small chunks of information. But like I said, I am a noob.</p>",
        "id": 206459753,
        "sender_full_name": "Jon Aarbakke",
        "timestamp": 1597065928
    },
    {
        "content": "<p>So if I were to translate your description to: after the discharge of the patient, you push a bucket-full of relevant [structured, not textual] data related to the encounter to some other party, to act as a summary of things that happened during the encounter. This data may be used by the receiver if and when they deal with the patient themselves. </p>\n<p>The key question to ask is then: do both the sender as well as the receiver persist/archive the overall 'bucket of data' or do they only persist the data itself, as individual FHIR resources ?</p>",
        "id": 206543153,
        "sender_full_name": "René Spronk",
        "timestamp": 1597126274
    },
    {
        "content": "<p>Thanks for replying! The data is used for research in this case - the patient is never seen. The receiver will in this case keep the received \"bucket\" for future reference, but also extract, transform and aggregate the received data. FHIR is only really used for transport.  BR</p>",
        "id": 206560154,
        "sender_full_name": "Jon Aarbakke",
        "timestamp": 1597141873
    },
    {
        "content": "<p>So, a collection, <a href=\"http://build.fhir.org/codesystem-bundle-type.html#bundle-type-collection\">http://build.fhir.org/codesystem-bundle-type.html#bundle-type-collection</a> ? Only alternative would be batch (where there is no requirement for persistence). </p>\n<p>Note that FHIR Messaging (<a href=\"http://build.fhir.org/messaging.html\">http://build.fhir.org/messaging.html</a>) or a custom operation might also work given the use case, but that wasn't your question.</p>",
        "id": 206568418,
        "sender_full_name": "René Spronk",
        "timestamp": 1597149066
    },
    {
        "content": "<p>Thanks, I am trying to get my head around this, and in particular, find the relevant documentation on Collections!</p>",
        "id": 206672612,
        "sender_full_name": "Jon Aarbakke",
        "timestamp": 1597222503
    },
    {
        "content": "<p>Good luck with your project. You may have to ask around, I don't think a lot of projects have been using the Collection bundle.</p>",
        "id": 206676118,
        "sender_full_name": "René Spronk",
        "timestamp": 1597225849
    },
    {
        "content": "<p>Our project is going ahead and we are collaborating with Firely on defining the colonoscopy report for the Cancer Registry. The main issue right now is the overall structure. Current assumption: A Bundle of type Collection. We have discussed Document, but our report is not for human consumption. I hasten to add that the data included do not cover all clinical aspects; this is data destined for quality monitoring of the national colon screening programme, starting late 2021. <br>\nThe report that the clinician files in the EPR will contain additional attributes, and will have a broader usage area. The screening programme never carries out colonoscopies to scout for Crohns, or as follow up to appendicitis etc.<br>\nSo, the issue I need to settle first  is the overall structure. We shall use resources like Practitioner, Procedure, DiagnosticReport, but shall have to use QuestionnaireResponse in places.<br>\nAs for value sets, we are working on that, too. ehelse/Linn Brandt is handling this.<br>\nInput appreciated! <span class=\"user-mention\" data-user-id=\"192681\">@Espen Stranger Seland</span> <span class=\"user-mention\" data-user-id=\"196665\">@Linn Brandt</span> <span class=\"user-mention\" data-user-id=\"192654\">@Øyvind Aassve</span> <span class=\"user-mention\" data-user-id=\"191334\">@Marten Smits</span></p>",
        "id": 224319947,
        "sender_full_name": "Jon Aarbakke",
        "timestamp": 1611837683
    },
    {
        "content": "<p>Do you have any UML og Logical Models to share with us?</p>",
        "id": 224320972,
        "sender_full_name": "Espen Stranger Seland",
        "timestamp": 1611838344
    },
    {
        "content": "<p>Have you considered or studied the daVinci project? They are trying to solve some similar use-cases (quality measures). Their implementation guide is currently on version 2.0.0 might be worth a look?<br>\n<a href=\"http://hl7.org/fhir/us/davinci-deqm/\">http://hl7.org/fhir/us/davinci-deqm/</a><br>\n<span class=\"user-mention\" data-user-id=\"317452\">@Jon Aarbakke</span></p>",
        "id": 224331707,
        "sender_full_name": "Thomas Tveit Rosenlund",
        "timestamp": 1611843714
    },
    {
        "content": "<p>Sounds good. Does this mean that Questionnaire is not the root of the clinical information any more, but rather DiagnosticReport? Did you find any relevant structures to reuse in the mCode/ CodeX IGs? <span class=\"user-mention\" data-user-id=\"317452\">@Jon Aarbakke</span> <span class=\"user-mention\" data-user-id=\"191334\">@Marten Smits</span></p>",
        "id": 224339750,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1611846899
    },
    {
        "content": "<p>You can all keep an eye on our efforts here: <a href=\"https://simplifier.net/NorwegianColonoscopyReport/example-1/~overview\">https://simplifier.net/NorwegianColonoscopyReport/example-1/~overview</a></p>",
        "id": 224459051,
        "sender_full_name": "Jon Aarbakke",
        "timestamp": 1611920020
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192654\">@Øyvind Aassve</span> The Design is still to use QuestionnaireResponse for some cases. It is one of multiple resources (including DiagnosticReport and Procedure) we use. All contained in a single Bundle (of type \"collection).</p>",
        "id": 224703349,
        "sender_full_name": "Marten Smits",
        "timestamp": 1612172423
    },
    {
        "content": "<p>The profiles are still a work in progress, but if there are any questions, please feel free to reach out!</p>",
        "id": 224703374,
        "sender_full_name": "Marten Smits",
        "timestamp": 1612172461
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191334\">@Marten Smits</span>  - sounds good. We could arrange a presentation for HL7 Norway TSC when you are ready to present. Would that be ok? If so, when could you be ready?</p>",
        "id": 224713232,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1612179019
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"317452\">@Jon Aarbakke</span></p>",
        "id": 224713817,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1612179415
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192856\">@Thomas Tveit Rosenlund</span> daVinci seems to be about aggregated data? Not individual screening reports?</p>",
        "id": 224735466,
        "sender_full_name": "Jon Aarbakke",
        "timestamp": 1612190857
    },
    {
        "content": "<p>DaVinci i a broad program, but main focus is on the payers. Might be more financially oriented than this work .... <span class=\"user-mention\" data-user-id=\"317452\">@Jon Aarbakke</span> <span class=\"user-mention\" data-user-id=\"192856\">@Thomas Tveit Rosenlund</span></p>",
        "id": 224752030,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1612196931
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"317452\">@Jon Aarbakke</span> You are probably right. The reports can be generated for individual patients, but the focus is on aggregation of the underlying individual data. However, the bundle can (and examples show how) to include the observations evaluated as part of the MeasureReport. <a href=\"http://hl7.org/fhir/us/davinci-deqm/col.html\">http://hl7.org/fhir/us/davinci-deqm/col.html</a></p>",
        "id": 224760177,
        "sender_full_name": "Thomas Tveit Rosenlund",
        "timestamp": 1612199983
    }
]