[
    {
        "content": "<p>Hei! Sitter og følger med litt på DevDays. Hører akkurat nå på et foredrag som heter \"IG Publisher\", som jeg egentlig trodde skulle være ganske praktisk. Foredragsholderen snakker en god del om hvordan Belgia har satt opp en struktur for FHIR-profilering og IG. Interessant i forhold til det som vi nettopp diskuterte i Standardiseringsutvalget <span class=\"user-mention\" data-user-id=\"192681\">@Espen Stranger Seland</span> <span class=\"user-mention\" data-user-id=\"191715\">@Line Saele</span> <span class=\"user-mention\" data-user-id=\"192654\">@Øyvind Aassve</span></p>",
        "id": 217267672,
        "sender_full_name": "Ingvar Sørlien",
        "timestamp": 1605792138
    },
    {
        "content": "<p>Hei (og takk for møte i Standardiseringsutvalget). Vi ( <span class=\"user-mention\" data-user-id=\"192654\">@Øyvind Aassve</span> , <span class=\"user-mention\" data-user-id=\"192856\">@Thomas Tveit Rosenlund</span> og meg)  har sett på IG Publisher som en alternativ til <a href=\"http://Simplifier.net\">Simplifier.net</a>. Kompleksiteten er noe høyere, og men også danskene har gode erfaringer. Jeg tester også ut Shorthand/Sushi, som benytter IG Publisher og fjerner litt kompleksitet. Det hadde vært morsomt å få til en slags \"click to publish\"-løsning for norske profiler, som ikke er avhengig av enkelte løsninger.</p>",
        "id": 217269528,
        "sender_full_name": "Espen Stranger Seland",
        "timestamp": 1605793106
    },
    {
        "content": "<p>Vi mangler egentlig tema for FHIR fagforum i desember, så vi vurderer å avlyse - kanskje vi kunne få snurret sammen noe rundt publisering?</p>",
        "id": 217269861,
        "sender_full_name": "Espen Stranger Seland",
        "timestamp": 1605793285
    },
    {
        "content": "<p>Jeg kjenner best publisering på SIMPLIFIER, men har også overfladisk kunnskap om IG publisher. Burde være mulig å få til noe om det temaet. Er det noen i miljøet i Norge som har brukt IG publisher noe særlig?</p>",
        "id": 217273448,
        "sender_full_name": "Thomas Tveit Rosenlund",
        "timestamp": 1605794929
    },
    {
        "content": "<p>Ja, det er et interessant tema med publisering. Har ingen erfaring med IG Publisher (foreløpig), men det ser ganske bra ut. Det som var overraskende interessant i dette foredraget jeg refererer til var hvordan de i Belgia lager en prosess for Samarbeid som imøtekommer behovet for  top down + bottom up. Tenkte kanskje det var noen tips å plukke opp der.</p>",
        "id": 217283102,
        "sender_full_name": "Ingvar Sørlien",
        "timestamp": 1605799043
    },
    {
        "content": "<p>Jose Teixeira (Belgium) is a co-author of the IG Publisher tools, so he knows quite a bit about it. IG Publisher allows you to tweak/modify quite a lot of things, its a complex tool. <a href=\"http://Simplifier.net\">Simplifier.net</a> offers GUI-based basic functionality - these tools are aimed at different audiences.</p>",
        "id": 217284574,
        "sender_full_name": "René Spronk",
        "timestamp": 1605799655
    },
    {
        "content": "<p>Hei Ingvar, har ikke sett Belgia sin tilnærming, men vi har jo også i Norge etablert en prosess for samarbeid som er både top-down og bottom-up. Kan du eventuelt si noe om forholdet mellom de to? <span class=\"user-mention\" data-user-id=\"256280\">@Ingvar Sørlien</span></p>",
        "id": 217341342,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1605825966
    },
    {
        "content": "<p>Jeg har nok ikke fått satt meg godt nok inn i den norske prosessen til at jeg kan si hva som er forskjellene <span class=\"user-mention\" data-user-id=\"192654\">@Øyvind Aassve</span> . Synes alltid det er inspirerende å se hvordan andre har løst lignende problemstillinger til det vi har selv. Belgia hadde lagt opp en flyt med IG Publisher, men Norge benytter vel i hovedsak Simplifier..?</p>",
        "id": 217627242,
        "sender_full_name": "Ingvar Sørlien",
        "timestamp": 1606138099
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"256280\">@Ingvar Sørlien</span>  - det stemme Ingvar, vi bruker GitHub/ SImplifier for publiserng. Men vi har også gjort mye på metodikk (ref det du nevnte om top-down, bottom-up) - ref basis- og områdeprofiler - så jeg var litt nysgjerrig på om Belgia også hadde gjort noe i den retningen. Mulig vi kunne ta en prat med de etterhvert.</p>",
        "id": 217634365,
        "sender_full_name": "Øyvind Aassve",
        "timestamp": 1606142065
    },
    {
        "content": "<p>Belgium actually is also using <a href=\"http://Simplifier.net\">Simplifier.net</a> for publishing: <a href=\"https://simplifier.net/ehealthplatformfederalprofiles\">https://simplifier.net/ehealthplatformfederalprofiles</a>. Let me know if it would be helpful to discuss how to optimize the publishing process <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 217634720,
        "sender_full_name": "Ward Weistra",
        "timestamp": 1606142279
    }
]