[
    {
        "content": "<p>Soon we will start up work with SAFEST with The Norwegian Medicines Agency / Statens legemiddelverk. Medications, packages, substances, IDMP/SPOR and everything you love - from one source!</p>\n<p><a href=\"https://github.com/HL7Norway/SAFEST\" target=\"_blank\" title=\"https://github.com/HL7Norway/SAFEST\">https://github.com/HL7Norway/SAFEST</a> (in Norwegian only so far)</p>",
        "id": 176087571,
        "sender_full_name": "Espen Stranger Seland",
        "timestamp": 1568890668
    },
    {
        "content": "<p>SAFEST Gjennomføring er i innspurten nå. Vi hadde satt stort pris på tilbakemeldinger på profiler og implementasjonsguider. </p>\n<p>Har også et konkret spørsmål: er det beste praksis å ta kardnialitet ned til 0-0 på felter man ikke skal gi ut, eller la dem ligge åpne? Jeg tenker at det kanskje er lurt å la dem ligge åpne, slik at det er enklere å utvide senere? </p>\n<p>Lenker:<br>\n<a href=\"https://simplifier.net/safest\">https://simplifier.net/safest</a> <br>\n<a href=\"https://simplifier.net/guide/safestimplementationguide/home\">https://simplifier.net/guide/safestimplementationguide/home</a></p>",
        "id": 210962417,
        "sender_full_name": "Stine Johansen",
        "timestamp": 1600841368
    },
    {
        "content": "<p>Hei - veldig fint hvis du har spesifikke deler som du ønsker at vi/andre skal ta en kikk på - litt vanskelig å bla gjennom alle profilene. </p>\n<p>Siden dette i første omgang er en konsumet-tjeneste tipper jeg det er like greit å la original kardinalitet stå? Men spørsmålet er viktig, for det er jo ikke noe poeng at konsument lager støtte for attributter/innhold som ikke vil være med. Kanskje et tema vi kunne tatt opp et sted?</p>",
        "id": 210976741,
        "sender_full_name": "Espen Stranger Seland",
        "timestamp": 1600852379
    },
    {
        "content": "<p>Lag gjerne issues på GitHub, så kan vi tagge de som burde ta en kikk.</p>",
        "id": 210976868,
        "sender_full_name": "Espen Stranger Seland",
        "timestamp": 1600852449
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192681\">Espen Stranger Seland</span> <a href=\"#narrow/stream/179226-norway/topic/SAFEST/near/210976741\">said</a>:</p>\n<blockquote>\n<p>Siden dette i første omgang er en konsumet-tjeneste tipper jeg det er like greit å la original kardinalitet stå? Men spørsmålet er viktig, for det er jo ikke noe poeng at konsument lager støtte for attributter/innhold som ikke vil være med. Kanskje et tema vi kunne tatt opp et sted?</p>\n</blockquote>\n<p>Enig, burde kanskje da dokumentere i IG eller liknende hva en konsument kan forvente å få tilbake? </p>\n<p>Ang. spesifikke områder, så har jeg bare to konkrete per nå:</p>\n<ul>\n<li>inneholder IG det man forventer?</li>\n<li>er profilene teknisk sett godt implementert (hvis man tar utgangspunkt i bare èn av dem for eksempel)</li>\n</ul>",
        "id": 210982520,
        "sender_full_name": "Stine Johansen",
        "timestamp": 1600855888
    },
    {
        "content": "<p>For å starte litt på den første: Vi har nå begynt å skrive på \"Den gode implementasjonsguide\" - om hva som er best practice for hva som skal og bør være med i en IG. Målet er at alle IG'er skal ha en minimumskvalitet, spesielt de som senere kan bli normert. Se utkastet her (fortsatt veldig tynn), og kom gjerne med innspill:<br>\n<a href=\"https://hl7norway.github.io/best-practice/docs/dgi/\">https://hl7norway.github.io/best-practice/docs/dgi/</a></p>",
        "id": 212673367,
        "sender_full_name": "Espen Stranger Seland",
        "timestamp": 1602154749
    },
    {
        "content": "<p>BTW, dere venter ikke på meg for å pushe SAFEST til master-branch? Tenkte det kunne vært fint for å vise arbeidet til omverden enklere - det er vel uansett tagget som draft?</p>",
        "id": 212673490,
        "sender_full_name": "Espen Stranger Seland",
        "timestamp": 1602154843
    },
    {
        "content": "<p>Jeg har allerede funnet \"den gode implementasjonsguiden\" og prøver å få med elementene som står der. Om jeg ser noen mangler eller annet skal jeg gi beskjed. </p>\n<p>nei, jeg venter vel egentlig ikke på noe der, alt står i draft enda, men det er vel ingen grunn til å ikke pushe til master, det har ikke slått meg at omverden kanskje ikke ser min branch.</p>",
        "id": 213271699,
        "sender_full_name": "Stine Johansen",
        "timestamp": 1602672708
    },
    {
        "content": "<p>Bra og oversiktlig guide. </p>\n<p>Savner litt mer informasjon om hvordan API'et fungerer. Oppsett med tokens og Postman er bra og nødvendig dokumentasjon men det bør også eksistere en CapabilityStatement som beskriver hva slags søkefunksjonalitet grensesnittet tenker å eksponere for konsumenter.</p>\n<p>Angående kardinalitet tror jeg dere bør benytte mest mulig must-support. Da må dere også definere hva must-support betyr for deres grensesnitt. Alle elementer som markeres med must support må man forvente at servere utleverer og klienter kan lese/lagre/presentere. Det blir også veldig tydelig i ressursen hvilken informasjon man kan forvente siden alle selementer med must support markeres tydelig (i simplifier med rød \"S\").</p>\n<p>Vi har en egen definisjon av must support i grunndata for eksempel:<br>\n<a href=\"https://simplifier.net/guide/MasterPersonIndexR4/ReadersGuideandRESTfulFHIR\">https://simplifier.net/guide/MasterPersonIndexR4/ReadersGuideandRESTfulFHIR</a></p>",
        "id": 214670029,
        "sender_full_name": "Thomas Tveit Rosenlund",
        "timestamp": 1603786085
    },
    {
        "content": "<p>Takk for tilbakemeldingene <span class=\"user-mention\" data-user-id=\"192856\">@Thomas Tveit Rosenlund</span> ! Jeg  skal ta det med meg videre.</p>",
        "id": 214673657,
        "sender_full_name": "Stine Johansen",
        "timestamp": 1603788954
    }
]