[
    {
        "content": "<p>You may want to add the attached file to the Custom Dictionary in Word. It will remove 99% (I guess) of the false hits in the Word spelling checker. Using it I was able to go through my first resources document in a minute or two.</p>\n<p>I extracted these words from the set of HTML files that David sent out today (or yesterday). It includes a number of medical terms, words of art (such as FHIR, URL or YYYYMMDD) and the various concatenations of words that are created in defining resources (such as HealthcareService.availableTime.allDay, HealthcareService.availableTime, and HealthcareService). It contains 10,573 \"words\" in total.</p>\n<p>In order to install open the text file in Word, select all, copy and then open the Preferences for Word, select Spelling and Grammr and edit the Custom Dictionary. Paste the words into the custom dictionary, then save and close the custom dictionary and the text file. Be sure to turn spell-checking back on in Word. These are instructions for the Mac; YMMV.</p>\n<p>Hint: be sure that the option is selected in Word to use a 16-bit Unicode file for the dictionary, as this file has a smattering of Unicode characters in it.</p>\n<p>All conceivable caveats apply. I have only tested this on Word for Mac and only used it to edit a single resource file so far. Contact me at <a href=\"mailto:wrishel@gmail.com\" title=\"mailto:wrishel@gmail.com\">wrishel@gmail.com</a> if you have questions or suggestions.</p>\n<p><a href=\"/user_uploads/10155/3qS-XfWaAtYQAkJhovxL4sIY/FHIRmedical.txt.zip\" target=\"_blank\" title=\"FHIRmedical.txt.zip\">FHIRmedical.txt.zip</a></p>",
        "id": 153944967,
        "sender_full_name": "Wes Rishel",
        "timestamp": 1521092784
    },
    {
        "content": "<p>Wes, thanks for compiling the terms. But I think you may have zipped the wrong file. The file in the zip contains 97,514 words and none of them are \"FHIR\"! Thanks. Sheila</p>",
        "id": 153945280,
        "sender_full_name": "Sheila Connelly",
        "timestamp": 1521164993
    },
    {
        "content": "<p>Sheila, somehow I thought I would be notified of responses to my messages in Zulip and thereby missed your message. David did circulate a later version of my dictionary. I believe that David subsequently circulated an updated dictionary. The one that I am working with after some subsequent tweaks has 11223 words. Here it is, in case it is any use at this late date. <a href=\"/user_uploads/10155/d116Zw956UQBNL8JXTnSbg-_/FHIR.dic.2018.txt.zip\" target=\"_blank\" title=\"FHIR.dic.2018.txt.zip\">FHIR.dic.2018.txt.zip</a></p>",
        "id": 153948890,
        "sender_full_name": "Wes Rishel",
        "timestamp": 1522277553
    }
]