[
    {
        "content": "<p>Not sure where this question should go, so I will try here first. <br>\nCan someone point me to the FHIR IG STU Update process? I have an IG that has no errors and warnings, the Jira Artifacts have been updated, the Sponsoring and Co-sponsoring WGs have approved in scope and to carry on with the process. I have a link to for a publication request, but was wondering if there was any more in the process, particularly around review and approvals.</p>",
        "id": 235354269,
        "sender_full_name": "Corey Spears",
        "timestamp": 1618929578
    },
    {
        "content": "<p>Here is a link to the information on the HL7 Essentials page: <a href=\"https://confluence.hl7.org/download/attachments/86972322/Guidance-to-Work-Groups-on-DSTU-Updates20130819.docx?version=2&amp;modificationDate=1609966428642&amp;api=v2\">https://confluence.hl7.org/download/attachments/86972322/Guidance-to-Work-Groups-on-DSTU-Updates20130819.docx?version=2&amp;modificationDate=1609966428642&amp;api=v2</a></p>",
        "id": 235364101,
        "sender_full_name": "Melva Peters",
        "timestamp": 1618932635
    },
    {
        "content": "<p>Work group and co-sponsoring WGs have to agree to the scope of the STU Update.  The Peer Review has to be announced via the Co-chair list, Zulip, and to stakeholders and be open for a minimum of 2 weeks.  All comments must be captured in Jira.</p>",
        "id": 235364300,
        "sender_full_name": "Melva Peters",
        "timestamp": 1618932702
    },
    {
        "content": "<p>After the peer review cycle closes, comments are reviewed and triaged via the same process as for a ballot.  Changes are made as agreed and a publication request is approved by the WG the FHIR Management Group and the TSC.  The STU update will be published as a dot release.</p>",
        "id": 235364457,
        "sender_full_name": "Melva Peters",
        "timestamp": 1618932758
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span>, Everything is in place and the FM is ready to go to open the Peer Review on Friday on 4/23. Does FMG need to review and approve before the peer review is open for comment?</p>",
        "id": 235392556,
        "sender_full_name": "Corey Spears",
        "timestamp": 1618943578
    },
    {
        "content": "<p>No requirement for that at this point...that will happen with the publication request.  You'll need to get the notifications sent out to the co-chair list, Zulip and stakeholders.</p>",
        "id": 235417191,
        "sender_full_name": "Melva Peters",
        "timestamp": 1618953095
    }
]