[
    {
        "content": "<p>I tried to withdraw <a href=\"https://jira.hl7.org/browse/BALLOT-14545\">https://jira.hl7.org/browse/BALLOT-14545</a> but it did not seem to work.  It has 16 \"sub-tasks\" for the 16 Ballot Votes; e.g., <a href=\"https://jira.hl7.org/browse/BALLOT-14599\">https://jira.hl7.org/browse/BALLOT-14599</a></p>\n<p>Do I need to Retract all 16 ballot votes before I can withdraw the ballot submission?</p>\n<p>Should I do a bulk operation on the sub-types list to transition the Ballot Votes status from Balloted to Retracted, and then re-try withdrawing the ballot submission?</p>",
        "id": 250406285,
        "sender_full_name": "Paul Denning",
        "timestamp": 1629750189
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 250406342,
        "sender_full_name": "Melva Peters",
        "timestamp": 1629750222
    },
    {
        "content": "<p>Yes, the ballot submission is not an object the user is expected to interact with: it reflects the overall vote based on the individual issues assigned to it. if each of the negative comments is withdrawn (like ballot spreadsheet line items), the ballot submission will change the vote to affirmative</p>",
        "id": 250406850,
        "sender_full_name": "Lynn Laakso",
        "timestamp": 1629750468
    },
    {
        "content": "<p>Thanks. So what is the purpose of the \"Withdraw\" button on my Ballot Submission?</p>",
        "id": 250407306,
        "sender_full_name": "Paul Denning",
        "timestamp": 1629750657
    },
    {
        "content": "<p>good question, that is definitely for Lloyd.</p>",
        "id": 250407625,
        "sender_full_name": "Lynn Laakso",
        "timestamp": 1629750836
    },
    {
        "content": "<p>I did the bulk action and transitioned them to Retracted, and the Withdraw button went away on the Ballot Submission, and <a href=\"https://jira.hl7.org/browse/BALDEF-1920\">https://jira.hl7.org/browse/BALDEF-1920</a> is showing my now Affirmative vote</p>",
        "id": 250408017,
        "sender_full_name": "Paul Denning",
        "timestamp": 1629751055
    },
    {
        "content": "<p>You absolutely <em>can</em> Withdraw on the submission.  What that will do is try to withdraw all of the individual BallotVote items that are sub-tasks of the submission.  (We didn't want to make voters walk through the bulk operation process.)  However, doing the bulk operation will have the same outcome.</p>",
        "id": 250415657,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1629754750
    },
    {
        "content": "<p>I tried the Withdraw on the submission (before I did the bulk operation).  It did not seem to work, but maybe I didn't wait long enough (assuming it tries the individual BallotVote items in the background).  I did wait a little, and refreshed the Ballot Submission. I didn't notice any movement in the Progress bar (near the Sub-tasks line).  Seemed pretty quick doing the bulk operation (and better than changing them one by one).</p>",
        "id": 250416545,
        "sender_full_name": "Paul Denning",
        "timestamp": 1629755262
    }
]