[
    {
        "content": "<p>Hi, <br>\nNot to distract from the work going on in Koln, but I have a question about ad-hoc connectathons.  It turns out that some of the medical school and business school students at UChicago decided to organize a health tech hackathon this week.  We have a new Trauma Center opening up at the University, and the hackathon theme is 'Trauma', which is ostensibly the same as 'Acute Care' use case from the Clinicians on FHIR group.  I've talked with the organizer, and they're anticipating about 40 people to attend (including 3 to 6 from the Biomedical Informatics program); which seems like it's enough to qualify for an ad-hoc connectathon or Clinicians on FHIR session.  </p>\n<p>So, where do we begin with something like this?  Are there any introductory materials or on-ramping materials for groups holding local connectahons?  Are there any considerations we need to keep in mind regarding the HL7 brands and trademarks?  </p>\n<p>We're tentatively planning on doing a presentation on FHIR and the Clinician on FHIR usecases, and to try to rally the ~40 folks around using interoperability standards.  We've also been working on making the Meteor on FHIR platform available through the University tech-transfer program; so the teams who are starting from scratch can build directly on a FHIR platform.   </p>\n<p>Any thoughts much appreciated.<br>\nAbigail</p>",
        "id": 153962085,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1526495140
    },
    {
        "content": "<p>Well, there are these: <a href=\"http://wiki.hl7.org/index.php?title=FHIR_Connectathon_Track_Process\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=FHIR_Connectathon_Track_Process\">http://wiki.hl7.org/index.php?title=FHIR_Connectathon_Track_Process</a><br>\n<a href=\"http://wiki.hl7.org/index.php?title=Connectathon_Track_Lead_Responsibilities\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=Connectathon_Track_Lead_Responsibilities\">http://wiki.hl7.org/index.php?title=Connectathon_Track_Lead_Responsibilities</a><br>\nThe various tracks from the last 3-6 connectathons to mine for topics/track definitions<br>\nThe various training materials from things like DevDays, some of which explain a little bit about what a connectathon is<br>\nSomething else to consider is picking a primary server or two and making arrangements with the maintainer of that server to ensure they won't take it down for maintenance in the middle of your Connectathon and ideally that they'll be around to help if something goes wrong.</p>",
        "id": 153962090,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1526495763
    },
    {
        "content": "<p>Perfect!  Thank you!  Exactly what I was looking for.  :)</p>\n<p>We'll do this ad-hoc and try to keep in spirit with the HL7 process, take notes, and do a short write up afterwards.  </p>\n<p>Thank you!</p>",
        "id": 153962153,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1526498949
    },
    {
        "content": "<p>Have fun.  Sounds like an awesome idea</p>",
        "id": 153962163,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1526499415
    },
    {
        "content": "<p>Also, be sure to introduce the particpants to <a href=\"http://chat.fhir.org\" target=\"_blank\" title=\"http://chat.fhir.org\">chat.fhir.org</a> and encourage them to engage with the broader community when they have questions - may as well start them early :)</p>",
        "id": 153962164,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1526499449
    },
    {
        "content": "<p>Absolutely!  :D</p>",
        "id": 153962170,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1526499729
    },
    {
        "content": "<p>When’s that going on, Abigail?</p>",
        "id": 153962245,
        "sender_full_name": "Michael Donnelly",
        "timestamp": 1526504329
    },
    {
        "content": "<p>Friday noon through end of day Saturday.</p>",
        "id": 153962250,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1526504852
    },
    {
        "content": "<p>BTW - the conman app (part of clinFHIR) was developed to help support events like this. Just reach out if you want more info...</p>",
        "id": 153962948,
        "sender_full_name": "David Hay",
        "timestamp": 1526540410
    },
    {
        "content": "<p>How'd this end up going?</p>",
        "id": 153963912,
        "sender_full_name": "Michael Donnelly",
        "timestamp": 1526934221
    },
    {
        "content": "<blockquote>\n<p>BTW - the conman app (part of clinFHIR) was developed to help support events like this. Just reach out if you want more info...</p>\n</blockquote>\n<p>Thank you!  Yes, we're definitely interested in flow-charting and diagraming these usecases as a next step.  Are you going to be at FHIR DevDays in Boston this year?  I want to discuss in more detail (but am still gathering information).</p>",
        "id": 153964102,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1527004793
    },
    {
        "content": "<blockquote>\n<p>How'd this end up going?</p>\n</blockquote>\n<p>It went well!  About 40 to 50 people showed; of which maybe a half-dozen were organizers, and another dozen were mentors.  Probably a 3:1 ratio of students : professionals; divided into 5 teams.  A lot of greenfield projects, where folks were just wireframing ideas.  There were maybe a half-dozen of us who were experienced enough to be standing up actual systems.  We wound up getting 3 or 4 FHIR Servers up and running during the connectathon, and were mostly focused on non-clinical resources such as Location, Organization, and RelatedPerson.  Our team implemented a $near geospatial operator for proximity detection, with an eye towards first-responder applications.   We had a lot of learnings about how to run Meteor on FHIR framework within a hackathon environment; including what we need in a custom settings.json file, and how we might use IPFS to autosynchronize datasets.  All in all, it went really well!</p>",
        "id": 153964108,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1527006612
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191678\">@Abigail Watson</span> - sorry won't be at the Boston event (still haven't made it home form Cologne yet!). The tooling is more about tracking outcomes (for a technical CT) though, not intending to move into the flowcharting / diagramming space (ATM :) ). Are you likely to be in Baltimore?</p>",
        "id": 153964331,
        "sender_full_name": "David Hay",
        "timestamp": 1527082379
    }
]