[
    {
        "content": "<p>HQ have just asked me for comment on the network support for Cologne. What hotel proposes to provide is</p>\n<blockquote>\n<p>download up to 512 kbit/s; and upload up to 128 kbit/s </p>\n</blockquote>\n<p>For comparison, stats from NOLA (h/t <span class=\"user-mention\" data-user-id=\"193599\">@Lynn Laakso</span> : NOLA was 58 to 95 Mbps (megabytes per second) peak bandwidth. If you look at our peak users 555 users with 84 Mbps total bandwidth, you have 84000kbps (kbits/s) for 555 users at 151.4 kbps per user download. Peak bandwidth 550 users at 95Mbps is 172.7 kbps  </p>\n<p>Does anyone here have comments on this? (and seeing the prices we are talking about.... people should stop complaining about the cost of the connecatathon.... the money is going to telcos)</p>",
        "id": 153939973,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1519343033
    },
    {
        "content": "<p>How does the hotel's proposal for Cologne compare with what we had in Madrid last year?</p>",
        "id": 153940002,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1519347640
    },
    {
        "content": "<p>don't know. how would you rate it if it was more or less?</p>",
        "id": 153940004,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1519347710
    },
    {
        "content": "<p>Well, as the scale of the WGM and Connectathon are more likely to be equivalent to Madrid than a USA meeting, that might be a better comparison?</p>",
        "id": 153940008,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1519347837
    },
    {
        "content": "<p>well, note that the way this works if a per person limit; the hotel is saying they have the capacity</p>",
        "id": 153940009,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1519347872
    },
    {
        "content": "<p>The hotel in Paris probably said that as well. :) (note to self - must not complain about connectathon costs, will buy telco shares instead).</p>",
        "id": 153940013,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1519348031
    },
    {
        "content": "<p>It seems like this will be marginal, but hopefully manageable</p>",
        "id": 153940016,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1519348397
    }
]