[
    {
        "content": "<p>Welcome to the FHIR Care Management and Planning track, aka \"Care Plan\". The track title was renamed from \"Care Plan\" to \"Care Management and Planning\", which is a better description of participant objectives and interests.  Use of the CarePlan resource is still a core role in this track, but only part of a care management solution that is built on FHIR standards.  See the updated wiki page at <a href=\"http://wiki.hl7.org/index.php?title=201801_Care_Plan\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=201801_Care_Plan\">http://wiki.hl7.org/index.php?title=201801_Care_Plan</a>.  </p>\n<p>Please review the updated track roles and scenarios.  I updated these descriptions to clarify (I hope) how to participate and how we can track our outcomes by participant and scenario in the new connectathon management tool, <a href=\"http://snapp.clinfhir.com:4000\" target=\"_blank\" title=\"http://snapp.clinfhir.com:4000\">http://snapp.clinfhir.com:4000</a>.</p>\n<p>Also note that I changed the recommended use case to reference the NIH Chronic Kidney Disease care plan project, see links on the wiki page.  Very helpful personas for patients and clinicians, with their care plan wish lists. I am creating sample FHIR resources for testing that are based on the NIH patient persona, Betsy Johnson.  See the wiki for links.</p>",
        "id": 153931031,
        "sender_full_name": "Dave Carlson",
        "timestamp": 1517059264
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191990\">@Emma Jones</span>   Here is the tracker when we last discussed barriers: <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=4039\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=4039\">GF#4039</a></p>",
        "id": 153931163,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1517069557
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194474\">@George Dixon</span> Here is the tracker when we last discussed barriers: <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=4039\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=4039\">GF#4039</a></p>",
        "id": 153931167,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1517069622
    },
    {
        "content": "<p>In reading the resolution for that tracker, we concluded that barriers are referenced using CarePlan.supportingInfo (it was previously support, but since renamed to supportingInfo).</p>",
        "id": 153931194,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1517070510
    },
    {
        "content": "<p>Today's discussion:</p>\n<ul>\n<li>Be careful to assume ‘strengths’ are good and ‘weaknesses’ are bad/barriers.  Some ‘weaknesses’ can have a positive impact on care.  For example, an Alzheimer patient who has a history of wandering, who then becomes frail.  Typically (for a healthy patient), frail would be considered a weakness, but in context of this specific Alzheimer patient, that observation may help mitigate the prior wandering off.  </li>\n<li>When talking about strengths/weaknesses/barriers, the general feeling was that there is often a cause and effect relationship between the Observations and the resulting Barrier.  For example, illiteracy (generically) is more of an Observation, whereas the barrier is the patient being unable to read prescription instructions needed to be compliant with their medications.</li>\n</ul>",
        "id": 153931203,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1517070798
    },
    {
        "content": "<p>The frailness may mitigate one problem but will introduce a new problem - propensity to fall.</p>",
        "id": 153931211,
        "sender_full_name": "Emma Jones",
        "timestamp": 1517071499
    },
    {
        "content": "<p>From a workflow perspective  i would chart a weakness/barrier as an observation. i the example above weakness could be positive to a case where the patient wanders but that could translate to Weak + Wander prone = a prone to fall patient.   <br>\nSo <br>\nConcern - Patient is Prone to Fall <br>\nGoal - Patient will not fall <br>\nBarrier observed - patient is confused. <br>\nStrength - Patent has active involved family<br>\nIntervention -  Patient will wear yellow gown identifying patient as prone to fall. Side rails will be up at all times. Patient family to receive prone to fall prevention training.  Patient will be oriented person, place and time with each interaction.</p>",
        "id": 153931220,
        "sender_full_name": "George Dixon",
        "timestamp": 1517071958
    },
    {
        "content": "<p>Example:</p>\n<ul>\n<li>Concern is obesity</li>\n<li>Goal of losing weight</li>\n<li>Strength is the patient already exercises (cardio) 5 times a week</li>\n<li>Intervention is adding yoga (for strength training) into the mix.</li>\n</ul>\n<p>Question:  Should the yoga intervention reference the observation indicating that the patient is already motivated + disciplined with cardio 5 times a week?</p>",
        "id": 153931227,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1517072493
    },
    {
        "content": "<p>CON:  documentation burden (if association is down at the intervention/goal level)</p>",
        "id": 153931232,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1517072778
    },
    {
        "content": "<p>The con is a large barrier to adoption. Next question(s), if I chart this linkage even assuming it fits into my workflow and requires no additional effort what is the tangible benefit?  Is the information presented to me as part of reviewing the care plan or part of the care planning process? Presented as a patient attribute I can add on to or leverage?  How is the information collected initially? Part of an assessment and tagged as part of strengths and weakness for a specific patient?</p>",
        "id": 153931277,
        "sender_full_name": "George Dixon",
        "timestamp": 1517075990
    },
    {
        "content": "<p>From a workflow perspective. Someone is assessing the patient. They chart their functional and Cognitive status.  These status by default become linked to care planning as attributes of the patient that are either strengths / weakness (barriers) and pulled into the care planning process. They could be linked to the care plan but not really a need to be linked to specific concerns/goals/ interventions because its baseline information about the patient linked to the care plan in general.</p>",
        "id": 153931299,
        "sender_full_name": "George Dixon",
        "timestamp": 1517077460
    },
    {
        "content": "<p>I think \"lifestyle activity\" would be some part of an initial assessment done to create a comprehensive patient-centric care plan.   It would make sense for this to be part of the \"functional attributes\" of the patient as a care team member.  Having an initial assessment that documents functional status should reduce the documentation of  adding an activity, like yoga, to a patient's care plan.</p>",
        "id": 153931340,
        "sender_full_name": "Russell Leftwich",
        "timestamp": 1517083068
    },
    {
        "content": "<p><a href=\"http://build.fhir.org/observation.html#interop\" target=\"_blank\" title=\"http://build.fhir.org/observation.html#interop\">http://build.fhir.org/observation.html#interop</a></p>",
        "id": 153931342,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1517083211
    },
    {
        "content": "<p>For example, as applied to \"functional status\" :</p>\n<ul>\n<li>Observation.code = Feeding ADL</li>\n<li>Observation.value = Dependent | Independent | Requires assistance</li>\n</ul>",
        "id": 153931362,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1517084297
    },
    {
        "content": "<p>See <a href=\"https://chat.fhir.org/#narrow/stream/implementers/topic/Conditions.20vs.20Problem.20Lists\" target=\"_blank\" title=\"https://chat.fhir.org/#narrow/stream/implementers/topic/Conditions.20vs.20Problem.20Lists\">https://chat.fhir.org/#narrow/stream/implementers/topic/Conditions.20vs.20Problem.20Lists</a> for a discussion about practitioner-specific problem lists (among other topics)</p>",
        "id": 153931389,
        "sender_full_name": "Michelle (Moseman) Miller",
        "timestamp": 1517086166
    }
]