[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192121\">@Geoff Low</span> <span class=\"user-mention\" data-user-id=\"193236\">@Trisha Simpson</span> I'm reading the Clinical Research track. What do you mean by \"Create a triggering event that recognizes when new data is entered in EHR for a current ResearchSubject after patient encounters\"?</p>",
        "id": 153926943,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1514065767
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  this is working towards using the Subscription resource or similar to allow more contemporaneous monitoring of ResearchSubject targets in the primary healthcare systems. It's still very early on in planning/implementation, but is a strong value driver in terms of optimisation of monitoring costs, signal detection and not driving sites crazy with requests.</p>",
        "id": 153927204,
        "sender_full_name": "Geoff Low",
        "timestamp": 1514503908
    },
    {
        "content": "<p>ok. it could be clearer in that regard then. Do you have any EHR providers interested in the track?</p>",
        "id": 153927221,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1514507834
    },
    {
        "content": "<p>Not as such, I think we're still getting our ducks in a row.  We are very keen to start the dialogue with the vendors.  Can you recommend someone?</p>",
        "id": 153927387,
        "sender_full_name": "Geoff Low",
        "timestamp": 1514851011
    },
    {
        "content": "<p>Don't know that I can recommend someone, but <span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span> and <span class=\"user-mention\" data-user-id=\"191356\">@Jenni Syed</span> are possible contacts</p>",
        "id": 153927398,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1514871001
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192121\">@Geoff Low</span> looking at the connectathon survey data - you have a few participants who say that this is their first exposure to FHIR. I recommend that you encourage all your participants to attend <span class=\"user-mention\" data-user-id=\"191370\">@Richard Ettema</span>'s tutorial on the first day, and perhaps you want your own break out room for discussion as a follow up? (depends on other participants?)</p>",
        "id": 153928735,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1515925488
    },
    {
        "content": "<p>Absolutely, if I could frog march people to it I would.  My one observation from the San Diego event was that the FHIR training started a little too late, so there was some 'dead time'.  I'll talk with the co-chairs about the other room.  It's pleasing to see so many people from our side of the ditch getting involved, but it does introduce some spin up time - but it's a great example of opportunity cost.</p>",
        "id": 153928767,
        "sender_full_name": "Geoff Low",
        "timestamp": 1515959750
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191370\">@Richard Ettema</span> - interesting point - should you start earlier?</p>",
        "id": 153928768,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1515959863
    },
    {
        "content": "<p>James will be MC'ng starting at 9am.  I'm happy to start my FHIR Overview session as soon after that as possible.  How does 9:30am sound?</p>",
        "id": 153928778,
        "sender_full_name": "Richard Ettema",
        "timestamp": 1515961674
    },
    {
        "content": "<p>Have we thought about doing a recorded webinar a week or two ahead of time for those who want a head start?</p>",
        "id": 153928783,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1515962037
    },
    {
        "content": "<p>I did a preso for teh UK a year back that was recorded - we could use that if you like...</p>",
        "id": 153928784,
        "sender_full_name": "David Hay",
        "timestamp": 1515962474
    },
    {
        "content": "<p>well, there's already some introductory material to FHIR available</p>",
        "id": 153928786,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1515962841
    },
    {
        "content": "<p>could make some required reading/watching for the track?</p>",
        "id": 153928787,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1515962854
    },
    {
        "content": "<p>There's all the slides from the last Dev Days event here <a href=\"https://www.slideshare.net/DevDays\" target=\"_blank\" title=\"https://www.slideshare.net/DevDays\">https://www.slideshare.net/DevDays</a>.  Not sure if any of the videos are available (yet).</p>",
        "id": 153928788,
        "sender_full_name": "Richard Ettema",
        "timestamp": 1515963338
    },
    {
        "content": "<p>All of these sound great.  If you've got a good link, I'm going to try and organise sending out a primer for the session sometime this week, is this the most naive of the Groups meeting?  We have a couple of new revisions to the Research* resources included in R4 - we'll need to see what we can do about getting them somewhere usable.</p>",
        "id": 153928819,
        "sender_full_name": "Geoff Low",
        "timestamp": 1516010549
    },
    {
        "content": "<p>naive... no, I wouldn't use that word. You might be the most newbie (this time)</p>",
        "id": 153928828,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1516012461
    },
    {
        "content": "<p>Naive is not intended as being as disparaging as it sounds.  Just not as deeply embedded perhaps.</p>",
        "id": 153928834,
        "sender_full_name": "Geoff Low",
        "timestamp": 1516016476
    }
]