[
    {
        "content": "<p>During the Sunday afternoon AID conversation there was some discussion on how the Connectathon might evolve as it has substantially grown in size and is perceived as being too short.</p>\n<p>I hope others will post their thoughts in this thread.</p>\n<p>I'd like to see the Connectathon move from the weekend to the entire week, in parallel with the WG meetings. That would give 3-4 solid days of connectathon. People could break out, go to a WG meeting during one \"Q\" and then come back to the Connectathon. In this scenario, there could be one giant connectathon ballroom or separate smaller rooms dedicated to one or two tracks.</p>",
        "id": 153906347,
        "sender_full_name": "Jason Walonoski",
        "timestamp": 1505160832
    },
    {
        "content": "<p>Yes, please put any thoughts in here. Managing a larger connectathon is something that we need to put serious thought into...</p>",
        "id": 153906349,
        "sender_full_name": "David Hay",
        "timestamp": 1505161392
    },
    {
        "content": "<p>Note that there's also a 'Clinicians on FHIR' event on the friday - slightly different, but there are similarities, and some tracks (like CarePlan) are starting to be involved in both...</p>",
        "id": 153906350,
        "sender_full_name": "David Hay",
        "timestamp": 1505161448
    },
    {
        "content": "<p>I like the idea of a longer Connectathon but personally, I don't see being able to split my time between the Q# meetings and the Connectathon. I don't see the people who are attending the Connectathon today being able to spend a whole week too. I think having the Connectathon for 2 full days would be a good starting point.</p>\n<p>Given the number of tracks and our size, I don't see value in the 2min track summaries during the presentation section.</p>\n<p>Given our size, I would like to break out tracks into separate rooms. Ideally, this would allow us to spread out more (it is uncomfortable being so tight at the tables) and less people in the room would make the environment less intimidating for new Connectathon attendees.</p>",
        "id": 153906351,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1505161654
    },
    {
        "content": "<p>Another consideration is that HL7 books hotels (and rooms) 1.5-2 years in advance.  So changes to format that have any significant impact on space requirements will need to be longer-term considerations.  That doesn't mean we can't explore such ideas, we just need to be realistic about when they could take effect.</p>",
        "id": 153906353,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1505162280
    },
    {
        "content": "<p>It could be quite hard to predict number and size of tracks that far in advance.  We could just \"book rooms\" and then divy those rooms up between tracks based on registration.</p>",
        "id": 153906354,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1505162346
    },
    {
        "content": "<p>I do have a bit of a concern about people who do (or support) multiple tracks.</p>",
        "id": 153906355,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1505162372
    },
    {
        "content": "<p>We also need to remember that there are a number of reasons why people come: To learn more and practise (eg the Patient track), to advance the specification - and before too long for certification (official or anecdotal)...</p>",
        "id": 153906374,
        "sender_full_name": "David Hay",
        "timestamp": 1505163598
    },
    {
        "content": "<p>Agree with pretty much all of Kevin's post.  Some tables were very crowded at the weekend. I suggest that the Track Leads post summaries - including test results where appropriate - on their stream's Wiki Page as an alternative to 19 rushed presentations that don't do justice to what's been achieved. It seems inevitable that 2 full days will be required; but any further would create conflicts and the Connectathon is a separate event and revenue stream to the main WGM.</p>",
        "id": 153906397,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1505165144
    },
    {
        "content": "<p>sorting tables better is something that we'll do - I didn't have enrolled numbers when dividing tables - and no plan in advance. So that's some of the stuff we've agreed will happen</p>",
        "id": 153906422,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1505165951
    },
    {
        "content": "<p>I'd like longer though it would kill me - but we won't have time</p>",
        "id": 153906423,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1505165983
    },
    {
        "content": "<p>Best keep you alive, Grahame.<img alt=\":laughing:\" class=\"emoji\" src=\"/static/generated/emoji/images/emoji/unicode/1f606.png\" title=\":laughing:\"></p>",
        "id": 153906426,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1505166017
    },
    {
        "content": "<p>I assume the original thought of holding the Connectathon just before the WGM was we expected people were already going to the WGM could just show up a day or two early and play with this FHIR thing. I'd be interested to know how large the overlap between Connectathon and WGM attendees is now. I know my organization sends mostly completely different groups of people, so having the two events in conjunction offers little benefit. Would it make sense to eventually separate the two events? This would also let you lengthen the Connectathon if desired.</p>\n<p>(I'm just throwing this idea out there for discussion; I'm not sure it's a good idea. I can imagine non-North Americans might have objections.)</p>",
        "id": 153906588,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1505173488
    },
    {
        "content": "<p>I think about 40% people overlap, and those that overlap are very important</p>",
        "id": 153906591,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1505173897
    },
    {
        "content": "<p>and I travel more than I can deal with already, as do most internationals</p>",
        "id": 153906592,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1505173914
    },
    {
        "content": "<p>Yup, you were the first person I expected to object to the idea.</p>",
        "id": 153906594,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1505173948
    },
    {
        "content": "<p>if it was just me, I wouldn't</p>",
        "id": 153906615,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1505174797
    },
    {
        "content": "<p>One of the major benefits of the conjunction is the infusion of implementation experience we get into the standards design sessions.  We'd be extremely reluctant to do anything that would reduce that.</p>",
        "id": 153906619,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1505178236
    },
    {
        "content": "<p>It's had a very positive impact on the organization</p>",
        "id": 153906620,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1505178262
    },
    {
        "content": "<p>I think if you ran them in parallel, you'd get the non-overlap people to attend during the main conference. Those connectathon-only people potentially could pop into WG Qs and start to participate and add value. If they go home on Sunday, the potential to spontaneously bring those folks in disappears.</p>",
        "id": 153907034,
        "sender_full_name": "Jason Walonoski",
        "timestamp": 1505238489
    }
]