[
    {
        "content": "<p>Please be sure to submit BOTH your HL7 registration and your Pre-Connectathon Survey for the Cologne Connectathon. The Survey link is here: <a href=\"https://www.surveymonkey.com/r/DH6BCHP\" target=\"_blank\" title=\"https://www.surveymonkey.com/r/DH6BCHP\">https://www.surveymonkey.com/r/DH6BCHP</a></p>",
        "id": 153953342,
        "sender_full_name": "Sandy Vance",
        "timestamp": 1524229328
    },
    {
        "content": "<p>Oops, pre-connectathon survey done - but missed the registration date.  Any idea about the number of attendees for the CR track</p>",
        "id": 153954241,
        "sender_full_name": "Geoff Low",
        "timestamp": 1524645970
    },
    {
        "content": "<p>With just one week left before the 18th HL7 FHIR Connectation , we are doing our best to plan for appropriate bandwidth at the Connectathon event, but finding that the internet service provider in Cologne is not very flexible. </p>\n<p>Cost:  If you are staying at the hotel, you get one free wifi connection to one device.  If you use more than one device, you will be charged 5 euro per device per day. If you are not staying at the hotel, cost is 5 euro per device per day. </p>\n<p>Bandwidth:  The internet connectivity is not going to be as fast as we would like. In order to reduce potential slowdowns, we are asking that all connectathon attendees download the larger items needed to participate prior to arriving at the event. This might include the content for the core spec and any IGs related to connectathon tracks. Please check with your track lead to see what items might be useful.</p>\n<p>On site downloads: We will have a couple of file servers available on site and some thumb drives (available at the info desk) with more commonly used items on them. If you find yourself without a download on site, please check with me at the info table BEFORE you click download to see if I can get it to you without taking up valuable bandwidth. There are tracks that will require this bandwidth for testing so let us all please work together to ensure we are using it mindfully.</p>\n<p>HL7 Headquarters will continue to push the venue to provide the best service possible. Thanks in advance for your help in making this Connectathon successful. As always – if you have any questions or concerns please contact me directly.</p>",
        "id": 153955828,
        "sender_full_name": "Sandy Vance",
        "timestamp": 1525388417
    },
    {
        "content": "<p>Most importantly, ensure your integrated development environments are installed and configured, that your operating systems are fully patched and up to date and that you've got whatever libraries you're likely to need.  (And if Microsoft decides to do an update in the middle of the connectathon, it'd be great if you could delay the install until you're back in your room...)</p>",
        "id": 153955862,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1525395067
    },
    {
        "content": "<p>Break out rooms are again available on a first come, first serve basis. To schedule go here: <a href=\"https://docs.google.com/spreadsheets/d/1zZA0qoAmYwWDFY_0SyO_rf-IxrdSurTGQLdRCSY1hCk/edit#gid=2033893861\" target=\"_blank\" title=\"https://docs.google.com/spreadsheets/d/1zZA0qoAmYwWDFY_0SyO_rf-IxrdSurTGQLdRCSY1hCk/edit#gid=2033893861\">https://docs.google.com/spreadsheets/d/1zZA0qoAmYwWDFY_0SyO_rf-IxrdSurTGQLdRCSY1hCk/edit#gid=2033893861</a>.</p>",
        "id": 153956966,
        "sender_full_name": "Sandy Vance",
        "timestamp": 1525791806
    },
    {
        "content": "<p>Looking at the Connectathon Management App (<a href=\"http://conman.fhir.org/connectathon.html?event=cologne2018\" target=\"_blank\" title=\"http://conman.fhir.org/connectathon.html?event=cologne2018\">http://conman.fhir.org/connectathon.html?event=cologne2018</a>) there are only 6 registered attendees and 2 tracks. Are other using alternative tooling?</p>",
        "id": 153957728,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1526027353
    },
    {
        "content": "<p>Added CR to the app</p>",
        "id": 153957897,
        "sender_full_name": "Geoff Low",
        "timestamp": 1526050198
    },
    {
        "content": "<p>6 of the tracks are up (though no scenarios). <span class=\"user-mention\" data-user-id=\"194993\">@Sandra Vance</span> we did send out the details on how to set up tracks didn't we?</p>",
        "id": 153957915,
        "sender_full_name": "David Hay",
        "timestamp": 1526053825
    },
    {
        "content": "<p>I just added some basic stuff for the Versioned API track.</p>",
        "id": 153957945,
        "sender_full_name": "Kevin Olbrich",
        "timestamp": 1526058586
    },
    {
        "content": "<p>Added one scenario for CR</p>",
        "id": 153958197,
        "sender_full_name": "Geoff Low",
        "timestamp": 1526108468
    },
    {
        "content": "<blockquote>\n<p>6 of the tracks are up (though no scenarios). <span class=\"user-mention\" data-user-id=\"194993\">@Sandra Vance</span> we did send out the details on how to set up tracks didn't we?</p>\n</blockquote>\n<p>Are you referring to wiki details or orientation slides? need clarification... <span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span></p>",
        "id": 153958293,
        "sender_full_name": "Sandy Vance",
        "timestamp": 1526114558
    }
]