[
    {
        "content": "<p>Thanks to all the Track Leads who took the time to come to yesterdays demonstration of the new Connectathon Management tool that we’re trialing at the New Orleans WGM. As we discussed on the call, please feel free to use it for your own track – with the proviso that it is newly minted, so may have some rough edges and bugs! (Though I’ll do all I can to mitigate the risk.) The original spreadsheet is still available as an alternative/ backup.</p>\n<p>The schedule from this point forward is:</p>\n<ul>\n<li>Over the weekend I’ll clear out all the dross from the server at snapp.clinfhir.com:4000. After that, you can set up servers, clients and test registrations &amp; they’ll still be there for the event. I’ll put a notification here when that is done.</li>\n<li>At the same time I’ll set up a demo instance (same server, different port) that you can use for testing and/or training</li>\n<li>I’ll also upload all the registrations (as people) that we have to date. I should be able to update that on the day as well, but if not then people can set themselves up.</li>\n<li>If you want to alter your track details (new roles and/or scenarios) then let me know via email &amp; I’ll update the database. There isn’t (yet) a UI for that.</li>\n</ul>\n<p>If you have any issues, questions or suggestions then just drop them here. I’ll also add anything of interest.</p>",
        "id": 153928299,
        "sender_full_name": "David Hay",
        "timestamp": 1515606709
    },
    {
        "content": "<p>OK so I've just pushed an update to the management app. Was wondering if we should call it fhirCat - for fhir ConnectaThon. (actually it was <span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> s idea....)<br>\nMain updates:</p>\n<ul>\n<li>There's now a 'report' subtab under the first 'Track Descriptions' tab. The idea is to help the track leads with their 'end of session' report by summarizing the key data from the track. Take a look at the Patient track to see how it works. Enhancement ideas welcomed.</li>\n<li>There's a TestReport API for downloading the results as FHIR resources (rather than the internal format). url is [host]/fhir/TestReport. There's no search yet - will look to add that later. </li>\n<li>When adding a server to a track, there is the option to add the server to all scenarios in that track (in the selected role). Just for Grahame</li>\n<li>There were some stability issues with the server - it just kept stopping! I think it was a memory issue, so I've increased the memory on the server, and using the PM2 process manager to automatically restart in the event of issues. Seems to be working so far...</li>\n</ul>",
        "id": 153928388,
        "sender_full_name": "David Hay",
        "timestamp": 1515655776
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span> - I somehow missed that there was a demo/call yesterday. Where did that communication come from and when?</p>",
        "id": 153928424,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1515680382
    },
    {
        "content": "<p>Also, is there a recording and/or slide deck from yesterday I can look at?</p>",
        "id": 153928425,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1515680407
    },
    {
        "content": "<p>Hi Kevin - should have come from <span class=\"user-mention\" data-user-id=\"194993\">@Sandra Vance</span>  (hope this is the right sandra!) There is a recording I believe - I'll ping her via email as well...</p>",
        "id": 153928442,
        "sender_full_name": "David Hay",
        "timestamp": 1515688987
    },
    {
        "content": "<p>Thanks. I checked my email and didn't find anything (that doesn't mean I didn't accidentally delete it). I'll look for the slides/recording from her :-)</p>",
        "id": 153928443,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1515689315
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span> What's the link to the management tool?</p>",
        "id": 153928472,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1515700996
    },
    {
        "content": "<p>Hi Rob - <a href=\"http://snapp.clinfhir.com:4000/\" target=\"_blank\" title=\"http://snapp.clinfhir.com:4000/\">http://snapp.clinfhir.com:4000/</a></p>",
        "id": 153928496,
        "sender_full_name": "David Hay",
        "timestamp": 1515703194
    },
    {
        "content": "<p>I didn't receive the notice from <span class=\"user-mention\" data-user-id=\"194993\">@Sandra Vance</span>  either, but would be interested in reviewing the slides/recording.</p>",
        "id": 153928518,
        "sender_full_name": "Ron Shapiro",
        "timestamp": 1515706762
    },
    {
        "content": "<p>will get it and post in the chat...</p>",
        "id": 153928528,
        "sender_full_name": "David Hay",
        "timestamp": 1515708570
    },
    {
        "content": "<p>Connectathon Management Tool Introductory Meeting Recording is here: <a href=\"https://www.youtube.com/edit?o=U&amp;video_id=-pHVRqrcBo0\" target=\"_blank\" title=\"https://www.youtube.com/edit?o=U&amp;video_id=-pHVRqrcBo0\">https://www.youtube.com/edit?o=U&amp;video_id=-pHVRqrcBo0</a><br>\nNot that I recommend skipping our helpful reminders, but Davids demo starts around 11:04. :-)<br>\nMy apologies for the audio issues at the top of the call.</p>",
        "id": 153928536,
        "sender_full_name": "Sandy Vance",
        "timestamp": 1515710963
    },
    {
        "content": "<blockquote>\n<p>I didn't receive the notice from <span class=\"user-mention\" data-user-id=\"194993\">@Sandra Vance</span>  either, but would be interested in reviewing the slides/recording.</p>\n</blockquote>\n<p>Ron Shapiro - Please try this link!  <a href=\"https://youtu.be/-pHVRqrcBo0\" target=\"_blank\" title=\"https://youtu.be/-pHVRqrcBo0\">https://youtu.be/-pHVRqrcBo0</a></p>",
        "id": 153928694,
        "sender_full_name": "Sandy Vance",
        "timestamp": 1515798388
    },
    {
        "content": "<p>So I've cleared out the management tool at <a href=\"http://snapp.clinfhir.com:4000/\" target=\"_blank\" title=\"http://snapp.clinfhir.com:4000/\">http://snapp.clinfhir.com:4000/</a> - there is only the track setup and a sample client and server there. I won't clear it out again,  so feel free to set up the clients and servers for your track. </p>\n<p>I've also set up a test instance at <a href=\"http://snapp.clinfhir.com:4001/\" target=\"_blank\" title=\"http://snapp.clinfhir.com:4001/\">http://snapp.clinfhir.com:4001/</a> if you want to have a play - or show someone how it works. It's exactly the same as the main one (actually it's just a duplicate instance of the same app) but with a separate database. I've made the navbar yellow to help avoid confusion.</p>",
        "id": 153928726,
        "sender_full_name": "David Hay",
        "timestamp": 1515915120
    },
    {
        "content": "<p>btw - added the ability for a person to have a 'primary track'.  Set it by selecting the person in the 'people' tab, and it's now an option when you edit the person (or add a new one). List the people currently registered for a track in the 'Track Descriptions' tab.</p>",
        "id": 153928757,
        "sender_full_name": "David Hay",
        "timestamp": 1515955475
    },
    {
        "content": "<p>And now you can add multiple 'Tracks Of Interest' for tracks that your're intersted in (and might be participating in), but are not your primary track. Like the primary track, you add them through the people tab, and view them in the track description...</p>",
        "id": 153928798,
        "sender_full_name": "David Hay",
        "timestamp": 1515986047
    },
    {
        "content": "<p>I'm trying to register a server on this tool and it says there is no CapabilityStatement returned, but there is: <a href=\"http://measure.eval.kanvix.com/cqf-ruler/baseDstu3/metadata\" target=\"_blank\" title=\"http://measure.eval.kanvix.com/cqf-ruler/baseDstu3/metadata\">http://measure.eval.kanvix.com/cqf-ruler/baseDstu3/metadata</a></p>",
        "id": 153928915,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1516046860
    },
    {
        "content": "<p>So it won't let me save the server :)</p>",
        "id": 153928916,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1516046870
    },
    {
        "content": "<p>I also wonder about a CDS Hooks service, should this tool support specifying a CDS Hooks service, even though it's not a FHIR Server per se?</p>",
        "id": 153928919,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1516047637
    },
    {
        "content": "<p>I figured CDS Hooks was an outlier (today). All of the communication/view around FHIR connectathons is centered around exploring, testing, and playing with FHIR.</p>\n<p>With CDS Hooks, FHIR is used but not a focus. As more projects emerge in the FHIR ecosystem, I imagine they will fall into the same boat as CDS Hooks.</p>",
        "id": 153928921,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1516048205
    },
    {
        "content": "<p>that should be handled but David might not get to it too quickly</p>",
        "id": 153928940,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1516056134
    },
    {
        "content": "<p>It's the CORS issue again. What I'll do is to relax the requirement for the metadata call - make it optional. hold on...</p>",
        "id": 153928953,
        "sender_full_name": "David Hay",
        "timestamp": 1516060662
    },
    {
        "content": "<p>OK - try now. It shouldn't cause any issues.  But thanks for doing this now, while there is time to sort out these little issues!</p>",
        "id": 153928954,
        "sender_full_name": "David Hay",
        "timestamp": 1516061044
    },
    {
        "content": "<p>Actually the idea about registering a CDS-hooks service is a good idea! How best to handle? I guess it's a refinement on a 'basic' server?  Perhaps when registering a server you can specify the hooks services it supports?</p>",
        "id": 153928955,
        "sender_full_name": "David Hay",
        "timestamp": 1516061130
    },
    {
        "content": "<p>btw - if you're trying things out - or just want to demo how it works - don't forget that there is a test instance at <a href=\"http://snapp.clinfhir.com:4001/\" target=\"_blank\" title=\"http://snapp.clinfhir.com:4001/\">http://snapp.clinfhir.com:4001/</a> . Guaranteed to be the same as the prod instance...</p>",
        "id": 153928956,
        "sender_full_name": "David Hay",
        "timestamp": 1516061251
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191355\">@Kevin Shekleton</span> - have added a new tab in the 'add server' model called CDS-hooks. There's a button there that will query the server's hook discovery end point and records any hooks it finds against the server definition. Is there any value in doing more than that? eg, when recording a test outcome, being able to specify that a particular hook was tested?</p>",
        "id": 153929095,
        "sender_full_name": "David Hay",
        "timestamp": 1516122710
    },
    {
        "content": "<p>@David Hay, thanks for looking into this. Unfortunately, now when I try to add a server there is no \"Save\" or \"Ok\" button anymore :( I've tried in both FireFox and Chrome.</p>",
        "id": 153929098,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1516123363
    },
    {
        "content": "<p>Never mind, user error :)</p>",
        "id": 153929100,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1516123789
    },
    {
        "content": "<p>whew! (didn't realise that the description was mandatory eh?) - should it be??<br>\nbtw - just changed the layout - rather than showing the hooks in the table, there's now a flag to the right if there are hooks defined. Mousing over the hook shows the description - edit the server to see the details. Likely need to think about security moving forward to avoid inadvertent changes. Right now it's on a trust basis...</p>",
        "id": 153929107,
        "sender_full_name": "David Hay",
        "timestamp": 1516129340
    },
    {
        "content": "<p>btw - the other flag shown is SM for a SMART server - the tool figures that out based on the CapabilityStatement if you click that link...</p>",
        "id": 153929108,
        "sender_full_name": "David Hay",
        "timestamp": 1516129384
    },
    {
        "content": "<p>Bryn, could you share what the user error was? I can't find a Save button either. Trying to add Vonk...</p>",
        "id": 153929188,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1516185651
    },
    {
        "content": "<p>The issue (I think) is that the comment is required. It does say so, but not obvious. I'm gonna relax that...</p>",
        "id": 153929273,
        "sender_full_name": "David Hay",
        "timestamp": 1516208491
    },
    {
        "content": "<p>and done. The only required fields now for adding a server are just the name and contact (which must be a selection from the list of users - not just text), and I updated the screen prompt to be - hopefully - more explicit.</p>",
        "id": 153929278,
        "sender_full_name": "David Hay",
        "timestamp": 1516209448
    },
    {
        "content": "<p>However, entering a server address (preferably the server root so the tool can locate the CapabilityStatement) would be highly recommended!</p>",
        "id": 153929281,
        "sender_full_name": "David Hay",
        "timestamp": 1516209635
    },
    {
        "content": "<p>The issue was that it was not obvious that 'contact' had to be selection. I just added the general vonk mail address. That is apparently not a recognized contact, but the UI does not tell me that. But I succeeded now, thanks for the help!</p>",
        "id": 153929305,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1516212923
    },
    {
        "content": "<p>hmm. I did add text below the input box - but I guess that's not enough. I'll throw an error message if there's text in the box, but no user selected. Hopefully that will be clearer...</p>",
        "id": 153929308,
        "sender_full_name": "David Hay",
        "timestamp": 1516214029
    },
    {
        "content": "<p>Hi Guys - just to confirm that there are 2 instances of the tool out there - the one on port 4000 is the 'production' version and the one on port 4001 is a test/play version. So put any 'real' clients/servers/people in the 4000 one...</p>",
        "id": 153929524,
        "sender_full_name": "David Hay",
        "timestamp": 1516314959
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> - scenarios added...</p>",
        "id": 153931263,
        "sender_full_name": "David Hay",
        "timestamp": 1517075253
    },
    {
        "content": "<p>btw - if anyone wants new scenarios added then give me a shout, currently there is no UI to do this...</p>",
        "id": 153931265,
        "sender_full_name": "David Hay",
        "timestamp": 1517075297
    }
]