[
    {
        "content": "<p>(deleted)</p>",
        "id": 153857097,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1479271698
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 153857098,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1479271780
    },
    {
        "content": "<p>Welcome to the openEHR track at DevDays16. </p>\n<p>This track will be a little different to the other tracks - it's more of a meta-track.  We'll be working with both the Logical Model track, and the Clinical FHIR track. (In fact, in the program schedule, there is one main track 'Profiling, Logical Models, and openEHR' - but we have split these into 3 different tracks here in Zulip, and they are loosely related.</p>\n<p>Partly, this is because of where we are with regard to openEHR.</p>\n<p>In some kind of dream world, people will be able to model their content using openEHR, and then express system interfaces using FHIR, and not only will it be clear how that works, there'll be a simple tooling stack that automates it. Also, in an ideal world, the process will be reversible - people could take a FHIR implementation guide, and generate openEHR content for that. But we don't live in that dream world. And we may not ever do that; the differences in the way openEHR and FHIR conceptualise the tasks and prioritise our compromises will probably mean we can never get to that point. But we should be able to get a useful amount of direction along the way</p>\n<p>Right now, we have several technical routes along the way, but none are fully worked out. The openEHR track will leverage several different tracks - specifically, the logical modelling track, the clinical FHIR track, and the MR track.<br>\nPresentations relevant to the openEHR track today: <br>\n - FHIR Profiling (Michel Rutten, 9:45)<br>\n - Viewing And Building Resources (David Hay, 10:30)<br>\n - StructuredDataCapture (SDC) and Questionnaire (Lloyd McKenzie, 11:15)</p>\n<p>For the Hands-on Element of this track, we'll be picking an openEHR archetype from CKM, and then representing it in FHIR in 3 different ways:<br>\n- as a profile on one or more resources<br>\n- as a logical model with a mapping to FHIR resources, and a derived profile<br>\n- as a questionnaire on a set of data elements</p>\n<p>Suggestions are welcome for what archetype we should pick. I'll be selecting an archetype sometime this morning based on it representing some of the structural complexirties I know we're going to encounter</p>",
        "id": 153857101,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1479272725
    },
    {
        "content": "<p>tomorrow, I'll be doing a full introduction presentation at 9:45</p>",
        "id": 153857102,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1479272780
    },
    {
        "content": "<p>Candidate Archetypes:<br>\n- Pregnancy Summary<br>\n- Infant Feeding Summary<br>\n- Health Risk Assessment<br>\nComments welcome</p>",
        "id": 153857151,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1479286807
    },
    {
        "content": "<p>I did Health Risk Assessment as a logical model. Now going for the questionnaire and profile. Would like to discuss my findings in the process!</p>",
        "id": 153857277,
        "sender_full_name": "diego kaminker",
        "timestamp": 1479307092
    },
    {
        "content": "<p>great. lets do that tomorrow morning</p>",
        "id": 153857347,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1479322586
    },
    {
        "content": "<p>btw - <span class=\"user-mention\" data-user-id=\"191839\">@diego kaminker</span> figured out how to use clinFHIR to create samples for the logical models. The process is a bit klunky but it works!<br>\n1. Create the model using Forge and upload to simplifier. You need to find out the ID of the resource that ?simplifier creates<br>\n2. In clinFHIR, set the conformance server to simplifier (and the data server to an ST2 server as well to stop CF complaining), then click the 'find profile' link.<br>\n3. in the dialog, select the 'Select directly' tab, set the dropdown to simplifier (again) and paste in the id. Click the 'Select profile' button that appears</p>\n<p>The profile is loaded into CF and you can then select a patient and create an instance of the logical model. cool!</p>\n<p>(I'm sure Diego will show you the process :) )</p>",
        "id": 153857419,
        "sender_full_name": "David Hay",
        "timestamp": 1479359492
    },
    {
        "content": "<p>you can't save the instance yet (though I've added a download icon to the upper right in the resource builder so you can download one) - and you can also park it if you want.<br>\nYou should also be able to do this with Logical Models created in CF - just use the server you created the model on rather than simplifier...</p>",
        "id": 153857420,
        "sender_full_name": "David Hay",
        "timestamp": 1479359626
    },
    {
        "content": "<p>To me this shows the value of doing this work within the FHIR stack - being able to-use the tooling developed for other purposes is just great. It also shows the benefit of devdays - getting people together to work on issues from different perspectives...</p>",
        "id": 153857421,
        "sender_full_name": "David Hay",
        "timestamp": 1479359861
    },
    {
        "content": "<p>Oh, and when you have loaded the Logical Model into CF, click on the 'eye' icon to the left of the model name which will show the 'profile' editor. There are a number of visualizations there - like the mind map - that are useful...</p>",
        "id": 153857422,
        "sender_full_name": "David Hay",
        "timestamp": 1479359945
    }
]