[
    {
        "content": "<p>Hi All!</p>\n<p>For the upcoming DevDays in Amsterdam, I am wondering if people are interested in a ‘birds of a feather’ session discussing how interoperable national programs, such as Argonaut and the Dutch/Finnish PHR program, are at an international level. </p>\n<p>For example, think on how much effort it would take a USA based healthcare IT company, that has implemented US core, to start operations aboard. How easy or how hard is it for them to join the Dutch PHR program. Or the other way around. We could discuss where the bottlenecks are. At the data level or rather with regards to accessing the data based on different authorizations implementation?  Should we do anything about it?</p>\n<p>Who thinks this is a good subject to discuss? Even better: will you be at DevDays and able to add something to the discussion?</p>",
        "id": 180225840,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1573217021
    },
    {
        "content": "<p>Would having the International Patient Summary perspective there help? <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> ?</p>",
        "id": 180231667,
        "sender_full_name": "Ward Weistra",
        "timestamp": 1573221649
    },
    {
        "content": "<p>I'm happy to share where we're at with the CA Core profiles</p>",
        "id": 180232612,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1573222412
    },
    {
        "content": "<p>I’d find it interesting. Now, I just need to get to DevDays.</p>",
        "id": 180237373,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1573225457
    },
    {
        "content": "<p>I'm definitely interested, and will talk about the International Patient Access spec.</p>",
        "id": 180264442,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1573242212
    },
    {
        "content": "<p>very useful to call out the relationship between the IPS and IPA (other than that the latter is a type of beer....)</p>",
        "id": 180276118,
        "sender_full_name": "David Hay",
        "timestamp": 1573249900
    },
    {
        "content": "<p>Yes, I think this would be very interesting and useful.  I agree with <span class=\"user-mention\" data-user-id=\"203235\">@Ward Weistra</span> that the IPS perspective is very appropriate and I would be happy to speak to that.  And I also agree with <span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span> that looking at the different perspectives and the commonalities and the relationship between IPS and IPA will be very useful.  It will be a good opportunity to see them side by side.</p>",
        "id": 180287000,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1573259801
    },
    {
        "content": "<p>Wow, what a great reactions so far! I will try to see if we can get people working for the big tech companies in the session as well.</p>",
        "id": 180413595,
        "sender_full_name": "Ardon Toonstra",
        "timestamp": 1573469714
    },
    {
        "content": "<p>I'm interested. Australia has made a start on an Argonaut AU, but its very early days</p>",
        "id": 180484056,
        "sender_full_name": "Jim Steel",
        "timestamp": 1573537433
    },
    {
        "content": "<p>I'll be at the DevDays and am very interested. Working on IPS and Dutch models and implementation in e.g. Epic.</p>",
        "id": 180558495,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1573590872
    },
    {
        "content": "<p>Hopefully I'm not too late to the party, but I'd be very interested in this as well from a Swedish perspective. We've come to see this as one of the most important issues to find common solutions to in order for Sweden's careproviders to more easily have access to the international marketplace.</p>",
        "id": 181095525,
        "sender_full_name": "Viktor Jernelöv",
        "timestamp": 1574156645
    },
    {
        "content": "<p>Not too late. Make sure to be here: <a href=\"https://www.devdays.com/amsterdam/schedule-2019/#event-884\" target=\"_blank\" title=\"https://www.devdays.com/amsterdam/schedule-2019/#event-884\">https://www.devdays.com/amsterdam/schedule-2019/#event-884</a>. <span class=\"user-mention\" data-user-id=\"192301\">@Ardon Toonstra</span> is coordinating this session.</p>",
        "id": 181097118,
        "sender_full_name": "Rien Wertheim",
        "timestamp": 1574158126
    }
]