[
    {
        "content": "<p>This is the FHIR Developer Days 2016 channel for the Terminology track.</p>",
        "id": 153852804,
        "sender_full_name": "Rien Wertheim",
        "timestamp": 1476384657
    },
    {
        "content": "<p>Dev Days is almost here.  Thanks in advance for being part of the Terminology Track.  Broadly what we want to do is excercise and evaluate the FHIR Termimology Service API and the offerings of our available servers to ensure that we are meeting the needs of the FHIR community generally in regard to making the needed terminologies available and useable.  With that in mind, as much as possible we want to engage with the other tracks at Dev Days to encourage them to utilize the terminology services to meet their terminology needs.  Any suggestions or requests for specific topics or activities that any of you have are very welcome.  It will be good to have some dialogue in advance regarding what you may be planning to offer and/or what you hope to be able to accomplish over the next few days (unless we're all too busy traveling at the moment).  I'm looking forward to meeting and being with all of you beginning on Wednesday!</p>",
        "id": 153856948,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1479188854
    },
    {
        "content": "<p>Hi Rob, i'm a FHIR newbie and was planning to join the terminology track to start getting familiar with what FHIR offers. If you have some reading suggestions for me (or suggested track) it will be great to prepare more ! Thanks, looking forward ! </p>",
        "id": 153856959,
        "sender_full_name": "Nana Ginzburg",
        "timestamp": 1479199218
    },
    {
        "content": "<p>Hi Nana, if you're a developer, please also consider joining James Agnew or me for the Java or .Net API beginner sessions that are taking place just before Robs talk. In the afternoon we'll be happy to have you take part in the hands-on track.</p>",
        "id": 153856960,
        "sender_full_name": "Mirjam Baltus",
        "timestamp": 1479200456
    },
    {
        "content": "<p>thanks Mirjam,  i'm still not sure where exactly i will go - everything on the schedule sounds interesting and new for me, but i will most definitely consider it ! See you tomorrow :)  Anything you recommend me reading before ? </p>",
        "id": 153856961,
        "sender_full_name": "Nana Ginzburg",
        "timestamp": 1479200932
    },
    {
        "content": "<p>I would recommend browsing through the <a href=\"http://www.hl7.org/fhir/\" target=\"_blank\" title=\"http://www.hl7.org/fhir/\">FHIR specification</a>, if you haven't done that already. Then start with the Introduction session tomorrow, followed by anything that catches your interest. :) You can switch tracks, no problem. f you have any questions during the day, we'll be walking around to help. See you tomorrow!</p>",
        "id": 153856962,
        "sender_full_name": "Mirjam Baltus",
        "timestamp": 1479201509
    },
    {
        "content": "<p>I think that all of that is good advice.  The FHIR specification probably is the best place to read - that's how it's intended.  For terminology, starting with the <a href=\"http://build.fhir.org/terminology-module.html\" target=\"_blank\" title=\"http://build.fhir.org/terminology-module.html\">terminology module page</a> and browsing through the main topics from there would be good.</p>",
        "id": 153856963,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1479203679
    },
    {
        "content": "<p>It would be good to share what each of us have to offer (servers, clients, etc.) and what we would like to accomplish with terminology in the hands on portion for rest of the meeting.  In particular I want to reach out to the other tracks and find out how they are using or how they need to use the FHIR terminology services in the work that they are doing.</p>",
        "id": 153857222,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1479296026
    }
]