[
    {
        "content": "<p>To all participants of the DevDays 2016 profiling track, here you can download the exercises for the profiling workshop: <a href=\"http://bit.ly/2gdKQb2\" target=\"_blank\" title=\"http://bit.ly/2gdKQb2\">http://bit.ly/2gdKQb2</a></p>",
        "id": 153856990,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1479228673
    },
    {
        "content": "<p>Note: The initial Forge BETA release has a bug concerning slicing, so you cannot use it to complete Exercise 4. I've just deployed an update that fixes the bug. If you've already downloaded the Forge BETA release, then please re-download the ZIP file (the size of the new ZIP file is 5.663.142 bytes) and extract in place, overwriting the existing binaries. And if you find any other bugs, please let me know!</p>",
        "id": 153857212,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1479294442
    },
    {
        "content": "<p>We will be doing a Profiling break out session today after lunch in The Muhammad starting at 13:30. We will demonstrate the use of Forge and Simplifier. Everybody is welcome to join!</p>",
        "id": 153857502,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1479381145
    },
    {
        "content": "<p>Correction: David Hay will kick off the profiling break out session in the Richard at 13:30 with a demo of the ClinFhir profiling tool. After about an hour I will take over and demo Forge &amp; Simplifier. All are invited!</p>",
        "id": 153857525,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1479385304
    },
    {
        "content": "<p>and welcome!</p>",
        "id": 153857532,
        "sender_full_name": "David Hay",
        "timestamp": 1479385887
    },
    {
        "content": "<p>moved</p>",
        "id": 153857537,
        "sender_full_name": "Christian Jeppesen",
        "timestamp": 1479387367
    },
    {
        "content": "<p>In the Furore profiling tool, how would a specify a conditional where if it is done, it shall be done this way but it does not have to be done. In my case I am thinking of slicing an identifier which is an array. There shall be one set of codes that is always present. However, one may also use the Bluetooth address as an additional identifier if the device is a BT device. However, if one chooses to add this identifier, it shall be done as specified. </p>\n<p>I know how to write this in standard normative text, but how is it done in profiling. My guess is as follows.</p>\n<div class=\"codehilite\"><pre>Slice the identifier.\n    The discriminator is the system\n    The first identifier is 1...1\n         the system is the IEEE urn\n         the value is an EUI-64 system id\n    The second identifier is 0...1 but the fields in the identifier are defined.\n         the system is some BT urn (though I don&#39;t know what that is yet) \n         the value is the BT address\n    The third identifier is 0...1 but the fields in the identifier are defined.\n         the system is some USB urn (though I don&#39;t know what that is yet) \n         the value is the VID and PID numbers\n</pre></div>",
        "id": 153857922,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1479654208
    },
    {
        "content": "<p>Okay i wanted to delete this entirely and make a new topic but that didn't work either. So now there is a bunch of crap that all looks like one topic. It ain't!</p>",
        "id": 153857923,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1479654447
    },
    {
        "content": "<p>Where does one obtain 'system' values. For example I know that the system specifying IEEE 11073 is urn:</p>\n<div class=\"codehilite\"><pre>urn:iso:std:iso:11073:10101\n</pre></div>\n\n\n<p>Where would I get these for Bluetooth MAC addresses and USB pid and vid identifiers? Do they even exist?</p>",
        "id": 153857924,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1479655028
    },
    {
        "content": "<p>bluetooth: this is what we talked about before:</p>\n<div class=\"codehilite\"><pre> {\n        &quot;use&quot;:&quot;official&quot;,\n        &quot;system&quot;:&quot;http://ietf.org/eui-48&quot;,\n        &quot;value&quot;:&quot;00:3E:42:FF:B2:01&quot;,\n        &quot;assigner&quot;:{\n            &quot;reference&quot;:&quot;Bluetooth SIG&quot;\n        }\n    }\n</pre></div>",
        "id": 153857936,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1479659802
    },
    {
        "content": "<p>I don't think we've ever talked about USB identifiers before</p>",
        "id": 153857937,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1479659817
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span> Did you manage to fix the bug that the beta Forge tool did not save changes, unless you forced it?</p>",
        "id": 153857979,
        "sender_full_name": "Thomas Tveit Rosenlund",
        "timestamp": 1479735082
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192856\">@Thomas Tveit Rosenlund</span> not yet. This week we will try to fix (most of) the bugs that we found during the DevDays. Then we will publish an official new release, which will be announced via Zulip. Stay tuned...</p>",
        "id": 153857981,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1479737485
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191336\">@Michel Rutten</span>  Great, looking forward to it!</p>",
        "id": 153858102,
        "sender_full_name": "Thomas Tveit Rosenlund",
        "timestamp": 1479800953
    }
]