[
    {
        "content": "<p>Active discussion about the difference between regular client ID/secret and certificate-based authentication scenarios at the table now. Join us!</p>",
        "id": 154001515,
        "sender_full_name": "Julie Maas",
        "timestamp": 1538230650
    },
    {
        "content": "<p>How does client authentication work with FHIR Server and OAuth Server when using trusted certificates? Discussing at the table now. Welcome to join us.</p>",
        "id": 154001642,
        "sender_full_name": "Julie Maas",
        "timestamp": 1538233500
    },
    {
        "content": "<p>Would be highly interested in a summary of this discussion!</p>",
        "id": 154001922,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1538239971
    },
    {
        "content": "<p>Ditto. Would be great to compare with the SMART backend service approach (where clients sign JWTs to obtain access tokens, but without explicit dependency on certificate infrastructure).</p>",
        "id": 154001925,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1538240418
    },
    {
        "content": "<p>A lot of the same steps, but with added capability of trust validation (verified network participant, certificate still valid, etc.)  and certificate details validated by some trusted independent 3rd party.</p>",
        "id": 154003213,
        "sender_full_name": "Julie Maas",
        "timestamp": 1538329673
    },
    {
        "content": "<blockquote>\n<p>Ditto. Would be great to compare with the SMART backend service approach (where clients sign JWTs to obtain access tokens, but without explicit dependency on certificate infrastructure).</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>  A lot of the same steps, but with added capability of trust validation (verified network participant, certificate still valid, etc.)  and certificate details validated by some trusted independent 3rd party.</p>",
        "id": 154003217,
        "sender_full_name": "Julie Maas",
        "timestamp": 1538329928
    },
    {
        "content": "<p>I don't understand why those things - which are inherent properties of certificates - are different between the 2 approaches</p>",
        "id": 154003594,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1538392624
    },
    {
        "content": "<p>In one approach, clients to register just say \"here are my public keys,  available at  URL protected by TLS.\" In the other they say \"here is a certificate, generally created by a third-party declaring that these are my keys and also declaring a bunch of other verified attributes about me\"</p>",
        "id": 154003607,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1538396022
    },
    {
        "content": "<p>but the jwks can carry that additional stuff, no?</p>",
        "id": 154003610,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1538397109
    }
]