[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> reading this, I'm confused. These 2 statements seem contradictory:</p>",
        "id": 153926973,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1514069346
    },
    {
        "content": "<ul>\n<li>The expected Track testing will be via HTTP POST Request-Response with the resource, or exchangeable content in the body of the HTTP content.</li>\n<li>The FHIR Client will construct a Eligibility resource. To obtain the EligibilityResponse for the submitted resource via FHIR REST the client with perform a GET on EligibilityResponse with search parameters which may be expected to select the intended response</li>\n</ul>",
        "id": 153926974,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1514069375
    },
    {
        "content": "<p>not that I know what \"or exchangeable content in the body\" means, or what the client does with it's eligibility resource.</p>",
        "id": 153926975,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1514069436
    },
    {
        "content": "<p>then for this:</p>\n<ul>\n<li>The FHIR Client will construct a Claim resource indicating Pre-Authorization. The service will respond with a ClaimResponse indicating only receipt not adjudication of the Claim (Pre-Authorization).</li>\n</ul>",
        "id": 153926976,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1514069465
    },
    {
        "content": "<p>where does the claim resource go? Post to where?</p>",
        "id": 153926977,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1514069482
    },
    {
        "content": "<p>also, can you ask Benoit to sign up here please</p>",
        "id": 153926978,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1514069493
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> I think there are three questions here:<br>\n1) The exchangeable content is the Resource (EligibilityRequest or Bundle containing an EligibilityRequest) - there are being moved from straight HTTP to a $submit operation after this connectathon (isn't sufficient time to implement for this connectathon).<br>\n2) What does the client do with its EligibilityRequest resource? Typically persist it in some manner.<br>\n3) Where does the Claim resource go? It would be POSTed to the insurer.<br>\nSure, I'll be speaking with Benoit later today.</p>",
        "id": 153927003,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1514097507
    },
    {
        "content": "<p>from straight HTTP... a POST to somewhere? anywhere?</p>",
        "id": 153927005,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1514099396
    },
    {
        "content": "<p>the others - maybe the doco could be improved</p>",
        "id": 153927006,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1514099421
    },
    {
        "content": "<p>welcome <span class=\"user-mention\" data-user-id=\"195023\">@Benoit Schoeffler</span></p>",
        "id": 153927011,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1514107880
    },
    {
        "content": "<p>This will be the Zulip topic for the Financial Track (and the KSA Financial Track) beginning with Connectathon 25</p>",
        "id": 209195375,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1599338871
    },
    {
        "content": "<p>We are starting an orientation session of the Financial Track now, 3PM eastern. But will redo at the start of the KSA and North American sessions on Thursday.</p>",
        "id": 209553742,
        "sender_full_name": "Paul Knapp",
        "timestamp": 1599678232
    },
    {
        "content": "<p>Hello everyone,</p>\n<p><span class=\"user-mention\" data-user-id=\"191430\">@Paul Knapp</span> is a link for the Financial Track on Whova ? I missed the introduction session, and want to make sure I attend this coming one please.</p>",
        "id": 209597748,
        "sender_full_name": "Azmi Asali",
        "timestamp": 1599716059
    }
]