[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191968\">@Ioana Singureanu</span> I'm reading this track description, and wondering why DeviceUseStatement doesn't feature in it? Should it? Also, isn't Procedure.focalDevice.action critical? It would be an error if I claimed that a device was implanted to 2 different patients at the same time, right?</p>",
        "id": 153926955,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1514068266
    },
    {
        "content": "<p>Merry Xmas from the Frozen NH, <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> ! <br>\nYou raised several questions:</p>\n<ul>\n<li>Indeed <strong>DeviceUseStatement</strong>  is not applicable; it's supposed to be a suggestion/recommendation from a CDS system  such as <em>\"The patient may benefit from a wheelchair\"</em>.   Our track if focused on documenting the procedure that involves the device.  BTW, I'm not sure why we need <strong>DeviceUseStatement</strong> a hyper-specialized resource for device-related advice.  Perhaps <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>  has an opinion on <strong>DeviceUseStatement</strong> and whether it overlaps too much a  'suggestion card' in CDS-Hooks.  </li>\n<li>The <strong>Procedure.focalDevice.action</strong> is useful and supported but not critical. The <strong>Procedure.code</strong> will identify pretty well the type procedure performed for implant (e.g. pacemaker implant inpatient procedure CPT-4 or HCPCS code). <strong>Procedure.focalDevice.action</strong> is, of course,  \"Supported\" in the profile- it will be reported if available.</li>\n<li>Regarding duplicate implant references in an implant procedures: indeed that would be an error because implants are usually single-use devices. Detecting duplicated UDIs is akin to counterfeit, recal, and out-of-calibration detection. These are all features/capabilities of the the Medical Device Registry (using a additional business rules). You could have multiple Device resource instances for the same device if you are tracking every time a device is detected in a room, for example. There are lot of cool applications of this resource because it could support inventory/materials management.</li>\n</ul>",
        "id": 153926998,
        "sender_full_name": "Ioana Singureanu",
        "timestamp": 1514076778
    },
    {
        "content": "<p>merry xmas from the non-frozen south east of Australia</p>",
        "id": 153927000,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1514090117
    },
    {
        "content": "<ul>\n<li>I think you have DeviceRequest and DeviceUseStatement mixed up - DeviceUseStatement matches MedicationStatement - <em>\"The Patient is using a wheelchair\"</em></li>\n<li>I asked about  Procedure.focalDevice.action because I think it needs a stronger binding. Yes, I think that if you were a really smart system with good terminology support, you could determine from the procedure code and the device code whether the device was used, or implanted (or explanted). Maybe. But why not be explicit - mark that the device was implanted using  Procedure.focalDevice.action.</li>\n</ul>",
        "id": 153927001,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1514090117
    },
    {
        "content": "<p>Please use the SAMHSA OCP Test server for this Connectathon. We tested it and it supports all the searches needed to identity recalled devices, or devices used for a specific purpose.  </p>\n<p><a href=\"https://ocp.consent2share.org/fhir/baseDstu3\" target=\"_blank\" title=\"https://ocp.consent2share.org/fhir/baseDstu3\">https://ocp.consent2share.org/fhir/baseDstu3</a></p>\n<p>You can browse the resources you've created at :<a href=\"https://ocp.consent2share.org/fhir/home?encoding=null&amp;pretty=true\" target=\"_blank\" title=\"https://ocp.consent2share.org/fhir/home?encoding=null&amp;pretty=true\">https://ocp.consent2share.org/fhir/home?encoding=null&amp;pretty=true</a><br>\nIt's basically a HAPI FHIR server using Postgres.</p>",
        "id": 153931093,
        "sender_full_name": "Ioana Singureanu",
        "timestamp": 1517067174
    },
    {
        "content": "<p>The Procedure.code is how we identify whether an implant added or replaced/removed.  This the current situation.. it may change. I agree that an improved terminology would help implementers adopt 'Procedure.focalDevice.action'. Right now it's unclear...</p>\n<blockquote>\n<ul>\n<li>I asked about  Procedure.focalDevice.action because I think it needs a stronger binding. Yes, I think that if you were a really smart system with good terminology support, you could determine from the procedure code and the device code whether the device was used, or implanted (or explanted). Maybe. But why not be explicit - mark that the device was implanted using  Procedure.focalDevice.action.</li>\n</ul>\n</blockquote>",
        "id": 153931099,
        "sender_full_name": "Ioana Singureanu",
        "timestamp": 1517067306
    }
]