[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194993\">@Sandra Vance</span>  and <span class=\"user-mention\" data-user-id=\"223704\">@Mary Ann Boyle</span>   A few of us from different tracks are working on new uses of the Task Resource.  We have found each other by accident, but all agreed it would be helpful to know of all the places where experimentation on the use of the Task Resource is happening.  I created a new Stream, but we would also like to take a more proactive approach to finding others.  During Report-outs, could you ask each group the questions, \"Is your Track doing anything with the Task Resource?\"  and just keep track of which Tracks say yes.  We would use the list you create to reach out and build community around this new area of focus.  Thanks!  Lisa</p>",
        "id": 222803592,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1610669480
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"192205\">Lisa Nelson</span> <a href=\"#narrow/stream/179207-connectathon-mgmt/topic/Report-out.20Request/near/222803592\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"194993\">Sandra Vance</span>  and <span class=\"user-mention silent\" data-user-id=\"223704\">Mary Ann Boyle</span>   A few of us from different tracks are working on new uses of the Task Resource.  We have found each other by accident, but all agreed it would be helpful to know of all the places where experimentation on the use of the Task Resource is happening.  I created a new Stream, but we would also like to take a more proactive approach to finding others.  During Report-outs, could you ask each group the questions, \"Is your Track doing anything with the Task Resource?\"  and just keep track of which Tracks say yes.  We would use the list you create to reach out and build community around this new area of focus.  Thanks!  Lisa</p>\n</blockquote>\n<p>Hi Lisa - I think the best way to do this would be to put it on the Track Lead section of the post connectathon survey and then share the results. Would that work for you?</p>",
        "id": 222804741,
        "sender_full_name": "Sandy Vance",
        "timestamp": 1610670526
    }
]