[
    {
        "content": "<p>ConMan is useful in coordinating testing between systems, particularly in this day of virtual Connectathons. During track kickoffs we mention ConMan and ask participants to register their systems. I personally have entered a number of systems and further set up track information. </p>\n<p>Today, a participant asked for my server information to get set up early and maximize the testing time during the July 21 CMS Connectathon. I was about to point him to ConMan, but noticed that all of the information I added was deleted (I noticed the warning on the main page after I entered the info). This is a bit frustrating as setting the information up is a completely manual process. Is there any way in the future to not have ConMan configuration deleted after the start of the Connectathon kick-offs? This would facilitate early set up before the Connectathon so we can spend on time on actual testing before the event.<br>\nAlso, is there an ETA when we may be able to set up info for next weeks Connectathon?</p>",
        "id": 245890460,
        "sender_full_name": "Corey Spears",
        "timestamp": 1626211067
    },
    {
        "content": "<p>It would also be nice to be able to carry over (or import) track information from previous Connectathons.</p>",
        "id": 245897360,
        "sender_full_name": "Corey Spears",
        "timestamp": 1626215055
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span></p>",
        "id": 245897892,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1626215449
    },
    {
        "content": "<p>Actually working on that ATM. I've got a separate app that generates a config file that I can use to populate different events. Sorry I obliterated your stuff - if you re-enter it, I promise not to wipe it out again - and will copy to my config file for next time! Just remind me which track?</p>\n<p>And also interested in your thoughts on servers. I did think about copying across the servers between events, but decided not to as I thought they might be event specific. Is that right? Perhaps I need a checkbox on the server that states 'copy to the next event'?</p>\n<p>Kinda wondering if tracks should be 'persistent' across events TBH...</p>",
        "id": 245926021,
        "sender_full_name": "David Hay",
        "timestamp": 1626246171
    },
    {
        "content": "<p>Thanks David. <br>\nI am assisting on Da Vinci Patient Access API, CARIN BlueButton, and to a lesser extent PACIO Re-assessment Timepoints.</p>\n<p>Some tracks are exploratory and short lived after the exploration is complete. Many tracks however follow an IG through its balloting lifecycle. These are fairly persistent. Sometimes the track tests change due to sizable changes in the specification. Sometimes they do not change very much even if there are notable changes in the spec (e.g. technically focused changes). This may depend on how detailed the tests are written. In either event, much of the configuration carries over.</p>\n<p>As far as servers are concerned, it may vary a bit more. I manage Reference Implementation Servers that are very consistent. So are my online app client reference implementations. A fair number of participants involved in the tracks I assist also have a fairly consistent configuration across Connectathons. I can imagine others may be event specific.</p>",
        "id": 245965418,
        "sender_full_name": "Corey Spears",
        "timestamp": 1626272053
    },
    {
        "content": "<p>So what I'll do is to let you guys update the CMS connectathon manually from now on, and then when the event is over I'll pull out all the tracks and associated scenarios - and maybe the servers / Implementation Guides associated with them - and add them to the separate config file that I can subsequently use to populate subsequent events - like the HL7 ones. I'll won't pull out the users and results (but they will always remain with the event anyway).</p>\n<p>Then, for the next event (the September CT), track leads can request that their track be 'pre-populated' from the CMS one. They can subsequently make changes online and I'll repeat the process at the end. </p>\n<p>That way we'll have a 'rolling' set of configuration that will help track leads in setup.</p>\n<p><span class=\"user-mention\" data-user-id=\"194993\">@Sandra Vance</span> - does that seem a reasonable approach to you? We could include the tracks from the May connectathon in this as well. And perhaps add a flag to the confluence track page to request the 'pre-population'...  It will also be important for the tracks to reference the IG's they're testing and the servers they're using so I can pull those across between events..  We'll also need to be quite explicit about the date that a new event is set up can can be edited by track leads without the issues that Corey faced.</p>",
        "id": 245996848,
        "sender_full_name": "David Hay",
        "timestamp": 1626285694
    }
]