[
    {
        "content": "<p>Terminology server available here for value set validation:  <a href=\"https://fhir-terminology-demo.e-imo.com/api/v1\" target=\"_blank\" title=\"https://fhir-terminology-demo.e-imo.com/api/v1\">https://fhir-terminology-demo.e-imo.com/api/v1</a>    user id&amp;password     \"connectathon\" / \"WCGkKDTVBviSCYIYxX1GFAq0TefZyjkT\"</p>",
        "id": 154001367,
        "sender_full_name": "Carmela Couderc",
        "timestamp": 1538227550
    },
    {
        "content": "<p>Thanks, Carmela.  For everyone, we want to have all of the available servers listed in the ConMan tool, so if you haven't done  that yet please go ahead and do so.  And if you haven't signed up yourself as a track participant, please do that, too.  Also, if your server isn't listed on the <a href=\"http://wiki.hl7.org/index.php?title=201809_Terminology_Services_Track\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=201809_Terminology_Services_Track\">track Wiki page</a> let me know that and we'll get it added.</p>",
        "id": 154001438,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1538228810
    },
    {
        "content": "<p>FYI, we (NMDP) are in the process of inventing a new code system for nomenclature-level HLA (and KIR) data.  The main purpose of the new code system is to add a compositional grammar to established standard nomenclatures.  These nomenclatures are important for transplantation scenarios, to describe donor and recipient tissue types.  A (currently draft) web site describing the Genotype List String Code (GLSC) code system is here:</p>\n<p><a href=\"https://glstring.org/\" target=\"_blank\" title=\"https://glstring.org/\">https://glstring.org/</a></p>\n<p>Review and comments on the code system and web site content/narrative would be appreciated.</p>",
        "id": 154002101,
        "sender_full_name": "Joel Schneider",
        "timestamp": 1538248183
    },
    {
        "content": "<p>Thanks, Joel.  Have you represented this in FHIR yet?  I'm assuming it's going to be a code system supplement?</p>",
        "id": 154002136,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1538249035
    },
    {
        "content": "<p>I think it would be a new code system.  The rationale being that adding a grammar to an established code system effectively adds new valid codes to the system.  So, not just a supplement.</p>",
        "id": 154002142,
        "sender_full_name": "Joel Schneider",
        "timestamp": 1538249189
    },
    {
        "content": "<p>But this would be a new code system that uses codes that are defined and imported from other code systems (with those other code systems being the source of truth).  I don't think that we've defined a way to do anything quite like that.</p>",
        "id": 154002237,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1538252602
    },
    {
        "content": "<p>We don't have to define a way to do that - it's a CodeSystem</p>",
        "id": 154002241,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1538252704
    },
    {
        "content": "<p>The fact it leverages other code systems in its grammer doesn't matter.</p>",
        "id": 154002243,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1538252721
    },
    {
        "content": "<p>It's just like the ISO language code system draws on the country code system.  That doesn't manifest in any way over the wire.</p>",
        "id": 154002245,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1538252741
    }
]