[
    {
        "content": "<p>Dear colleague,</p>\n<p>You will doubtless be aware that the May Working Group Meeting will not be going ahead, and that HQ has asked the FHIR Management Group (FMG)  to determine the feasibility for hosting a virtual connectathon. </p>\n<p>We’re imagining that the people who would be interested in such an event are those that have the need of a connectathon to advance their projects - such as an Implementation Guide or part of one of the FHIR related  specifications. We’re unsure that streams like the Patient track which have more of a training focus would be of interest - but happy to be convinced that they would be.</p>\n<p>With regard to the format - again we’re open to suggestions, but are envisaging an event that would extend over 2-3 days - starting around 3 or 4PM EST and ending at the same time. This would be equally inconvenient for most attendees!</p>\n<p>We'd have a zoom meeting open throughout that time for full group activities - and which people could potentially schedule for individual chats (a la breakout rooms) plus the usual chat / conMan app as required. The welcome and close events would be held around 3PM.  Of course, many of the groups would have access to their own zoom channels (or the equivalent). The FHIR chat would be available as usual - with a separate ‘announcement’ stream for group issues.</p>\n<p>With regard to cost - we're looking at around $100 for the event - the cost of running is obviously much lower than the usual 'face-to-face' event.</p>\n<p>So are there groups that would be interested in participating in such an event? Any modifications or suggestions that you may have? Either use this chat stream  (preferred) or email Lloyd or myself to discuss.</p>\n<p>Many thanks...</p>",
        "id": 192137258,
        "sender_full_name": "David Hay",
        "timestamp": 1585422541
    },
    {
        "content": "<p>.. starts at 3Pm on day 1, ends at 3 PM on day 3. So that's a 72-hour continuous connectathon, 24 hours a day?  (you probably didn't intend to say that, or perhaps you did :-) )</p>",
        "id": 192160798,
        "sender_full_name": "René Spronk",
        "timestamp": 1585466447
    },
    {
        "content": "<p>Yep - 2-3 days in a row...  The assumption is that people will come in and out over that time as timezones (and other commitments) permit...</p>",
        "id": 192161639,
        "sender_full_name": "David Hay",
        "timestamp": 1585468123
    },
    {
        "content": "<p>yeah. sleep is for losers...</p>",
        "id": 192165121,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1585473972
    },
    {
        "content": "<p>No hotel staff to make us leave this time :)</p>",
        "id": 192183268,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1585500417
    },
    {
        "content": "<p>In case it is helpful to anyone, here is the list of three currently proposed tracks (before the connectathon went virtual): <a href=\"https://confluence.hl7.org/display/FHIR/2020-05+Connectathon+24\" title=\"https://confluence.hl7.org/display/FHIR/2020-05+Connectathon+24\">https://confluence.hl7.org/display/FHIR/2020-05+Connectathon+24</a></p>",
        "id": 192253169,
        "sender_full_name": "Jason Walonoski",
        "timestamp": 1585574094
    },
    {
        "content": "<p>I know there are plans for a Subscriptions track which haven't been posted yet.</p>\n<p>I worry the list isn't too representative, between the changing state of the meeting and all the COVID work.</p>",
        "id": 192274670,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1585583045
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191321\">David Hay</span> <a href=\"#narrow/stream/179207-connectathon-mgmt/topic/Virtual.20May.20connectathon/near/192161639\" title=\"#narrow/stream/179207-connectathon-mgmt/topic/Virtual.20May.20connectathon/near/192161639\">said</a>:</p>\n<blockquote>\n<p>The assumption is that people will come in and out over that time as timezones (and other commitments) permit...</p>\n</blockquote>\n<p>One of the advantages of the non-virtual connectathon is that everyone is present and (mostly) available for conversations during the same period of time.  If you have people dropping in and out over a 24-hour period, and managing other commitments, I am not sure it will work as well.  I would rather shift my sleep schedule for a couple of days and be present when everyone else is.</p>\n<p>That said, I do plan to participate whatever the format.</p>",
        "id": 192406804,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1585669108
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"195344\">Paul Lynch</span> <a href=\"#narrow/stream/179207-connectathon-mgmt/topic/Virtual.20May.20connectathon/near/192406804\" title=\"#narrow/stream/179207-connectathon-mgmt/topic/Virtual.20May.20connectathon/near/192406804\">said</a>:</p>\n<blockquote>\n<p>I would rather shift my sleep schedule for a couple of days and be present when everyone else is.</p>\n</blockquote>\n<p>It just occurred to me that the 'other commitments' might not be work commitments, but family commitments (e.g. kids in school), and there could be a significant number of people who would unable to shift their sleep schedule as I just suggested.  This is probably the reason for the format.</p>",
        "id": 192407857,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1585669514
    },
    {
        "content": "<p>We would certainly be interested in participation, maybe we could experiment with not having all sessions in parallel so it would be easier to join different tracks.</p>",
        "id": 193233138,
        "sender_full_name": "Bas van den Heuvel",
        "timestamp": 1586286315
    },
    {
        "content": "<p>Sleep schedule is a highly timezone related topic - a overlap that works for all (AU, US, EU) will be hard to find.</p>",
        "id": 193233286,
        "sender_full_name": "Bas van den Heuvel",
        "timestamp": 1586286391
    },
    {
        "content": "<p>The 'sweet spot' for 90 min WGM calls (Americas, Europe &amp; Australasia)  is around 4pm EST. For the purposes of a Connectathon, that may be the optimal time for event opening and closing sessions - but thereafter there is no one &gt;8 hour time slot that will suit everyone, so I think that the 'continuous' mode is the only viable option.</p>",
        "id": 193265816,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1586306819
    }
]