[
    {
        "content": "<p>I'm working on a HAPI server and trying to add the _count parameter to a search endpoint. I can take it in as an input parameter, and handle it inside my code, but it isn't added back into the resultant searchset bundle when the result gets marshalled from the collection I return. Is there another way I should be trying to do this?</p>",
        "id": 153827143,
        "sender_full_name": "Jim Steel",
        "timestamp": 1463017971
    },
    {
        "content": "<p>Hi Jim- Where is is missing in the result? Do you mean like it's not showing up in the self link?</p>",
        "id": 153827277,
        "sender_full_name": "James Agnew",
        "timestamp": 1463061695
    },
    {
        "content": "<p>the spec page is really vague, but says \"The server should repeat the original _count parameter in its returned page links\". I was kind of expecting to see it alongside \"total\" in the bundle that comes back. (Not sure if that's right)</p>",
        "id": 153827615,
        "sender_full_name": "Jim Steel",
        "timestamp": 1463093034
    },
    {
        "content": "<p>Well, the general idea here is that the server isn't required to include <code>_count</code> in the links, but one way or the other it should return pages that are the same size as the ones the client originally asked for.</p>\n<p>I do see the count param coming back in the self/paging links though, which is how HAPI satisfies this requirement: <a href=\"http://fhirtest.uhn.ca/baseDstu2/_history?_count=5\" target=\"_blank\" title=\"http://fhirtest.uhn.ca/baseDstu2/_history?_count=5\">http://fhirtest.uhn.ca/baseDstu2/_history?_count=5</a></p>",
        "id": 153827616,
        "sender_full_name": "James Agnew",
        "timestamp": 1463093247
    },
    {
        "content": "<p>ah</p>",
        "id": 153827617,
        "sender_full_name": "Jim Steel",
        "timestamp": 1463093270
    },
    {
        "content": "<p>oh, i see</p>",
        "id": 153827618,
        "sender_full_name": "Jim Steel",
        "timestamp": 1463093376
    },
    {
        "content": "<p>thanks :)</p>",
        "id": 153827619,
        "sender_full_name": "Jim Steel",
        "timestamp": 1463093401
    },
    {
        "content": "<p>np! :)</p>",
        "id": 153827620,
        "sender_full_name": "James Agnew",
        "timestamp": 1463093424
    },
    {
        "content": "<p>hmm, still not sure how to handle this. If I capture it as an @Count parameter in my provider, then I can use the value when I process the search, but then (a) the \"total\" value in the result is the total returned rather than the total matched, and (b) the _count parameter disappears from the self link</p>",
        "id": 153827624,
        "sender_full_name": "Jim Steel",
        "timestamp": 1463096379
    },
    {
        "content": "<p>Oh- you're right! It looks like if you have a parameter with <code>@Count</code> on it, the server ignores the URL parameter entirely. That is a bug for sure. I'm just testing a fix, will commit shortly.</p>",
        "id": 153827864,
        "sender_full_name": "James Agnew",
        "timestamp": 1463181293
    }
]