[
    {
        "content": "<p>We currently import data via bundle into our HAPI server using the \"?identifier\" syntax and PUT. The problem: When sending the bundle, resources do not yet exist on the FHIR server which reference some of the resources. <br>\nProminent example: KdsMedikationsModul. The bundle basically contains the resources Medication, MedicationAdministration and MedicationStatement. MedicationAdministration and MedicationStatement reference Medication.Since the entry order in the processing on the server is random (?), it can of course happen that MedicationAdministration is processed first, at a time when Medication does not yet exist. </p>\n<p>The first error message reads: <br>\n\"Invalid match URL \\\"Medication?identifier=55555\\\" - No resources match this search\". <br>\n(when re-executing / or trying to perform a batch operation, messages like \"ConstraintViolentException\" appear).</p>\n<p>Is there a solution for this and is this a HAPI specific problem at all? I have attached a minimal example and it would be good if one of the experts could answer me whether this can work at all. <br>\nOne solution, of course, would be to disassemble the bundle, separate it by resources and run it separately, but that would be anything but a nice solution. <a href=\"/user_uploads/10155/Od88dbzKUK7k31m1Tq8czTTG/MedicationPUT_Example.json\">MedicationPUT_Example.json</a></p>",
        "id": 230342920,
        "sender_full_name": "David Meyers",
        "timestamp": 1615814637
    },
    {
        "content": "<p>I think you can temporarily disable referential integrity when starting the server up in <code>application.yaml</code>. Specifically, these keys (are they called keys?). Relevant <a href=\"https://smilecdr.com/docs/configuration_categories/fhir_configuration.html\">docs here</a>.</p>\n<div class=\"codehilite\"><pre><span></span><code># allow_external_references: true\nallow_placeholder_references: true\nenforce_referential_integrity_on_delete: false\nenforce_referential_integrity_on_write: false\n</code></pre></div>\n<p>Example yaml <a href=\"https://github.com/hapifhir/hapi-fhir-jpaserver-starter/blob/master/src/main/resources/application.yaml\">here</a></p>\n<p>I could be wrong though, I'm barely scratching the surface of HAPI and FHIR. I hope this helps :)</p>",
        "id": 230479280,
        "sender_full_name": "Dexter",
        "timestamp": 1615885292
    },
    {
        "content": "<p>thx for that advice <span class=\"user-mention\" data-user-id=\"359486\">@Dexter</span> <br>\nWeve tried this out, but unfortunately the issue type is still the same.</p>",
        "id": 230519127,
        "sender_full_name": "David Meyers",
        "timestamp": 1615904230
    }
]