[
    {
        "content": "<p>I'd like to have my HAPI server validate the codeable concepts coming in. I noticed that even with the StrictErrorHandler (which handles everything I wanted but this) that Codeable concepts can have any free text submitted in the system/code fields. I'd like to validate that the incomming system and code exists, including NCI/SNOMED/ICD9&amp;10/LNC/and some others. I noticed a class called <code>FhirResourceDaoValueSetDstu3</code> that looks like it contains code similar to what I'd want, but I have not figured out how to use it exactly.</p>\n<p>Do I need to write my own validator for hapi that checks the system/code combos, or is there one already built somewhere?</p>",
        "id": 153904228,
        "sender_full_name": "Joshua Bell",
        "timestamp": 1504203180
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194330\">@Joshua Bell</span>, did you look at <a href=\"http://hapifhir.io/doc_validation.html\" target=\"_blank\" title=\"http://hapifhir.io/doc_validation.html\">http://hapifhir.io/doc_validation.html</a> ?</p>",
        "id": 153904233,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1504209053
    },
    {
        "content": "<p>Just now getting time to revisit this <span class=\"user-mention\" data-user-id=\"191393\">@Igor Sirkovich</span>  - I have read the validation docs there pretty thoroughly. At this point from what I can tell all the resource validation is within the scope of the validator, and I haven't been able to figure out how to make it global to all actions.<br>\nThe parser validator does what I expect it to do: I can set it to the global context and on all posts etc it will run the StrictErrorHandler.<br>\nBut all of the resource validation examples simply create a validator and then run it on a single/batch of resources known in the scope of that code. I haven't been able to figure out how to set it up to work across all resources.</p>\n<p>Maybe I am getting some validation but not the validation I am looking for, not completely sure. I expect that if I have a Coding with a system and code, that if the code is invalid (like I put some random characters in it) - I want it to fail the posting of that resource. I'd like this set up with all the main code systems like SNOMED, NCI, etc...</p>",
        "id": 153917329,
        "sender_full_name": "Joshua Bell",
        "timestamp": 1509638366
    }
]