[
    {
        "content": "<p>I’m trying to create a Restful server using HAPI-FHIR. </p>\n<p>I have profiled the Medication resource and I’ve created the instances that I want served from the server. I’m running a HAPI-FHIR Restful server with no customization, and can write those resource instances to it. I also know what I want my capability statement to look like.</p>\n<p>I’m trying to understand how to constrain that FHIR server to support only my profiled resources and the operations defined in my capability statement. </p>\n<p>For instance, I only want to be able to upload Medication resources that conform to my profiled Medication resource. And I want to restrict which operations can be run against those Medication resources. I can’t find any examples of how to continue using the default persistence functionality of the JPA server, but simply constrain which of those operations can be used.</p>\n<p>I've tried making a resource provider and I recognize I can constrain the operations available for it through annotations, but then I couldn't find any examples where the ResourceProvider functions were actually implemented to use the persistence mechanism that the an un-customized server uses. I also tried subclassing JpaResourceProviderDstu3, but then my CapabilityStatement logically reflects that all of the standard operations are supported. </p>\n<p>Thanks in advance for any direction you can provide me!</p>",
        "id": 153948762,
        "sender_full_name": "Cameron Bell",
        "timestamp": 1522258533
    },
    {
        "content": "<p>Create a Medication resource provider and override the Create and Update operations found in the <a href=\"http://hapifhir.io/xref-jpaserver/ca/uhn/fhir/jpa/provider/dstu3/JpaResourceProviderDstu3.html\" target=\"_blank\" title=\"http://hapifhir.io/xref-jpaserver/ca/uhn/fhir/jpa/provider/dstu3/JpaResourceProviderDstu3.html\">JpaResourceProvider</a> parent class.</p>",
        "id": 153948766,
        "sender_full_name": "Christopher Schuler",
        "timestamp": 1522260227
    },
    {
        "content": "<p>Thanks! I'm able to override those operations, but for instance, the JpaResourceProvider parent class implements the delete operation. From my subclass, is there a way I can prevent that delete operation from being available? I can override the delete function and do nothing, but the generated conformance statement still shows the delete operation. Is there a way to annotate that an operation should be removed?</p>",
        "id": 153948789,
        "sender_full_name": "Cameron Bell",
        "timestamp": 1522267086
    },
    {
        "content": "<p>No problem. Here is a <a href=\"http://hapifhir.io/doc_rest_server.html#Enhancing_the_Generated_Conformance_Statement\" target=\"_blank\" title=\"http://hapifhir.io/doc_rest_server.html#Enhancing_the_Generated_Conformance_Statement\">reference</a> that should help with that. For your use, you would extend the <a href=\"http://hapifhir.io/xref-jpaserver/ca/uhn/fhir/jpa/provider/dstu3/JpaConformanceProviderDstu3.html\" target=\"_blank\" title=\"http://hapifhir.io/xref-jpaserver/ca/uhn/fhir/jpa/provider/dstu3/JpaConformanceProviderDstu3.html\">JpaConformanceProviderDstu3</a>.</p>",
        "id": 153948924,
        "sender_full_name": "Christopher Schuler",
        "timestamp": 1522287187
    },
    {
        "content": "<p>Are you doing RESTful server or the JPA one? We used restful and created our own providers, the default conformance provider then only showed the operations we had implemented.</p>",
        "id": 153949902,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1522699312
    },
    {
        "content": "<blockquote>\n<p>Are you doing RESTful server or the JPA one? We used restful and created our own providers, the default conformance provider then only showed the operations we had implemented.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"195516\">@Cameron Bell</span> if you validate instances that adhere to your profiles and then persist, you are indeed only serving your profiled instances.</p>",
        "id": 153950226,
        "sender_full_name": "Joel Francis",
        "timestamp": 1522770140
    }
]