[
    {
        "content": "<p>Our contained valueset(s) are being dropped when the questionnaire resource is created in our FHIR server (HAPI R4 version 5.0.2), whether pasted directly into the CRUD operations tab or sent as a POST via Postman. I get back a 201 Created response, so everything appears to have happened correctly. The questionnaire resource looks fine in our HAPI server, except it is missing the contained valueset(s).</p>\n<p>The contained valueset(s) are not dropped when the same questionnaire resource is loaded into <a href=\"http://hapi.fhir.org\">hapi.fhir.org</a> (see for example <a href=\"http://hapi.fhir.org/baseR4/Questionnaire/2736623\">http://hapi.fhir.org/baseR4/Questionnaire/2736623</a>)</p>\n<p>Is there something wrong with our HAPI server?   Is there anything that I should look at in the conformance statement?</p>",
        "id": 266895136,
        "sender_full_name": "Diane",
        "timestamp": 1641354842
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"237340\">@Diane</span> start by updating your local HAPI FHIR server. The community can deliver you the best kind of support if you are on the latest released version of the framework</p>",
        "id": 266912733,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1641374274
    },
    {
        "content": "<p>Yes. That makes sense.   When we installed our HAPI FHIR initially, we got stuck for several weeks with no progress.  Our team has software developers but no one with Java or server expertise. We finally had to engage a 3rd party to create a cloud image for us in Docker.   Is the upgrade similar in difficulty to a new install?   If so, we may have to get the 3rd party back.  We run the JPA Server.  Is this the upgrade process <a href=\"https://hapifhir.io/hapi-fhir/docs/server_jpa/upgrading.html\">https://hapifhir.io/hapi-fhir/docs/server_jpa/upgrading.html</a>  or does that only upgrade the JPA  but not the HAPI?    Since our project is a demo only (with no real data), should we just do a clean install of the lastest version?  Would that be easier?</p>",
        "id": 267006484,
        "sender_full_name": "Diane",
        "timestamp": 1641425123
    },
    {
        "content": "<p>HAPI FHIR is already distributed as a docker image at <a href=\"https://hub.docker.com/r/hapiproject/hapi\">https://hub.docker.com/r/hapiproject/hapi</a></p>",
        "id": 267006665,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1641425236
    },
    {
        "content": "<p><a href=\"https://hapifhir.io/hapi-fhir/docs/server_jpa/upgrading.html\">https://hapifhir.io/hapi-fhir/docs/server_jpa/upgrading.html</a> documents the process for migrating the database from previous versions to newer versions</p>",
        "id": 267006802,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1641425315
    },
    {
        "content": "<p>You'll have to do the database migration if you would like the data to survive when using newer versions of the HAPI FHIR server</p>",
        "id": 267006958,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1641425412
    }
]