[
    {
        "content": "<p>Hi, I'm wondering if anyone can help me with an issue I'm having testing out custom search parameters.  I've recently updated to 2.3 and have put together a test situation to attempt to create a custom search parameter and use it.</p>\n<p>In the scenario, I've created a profile on observation, and two extensions to go with it, it represents a blood pressure reading (this is not important, it's just a simple test case).  I upload them, then upload a search parameter to search for the systolic reading.  Finally I upload the data, which contains three resources, each with an integer value for the systolic reading.</p>\n<p>The problem I'm having is, if I set the search parameters type to 'number', the server returns 'Failed to call access method' when I attempt to upload the data.  If I change it's type to token, I can upload the data, and I can search on it, but obviously I then can't perform &gt; or &lt; searches.  We've tested changing it to all other codes on the recommended list and all others fail.</p>\n<p>This seems like a bug, but I just wanted to check here and see if anyone might have an idea what's wrong?</p>\n<p>Here's a link to the data, to replicate what I've done, upload profiles.xml (bundle), searchParameter.json (single resource), data.xml (bundle): <a href=\"https://www.dropbox.com/s/9945v2y0febfcri/TestData.zip?dl=0\" target=\"_blank\" title=\"https://www.dropbox.com/s/9945v2y0febfcri/TestData.zip?dl=0\">https://www.dropbox.com/s/9945v2y0febfcri/TestData.zip?dl=0</a></p>\n<div class=\"message_inline_ref\"><a href=\"https://www.dropbox.com/s/9945v2y0febfcri/TestData.zip?dl=0\" target=\"_blank\" title=\"TestData.zip\"><img src=\"https://cfl.dropboxstatic.com/static/images/icons128/page_white_compressed.png\"></a><div><div class=\"message_inline_image_title\">TestData.zip</div><desc class=\"message_inline_image_desc\"></desc></div></div>",
        "id": 153885752,
        "sender_full_name": "Andrew Broadbent",
        "timestamp": 1493046217
    },
    {
        "content": "<p>Hey just giving this another nudge.  Is there anyone who I could discuss search parameters with?  It's pretty critical to our application and we're hitting this error very frequently right now.</p>",
        "id": 153886161,
        "sender_full_name": "Andrew Broadbent",
        "timestamp": 1493218097
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span> - for you to follow up</p>",
        "id": 153886267,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1493275624
    }
]