[
    {
        "content": "<p>We’re leveraging the Migrator in the hapi-fhir-jpaserver-migrate project to migrate a HAPI FHIR version 4.1.0 database to a 5.2.0 database. There are a few tasks that need to be skipped in order to complete the conversion successfully. We made no modifications to the 4.1.0 schema. It looks to be related to dropping constraints. In all the cases the original constraint (create unique index …) was mapping to one or a set of columns on the table. The new constraint of the same name added a column or columns.</p>\n<p>For us, the following tasks had to be skipped:</p>\n<p>5_1_0.20200910.2<br>\n5_1_0.20200923.3<br>\n5_1_0.20201028.2</p>\n<p>Any insights would be appreciated.</p>\n<p>Thanks.</p>",
        "id": 222135696,
        "sender_full_name": "Joe Atterberry",
        "timestamp": 1610145815
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span></p>",
        "id": 222159543,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1610178863
    },
    {
        "content": "<p>Hmm, these are all tasks that drop indexes and as you point out it's mostly just because new indexes will be created with additional columns.</p>\n<p>Why did you have to skip them? Can you just manually drop the unwanted indexes?</p>",
        "id": 222183100,
        "sender_full_name": "James Agnew",
        "timestamp": 1610217393
    },
    {
        "content": "<p>If I don't skip them, I get a non existent index error even though the index is there.  I'm on a Mac using Oracle XE in a Docker container.  It's pretty repeatable.  I just start up the jpa server and allow the database to be created.  I run the migrator and I get the following for the first constraint:</p>\n<p>Caused by: org.springframework.jdbc.UncategorizedSQLException: PreparedStatementCallback; uncategorized SQLException for SQL [ALTER TABLE TRM_CONCEPT_MAP DROP CONSTRAINT IDX_CONCEPT_MAP_URL]; SQL state [72000]; error code [2443]; ORA-02443: Cannot drop constraint  - nonexistent constraint<br>\n; nested exception is java.sql.SQLException: ORA-02443: Cannot drop constraint  - nonexistent constraint</p>",
        "id": 222198080,
        "sender_full_name": "Joe Atterberry",
        "timestamp": 1610240267
    },
    {
        "content": "<p>Update:  This now looks like a database issue.  </p>\n<p>I had two schemas in the Oracle XE instance with the identical structure as generated by starting up the JPA server.  My plan was to leave one schema as is and use the other to apply the migration and then do some comparisons.  The first schema was always there when I introduced the second identical schema and the migration on the second always failed.  Once I removed the second identical schema and applied the migration to the first schema it worked fine.  I have now created two instances of Oracle XE and will do the comparisons that way.</p>",
        "id": 222598588,
        "sender_full_name": "Joe Atterberry",
        "timestamp": 1610552173
    }
]