[
    {
        "content": "<p>Working with the Java data types, I'm noticing quite a bit of unexpected behavior when manipulating dates.</p>\n<ol>\n<li>copy() doesn't behave as expected with respect to string value.</li>\n<li>Making any changes to the date value reverts the string representation to the system default time zone.</li>\n<li>Data arithmetic using calendar units doesn't appear to be behaving as expected.<br>\nThis is all with the HAPI 4.0.1 data types, but I know some of these bugs have been around for a bit.</li>\n</ol>",
        "id": 184834355,
        "sender_full_name": "Keith Boone",
        "timestamp": 1578201398
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span></p>",
        "id": 184847171,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1578227645
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191387\">@Keith Boone</span> these sound like bugs but i'm not sure i understand any of them exactly.. are you able to provide test cases?</p>",
        "id": 184856074,
        "sender_full_name": "James Agnew",
        "timestamp": 1578243705
    },
    {
        "content": "<p>Yes, they are bugs, and yes I can provide test case, and will file them.</p>\n<p>In first case, load a date as string using a TZ different from your local default.  Change the precision, or set it exact same time from Date value , or use add function to change the value.  Note a different value.</p>\n<p>In next case, make a copy of the date using copy() method.  Print string values of original and copy.  They should be equal but are not.</p>",
        "id": 184927340,
        "sender_full_name": "Keith Boone",
        "timestamp": 1578332043
    },
    {
        "content": "<p>Ah yeah, that one is known... Comes down to the use of a java Date object as the underlying data structure. We picked that back when we were still supporting Java 6. </p>\n<p>We really ought to replace that Date with a javax.time.Instant now that we're on Java 8. That's a painful change though...</p>",
        "id": 184939719,
        "sender_full_name": "James Agnew",
        "timestamp": 1578340403
    }
]