[
    {
        "content": "<p>We have a use case of Case Managers who start patient discharge planning from the moment they are admitted. This process includes identifying anticipated/planned discharge dates, locations to discharge to, barriers to discharge, Coverage (insurance), social status (homelessness / poverty), transportation etc. As you can see this can involve multiple parties and is a constantly evolving case.</p>\n<p>Any idea on what is the best Resource or resources that can be leveraged to implement this use case?</p>",
        "id": 197749591,
        "sender_full_name": "dsh",
        "timestamp": 1589575089
    },
    {
        "content": "<p>In this situation isn't it we have to leverage the existing the existing encounter resource?</p>",
        "id": 197891123,
        "sender_full_name": "Vibin_chander",
        "timestamp": 1589780450
    },
    {
        "content": "<p>If ending up creating the new resource is a solution then it becomes more like V2</p>",
        "id": 197891154,
        "sender_full_name": "Vibin_chander",
        "timestamp": 1589780517
    },
    {
        "content": "<p>Interesting questions, but:</p>\n<ol>\n<li>This is the hapi stream, the question belongs to implementers</li>\n<li>Seeing the huge amount of implementing questions, would it make sense to divide into domain specific substreams, eg. Implementers/adt?</li>\n<li>Looking at v2 and v3 is a good idea</li>\n<li>It must be realized by a combibation of resource updates, eg patient, encounter,...</li>\n<li>Not sure, whether the encounter resource definition is correct/appropriate?! It should be more like in c3...</li>\n</ol>",
        "id": 197895767,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1589785028
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191549\">@Frank Oemig</span> I just moved this conversation to Implementers stream</p>",
        "id": 197899145,
        "sender_full_name": "dsh",
        "timestamp": 1589787099
    },
    {
        "content": "<p>May be you can checkout the CarePlan resource? Just see if you can leverage it</p>",
        "id": 197954411,
        "sender_full_name": "Keerthivasan Ramanathan",
        "timestamp": 1589817057
    },
    {
        "content": "<p>As I don't think it is wise to discuss the same issue in two streams, please see discussion here: <a href=\"#narrow/stream/179166-implementers/topic/Discharge.20Planning\">https://chat.fhir.org/#narrow/stream/179166-implementers/topic/Discharge.20Planning</a>. As this is not HAPI-specific, I'd prefer to lead the discussion there. Thanks.</p>",
        "id": 197965914,
        "sender_full_name": "Mareike Przysucha",
        "timestamp": 1589821825
    }
]