[
    {
        "content": "<p>When escaping the character ampersand (&amp;) in an address, the json seems right(i.e., \"&amp; a m p ;\") but the xml shows \"&amp; a m p ; a m p ;\"(here, extra spacebars for displaying it correctly, and actually there are no such spacebars).  Is that right?</p>",
        "id": 267552929,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1641891450
    },
    {
        "content": "<p>My Environment: HAPI-FHIR/5.1.0 (FHIR Client; FHIR 4.0.1/R4; apache)</p>",
        "id": 267553059,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1641891507
    },
    {
        "content": "<p>why would you escape it in the JSON representation?</p>",
        "id": 267579409,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1641907274
    },
    {
        "content": "<p>The resource was constructed with the IGeneticClient (See <a href=\"https://hapifhir.io/hapi-fhir/docs/client/examples.html\">https://hapifhir.io/hapi-fhir/docs/client/examples.html</a>). The JSON and XML instance are both representations of the same result.  Without escaping, the script would fail with an error/exception.</p>",
        "id": 267584300,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1641909597
    },
    {
        "content": "<p>What you see would appear to be the xml escaping a json blob (containing json escaping). Which if you want xml to contain json blobs it would be correct. Generally you'd take your source data and escape it one time into the desired format and for a different format you'd start at source (not the previous serialization). Perhaps you have a json deserialize xml serialize process that doesn't un-escape the json before it escapes the data for xml?</p>\n<p>Perhaps as stated it shouldn't have been escaped in the json to begin with?</p>",
        "id": 267595372,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1641914047
    },
    {
        "content": "<p>When creating and submitting such an instance, there is no explicit setting(s) to use JSON or XML.  At least, the error/exception would be thrown out when trying to generate the XHML narrative.</p>",
        "id": 267658962,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1641941991
    }
]