[
    {
        "content": "<p>We want to setup a HAPI FHIR / JPA Server. It works quite well but now I am stuck. We want to use only a small number of resource types (Patient, DiagnosticReport, Bundle) but we must adopt them. Following requirements do we have:</p>\n<p>(1) Extend Patient by a subclass (GbaPatient) and profile<br>\n(2) Extend DiagnosticReport by a subclass (GbaDiagnosticReport) and profile<br>\n(3) Having a link from MyPatient to a list of MyDiagnosticReport<br>\n(4) Having a searchparameter \"report\" corresponding to this link</p>\n<p>What exactly must I implement? Is there a documentation describing this scenario or even a repo where I can find an answer?</p>\n<p>Thank you in advance!</p>\n<p>PS: So far I have implemented the subclasses includig an extension field of type List&lt;Reference&gt; and a searchparameter. Moreover, I have implemented IResourceProviders as subclasses of JpaResourceProviderDstu3.However, the searchparameter is ignored.</p>",
        "id": 154020497,
        "sender_full_name": "Björn Kroll",
        "timestamp": 1542900540
    },
    {
        "content": "<p>Hi Björn, normally you don't have to extend/ derive classes from the FHIR classes. You could handle profiled classes with the normal hapi code because profiled instances, e.g. a patient is still a patient.</p>",
        "id": 154020527,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1542909904
    },
    {
        "content": "<p>Hi Patrick, thank you for your answer. Right now we are using fluent  API to create queries. Do we not have to extend the classes in order to include the link in our searches and also to create a searchparameter which creates an index on the database?</p>",
        "id": 154020578,
        "sender_full_name": "Björn Kroll",
        "timestamp": 1542946685
    },
    {
        "content": "<p>Is it possible to add a searchprameter without extending a class of the JPA HAPI Server?</p>",
        "id": 154020983,
        "sender_full_name": "Björn Kroll",
        "timestamp": 1543297669
    }
]