[
    {
        "content": "<p>The next release of HAPI has now been uploaded to the Maven repos and GitHub's releases section.</p>\n<p>This release brings several primary changes:</p>\n<ul>\n<li>STU3 definitions have been updated to the latest definitions (FHIR 1.7.0 - SVN 10129)</li>\n<li>Add support for FHIR Patch operation (thanks to Peter Girard of McKesson for his help on this!)</li>\n<li>Android library has been streamlined to use the OkHttp client by default (no more fighting with out-of-date Apache HttpClient. Thanks to Matt Clarke of Orion Health for his help on this!)</li>\n<li>The STU3 client now supports both the Conformance resource (which is going away) and the new CapabilityStatement (which replaces it). This should allow for a bridge while servers are migrated to the new resource type being returned by the &lt;code&gt;/metadata&lt;/code&gt; endpoint.<br>\nThis release also brings a number of bugfixes and also quite a few enhancements. As always, the changelog has the full list of changes in this version. </li>\n</ul>",
        "id": 153856788,
        "sender_full_name": "James Agnew",
        "timestamp": 1479067366
    },
    {
        "content": "<p>Aw nuts. <span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span> managed to find a bug 2 days after the release. Sigh. :)</p>\n<p>There are some search parameters missing from the JPA server on the \"metadata\" resources such as StructureDefinition. Basically any of the search params that are common across all of them have been moved to a new spreadsheet and HAPI's build didn't pick that up. This bug only affects JPA FYI, no other parts of HAPI are affected.</p>\n<p>I've patched this, and uploaded a 2.2-SNAPSHOT build with this fixed. If anyone wants a copy of the CLI with this fix you can grab one <a href=\"https://fileportal.uhn.ca/download.aspx?ID=d67e46e0-dc45-4a3b-a7b6-1a2665d596ca\" target=\"_blank\" title=\"https://fileportal.uhn.ca/download.aspx?ID=d67e46e0-dc45-4a3b-a7b6-1a2665d596ca\">here</a>. Will push a new release with this fix soon.</p>",
        "id": 153856859,
        "sender_full_name": "James Agnew",
        "timestamp": 1479145474
    }
]