[
    {
        "content": "<p>We are trying to upgrade to Hapi510 and are having trouble using STU3-profiles generated with Forge version 24.2 . The issue seems to be that the snapshots in them are different,  the hapi solution generates more elements. The specific mismatching element seems to be at least Extension.extension:name.value[x], both snapshots have elementdefiniton of Extension.extension:name.value[x]:valueString.  Is there something we could do to make the snapshots match? Regenerate profiles or configure the hapiserver?</p>\n<p><a href=\"/user_uploads/10155/5jtOuDc_82TqFrRlz-8ukmMP/kuva.png\">kuva.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/5jtOuDc_82TqFrRlz-8ukmMP/kuva.png\" title=\"kuva.png\"><img src=\"/user_uploads/10155/5jtOuDc_82TqFrRlz-8ukmMP/kuva.png\"></a></div><p>There's a boolean for checkspecials to disable this validation, but it isn't passable from application config.</p>",
        "id": 211613607,
        "sender_full_name": "Eeva Turkka",
        "timestamp": 1601382585
    },
    {
        "content": "<p>HAPI has the tooling for generating snapshots based on differentials. You should either address this to <span class=\"user-mention\" data-user-id=\"203235\">@Ward Weistra</span> or use the snapsnot generation tooling as part of HAPI</p>",
        "id": 211617292,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1601384630
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192813\">@Eeva Turkka</span> Hi Eeva, hard to judge from the current description if there's something wrong with snapshot generation in either of the tool stacks (.NET stack underlying Forge and/or Java stack underlying HAPI). Are the profiles using FHIR 4.0.1? Could you try snapshot generation with the latest version of Forge (25.1.1) and HAPI and compare the two to see if it still occurs?</p>\n<p>You're also free to let HAPI regenerate the snapshots, but if there's really a difference in snapshot generation that's good to know so we align the two! Thanks in advance.</p>",
        "id": 211646980,
        "sender_full_name": "Ward Weistra",
        "timestamp": 1601397053
    },
    {
        "content": "<p>We are using FHIR 3.0.1 for these profiles, since the project is still in STU3 and we will be supporting STU3 for a while still.  I will check if there's a difference with the latest version soon. Both the snapshots seem to have the elements Forge generates, Hapi generates those value[x] elements in addition to that -&gt; leading the number of items in the snapshots to mismatch and the profile to be rejected by Hapi validation. The amount of elements by Hapi seems always to be greater than one generated by Forge.  (Our profiles are here (<a href=\"https://simplifier.net/finnishphr/~resources?category=Profile\">https://simplifier.net/finnishphr/~resources?category=Profile</a>) and they seem to cause this error with general Hapi and validation operation on the STU3-branch)</p>\n<p>We will try to regenerate the STU3 profiles without snapshots to see if it'll solve this (the snapshot generation tooling wasn't available in Hapi when the project started quite a few years ago so it's not in use yet).</p>",
        "id": 211659124,
        "sender_full_name": "Eeva Turkka",
        "timestamp": 1601402201
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192813\">@Eeva Turkka</span> can the content of the Finnish PHR be downloaded as an IG compatible file - I mean as a tgz file?</p>",
        "id": 211662982,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1601403790
    },
    {
        "content": "<p>I haven't tried? The profiles, codesystems, valuesets etc are available in Simplifier? I'm just trying to upload a single SD as a post to our FHIR server in this case (and pretty much all of them seem to have this trouble with mismatching snapshots). I will test the differential-based validation tomorrow during office time :).</p>",
        "id": 211663542,
        "sender_full_name": "Eeva Turkka",
        "timestamp": 1601404041
    },
    {
        "content": "<p>We (<span class=\"user-mention\" data-user-id=\"225575\">@Timi Rahikainen</span> ) tested this with new Forge and both 3.0.1 and 3.0.2 and with the <a href=\"http://hapi.fhir.org\">hapi.fhir.org</a> server and StructureDefinition validation there and the snapshots generated are mismatched in element count. </p>\n<p>The immediate problems with updating profiles can be circumvented with generating the snapshot on the hapi side, we'll need to test a bit and see if there's any impact on perfomance :).</p>",
        "id": 211736235,
        "sender_full_name": "Eeva Turkka",
        "timestamp": 1601458907
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"192813\">@Eeva Turkka</span>, I've spent quite some time trying to find what you are referring to, but I'm afraid I need more specific examples. For example, can you upload profileX-<code>snapshotFromForge25-1-1.xml</code> and <code>profileX-snapshotFromHAPIx-x.xml</code> and quote the specific differences here?</p>\n<p>I've downloaded multiple of your profiles (vital signs and blood pressure), removed the snapshot and regenerated that with Simplifier, Forge and the IG publisher and all of them have a similar set of <code>value[x]</code> elements, as far as I can tell.</p>\n<p>Thanks in advance!</p>",
        "id": 211917333,
        "sender_full_name": "Ward Weistra",
        "timestamp": 1601561985
    },
    {
        "content": "<p>Thank you! We will test some more and get back to this!  The trouble is that the hapi generates a new snapshot for the SD for validation in memory temporarily when saving an SD and that doesn't match the ones we have in the profiles in simplifier - they worked fine with 5.0.3 version and with the latest version they stopped being valid without any change to the profiles.</p>",
        "id": 211920651,
        "sender_full_name": "Eeva Turkka",
        "timestamp": 1601563283
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192813\">@Eeva Turkka</span> If I remember correctly the validation framework had quite a bump in functionality from 5.0.x to 5.1.0 in HAPI</p>",
        "id": 211921835,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1601563718
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191427\">@Jens Villadsen</span> totally. Run into several problems/bugs with 5.0.x<br>\n5.1.0 just works</p>",
        "id": 211932759,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1601567934
    },
    {
        "content": "<p>Yup, I noticed and that was part of my original question if there's a workaround for these SDs. There's a \"check specials\" boolean for the validation that would turn off the snapshot checking for the profiles but it isn't passable from the server configuration because the bean that uses it is created with new inside the validator.</p>\n<p>I will try to create a junit test for a profile to reproduce this error.</p>",
        "id": 212050278,
        "sender_full_name": "Eeva Turkka",
        "timestamp": 1601629832
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"203235\">@Ward Weistra</span> I can reproduce (what looks like) the same error using the latest R4 Forge and the latest validator tool (Java one)</p>\n<ol>\n<li>Load the STU1 IPS Patient profile (v. 1.0.0) into a directory (+ any data type profiles it depends on)</li>\n<li>Use Forge R4 to create a new derived profile from the IPS Patient</li>\n<li>Save the new profile without making any changes  (I've attached an example)</li>\n<li>Validate the corresponding StructureDefinition file using the validator</li>\n</ol>\n<p>The result is the following error:</p>\n<div class=\"codehilite\"><pre><span></span><code>FHIR Validation tool Version 5.1.16 (Git# ea0b4c0c1c10). Built 2020-10-01T04:39:09.65Z (5 days old)\n  Java:   12.0.2 from /Library/Java/JavaVirtualMachines/adoptopenjdk-12.jdk/Contents/Home on x86_64 (64bit). 4096MB available\n  Paths:  Current = /Users/morten.ernebjerg/repos/s4h-fhir-profiles, Package Cache = /Users/morten.ernebjerg/.fhir/packages\n  Params: -version 4.0.1 profiles/MyPatientUvIps.StructureDefinition.json\nLoading\n  Load FHIR v4.0 from hl7.fhir.r4.core#4.0.1 - 4575 resources (00:03.0623)\n  Terminology server http://tx.fhir.org - Version 1.0.353 (00:01.0472)\n  Get set...  go (00:00.0003)\nValidating\n  Validate profiles/MyPatientUvIps.StructureDefinition.json  Load hl7.fhir.uv.ips#0.3.0 - 81 resources (00:01.0364)\n 00:00.0551\nDone. Times: Loading: 00:05.0317, validation: 00:01.0916\n\n*FAILURE*: 1 errors, 5 warnings, 2 notes\n  Error @ StructureDefinition : The generated snapshot has a different number of elements 87 that the originally provided snapshot 54\n...\n</code></pre></div>\n\n\n<p>Example StructureDefinition: <a href=\"/user_uploads/10155/QLkYRSinDvFUh7x5cZnZzs5K/MyPatientUvIps.StructureDefinition.json\">MyPatientUvIps.StructureDefinition.json</a></p>",
        "id": 212404424,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1601977112
    },
    {
        "content": "<p>PS: Looking at the error trace, it seems the validator is loading  the 0.3.0 IPS package (as per<a href=\"#narrow/stream/207835-IPS/topic/IPS.20STU1.20as.20FHIR.20package.3F\"> discussion in #IPS</a>, the 1.0.0 package is not in the registry at the moment). However, I derived the profile from (a local copy) the 1.0.0 version of the profile. Might that be (part of) the issue?</p>",
        "id": 212407757,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1601979422
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194703\">@Morten Ernebjerg</span> Thanks!<br>\nBut indeed, if the original snapshot was made based on the IPS patient profile from <code>hl7.fhir.uv.ips#1.0.0</code> and the validator compares it to a snapshot it generates from the IPS patient profile from <code>hl7.fhir.uv.ips#0.3.0</code>, a difference is most likely due to that, rather than a difference in snapshot generation between Java and .NET tooling.</p>\n<p>I wonder how the Java validator chose to use that package and version. Do you specify that in the command calling it (eg. with the <code>-ig</code> flag like in the IG publisher), does it take it from the <code>package.json</code> in the folder from where it's run or does it search the registry for the canonical it found? Would you be able to tell it to use the 1.0.0 version instead if you manually install it to your package cache, eg. with Torinox or by manually placing it there?</p>\n<p>If you are able to reproduce the \"snapshot has a different number of elements\" error with a snapshot generated by Forge and Java validator deriving from the same profile (either both 0.3.0 or 1.0.0) we can investigate any potential snapshot generation differences.</p>",
        "id": 212413360,
        "sender_full_name": "Ward Weistra",
        "timestamp": 1601983414
    },
    {
        "content": "<p>Right, that does indeed seem to be the issue. I got the error without using the <code>-ig</code> parameter. Presumably, what happens is that the validator sees that the profile is derived from the IPS one and then, not having been pointed explicitly to an IG, pulls the most recent corresponding package (v0.3.0). If I add <code>-ig</code> and point it to the folder containing the v1.0.0 IPS profiles, the error disappears.</p>\n<p>So this does indeed seem to be a separate issue, sorry for muddying the waters!</p>",
        "id": 212414121,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1601983995
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194703\">@Morten Ernebjerg</span> Not at all! Thank you for helping reproducing errors.</p>",
        "id": 212415829,
        "sender_full_name": "Ward Weistra",
        "timestamp": 1601985148
    },
    {
        "content": "<p>Ok, so I finally got back to this and wrote a junit test (this is with Hapi 5.1.0):</p>\n<div class=\"codehilite\"><pre><span></span><code>@Test\npublic void validate() throws  IOException {\n    String sd = new String(Files.readAllBytes(Paths.get(&quot;src/test/resources/fiphr-ext-creatingapplication.json&quot;)));\n\n    FhirContext dstu3Context = FhirContext.forDstu3();\n\n    FhirValidator validator = new FhirValidator(dstu3Context);\n\n    ValidationSupportChain validationSupportChain = new ValidationSupportChain(\n        new DefaultProfileValidationSupport(dstu3Context),\n        new InMemoryTerminologyServerValidationSupport(dstu3Context),\n        new CommonCodeSystemsTerminologyService(dstu3Context),\n        new SnapshotGeneratingValidationSupport(dstu3Context));\n\n    FhirInstanceValidator instanceValidator = new FhirInstanceValidator(validationSupportChain);\n    validator.registerValidatorModule(instanceValidator);\n\n    ValidationResult res = validator.validateWithResult(sd);\n\n    assertTrue(res.isSuccessful());\n}\n</code></pre></div>\n\n\n<p>The json-file is basically this: <a href=\"https://simplifier.net/finnishphr/fiphr-ext-creatingapplication\">https://simplifier.net/finnishphr/fiphr-ext-creatingapplication</a>  downloaded with the snapshot as json just half an hour ago. The test fails for me with the number of items mismatching, similarily when trying to save the extension tuo a stu3 fhir server.</p>",
        "id": 212434596,
        "sender_full_name": "Eeva Turkka",
        "timestamp": 1601994127
    },
    {
        "content": "<p>I figured out why the IPS 1.0.0 package is not published - a typo in the package-list.json file - and published it. Will get into <a href=\"http://packages.fhir.org\">packages.fhir.org</a> whenever it next updates the registry</p>",
        "id": 212477481,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1602014433
    },
    {
        "content": "<p>Awesome <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span aria-label=\"thumbs up\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"thumbs up\">:thumbs_up:</span></p>\n<p>Would you also happen to understand why <span class=\"user-mention\" data-user-id=\"192813\">@Eeva Turkka</span> is seeing a snapshot element mismatch error in the validation unit test she shared above? Her issue is independent of IPS, seeing the error when Java validating resources (eg. this one <a href=\"https://simplifier.net/FinnishPHR/fiphr-ext-creatingapplication\">https://simplifier.net/FinnishPHR/fiphr-ext-creatingapplication</a>) from <a href=\"https://simplifier.net/finnishphr\">this project</a>, which only depends on the core STU3 package.</p>",
        "id": 212526974,
        "sender_full_name": "Ward Weistra",
        "timestamp": 1602058715
    },
    {
        "content": "<p>well, I tried to get the snapshot generation process harmonised between the dotnet code and the java code, but that process is currently waiting on a response from someone on the dotnet side. We have unit tests that we work to, and someone on the dotnet side was going to like at them</p>",
        "id": 212633304,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1602114332
    },
    {
        "content": "<p>I was waiting here for Eeva to tell me what was actually wrong with the generated snapshot</p>",
        "id": 212633325,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1602114355
    },
    {
        "content": "<p>Oh, the generated snapshot from Hapi has different amount of elements than from Forge so the profiles that have snashots already with them are now all \"invalid\" according to Hapi. There seems to be one extra value[x] -element in the hapi generated one (there's a screenshot of the extra element from a debugger in the first message of this discussion), Forge does two elements for the valueString and value and Hapi does three if I looked at it correctly. Trouble is that the two snapshots don't match and the StructureDefinitionValidator rejects the SD. There's the \"checkSpecials\" boolean that would disable it, but it isn't injectable from outside into the validator.</p>\n<p>We've been testing the generated one and there seems to be some issues validating the refrence type of references of a derived profile. Also seems, but we haven't been able to pinpoint it, but there might be some concurrency issues for generating the snapshot for profile under load - cannot confirm the latter one but we are seeing some weird intermittent validation issues (validation fails) for that. It's still under tests so I can't report that one more accurately.</p>",
        "id": 212652494,
        "sender_full_name": "Eeva Turkka",
        "timestamp": 1602139903
    },
    {
        "content": "<p>do you want to post examples?</p>",
        "id": 212665136,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1602149016
    },
    {
        "content": "<p>Examples of failing profiles? One example is that extension we have in simplifier and I linked - the snapshot it has is invalid according to Hapi. The unit test I posted fails - and it fails pretty much for all the profiles we have in FinnishPHR for same error: mismatching number of elements in snapshot. I used it here as an example because I didn't need to load any other resources for the validation.</p>",
        "id": 212671601,
        "sender_full_name": "Eeva Turkka",
        "timestamp": 1602153464
    },
    {
        "content": "<p>what does 'it is invalid according to HAPI' mean?</p>",
        "id": 212671688,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1602153507
    },
    {
        "content": "<p>the unit test you added wasn't really a functional test - there's some reasons why the snapshots might be different without affecting the functional behavior</p>",
        "id": 212671719,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1602153539
    },
    {
        "content": "<p>The snapshots work fine for resource validation, but we are having trouble uploading the profiles since they don't pass the validation of create action?</p>",
        "id": 212671838,
        "sender_full_name": "Eeva Turkka",
        "timestamp": 1602153613
    },
    {
        "content": "<p>The specific error here is \"[SingleValidationMessage[locationString=StructureDefinition,message=The generated snapshot has a different number of elements 25 that the originally provided snapshot 15,severity=error]]\"</p>",
        "id": 212671899,
        "sender_full_name": "Eeva Turkka",
        "timestamp": 1602153676
    },
    {
        "content": "<p>can you chase that message down? where does it come from?</p>",
        "id": 212674513,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1602155742
    },
    {
        "content": "<p>It's from line 89 in StructureDefinitionValidator, <br>\n            if (!snapshot.isEmpty()) {<br>\n              int was = snapshot.size();<br>\n              int is = sd.getSnapshot().getElement().size();<br>\n              rule(errors, IssueType.NOTFOUND, stack.getLiteralPath(), was == is, I18nConstants.SNAPSHOT_EXISTING_PROBLEM, was, is);<br>\n            }</p>",
        "id": 212674661,
        "sender_full_name": "Eeva Turkka",
        "timestamp": 1602155840
    },
    {
        "content": "<p>oh. ha. That's my fault</p>",
        "id": 212677716,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1602158118
    },
    {
        "content": "<p>Ok, so it'll be fixed in the code? If needed you are welcome to use our profiles for units :)</p>",
        "id": 212678957,
        "sender_full_name": "Eeva Turkka",
        "timestamp": 1602158868
    },
    {
        "content": "<p>I'm trying to decide what to do about it. but yes, it's something i have to do. The intent of the check is to find out that there's engines out there that aren't aligned, or that mine is not acting reproducibly. But the intent is not to make it other people's problems  - it's a discovery thing</p>",
        "id": 212681927,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1602160484
    },
    {
        "content": "<p>One thing that could help is to make the \"checkSpecials\" boolean passable trought to the validator from the server so we could just skip those checks?</p>",
        "id": 212683577,
        "sender_full_name": "Eeva Turkka",
        "timestamp": 1602161322
    },
    {
        "content": "<p>yes something like that. but I have to review exactly how.</p>",
        "id": 212685008,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1602162023
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191316\">Grahame Grieve</span> <a href=\"#narrow/stream/179167-hapi/topic/Hapi.20510.20with.20forge.20snapshots/near/212685008\">said</a>:</p>\n<blockquote>\n<p>yes something like that. but I have to review exactly how.</p>\n</blockquote>\n<p><strong>Much appreciated! </strong>@<strong>Grahame Grieve</strong></p>",
        "id": 212685260,
        "sender_full_name": "Vikrant Chauhan",
        "timestamp": 1602162126
    }
]