[
    {
        "content": "<p>Is there a way to make <code>hapi_fhir_cli</code> work with a custom profile, so that the profile is referenced in <code>Conformance</code> response?</p>",
        "id": 153853058,
        "sender_full_name": "Günter Zöchbauer",
        "timestamp": 1476769949
    },
    {
        "content": "<p>Is this a stupid question? <br>\nAny hint? </p>",
        "id": 153853173,
        "sender_full_name": "Günter Zöchbauer",
        "timestamp": 1476880745
    },
    {
        "content": "<p>Looks exactly like what I'm looking for. Have yet to check the details though<br>\n<a href=\"https://fhirblog.com/2016/10/19/setting-up-your-own-fhir-server-for-profiling/\" target=\"_blank\" title=\"https://fhirblog.com/2016/10/19/setting-up-your-own-fhir-server-for-profiling/\">https://fhirblog.com/2016/10/19/setting-up-your-own-fhir-server-for-profiling/</a></p>",
        "id": 153853300,
        "sender_full_name": "Günter Zöchbauer",
        "timestamp": 1476940759
    },
    {
        "content": "<p>Hi Gunter, sorry unfortunately this isn't yet supported.</p>",
        "id": 153853721,
        "sender_full_name": "James Agnew",
        "timestamp": 1477065762
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span> Thanks a lot for the info! <br>\nDo you know any server I can use to test if my client properly works with servers that have custom profiles configured?</p>",
        "id": 153853724,
        "sender_full_name": "Günter Zöchbauer",
        "timestamp": 1477066155
    },
    {
        "content": "<p>Depends on what you need to test I suppose. I haven't actually yet come across any client workflows that depend on profiles being exposed via the conformance statement yet (not that they don't exist of course).</p>\n<p>If you just need a server to serve up resources which declare and conform to a given profile URL, you can upload to most of the public test servers (certainly HAPI among others) and the server will preserve the profile URL when you fetch the resources..</p>",
        "id": 153853725,
        "sender_full_name": "James Agnew",
        "timestamp": 1477068599
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span> I'm working on a code generator for a FHIR REST client, and I want it to build the classes in a way that they include all the expected extensions.<br>\nWhat do you think is the correct way to get this information from a server?</p>",
        "id": 153853727,
        "sender_full_name": "Günter Zöchbauer",
        "timestamp": 1477073035
    },
    {
        "content": "<p>Whoa, neat. Would love to hear more about the project! :)</p>\n<p>That does sound like you'd want a proper conformance statement if the aim is to have the code generated for all profiles supported by a given server.</p>\n<p>I suppose another approach might be to have it pull down profiles from a registry instead of from the server (e.g. point the tool at a profile on <a href=\"http://simplifier.net\" target=\"_blank\" title=\"http://simplifier.net\">http://simplifier.net</a> and generate corresponding code for that..) Man that would be neat...</p>",
        "id": 153853728,
        "sender_full_name": "James Agnew",
        "timestamp": 1477073706
    },
    {
        "content": "<p>I'm working for a customer. He considers to make this part open source (yet to decide).</p>\n<blockquote>\n<p>That does sound like you'd want a proper conformance statement if the aim is to have the code generated for all profiles supported by a given server.</p>\n</blockquote>\n<p>Yes, this is exactly what I try to figure out how to do it right.</p>\n<blockquote>\n<p>I suppose another approach might be to have it pull down profiles from a registry instead of from the server (e.g. point the tool at a profile on <a href=\"http://simplifier.net\" target=\"_blank\" title=\"http://simplifier.net\">http://simplifier.net</a> and generate corresponding code for that..) Man that would be neat...</p>\n</blockquote>\n<p>How do I know which profiles should be pulled down for a specific server?</p>\n<p>I got the impression this is common practice in .Net, Java, Swift, Python, JS. But the language I'm using is not among these therefore I'm working on my own implementation. At the beginning I got a few ideas from <a href=\"https://github.com/smart-on-fhir/client-py\" target=\"_blank\" title=\"https://github.com/smart-on-fhir/client-py\">https://github.com/smart-on-fhir/client-py</a></p>",
        "id": 153853729,
        "sender_full_name": "Günter Zöchbauer",
        "timestamp": 1477074250
    },
    {
        "content": "<p>I might be misunderstanding.. I don't think there are tools in any of these languages yet to go to a server, download the conformance statement and generate code for the profiles it supports.</p>\n<p>FWIW HAPI won't do this completely out of the box, but it does let you put anything you want in your server's conformance profile (by overriding <code>ServerConformanceProvider</code> and then passing your overridden class into <code>RestfulServer</code>). You could certainly  mock up anything you want it to do..</p>",
        "id": 153853758,
        "sender_full_name": "James Agnew",
        "timestamp": 1477085360
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span> I guess that explains why I haven't yet found anything about that ;-)</p>\n<p>So how are people doing this. I assumed the structuredefinitions are supposed to be used to define the interfaces. Are they usually exchanged in advance? Are they more used like documentation to implement the clients and servers accordingly?</p>",
        "id": 153853759,
        "sender_full_name": "Günter Zöchbauer",
        "timestamp": 1477085525
    },
    {
        "content": "<p>So far, yes. The bulk of the current / short term work in this area is using the profiles to do two things: generate documentation (e.g. implementation guides) and do validation of resources which conform to those profiles. There is lots of good tooling for both of these things.</p>\n<p>The thing you're talking about, code-generation from profiles, is an awesome idea but I don't believe it exists yet in any platform.</p>\n<p>Claude Nanjo is actually doing some really cool work in this space in Java (we're hoping to bring it into HAPI at some point when it's ready).. I do totally think the concept is sound. It's just not a trivial problem to solve which is why it hasn't happened yet.</p>",
        "id": 153853760,
        "sender_full_name": "James Agnew",
        "timestamp": 1477085761
    },
    {
        "content": "<p>there's a team in Europe working on java code generation for profiles </p>",
        "id": 153853763,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1477086565
    },
    {
        "content": "<p>we'll see them in a few weeks time at devDays</p>",
        "id": 153853765,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1477086574
    },
    {
        "content": "<p>But the conformance statement or capability statement are, at least in theory, the right place to look up the profile configuration for a specific FHIR REST endpoint?<br>\nUntil this is fully supported by HAPI or other tools, the way to go is to just share the profiles as XML or JSON files, right?</p>",
        "id": 153853800,
        "sender_full_name": "Günter Zöchbauer",
        "timestamp": 1477135197
    },
    {
        "content": "<p>Rather than working from a conformance statement from a specific server, I would think you'd be creating the conformance resource that you plan for the project to generate off. This is then not dependant on any specific server.<br>\nAnd you can publish that to other server vendors to state that this is the base profile that we expect everyone to be able to support.<br>\nFor our needs we are just using the standard .NET FHIR client, and have wrappers converting from our native (legacy/internal) object models into the FHIR model, with extensions included  as required.</p>",
        "id": 153853867,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1477272088
    },
    {
        "content": "<p>Thanks a lot everyone for helping me understand this topic better.</p>\n<p><span class=\"user-mention\" data-user-id=\"191367\">@Brian Postlethwaite</span> I guess that could work.</p>\n<p>I'm still wondering what the purpose of the profile information in the conformance statement is then exactly.</p>",
        "id": 153854044,
        "sender_full_name": "Günter Zöchbauer",
        "timestamp": 1477373327
    },
    {
        "content": "<p>There are 2 reasons that I would expect to find the profile in there (both are related to what you could expect to find in the server)<br>\n1. The server is a facade on an existing legacy system that cannot handle anything but the provided profile. (other content will be discarded or rejected as the server doesn't support storing it)<br>\n2. The server is planning to only support a subset of information based on a defined profile for a specific use.<br>\n(Such as configuring a HAPI server - which can support any fhir content - such that it will only accept that subset of content - disclaimer: not sure if you can configure HAPI like this out of the box yet.)</p>",
        "id": 153854047,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1477375446
    },
    {
        "content": "<p>Thanks,  I think that helps me understand a bit better how FHIR is supposed to be used.</p>",
        "id": 153854050,
        "sender_full_name": "Günter Zöchbauer",
        "timestamp": 1477376430
    },
    {
        "content": "<p>Hi all, I have read the whole conversation with great interest. Within the scope of a multi-national EU project for diabetes, we have profiled several FHIR resources, and as the server side we would like to provide our client partners with easy to use HAPI based java clients. For a few profiled resources only, the simplest way is to manually create custom classes extending native resources. However, we have tens of profiled resources and we would like to have a more sustainable and reusable mechanism. Hence, we are also looking into code generation automatically from structure definitions. <br>\n<span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span> and <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> Regarding the efforts you mentioned (i.e. Claude Nanjo and a team in Europe), is there any further information that you can share or point to? We can actively contribute to such efforts if possible. In the worst case, we are planning to implement it ourselves. Thanks. </p>",
        "id": 153856326,
        "sender_full_name": "Mustafa Yuksel",
        "timestamp": 1478784286
    },
    {
        "content": "<p>Unfortunately there isn't really anything I can point you to. We've had lots of discussions about getting this project off the ground, but I'm not sure if any code has actually been written that is anywhere public yet. I know Claude's plans are to contribute his work back to HAPI, but I don't believe he has any code written yet. The other effort was presented at DevDays last year, but I don't believe they are open-sourcing their work.</p>\n<p>If you decide you want to go down the code-generation route, of course I'd be delighted if you wanted to do it in a way that we could integrate it into HAPI. I'm happy to chat about ideas for how it could be done... I've got lots of ideas, just not enough hours in the day to do them all. :)</p>",
        "id": 153856781,
        "sender_full_name": "James Agnew",
        "timestamp": 1479067108
    },
    {
        "content": "<p>Thanks James. We are happy to collaborate for integration with HAPI. I will come back to you soon with some more details about our plans. </p>",
        "id": 153856829,
        "sender_full_name": "Mustafa Yuksel",
        "timestamp": 1479107711
    }
]