[
    {
        "content": "<p>I'm new to the HAPI JPA server and trying out few things with the starter server repository.</p>\n<p>How is one able to load multiple business versions of the same CodeSystem?  When I try this, even with different version numbers, I receive the following error: </p>\n<p>Error: HTTP 422 Unprocessable Entity: Can not create multiple CodeSystem resources with CodeSystem.url \"...\", already have one with resource ID: CodeSystem/3</p>\n<p>I'm trying this through the web UI. Is there a configuration option to control this or am I not submitting the new CodeSystem instance correctly? By new version, I mean I'd like to have a new CodeSystem instance with its own identity, a newer business version, etc. but the same .url value.  I know the URL can be qualified with a version but is there no way to have multiple instances with the same canonical url and the client needs to know how pick the correct one from the query result? Thanks!</p>",
        "id": 215978198,
        "sender_full_name": "Shahim Essaid",
        "timestamp": 1604790938
    },
    {
        "content": "<p>On the CRUD Operations tab, maybe you want to use the UPDATE operation if the CodeSystem is not that large.</p>",
        "id": 215984302,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1604801332
    },
    {
        "content": "<p>I was wondering if it is possible to create multiple instances, not update an existing instance, of CodeSystem or other resources that have a canonical url.  Does the spec say that an API can only have one instance/url of a canonical resource? I'm guessing it makes sense so clients don't have to figure out how to pick from multiple instances of the same resource type and same url.</p>",
        "id": 216410254,
        "sender_full_name": "Shahim Essaid",
        "timestamp": 1605137124
    },
    {
        "content": "<p>What use case is it for?</p>",
        "id": 216410653,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1605137473
    },
    {
        "content": "<p>it should be possible to have multiple different resources that all have the same canonical URL. For a start, if they have different versions.</p>",
        "id": 216444425,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1605172887
    },
    {
        "content": "<p>but even if they have the same versions.</p>",
        "id": 216444433,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1605172893
    },
    {
        "content": "<p>but some servers might say, no, you have to manage them so they have different versions</p>",
        "id": 216444444,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1605172907
    },
    {
        "content": "<p>and some mat say no, you can only have one version with a given URI (canonical URL)</p>",
        "id": 216444917,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1605173239
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 216606144,
        "sender_full_name": "Lin Zhang",
        "timestamp": 1605272221
    }
]