[
    {
        "content": "<p>I've noticed a somewhat confusing behavior with the way HAPI updates meta-data upon PUT  (also reproducible on <a href=\"http://hapi.fhir.org/baseDstu3\" target=\"_blank\" title=\"http://hapi.fhir.org/baseDstu3\">http://hapi.fhir.org/baseDstu3</a>) and just wanted to check that I am not missing smt. before I log an issue. Specifically, the <code>lastUpdated</code> and <code>versionId</code> fields do not seem to be updated synchronously.</p>\n<p>Suppose we do the following</p>\n<p>1. First, POST a resource  --&gt; get back created resource with <code>lastUpdated</code>and <code>versionId</code><br>\n2. Copy the resource returned, make a change somewhere, and then PUT it, <em>including <code>meta</code>-field</em>  --&gt; get back (apparently) updated resource with <code>lastUpdated</code>and <code>versionId</code><br>\n3. Finally, GET the resource</p>\n<p>Then we find that:</p>\n<ul>\n<li>The  resource returned from the PUT in step 2 has an updated <code>lastUpdated</code> relative to what came back from the POST in step 2, <em>but</em> the same <code>versionId</code> (viz. the one that included in the body of the PUT request). </li>\n<li>In step 3, we get back a resource in which <em>both</em> <code>versionId and </code>lastUpdated`has been updated.</li>\n</ul>\n<p>In other words, the resource returned on a PUT seem to have a \"half-updated\" <code>meta</code>-field. However, the ETag header has the correct version. There is also a <code>Content-Location</code>header with the correct versioned path, but no <code>Location</code>header. Also, if we leave out the <code>meta</code>-field in the body of the PUT in step 2,  the right (updated) <code>versionId</code> comes back in response(<a href=\"https://www.hl7.org/fhir/http.html#update\" target=\"_blank\" title=\"https://www.hl7.org/fhir/http.html#update\">in line with the spec</a>: \"If the request body includes a meta, the server SHALL ignore the provided versionId and lastUpdated values\". </p>\n<p>Is there some reason behind this behavior? From the spec it seems that returned the updated resource is not required, only the updated <code>ETag</code>.</p>",
        "id": 154024738,
        "sender_full_name": "Morten Ernebjerg",
        "timestamp": 1544604119
    }
]