[
    {
        "content": "<p>Hi all,</p>\n<p>I was wondering if it's possible to intercept outgoing Subscription calls before they are sent. So that I can execute logic that decides whether the notification is sent or not.</p>\n<p>Some context: We apply search narrowing based on a given authorization. We also want to apply this logic runtime to calculate if the given Subscription should execute. We <em>could</em> also modify the <code>Subscription.criteria</code> on save. But we'd need to keep  changing it as the authorizations change. If the above isn't possible in HAPI, deciding between the two options will be easy!</p>",
        "id": 262454465,
        "sender_full_name": "Joris Scharp",
        "timestamp": 1637673890
    },
    {
        "content": "<p>HAPI has an interceptor framework for doing this kind of thing.  Here's a link to some documentation on server pointcuts.<br>\n<a href=\"https://hapifhir.io/hapi-fhir/docs/interceptors/server_pointcuts.html\">https://hapifhir.io/hapi-fhir/docs/interceptors/server_pointcuts.html</a></p>",
        "id": 262472198,
        "sender_full_name": "Joel Schneider",
        "timestamp": 1637681898
    },
    {
        "content": "<p>I  know about the primary interceptor hooks. But as far as I know, this is always based on an incoming request, which is not directly the case for sending a notification to existing <code>Subscription</code> resources right? Say someone executes a <code>PUT</code> on  a <code>Patient</code> resource, I don't see  any hook that lets  me inject logic on whether to or not to send the notification based  on <code>Subscription.criteria</code> that matches the updated <code>Patient</code> resource.</p>",
        "id": 262556565,
        "sender_full_name": "Joris Scharp",
        "timestamp": 1637741513
    },
    {
        "content": "<p>I can't really speak to the subscription story, but the javadoc for the PointCut enum includes a bunch of  SUBSCRIPTION_xxx values.<br>\n<a href=\"https://hapifhir.io/hapi-fhir/apidocs/hapi-fhir-base/ca/uhn/fhir/interceptor/api/Pointcut.html\">https://hapifhir.io/hapi-fhir/apidocs/hapi-fhir-base/ca/uhn/fhir/interceptor/api/Pointcut.html</a></p>",
        "id": 262558471,
        "sender_full_name": "Joel Schneider",
        "timestamp": 1637742890
    },
    {
        "content": "<p>Ah that's interesting <span class=\"user-mention\" data-user-id=\"191926\">@Joel Schneider</span>, thanks! I see some promissing <code>Pointcuts</code>. </p>\n<p>I see a lot more hook types than shown in the server pointcuts diagrams. It would be great if HAPI could add all server hook types to <a href=\"https://hapifhir.io/hapi-fhir/docs/interceptors/server_pointcuts.html\">https://hapifhir.io/hapi-fhir/docs/interceptors/server_pointcuts.html</a>, much easier to find that way!</p>",
        "id": 262573020,
        "sender_full_name": "Joris Scharp",
        "timestamp": 1637751514
    }
]