[
    {
        "content": "<p>When we use the next url in the bundle to navigate to the next page of the search result, I'm assuming the server has the notion of the search session so that the search result between pages are stable?</p>",
        "id": 278676777,
        "sender_full_name": "Jing Tang",
        "timestamp": 1649761420
    },
    {
        "content": "<p>for example, if a new resources is created and it would appear in the search result, when i navigate to the 2nd page of the search using next url, does that resource magically appear?</p>",
        "id": 278676881,
        "sender_full_name": "Jing Tang",
        "timestamp": 1649761481
    },
    {
        "content": "<p>No, searches are persisted in the DB, so the next page would not include this new resource (which is a good thing, because you get consistency while going through the pages.</p>",
        "id": 278677433,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1649761804
    },
    {
        "content": "<p>fantastic - thanks. how long is the search session kept in db if there's a time out?</p>",
        "id": 278684589,
        "sender_full_name": "Jing Tang",
        "timestamp": 1649766297
    },
    {
        "content": "<p>by default in the jpastarter 60 min, irrc</p>",
        "id": 278688575,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1649768416
    },
    {
        "content": "<p>can be set in the application.yaml</p>",
        "id": 278688629,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1649768428
    },
    {
        "content": "<p>thanks. i'm assuming this is a \"HAPI\" thing rather than a \"FHIR spec\" thing? Couldn't see anything concrete in the spec.</p>",
        "id": 278689734,
        "sender_full_name": "Jing Tang",
        "timestamp": 1649768977
    },
    {
        "content": "<p>yes.</p>",
        "id": 278701382,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1649774052
    },
    {
        "content": "<p>And it depends on the implementation in a facade situation. In my server (a HAPI implementation) case, if you initiate a search and get page1... a new record is inserted in page 1...you request page 2, you will be offset by 1. Our pages are dynamically created on each page request. The entire page set is not calculated and stashed.</p>",
        "id": 278706394,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1649776007
    }
]