[
    {
        "content": "<p>When I build <a href=\"https://github.com/hapifhir/org.hl7.fhir.core\" target=\"_blank\" title=\"https://github.com/hapifhir/org.hl7.fhir.core\">https://github.com/hapifhir/org.hl7.fhir.core</a> it is generates stuff for R5 in src\\main\\java\\org\\hl7\\fhir\\r5\\model. But it seems the same as the R4 classes in src\\main\\java\\org\\hl7\\fhir\\r4\\model. <br>\nIs there a way to generate the java reference code for what is in the current build?</p>",
        "id": 174871629,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1567595879
    },
    {
        "content": "<p>Yes, that is very similar to the situation and question that I have right now.  I'm updating ConceptMap in the current build and I need to be able to generate r5.model classes that correspond to that - without it the build will fail.  Grahame said that it is about time and he would generate the updates for org.hl7.fhir.core for the current build (as it is now).  But that alone won't solve my issue, as I need to be able to update org.hl7.fhir.core locally first to match my local build changes (in the resource spreadsheets, etc.) so that I can get a successful local build and then create pull requests for both repos so that the changes to the build can be made in sync. <span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span>?</p>",
        "id": 174876578,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1567600384
    },
    {
        "content": "<p>The model classes get built in the FHIR spec build- Once in a while Grahame syncs them into org.hl7.fhir.core. I believe the current R5 models are from December so they're not far off from the R4 ones.</p>\n<p>The challenge is that when they get moved into org.hl7.fhir.core, various other things will often break (converters, validator, fhirpath) as a result of changes to the model so Grahame resolves those things too. I suspect that task is an arduous one, which is why it doesn't happen super frequently.</p>\n<p>Technically anyone could probably replace the contents of the <code>src\\main\\java\\org\\hl7\\fhir\\r5\\model</code> package with the new contents from the spec build, and submit it in a PR along with fixes to anything that breaks. No idea if this would be easy to do, or easy to review...</p>",
        "id": 174916977,
        "sender_full_name": "James Agnew",
        "timestamp": 1567627042
    },
    {
        "content": "<p>The problem is that there's a few resources where changes to the resources requires changes to the core package. Successfully committing them is an arduous process that requires full access to the various packages so you can manage commit dependencies and PRs</p>",
        "id": 174917923,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1567627682
    },
    {
        "content": "<p>Yes, that's exactly the case.  I'm near to the end of this for the agreed changes to ConceptMap, but I need to figure out how to (most expeditiously) get it to the final endpoint with the spec updated and building correctly.</p>",
        "id": 174918717,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1567628192
    },
    {
        "content": "<p>I'm not quite sure if \"replace the contents of the src\\main\\java\\org\\hl7\\fhir\\r5\\model package with the new contents from the spec build\" actually works, because (at least what I've experienced with what I'm doing) you can't get a successful fhir spec build without first updating the src\\main\\java\\org\\hl7\\fhir\\r5\\model package - a chicken and egg problem, it seems.</p>",
        "id": 174918890,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1567628319
    },
    {
        "content": "<p>Any further thoughts/corrections/suggestions on it, <span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span>?</p>",
        "id": 174919094,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1567628414
    },
    {
        "content": "<p>I need to do the merge. No one else can do it</p>",
        "id": 174919728,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1567628885
    },
    {
        "content": "<p>so you can't get a build that works?</p>",
        "id": 174919765,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1567628894
    },
    {
        "content": "<p>I think the only way is for you to send me a diff so that I can do it.</p>",
        "id": 174919809,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1567628936
    },
    {
        "content": "<p>Hmm, that seems like a potentially major bottleneck and rather unfortunate (especially for you).  If the model code is generated (which I thought you said before?), it seems that possibly others could do that?  I don't really have a diff available to send.  What I have now is the updated ConceptMap spreadsheet (which is creating the need for most of the other updates) and quite a bit of hand-edited code reflecting most of the other required changes, which I was hoping to get to the point of being able to generate pull request(s) from (I don't think I'm too far off at this point from being able to that, actually).  And you're right that I can't get a build that works unless first I have a working updated r5 model.</p>",
        "id": 174921181,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1567629822
    },
    {
        "content": "<p>breaking changes to the following resources create this issue: CapabilityStatement, ValueSet, CodeSystem, StructureDefinition, ConceptMap</p>",
        "id": 174921883,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1567630347
    },
    {
        "content": "<p>all but 1 of them are normative. So ConceptMap is the only one that has this problem</p>",
        "id": 174921906,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1567630365
    },
    {
        "content": "<p>Yes, that does make sense.  So how best to proceed in this case?  I kind of don't want to throw away the work that I've done and dump it all back in your lap to do over - unless it's actually <strong>easy</strong> for you to do that.  But it's your call for what will work best.</p>",
        "id": 174922549,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1567630902
    },
    {
        "content": "<p>send me 2 patches for core and main spec</p>\n<p>For patches, see 2nd answer here: <a href=\"https://stackoverflow.com/questions/5159185/create-a-git-patch-from-the-changes-in-the-current-working-directory\" target=\"_blank\" title=\"https://stackoverflow.com/questions/5159185/create-a-git-patch-from-the-changes-in-the-current-working-directory\">https://stackoverflow.com/questions/5159185/create-a-git-patch-from-the-changes-in-the-current-working-directory</a></p>",
        "id": 174922855,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1567631158
    },
    {
        "content": "<p>ok - I'll do that</p>",
        "id": 174926261,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1567633704
    }
]