[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span> Any change on getting JavaDocs in each release so that they can be downloaded?  Otherwise, I keep having to update my JavaDoc location when you have a new release, AND I can never be sure afterwards that I'm actually looking at the right JavaDoc because the HAPI API might have changed between releases.  Also, wold be nice if the Reference Implementation JavaDocs were available.</p>",
        "id": 153866089,
        "sender_full_name": "Keith Boone",
        "timestamp": 1483982654
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191387\">@Keith Boone</span> - Ah good point, our distribution ZIP should probably include the JavaDoc and Sources JARs. I'll fix that.</p>\n<p>In the meantime, you can always grab the sources/javadoc jars by clicking the appropriate link in the Maven repository search: <a href=\"http://search.maven.org/#search%7Cga%7C1%7Chapi-fhir\" target=\"_blank\" title=\"http://search.maven.org/#search%7Cga%7C1%7Chapi-fhir\">http://search.maven.org/#search%7Cga%7C1%7Chapi-fhir</a></p>",
        "id": 153867397,
        "sender_full_name": "James Agnew",
        "timestamp": 1484502620
    },
    {
        "content": "<p>Going to the HAPI  FHIR site, looking under Documentation&gt; Javadocs, I used to be able to find JavaDoc for all the FHIR resource classes and their components etc. Now I can't find it. Where did it go? [ e.g Model API(R4) shows me only a very few classes].</p>",
        "id": 173958264,
        "sender_full_name": "robert worden",
        "timestamp": 1566556264
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"193818\">@robert worden</span> - Thanks for raising- This is a known issue (well, reported after we launched 4.0.0) that was caused by some reorganizing of how we package the structures.</p>\n<p>We're in the middle of a complete website redesign so I'm expecting this to be broken for ~2-3 weeks, but it'll be back to normal soon.</p>",
        "id": 173965140,
        "sender_full_name": "James Agnew",
        "timestamp": 1566563908
    }
]