[
    {
        "content": "<p>Hello,<br>\nwe are struggling with large payloads in FHIR resource update. One of our codesystems (HMDB) has roughly 200MB in size/120k concepts and although we tweak settings on ES side as well as FHIR server and DB side, we still cannot create the resource. Currently we end up with 'Connection reset by peer' probably due to timeout.</p>\n<p>We are using hapi fhir r4 5.1 version and the FHIR client update method to create a resource. Our solution is deployed in AWS. We are using RDS for the database.</p>\n<p>Are there any guidelines for creating such a large CodeSystem in HAPI FHIR server? <br>\nAre there any declared limits for the resource size?<br>\nWhat is the recommended hardware configuration for such operations? <br>\nThanks</p>",
        "id": 248447112,
        "sender_full_name": "Pavel Pilar",
        "timestamp": 1628149241
    },
    {
        "content": "<p>Does HAPI support compressed <code>gzip</code> content encodings in the POST?</p>",
        "id": 248460486,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1628159566
    },
    {
        "content": "<p>The problem is not in sending the data, but in processing it on HAPI FHIR side. <span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span> - any ideas about maximum size of the resource or ways how to make sure HAPI server can import such resource?</p>",
        "id": 248583176,
        "sender_full_name": "Pavel Pilar",
        "timestamp": 1628237877
    },
    {
        "content": "<p>Of course James is the better one to answer ...<br>\nWe tried using the HAPI FHIR cli before; it has a way to upload CodeSystems (or ValueSets).  We did run into problems (Java memory size limits and network problems when we tried it a while ago and with an older version of HAPI, I think 4.2.x, but maybe it works better now.)</p>\n<p><a href=\"https://hapifhir.io/hapi-fhir/docs/tools/hapi_fhir_cli.html\">https://hapifhir.io/hapi-fhir/docs/tools/hapi_fhir_cli.html</a></p>",
        "id": 248661651,
        "sender_full_name": "John Silva",
        "timestamp": 1628280294
    }
]