[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"248736\">@Mark Iantorno</span> Grahame mentioned I should ask you about the details of the move to github releases from sonatype snapshots... Right now, Trifolia-on-FHIR (IG tooling) uses the sonatype snapshots to provide users with a list of IG Publisher versions to select from. Grahame mentioned that snapshots will be going away. Can you provide more details on this transition? As soon as you get rid of sonatype snapshots for the IG Publisher, Trifolia-on-FHIR will stop working with the IG Publisher. So, I'm trying to figure out how and when to plan the transition.</p>",
        "id": 200307631,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1591748706
    },
    {
        "content": "<p>Hey Sean. You are correct in that we're moving to concrete release versions, as opposed to SNAPSHOTs, as they are not really stable. Are you free for a quick call tomorrow, and maybe we can go over any concerns you might have, and I can provide details on the goals we have with the new integration and distribution pipelines.</p>",
        "id": 200313164,
        "sender_full_name": "Mark Iantorno",
        "timestamp": 1591754980
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"248736\">@Mark Iantorno</span> i would be interested too in the new integration and distribution pipeline, if you have some description of it or if it would be possible to join the call  that would be very helpful</p>",
        "id": 200383902,
        "sender_full_name": "Oliver Egger",
        "timestamp": 1591772517
    },
    {
        "content": "<p>I can join the call if you'd like. Could you please provide an invite or joining information?</p>",
        "id": 200409510,
        "sender_full_name": "Mark Iantorno",
        "timestamp": 1591792515
    },
    {
        "content": "<p>I will be writing a summary up after the implementation is complete.</p>",
        "id": 200409569,
        "sender_full_name": "Mark Iantorno",
        "timestamp": 1591792556
    },
    {
        "content": "<p>There will still be SNAPSHOT builds for the core libraries and test cases. That will not change. There will just be additional, fixed, stable releases.</p>",
        "id": 200409698,
        "sender_full_name": "Mark Iantorno",
        "timestamp": 1591792614
    },
    {
        "content": "<p>there will only be snapshots for the latest versions. that will change</p>",
        "id": 200410829,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1591793273
    },
    {
        "content": "<p>I believe?</p>",
        "id": 200410830,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1591793273
    },
    {
        "content": "<p>SNAPSHOTS still live forever in sonatype, so every time a merge occurs to master in the core libs, a SNAPSHOT is cut. But now, releases are done by publishing an actual release version on sonatype. This is the same for both fhir-test-cases, and the hapi fhir core lib. IG-publisher can be set up the same was as well, but a SNAPSHOT will not be published until a push to master is made.</p>",
        "id": 200415514,
        "sender_full_name": "Mark Iantorno",
        "timestamp": 1591795619
    },
    {
        "content": "<p>I should also add that SNAPSHOTS shouldn't be treated as the source of truth going forward. They are more of a moving target, until a release is cut. The release is the stable jar for publishing</p>",
        "id": 200421348,
        "sender_full_name": "Mark Iantorno",
        "timestamp": 1591798486
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"248736\">@Mark Iantorno</span> I am sending you a private DM with my availability today</p>",
        "id": 200443224,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1591807726
    },
    {
        "content": "<p>I thought you said that past snapshots would be removed once a release is done?</p>",
        "id": 200468627,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1591819089
    }
]