[
    {
        "content": "<p>Hello!<br>\nI've been exploring hapi-fhir's new multitenancy support using the JPA starter project.</p>\n<p>It's been tricky, though:</p>\n<ul>\n<li>it took quite a while to figure out how to create partitions/tenants (the docs don't mention you must refer to a \"DEFAULT\" tenant for these operations)</li>\n<li>Resource creation  fails if auto_create_placeholder_reference_targets is true and your resource refers to something not yet created (it looks like that makes an update call that doesn't include the request, so the tenant can't be extracted)</li>\n<li>...and there's a bug in jpa starter where that flag ^ is set to the value of a different, similarly-named config flag</li>\n<li>now that I've gotten this far (with local fixes), I can create tenants <span aria-label=\"thumbs up\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"thumbs up\">:thumbs_up:</span>  but when I create a patient &amp; condition for tenant A, then query tenant B for that condition...  it comes back.  :(</li>\n</ul>\n<p>Is anyone else working with this feature?  Is there anything other than the 5.2.0 release I should be working with? Are there other feature I just need to disable, because they don't play nicely with multi-tenancy yet?</p>\n<p>Any guidance at all would be very welcome. :)</p>\n<p>I'll of course be happy to contribute my little fixes back, but I really need to know if this is a feature that just isn't usable yet.</p>\n<p>Thanks!</p>\n<p>EDIT: next issue found: I'm disabling reuse of cached search results, but there's an issue in Spring Boot passing a null from yaml into config... but that's what DaoConfig.setReuseCachedSearchResultsForMillis() requires to disable this feature.<br>\nHmm; and even with search caching disabled, any tenant in the URL returns the same resources. Back to the debugger.</p>",
        "id": 218428026,
        "sender_full_name": "Rob Whelan",
        "timestamp": 1606832718
    },
    {
        "content": "<p>if there are problems with thee starter project, then please submit an issue on the github page</p>",
        "id": 218481518,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1606856717
    },
    {
        "content": "<p>a lot of stuff in regards to configuration has moved a lot</p>",
        "id": 218481561,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1606856741
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"367059\">@Rob Whelan</span></p>",
        "id": 218481570,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1606856749
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191427\">@Jens Villadsen</span> , I will — at this point, I'm just hoping to find out how stable this feature is in hapi-fhir, itself.</p>\n<p>So far I've found that (once the config issues in jpaserver-starter are fixed) the multi-tenancy works fine for creating resources and fetching them back by ID.  This correctly returns empty (this condition was created in TENANT_A, and I can fetch it there):</p>\n<div class=\"codehilite\"><pre><span></span><code>http GET localhost:8080/fhir/TENANT_B/Condition/2\n</code></pre></div>\n<p>But this returns the Condition, even though it's the wrong  tenant:</p>\n<div class=\"codehilite\"><pre><span></span><code>http GET localhost:8080/fhir/TENANT_B/Condition?_id=2\n</code></pre></div>\n<p>There's a config setting, <code>getAllowReferencesAcrossPartitions</code> that I've also set to false (and double-checked in the debugger), but there's nothing else in config that seems at all relevant.</p>\n<p>I'll raise an issue in the hapi-fhir project once I've verified this a bit more.<br>\nIt does seem like there are real issues, and not just mis-config.</p>\n<p>That may be the best way to get some input from someone working on the project, if this feature is still at a stage where basic bugs like this are expected, or if there are known workarounds that'll provide something usable.</p>",
        "id": 218522776,
        "sender_full_name": "Rob Whelan",
        "timestamp": 1606894673
    },
    {
        "content": "<p>Update for anyone following here: James A fixed the blocking bug I hit in core (yesterday), so the fix will be in the next release. <span aria-label=\"celebration\" class=\"emoji emoji-1f388\" role=\"img\" title=\"celebration\">:celebration:</span></p>",
        "id": 218664639,
        "sender_full_name": "Rob Whelan",
        "timestamp": 1606984124
    }
]