[
    {
        "content": "<p>Just upgraded our hapi installation to 3.8 from 3.7 and hapi stopped searching for names.<br>\nIf i search for a Patient with Patient?name=foo, hapi can't find any patients. However if a create a new Patient searching for names works.<br>\nAny idea which kind of index i have to reset?</p>",
        "id": 172490447,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1564996925
    },
    {
        "content": "<p>Did you run the database migrator command during the upgrade? If not, you probably need to do that..</p>",
        "id": 172529127,
        "sender_full_name": "James Agnew",
        "timestamp": 1565031955
    },
    {
        "content": "<p>i did. it showed that there is no needed update</p>",
        "id": 172529196,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1565031982
    },
    {
        "content": "<p>i'm not sure if our server was updated from 3.5 -&gt; 3.7 before .But in 3.7 everything worked. Do you think by upgrading to 3.8 now, something got triggered which didn't showed in 3.7? If so, is it safe to run a migration e.g. from 3.4 - 3.8 just to be sure? or can this cause problems?</p>",
        "id": 172529393,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1565032147
    },
    {
        "content": "<p>Yup, it's always safe to run the migrator from older versions, it'll only make changes that are needed.</p>\n<p>Can you check your <code>HFJ_SPIDX_STRING</code> table to see if there are any null values in the <code>HASH_IDENTITY</code> column? If so, that's the issue. This column was added in 3.6 but we only switched to using it in 3.8 so if you did a 3.5-&gt;3.x migration without running the migrator that's almost certainly the issue.</p>",
        "id": 172531885,
        "sender_full_name": "James Agnew",
        "timestamp": 1565034178
    },
    {
        "content": "<p>thanks a lot. I think that caused the issue. Running the migration tool didn't change anything (i think because the index was already created through the first start of 3.7 or 3.8 ? So the script assumes \"nothing to do there\"?<br>\nTo prevent such issues, did you ever discuss using liquibase to automatically upgrade DB schema if needed?</p>",
        "id": 172538188,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1565039138
    },
    {
        "content": "<p>Yeah, it may be identifying that nothing is needed since some of the indexes have been built already. You could force the indexes to be rebuilt by invoking the <code>$mark-all-resources-for-reindexing</code> operation at the root of the server).</p>\n<p>We looked at liquibase and flyway, but ultimately wanted something more flexible (and we suffer a bit from not-inveted-here syndrome :) ). The intent with the migrator tool is definitely that it will be able to run automatically in the future when configured to do so. We're almost there.</p>",
        "id": 172552781,
        "sender_full_name": "James Agnew",
        "timestamp": 1565054673
    },
    {
        "content": "<p>great news. And thanks, reindexing solved all our problems</p>",
        "id": 172583714,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1565094917
    },
    {
        "content": "<p>woohoo! man, we really need to automate that</p>",
        "id": 172588979,
        "sender_full_name": "James Agnew",
        "timestamp": 1565098827
    }
]