[
    {
        "content": "<p>Hi! I'm using hapi as a facade to a system with a proprietary API and have to deliver some basic statistics about measurements of a group of patients. I think the <a href=\"http://hl7.org/fhir/observation-operation-stats.html\">$stats operation on Observation resource</a> with a Group as Subject would be a nice representation in FHIR. I'm wondering if hapi supports $stats operations for Observation at all. I tried to GET on the public R4 test server with this request: <code>http://hapi.fhir.org/baseR4/Observation/$stats?subject=Patient/123&amp;code=55284-4&amp;system=http://loinc.org&amp;duration=1&amp;statistic=average&amp;statistic=min&amp;statistic=max</code> and hapi returns an error, bc the endpoint does not know how to handle GET operations [Observation/$stats] with given parameters. Is this not implemented in hapi, yet?</p>",
        "id": 226782075,
        "sender_full_name": "Nils Benning",
        "timestamp": 1613639274
    },
    {
        "content": "<p>Have you inspected the server's CapabilityStatement to see if the operation is supported ?</p>",
        "id": 226784587,
        "sender_full_name": "René Spronk",
        "timestamp": 1613640806
    },
    {
        "content": "<p>Hi René, thanks for the hint. Had a look at the CapabilityStatement - HAPI public test server seems not to support $stats operation on Observations. Anyhow, this must not mean that HAPI doesn't implement the operation, does it? It would be quite helpful to have any test server which supports it, to implement it on my side in a compliant way.</p>",
        "id": 226870080,
        "sender_full_name": "Nils Benning",
        "timestamp": 1613678059
    },
    {
        "content": "<p><a href=\"http://test.fhir.org\">test.fhir.org</a> tends to support the most (more exotic/new) features of the FHIR spec, so you could give that one a try.. on HAPI it'd just be a matter of developing a plugin.</p>",
        "id": 226929012,
        "sender_full_name": "René Spronk",
        "timestamp": 1613720394
    },
    {
        "content": "<p><a href=\"http://test.fhir.org\">test.fhir.org</a> reports an \"Invalid class typecast\" for the above-mentioned request -- seems like I am working on a rather exotic feature. From a development perspective in HAPI you are right, however it would be helpful to have a 'established' server which supports the operation, in order to be \"compliant\". But I start to believe this might be meaningless for such an exotic feature. Thanks once again!</p>",
        "id": 226946946,
        "sender_full_name": "Nils Benning",
        "timestamp": 1613731613
    }
]