[
    {
        "content": "<p>Hi, I would like to make experiments with the query API of the HAPI server. Could somebody who has some experience with the technical internals point me to some of the classes that are responsible for the parsing and traversing of the _query parameters, so I could reuse those parts ?<br>\nGreetings</p>",
        "id": 153985745,
        "sender_full_name": "Georg Fette",
        "timestamp": 1534161035
    },
    {
        "content": "<p>Assuming you mean the JPA server, you're probably looking for the class <code>SearchBuilder</code>.</p>",
        "id": 153985879,
        "sender_full_name": "James Agnew",
        "timestamp": 1534188073
    },
    {
        "content": "<p>Thank you. It could be that I mean this class, but I first have to dig a bit through the code from there.<br>\nI would like to write an alternative query engine, so the JPA server could be the right place, although I would have thought to find the hook I am looking for some layers towards the abstract side because the thing I want to write isn't exactly a JPA server. I would like to find the place were the HAPI server takes the query request and gives it to the the arbitrary persistence layer where the query engine is also located.</p>\n<p>Is the complete query represented by the SearchParameterMap which is passed in createQuery ? In createQuery the parameters for the AND and OR are explicitly processed. Are concepts like chained parameters, reverse chaining, composite search parameters and filter contained in the elements of the SearchParameterMap ?</p>",
        "id": 153986272,
        "sender_full_name": "Georg Fette",
        "timestamp": 1534244377
    },
    {
        "content": "<p>Is this useful? <a href=\"https://nhsconnect.github.io/CareConnectAPI/build_patient_server.html\" target=\"_blank\" title=\"https://nhsconnect.github.io/CareConnectAPI/build_patient_server.html\">https://nhsconnect.github.io/CareConnectAPI/build_patient_server.html</a> We use this RESTful server as is but then implement our own query engine.</p>",
        "id": 153986273,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1534244780
    },
    {
        "content": "<p>Ah, thanks. I did not know the CareConnectAPI yet. Interesting. Is the CareConnectAPI (besides the API parts for non-FHIR parts like security) something like a facade for FHIR that can be used to capsule APIs like that of the HAPI server ?  It looks like a big REST-API-adapter that combines a lot of APIs, but does it also have a processing logic in itself or does it only serve as a bundle of APIs ?</p>\n<p>Is the CCRI an alternative to HAPI ?</p>\n<p>What software part represents the REST-API-part of the CareConnectAPI that I could use to use it as my facade for the FHIR query ? I found a gibthub repository (<a href=\"https://github.com/nhsconnect/CareConnectAPI\" target=\"_blank\" title=\"https://github.com/nhsconnect/CareConnectAPI\">https://github.com/nhsconnect/CareConnectAPI</a>). Would I still use HAPI (or CCRI) as a processing server and replace parts in those FHIR servers to fulfill my needs, or would I directly implement something that gets attached to the CareConnectAPI ?</p>",
        "id": 153986281,
        "sender_full_name": "Georg Fette",
        "timestamp": 1534247614
    },
    {
        "content": "<p>CCRI is UK equivalent of USA's HSPC (Argonaut) Reference Implementation. HSPC used HAPI JPA server but we wanted to show you could use HAPI to create a FHIR server with an existing SQL server.<br>\nHAPI does most of the REST and FHIR object work. We added the SQL to HAPI translations using JPA/Hibernate.</p>",
        "id": 153986346,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1534258574
    },
    {
        "content": "<p>It's still a HAPI FHIR Server but the internals are different.</p>",
        "id": 153986347,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1534258725
    }
]