[
    {
        "content": "<p>Hi all,</p>\n<p>We are making use of HAPI FHIR as a central repository system to store patient data for reporting.<br>\nIn our Dev environment we have been using HAPI FHIR from Docker and connecting to a PostGres database (also running within a Docker container), this has been serving our purposes for Dev and test but would like to know if there are any guides for deploying to production in terms of:<br>\n1)  how to size hardware<br>\n2) Should we use Docker in production</p>\n<p>Has anyone been through a production planning exercise and have anything they would be able to share with us?</p>\n<p>Thanks</p>\n<p>Peter</p>",
        "id": 254009366,
        "sender_full_name": "Peter Imrie",
        "timestamp": 1632123651
    },
    {
        "content": "<p>Hi, this depends on many factors. We are using Docker in Production,  for hapi we are using 4 cores and 8GB of RAM which works fine in our use-case. I would say minimum 2 cores and 4 GB are needed.</p>",
        "id": 254014113,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1632126517
    },
    {
        "content": "<p>Thanks Patrick,</p>\n<p>Are you running the database separately or also in Docker?</p>",
        "id": 254015471,
        "sender_full_name": "Peter Imrie",
        "timestamp": 1632127354
    },
    {
        "content": "<p>Postgres also in Docker</p>",
        "id": 254015552,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1632127403
    },
    {
        "content": "<p>Thanks! <br>\nWhat sort of transaction volumes are you catering for with the set up you currently have? </p>\n<p>In terms of the database, do you have a separate volume for the data files and are you clustering the db at all?</p>",
        "id": 254029995,
        "sender_full_name": "Peter Imrie",
        "timestamp": 1632134932
    },
    {
        "content": "<p>Just a bump on this thread if anyone has any real world experience deploying a production instance of Hapi FHIR and if there is any further advice on sizing and gotchas etc</p>",
        "id": 254484272,
        "sender_full_name": "Peter Imrie",
        "timestamp": 1632376087
    },
    {
        "content": "<p>A setup of mine hosts roughly +10 HAPI FHIR servers. Ill vouch for Patricks advice</p>",
        "id": 254484596,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1632376386
    },
    {
        "content": "<p>Thanks Jens. We are looking at about 200 000 patients with +- 10 years of clinical data which will have quite a heavy initial write process as all the data is imported, followed by a heavy read as data is then extracted. Trying to gauge how best to size and set up underlying DB etc</p>",
        "id": 254495476,
        "sender_full_name": "Peter Imrie",
        "timestamp": 1632383496
    }
]