[
    {
        "content": "<p>Hi All,</p>\n<p>How do I query the Patient Phone number from Patient Resource along with the Appointment resource?. In case of _include, it returns whole resource, instead can't we get phone field as part of Appointment response?</p>\n<p>I am looking for a response like below, selecting the fields from Patient and Appointment resources by joining patient id</p>\n<p>select <a href=\"http://p.id\">p.id</a>, <a href=\"http://p.name\">p.name</a>, <a href=\"http://p.phone\">p.phone</a>, a.starttime, a.endtime, a.practitioner from patient p, appointment a where p.patientid = a.patientid</p>",
        "id": 250447576,
        "sender_full_name": "Kishore Karanam",
        "timestamp": 1629787333
    },
    {
        "content": "<p>Fhir doesn't define a way for you to retrieve attributes independent of the resource that contains them, you only query resources, you only _include resources. You can query by the value of an attribute, but you don't retrieve an attribute. (Unless you dive into custom operations where you define the return fields, Attribute X from Resource A, Attribute Y from Resource B....). </p>\n<p>Let's take that scenario, You get a list of Appointments for the day and the phone number of the patient. When your desk person calls the patient, who do they ask for if they only have the phone number available? FHIR is a sip protocol, you only retrieve the data at the time you need it. Retrieve the list of appointments, If you need Patient data (to put on the screen, print a signin roster,  call to reschedule) retrieve the pt resource at that moment.</p>",
        "id": 250480974,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1629810111
    },
    {
        "content": "<p>Hm..I have a requirement to show the list of appointments with \"Patient Name\" and \"Phone Number\" together on the screen ( attached the screen). We can retrieve the Patient name from Subject -&gt; Display Name, but the phone number will be residing in the Patient resource. As per your suggestion, if we click on the appointment and then call the patient resource to show the phone number will be a lengthy process. </p>\n<p>Do we have any other solution out of the box to achieve the same?</p>\n<p><a href=\"/user_uploads/10155/_9Txe7o1N5m48CGg_YUXPqf7/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/_9Txe7o1N5m48CGg_YUXPqf7/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/_9Txe7o1N5m48CGg_YUXPqf7/image.png\"></a></div>",
        "id": 250483925,
        "sender_full_name": "Kishore Karanam",
        "timestamp": 1629811442
    },
    {
        "content": "<p>The patient resource is not a large resource. If you think it is too lengthy to retrieve a single resource JIT, and too large a data lift to retrieve the whole Patient resource when you retrieve the Appointment resource, then you are going to have to do something custom. Whether that is a custom operation or a custom extension to hold the list of pt phone numbers on the Appointment resource. Personally I think you need to retrieve the full patient resource (either JIT or pre-load). If you go down the route of customization, you are going to be customizing forever. 1) Personally I don't trust that the reference.display is always populated. 2) tomorrow they'll want the gender, do you add another extension to appointment to hold pt gender? 3) Day after, they'll want pt birthdate, is that another custom extension? 4) Next week, they'll want the gender pronouns, another custom extension? 5) Oh wait, the pt is a minor, we need an extension to hold the Parents names, genders, pronouns too... How many extensions do you add before it would've been easier just to _include the Patient (and minor RelatedPerson) resource(s)?</p>\n<p>SQL server lets you take nibbles, just the attribute(s) you want. Base FHIR is bite sized chunks. If you want nibbles you are into custom land.</p>",
        "id": 250492622,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1629815216
    },
    {
        "content": "<p>Yaah true and make sense. Just a final question, can we get each appointment along with the patient associated in the single entry? As of now when I use _include, I am getting first appointments and then a list of patients. If I get each \"Apppintment+Patient\" as a single entry, it will be helpful to parse and show, otherwise will have to iterate and parse.</p>\n<p>If this is possible, please provide an example for the same so that it helps alot.</p>",
        "id": 250498395,
        "sender_full_name": "Kishore Karanam",
        "timestamp": 1629817431
    },
    {
        "content": "<p>Each entry in a bundle can only contain 1 resource (or other info, but never 2 resources).</p>",
        "id": 250529883,
        "sender_full_name": "Daniel Venton",
        "timestamp": 1629830854
    },
    {
        "content": "<p>The _include option seems to be the way to go since it's FHIR standard.  Not sure but it seems like code (an associative array/dictionary) can be used to link each Appointment with the Patient resources that are returns in the bundle.entry[] array.</p>",
        "id": 250635967,
        "sender_full_name": "John Silva",
        "timestamp": 1629905355
    }
]