[
    {
        "content": "<p>How to show that FHIR supports semantic interoperability?Can we do this using HAPI. I am exploring HAPI for maintaining epileptic data.</p>",
        "id": 153859900,
        "sender_full_name": "Shalini Sheoran",
        "timestamp": 1480680811
    },
    {
        "content": "<p><a href=\"https://www.hl7.org/fhir/questionnaire.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/questionnaire.html\">https://www.hl7.org/fhir/questionnaire.html</a> . How to use questionnaire  for checking for semantic interoperability.</p>",
        "id": 153859901,
        "sender_full_name": "Shalini Sheoran",
        "timestamp": 1480680899
    },
    {
        "content": "<p>Can you explain what you mean by this? FHIR is probably best understood as a building block for interoperable systems, but you still need agreement or conventions about semantics, vocabulary, etc. </p>",
        "id": 153859907,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1480683230
    },
    {
        "content": "<p>Let's consider there are two patients. And these two patients while using a text area to answer a question in a questionnaire ( Questionnaire.group.text) uses two different words : huge and large. How does HAPI parser takes care of this? I mean how it is being standardized? I am exploring FHIR for storing epileptic data. I want to see a example demo of FHIR supporting semantic interoperability?</p>",
        "id": 153859915,
        "sender_full_name": "Shalini Sheoran",
        "timestamp": 1480684116
    },
    {
        "content": "<p>HAPI (and FHIR in general) will provide you with building blocks you could use to build a syntactically interoperable solution, or a semantically interoperable solution, or even a solution that isn't interoperable at all. It's up to you to choose how to use it.</p>\n<p>If you and your trading partners have chosen to put your data in a freetext field you're probably headed down a path of syntactic interoperability only. If you and your trading partners choose to use a coded field with codes drawn from an agreed-upon valueset, you may well achieve semantic interoperability.</p>",
        "id": 153859945,
        "sender_full_name": "James Agnew",
        "timestamp": 1480692710
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span>  Ok. Are there any existing coded or structured elements, where we can see semantic interoperability being implemented. Basically, I wanted to understand how semantic interoperability is being supported in FHIR. Any pointers on which resources can I try to see where data is structured and semantic interoperability is happening?</p>",
        "id": 153859957,
        "sender_full_name": "Shalini Sheoran",
        "timestamp": 1480696943
    },
    {
        "content": "<p>Observation would be a good resource to start with. The FHIR <a href=\"http://hl7.org/fhir/observation-examples.html\" target=\"_blank\" title=\"http://hl7.org/fhir/observation-examples.html\">examples page</a> for that resource has a bunch of good examples of structured data, and lots of people are doing interesting real-world interoperability things with the Observation resource.</p>",
        "id": 153860041,
        "sender_full_name": "James Agnew",
        "timestamp": 1480713485
    }
]