[
    {
        "content": "<p>I have an exotic case where a customer of mine would like the outer interface to be Web service SOAP based and the interior to be FHIR based. Does anyone have any good input on how to make this as hazzle free as possible? Setting up HAPI FHIR and the endpoints is not the issue. The issue is to make the FHIR model or parts of it as easy mappable to a Java based SOAP infrastructure. I have wondered how much is doable with looking into Document/literal WSDL binding but it is not really 'my thing'/comfort zone</p>",
        "id": 191877573,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1585226497
    },
    {
        "content": "<p>It depends on what web services they'd like to have (or: are having). Creating create, read, update and delete (and query stored procedure) SOAP-based services would be the easiest mapping of course.</p>",
        "id": 191901699,
        "sender_full_name": "René Spronk",
        "timestamp": 1585236667
    },
    {
        "content": "<p>right ... the setup IS exotic ... and probably too custom to have a sane generalization strategy for</p>",
        "id": 191944477,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1585254634
    },
    {
        "content": "<p>I think Italy (?) had a similar challenge as Denmark does: the national secure infrastructure is based on SOAP. Obviously FHIR can be used in a services context, as messages, as documents, as a set of services that mimics REST, or as some other collection of (micro)services. The options are wide open. One option would be to re-implement any existing services to use FHIR payloads. If you're designing new services next to old ones, the granularity and style of the new services should probably be aligned with the design philosophy of the old ones to ensure ease of uptake.</p>",
        "id": 191983365,
        "sender_full_name": "René Spronk",
        "timestamp": 1585293966
    },
    {
        "content": "<p>There's no good computable path using SOAP and FHIR in combination. I guess we'll do a custom SOAP endpoint and bridge that for the HAPI backend. Then once the national infrastructure is capable of something else, we can remove that part ...</p>",
        "id": 192030971,
        "sender_full_name": "Jens Villadsen",
        "timestamp": 1585321752
    }
]