[
    {
        "content": "<p>Can we have the email notifications disabled?</p>\n<p>Details of email is:</p>\n<p><em>This issue has been automatically marked as stale because it has not had recent activity. It will be closed if no further activity occurs. Thank you for your contributions.</em></p>\n<p>I'm getting around 100 emails an hour.</p>",
        "id": 191206848,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1584686806
    },
    {
        "content": "<p>auto deleting issues, just because they are old/stale also seems possibly dangerous to me?</p>",
        "id": 191207569,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1584687896
    },
    {
        "content": "<p>Sorry about this. :(</p>\n<p>We installed this bot to auto-close issues that haven't seen any activity in over 2 years. Patrick I do take your point about the danger in doing so, but my counterpoint is that we get so many issues reported that it is really hard to separate important issues from long-forgotten obsolete ones and without some sort of cleanup we have a bigger risk of new/relevant issues being ignored.</p>\n<p>My hope is that the email flood was a one-time thing while all the old bugs from 2014 got cleaned up. There will definitely be another flood though when all the candidates for closing actually get closed (stale bot issues a warning that the bug is stale and lets the author or anyone else add a comment stating that it's still active.. so there is a 2 week grace period)</p>",
        "id": 191240878,
        "sender_full_name": "James Agnew",
        "timestamp": 1584710329
    },
    {
        "content": "<p>no worries. Just was unexpected (filtering them for now).<br>\nAnd i have to agree, issues 2+ years old probably were already fixed or reported again - therefore not inactive.</p>",
        "id": 191252665,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1584715959
    },
    {
        "content": "<p>No worries. All good now</p>",
        "id": 191269510,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1584722850
    }
]