[
    {
        "content": "<p>In our auto-generated Conformance statement /metadata, we are seeing entries for StructureDefinition and OperationDefinition. The latter only supports read and has entries for each of the contained OperationDefinitions in the Conformance resource itself (which is strange, because they could be referenced/linked, and not contained).<br>\nThe former indicates both read and search-type support.  Search returns a single entry for [base]/StructureDefinition/operationoutcome but this doesn't resolve.</p>\n<p>We're wondering how/why this is happening and what we can do to fix things</p>",
        "id": 153835381,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1467089908
    },
    {
        "content": "<p>[deleted]</p>",
        "id": 153835382,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1467090104
    },
    {
        "content": "<p>Ah yeah, the conformance generation post-DSTU1 still has some quirks to it. We put a lot of work getting it perfect for DSTU1 but conformance has been a bit of a moving target ever since so we haven't ever quite nailed it.</p>\n<p>If you wanted to file a bug about this in our tracker, great. If you want to know where to look to try and correct it, the conformance statement is generated in a class called <code>ServerConformanceProvider</code> (note that there are 3 versions of this class, one for each FHIR version)</p>",
        "id": 153835458,
        "sender_full_name": "James Agnew",
        "timestamp": 1467122179
    },
    {
        "content": "<p>Ah, thanks for that background.  We already massage some things via a <code>ServerConformanceProvider</code> subclass, so we'll beef that up as the short-term and raise some issues for the long term</p>",
        "id": 153835552,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1467155593
    },
    {
        "content": "<p>#395 raised becuase we can't see (and remove) the generated <code>OperationDefinition</code>s when overriding <code>ServerConformanceProvider</code></p>",
        "id": 153835565,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1467164033
    }
]