[
    {
        "content": "<p>Cross-Post in Subscriptions: <a href=\"#narrow/stream/179229-subscriptions/topic/Subscription.20vs.2E.20Interceptor.2FHook/near/214217622\">https://chat.fhir.org/#narrow/stream/179229-subscriptions/topic/Subscription.20vs.2E.20Interceptor.2FHook/near/214217622</a></p>\n<p>We are building a FHIR system where the data is ingested through FHIR, but then needs to be transformed by a separate service. I'm trying to find the balances between writing a custom interceptor to take that data after it's been saved and send that data to our job queue (MSK/Kafka) or whether to use Subscriptions with Kafka-rest. I think I've settled on the latter approach, but wanted to post here to see if folks had any thoughts, feedback. Are subscriptions any more or less reliable than using interceptors to kick off that job?</p>",
        "id": 214320000,
        "sender_full_name": "OS",
        "timestamp": 1603463179
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"285887\">@OS</span>  - Both options should be reliable, but the big difference is that interceptors are synchronous where subscriptions (ie. called within the DB transaction) are asynchronous (called outside of it).</p>",
        "id": 214491672,
        "sender_full_name": "James Agnew",
        "timestamp": 1603635395
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191319\">@James Agnew</span>  should we enable any feature in the HAPI while installing to enable the subscription resource? <br>\nI tried to hit the public hapi server endpoint with a subscription resource and it works but it does not work when I replicate the HAPI FHIR in local</p>",
        "id": 222055978,
        "sender_full_name": "Vibin_chander",
        "timestamp": 1610101158
    },
    {
        "content": "<p>Can anyone  look at this issue ?.. When I try in the hapi opensource the subscription works but its not working when it is insalled in the local. Although Im getting the response OK for subscription. The data is not going to the endpoint</p>",
        "id": 223808150,
        "sender_full_name": "Vibin_chander",
        "timestamp": 1611485851
    }
]