[
    {
        "content": "<p>Our team is implementing Subscriptions using HAPI 3.8, but the limit of 1000 active subscriptions is a downside. I see that <a href=\"https://github.com/jamesagnew/hapi-fhir/pull/1487/files#diff-37147347d1e34e731d224a1afcf2c359R38\" title=\"https://github.com/jamesagnew/hapi-fhir/pull/1487/files#diff-37147347d1e34e731d224a1afcf2c359R38\">MAX_SUBSCRIPTION_RESULTS was increased to 50k</a> in 4.1, but it's not clear why this limit was lifted. Is there a performance improvement with subscription matching in 4.1?</p>",
        "id": 193610581,
        "sender_full_name": "Seth Rylan Gainey",
        "timestamp": 1586548453
    },
    {
        "content": "<p>Hi Seth- Yup, in 4.1 we added \"in memory matching\", which allows many subscriptions (depending on the complexity of the criteria you use) to be processed without any database interaction at all. This dramatically increases the scalability of the subscription matcher.</p>\n<p>When you submit a subscription to the server, you'll notice an extension added to the response. It details whether your criteria is able to take advantage of the in-memory matcher.</p>",
        "id": 193622946,
        "sender_full_name": "James Agnew",
        "timestamp": 1586556040
    },
    {
        "content": "<p>The changelog and javadocs say that in-memory matching was in 3.7+</p>\n<blockquote>\n<p>1.1.7HAPI FHIR 3.7.0 (Gale)<br>\nChanged subscription processing, if the subscription criteria are straightforward (i.e., no chained references, qualifiers or prefixes) then attempt to match the incoming resource against the criteria in-memory</p>\n</blockquote>\n<p>Although there as an improvement added in 4.1.0</p>\n<blockquote>\n<p>Add support for in-memory matching on date comparisons ge,gt,eq,lt,le.</p>\n</blockquote>\n<p>We'll continue testing. Does it sound right that the upper bound for active Subscription with \"non-in-memory\" criteria is 1000, and about 50k for in-memory criteria? If so, we may just look at disabling the use of non-in-memory criteria for our server, since they would be a small set of Subscriptions, but a disproportionate performance cost.</p>",
        "id": 193769096,
        "sender_full_name": "Seth Rylan Gainey",
        "timestamp": 1586782656
    },
    {
        "content": "<p>Hmm, yeah I guess my timeline was wrong. That sounds correct to me.</p>",
        "id": 194326159,
        "sender_full_name": "James Agnew",
        "timestamp": 1587052385
    }
]