[
    {
        "content": "<p>Hi - I need to permanently delete all instances of a subset of all resources types (Patient, Appointment, Communication etc., but not the conformance resources StructureDefinition, ValueSet, CodeSystem etc.) on several servers running the hapi fhir jpaserver v4.1.0 DSTU3.</p>\n<p>By testing it seems that the hapi-fhir-jpaserver only supports the expunge everything parameter on system level operations (eg. permanently deleting all instances of <em>all</em> resource types on a server), and not on type level operations (permanently deleting all instances of <em>a given resource type</em>). It looks like this is unchanged in v4.2.0 and the soon-to-be-released v5.0.0  (released today?! hooray).</p>\n<p>Ok, so I thought, \"oh well, I'll just first invoke the type level DELETE operation on all of the resource types I need to permanently delete, before I call the type level expunge operation with the 'expungeDeletedResources' and 'expungeOldVersions' flags set.\" - however this is not possible, since the DELETE operation is only supported on resource instances, not on resource types.. It seems a bit to use this to mark all instances of a given resource type as deleted. </p>\n<p>Can anyone help me figuring out the combination of DELETE/ expunge operations needed in my use case?</p>",
        "id": 197395882,
        "sender_full_name": "Martin Zacho Grønhøj",
        "timestamp": 1589367402
    },
    {
        "content": "<p>If you enable multi-delete (it's disabled by default) you can use a conditional delete to delete everything by type.</p>\n<p>We make it a bit hard because it would be easy to accidentally to a lot of damage. Basically, we require at least one search parameter on the condition, so you can't do:</p>\n<p><code>DELETE Patient?</code></p>\n<p>...but you could get the same effect by doing:</p>\n<p><code>DELETE Patient?_lastUpdated=gt1970</code></p>\n<p>Note that expunge has had a lot of performance optimization in the last 6 months. You'll get much more consistent performance if you upgrade to HAPI FHIR 5.0.0.</p>",
        "id": 197408885,
        "sender_full_name": "James Agnew",
        "timestamp": 1589375110
    },
    {
        "content": "<p>Thanks - I can't seem to find any documentation of multi-delete?</p>",
        "id": 197414720,
        "sender_full_name": "Martin Zacho Grønhøj",
        "timestamp": 1589377680
    },
    {
        "content": "<p>This is the setting: <a href=\"https://github.com/jamesagnew/hapi-fhir/blob/master/hapi-fhir-jpaserver-api/src/main/java/ca/uhn/fhir/jpa/api/config/DaoConfig.java#L1001\">https://github.com/jamesagnew/hapi-fhir/blob/master/hapi-fhir-jpaserver-api/src/main/java/ca/uhn/fhir/jpa/api/config/DaoConfig.java#L1001</a></p>\n<p>Looks like it's literally the only one without documentation! Whoops......</p>",
        "id": 197432588,
        "sender_full_name": "James Agnew",
        "timestamp": 1589384847
    }
]