[
    {
        "content": "<p>I am running HAPI-FHIR service in order to capture some AuditEvents for a Healthcare system which runs in Norway. I'm getting following warning from the HAP service.</p>\n<div class=\"codehilite\"><pre><span></span><code> [http-apr-8080-exec-4] WARN  c.u.f.r.s.i.ExceptionHandlingInterceptor [ExceptionHandlingInterceptor.java:135] Failure during REST processing: ca.uhn.fhir.rest.server.exceptions.InvalidRequestException: Unknown resource type &#39;FHIRAuditEvent&#39; - Server knows how to handle: [User, Condition, Parameters, ProcedureRequest, DeviceComponent, Communication, DeviceMetric, Organization, ProcessRequest, Group, ValueSet, Test, Coverage, ImmunizationRecommendation, Appointment, MedicationDispense, DetectedIssue, Slot, PaymentNotice, MedicationStatement, AppointmentResponse, ImplementationGuide, Questionnaire, Composition, EpisodeOfCare, OperationOutcome, Conformance, FamilyMemberHistory, NamingSystem, Media, Binary, HealthcareService, VisionPrescription, DocumentReference, Immunization, Bundle, Subscription, OrderResponse, ConceptMap, Practitioner, ImagingStudy, Provenance, CarePlan, Device, StructureDefinition, Order, Account, Procedure, Substance, QuestionnaireResponse, DeviceUseRequest, DiagnosticReport, Medication, MessageHeader, SupplyDelivery, Schedule, DataElement, DocumentManifest, EligibilityRequest, MedicationAdministration, Encounter, PaymentReconciliation, TestScript, List, DeviceUseStatement, OperationDefinition, Goal, ImagingObjectSelection, SearchParameter, NutritionOrder, ClaimResponse, ReferralRequest, ClinicalImpression, BodySite, Flag, CommunicationRequest, RiskAssessment, Claim, EnrollmentRequest, Location, Observation, AllergyIntolerance, ExplanationOfBenefit, Contract, SupportingDocumentation, RelatedPerson, Basic, ProcessResponse, Specimen, AuditEvent, EnrollmentResponse, SupplyRequest, Patient, EligibilityResponse, MedicationOrder, Person, DiagnosticOrder]\n</code></pre></div>\n<p>Does any body can tell me what could be the possible reason for this?</p>",
        "id": 259978850,
        "sender_full_name": "AnujAroshA",
        "timestamp": 1635850303
    }
]