[
    {
        "content": "<p>Do we create a CapabilityStatement resource for our application or is that something that is explicitly specific to the different test servers. I see there are several in <a href=\"http://test.fhir.org/r3\" target=\"_blank\" title=\"http://test.fhir.org/r3\">http://test.fhir.org/r3</a>.</p>",
        "id": 153966088,
        "sender_full_name": "Fabian",
        "timestamp": 1527781784
    },
    {
        "content": "<p>All FHIR servers must expose a CapabilityStatement at the metadata endpoint.  If you're not a FHIR server, you don't have to have a CapabilityStatement, but if you don't have one, any assertion of being \"FHIR conformant\" doesn't have much meaning/utility.</p>",
        "id": 153966091,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1527782093
    },
    {
        "content": "<p>As the FHIR server is going to be used by multiple applications would it make sense for each application to add their own CapabilityStatement resource with some sort of way so identifying that a certain CapabilityStatement maps to a certain application?</p>\n<p>For example the application we have in mind is not going to support any billing resources. If I am reading this correctly the CapabilityStatement would be the place someone would check what resources we work with.</p>\n<p>((Edited for clarity, hopefully))</p>",
        "id": 153966092,
        "sender_full_name": "Fabian",
        "timestamp": 1527782766
    },
    {
        "content": "<p>The CapabilityStatement hosted at the 'metatdata' endpoint reflects everything the server is capable of doing.  Client apps might not take advantage of all of that functionality.</p>",
        "id": 153966125,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1527800347
    },
    {
        "content": "<p>Yes. I am also looking at the FHIR standard that says <br>\n\"RESTful clients SHOULD publish a capability statement.<br>\nThe search parameters that a server supports (<strong>or a client makes use of</strong>) are specified in the resource profile that the capability statement references.\"</p>\n<p>As we are not (if I understand correctly) creating a FHIR server should we be hosting a static CapabilityStatement in our app?</p>",
        "id": 153966444,
        "sender_full_name": "Fabian",
        "timestamp": 1527861669
    },
    {
        "content": "<p>If you're creating a client app, there isn't a pre-determined space to expose your CapabilityStatement.  The simplest thing to do would be to make it downloadable from a website that describes your app.</p>",
        "id": 153966447,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1527864549
    },
    {
        "content": "<p>Just to double check... for the hackathon are we creating a FHIR server with a database or are we just focusing on being able to connect to a FHIR server and exchange data?</p>",
        "id": 153966475,
        "sender_full_name": "Fabian",
        "timestamp": 1527868599
    },
    {
        "content": "<p>That's a question for <span class=\"user-mention\" data-user-id=\"193983\">@Lilian Minne</span> :)</p>",
        "id": 153966476,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1527868642
    },
    {
        "content": "<p>Hi Fabian, for the Student Track it will be sufficient to focus on mapping your data to FHIR resources and connecting to a FHIR server to exchange your data. On the day itself try to connect your application with those of the other students!</p>",
        "id": 153967271,
        "sender_full_name": "Lilian Minne",
        "timestamp": 1528265773
    }
]