[
    {
        "content": "<p>Hi everyone,<br>\nWe've updated the Student Track page on the FHIR DevDays website. Which now includes instructions on how to prepare.<br>\nIf there are questions, please let me know!</p>",
        "id": 153898765,
        "sender_full_name": "Marten Smits",
        "timestamp": 1501160599
    },
    {
        "content": "<p><a href=\"https://www.fhirdevdays.com/student-track/\" target=\"_blank\" title=\"https://www.fhirdevdays.com/student-track/\">https://www.fhirdevdays.com/student-track/</a></p>",
        "id": 153898766,
        "sender_full_name": "Marten Smits",
        "timestamp": 1501160603
    },
    {
        "content": "<p>Hello everyone<br>\nMy name is Daniel del Aguila, I am a physician and a student of the Health Informatics Program at the Universidad de Chile. Thanks to a DAAD grant I will be performing my thesis in Heidelberg during the Winter Semester 2017.<br>\nI participated in the Student Track of the FHIR DevDays last year, and I would love to do it again but I have no team. So, I am writing here in search of a team to join or some other students interested to start a new one.<br>\nThank you!</p>",
        "id": 153902287,
        "sender_full_name": "Daniel del Aguila",
        "timestamp": 1502678010
    },
    {
        "content": "<p>Hi everyone,<br>\nMy name is Hareem Mughis, I am Master student in RWTH Aachen. And I am working on my master thesis which is around FHIR resources validations. I am writing business rules on Medication Statement Resources and validating medicationStatement resources based on those business rules. I hope to meet other students and mentors in FHIR DevDays Student-Track to share my findings and gain new ideas for my business rules.</p>",
        "id": 153919313,
        "sender_full_name": "Hareem Mughis",
        "timestamp": 1510594315
    },
    {
        "content": "<p>Hi Hareem, sounds very interesting! Can you give an example of what such a business rule would be?</p>",
        "id": 153919317,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1510597515
    },
    {
        "content": "<p>I do lots of work on the validator and have an interest in medications, so happy to touch base at devdays and see what you've done.</p>",
        "id": 153919333,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1510601880
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193208\">@Hareem Mughis</span> unfortunately i'm not at the devDays this year - but im really interested what you did. Do express business rules as DMN Tables?</p>",
        "id": 153919414,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1510654199
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> Partially, we take input from a user and process it according to business rule and then express the decision made by a business rule. Currently, we have a very specific business rule, but we are moving it towards making it as general as possible. Like the variable part of the business rule also to be taken from user and then process it.</p>",
        "id": 153919439,
        "sender_full_name": "Hareem Mughis",
        "timestamp": 1510656941
    }
]