[
    {
        "content": "<p>Hello all, I am new to all of this. One of our health centers submitted questions that were accepted in the data set and I would like to build a form and test them, but I am not sure how to do it as they don't have LOINC codes yet. I have added the panel name and the questions with the temp codes, but I am unable to figure out how to add the questions. Is there anyone available to assist or who would be willing to test this with me during the connecathon?</p>",
        "id": 197446425,
        "sender_full_name": "Karie Nicholas",
        "timestamp": 1589390398
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"297817\">@Karie Nicholas</span> Have you checked to see if there are temporary codes for the questions on the SDOHCC Master and Temporary  Code  List? <a href=\"https://confluence.hl7.org/display/GRAV/SDOH-CC+Master+and+Temporary+Code+List\">https://confluence.hl7.org/display/GRAV/SDOH-CC+Master+and+Temporary+Code+List</a></p>",
        "id": 197448402,
        "sender_full_name": "Natasha Kreisle",
        "timestamp": 1589391191
    },
    {
        "content": "<p>Hi Natasha - yes, I have found the temporary codes. I have, but I cannot use them to import the question with associated answers from LOINC. I am able to add the questions, but I am struggling with entering the answers and answer codes.</p>",
        "id": 197450061,
        "sender_full_name": "Karie Nicholas",
        "timestamp": 1589391954
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"297817\">@Karie Nicholas</span> </p>\n<p>Unfortunately, if the screening tool has not yet been coded by LOINC, you will need to craft your own Questionnaire Resource by hand.  You can retrieve a Questionnaire Resource created by the LHC forms tool (or some other Form Builder tool) and then use that one as a pattern.  Use the temporary codes established by SDOH-CC so others working on this IG will be able to make sense of the coded questionnaire.</p>",
        "id": 197481726,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1589406277
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"297817\">@Karie Nicholas</span>  Have you tried the LHC Form Builder tool?  <a href=\"https://lhcformbuilder.nlm.nih.gov/\">https://lhcformbuilder.nlm.nih.gov/</a></p>",
        "id": 197482267,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1589406666
    },
    {
        "content": "<p>Thanks Lisa.  I will look into the NIH link. I'm still trying to figure out what to do and what I can bring back that will be useful for our health centers.</p>",
        "id": 197484293,
        "sender_full_name": "Karie Nicholas",
        "timestamp": 1589408262
    },
    {
        "content": "<p>My organization is interested in using the lhc form builder and we are not sure of the next steps. If we have identified bugs or missing features, should we contribute to the project by submitting a PR with suggested fixes? Or should we fork the project for our own use? </p>\n<p>If there are any timelines on when it would be prod ready that would helpful. Hope this is the right group to reach out to! Thank you!</p>",
        "id": 210446467,
        "sender_full_name": "Maggie Beauchamp",
        "timestamp": 1600374522
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196359\">@Robert Dieterle</span> do you have any additional information or do you know who I should reach out to for these answers?</p>",
        "id": 210865560,
        "sender_full_name": "Maggie Beauchamp",
        "timestamp": 1600779416
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"310117\">@Maggie Beauchamp</span> , I'm looping in <span class=\"user-mention\" data-user-id=\"195344\">@Paul Lynch</span> . He should be able to help troubleshoot issues with the LHC Form Builder.</p>",
        "id": 210871944,
        "sender_full_name": "Liz Amos",
        "timestamp": 1600782529
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"310117\">@Maggie Beauchamp</span> I am the technical lead for the project developing the NLM form builder (among other things) and <span class=\"user-mention\" data-user-id=\"195370\">@Ajay Kanduru</span> is the main developer.  Please feel free to contact us with bugs or issues.  If we can agree on a change, a PR would be we welcome.  The form builder is open source (<a href=\"https://github.com/lhncbc/formbuilder-lhcforms\">https://github.com/lhncbc/formbuilder-lhcforms</a>) so you can fork it, though we would prefer to pull in fixes and improvements when feasible.</p>",
        "id": 210873003,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1600783012
    },
    {
        "content": "<p>Thank you, <span class=\"user-mention\" data-user-id=\"194730\">@Liz Amos</span>!</p>",
        "id": 210882019,
        "sender_full_name": "Maggie Beauchamp",
        "timestamp": 1600786638
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195344\">@Paul Lynch</span> I have sent you a PM</p>",
        "id": 210882049,
        "sender_full_name": "Maggie Beauchamp",
        "timestamp": 1600786651
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"195344\">@Paul Lynch</span> My name is AJ and I am a software developer who works  with Maggie. From your previous comment I have made a PR for the formbuilder application. I didn't see any PR templates so I hope I am not stepping on anyone's process. I'd be happy to explain the change made and was wondering who would perform the review?</p>",
        "id": 211744325,
        "sender_full_name": "AJ Stangl",
        "timestamp": 1601464191
    },
    {
        "content": "<p>(Replied about AJ's pull request via PM to AJ.)</p>",
        "id": 211812434,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1601496096
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"195344\">@Paul Lynch</span>! I wanted to reach out again about the NLM apps. We are also interested in using the SDC Questionnaire app. Are you the PM for this app as well or do you know who I should get in touch with for any questions about that app?</p>",
        "id": 223425837,
        "sender_full_name": "Maggie Beauchamp",
        "timestamp": 1611172371
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"310117\">@Maggie Beauchamp</span> Yes, I am the technical lead for the project that created the <a href=\"https://lhcforms.nlm.nih.gov/sdc\">NLM SDC Questionnaire app</a>, so feel free to ask me questions about it.</p>",
        "id": 223506943,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1611235608
    }
]