[
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"432524\">Jake Gillberg</span> <a href=\"#narrow/stream/286658-omop-.2B.20fhir/topic/Updates.20on.20FHIR.20.2B.20OMOP.20collaboration/near/258565229\">said</a>:</p>\n<blockquote>\n<p>Hello folks, I help organize the OHDSI Health Equity workgroup and participate in the OHDSI Vocabulary workgroup. For our next health equity workgroup meeting (Tuesday, November 2nd at 2PM Eastern), we plan to discuss terminologies and mappings for patient-level social determinants of health, risk factors, and needs, and other domains useful for health equity research. I'm interested in seeing how the OMOP+FHIR collaboration could look in this space, especially given the work of project Gravity. Is there anyone here familiar enough with Gravity that would be able to participate in this meeting? Possibly giving a 5-7 minute overview of the work and terminologies?</p>\n</blockquote>",
        "id": 258583521,
        "sender_full_name": "Davera Gabriel",
        "timestamp": 1634836490
    },
    {
        "content": "<p>Hello!  I wanted to be sure you folks saw this invitation from Jake Gillberg.  Please direct any questions or comments directly to Jake.  Cheers!</p>",
        "id": 258583777,
        "sender_full_name": "Davera Gabriel",
        "timestamp": 1634836577
    },
    {
        "content": "<p>Jim Shalaby will attend the November 2nd meeting to provide a brief overview of the Gravity work. If possible, a member of the Gravity team will also attend to introduce Jim.</p>",
        "id": 259155102,
        "sender_full_name": "Monique van Berkum",
        "timestamp": 1635279371
    },
    {
        "content": "<p>Hi Davera, I'd be happy to. I don't see the zoom details yet. Just wondering if you can email to me at <a href=\"mailto:jshalaby@elimu.io\">jshalaby@elimu.io</a> or just add me to the Nov 2nd invite?  Thanks!</p>",
        "id": 259245347,
        "sender_full_name": "James Shalaby",
        "timestamp": 1635344135
    },
    {
        "content": "<p>Thanks! <span class=\"user-mention\" data-user-id=\"252570\">@James Shalaby</span>, I just forwarded you the event invite, which is taking place as a meeting of the OHDSI Health Equity workgroup, in the OHDSI Teams environment. Please let me know if there are others who should receive the invite, or feel free to forward it yourself.</p>",
        "id": 259257108,
        "sender_full_name": "Jake Gillberg",
        "timestamp": 1635348369
    }
]