[
    {
        "content": "<p>Some notes of using the Graph builder part of conman</p>\n<ul>\n<li>After selecting the Graph Builder tab, select the scenario of interest from the dropdown to the upper left</li>\n<li>You can import an existing graph using the 'import' link just below the scenario dropdown. Useful if the scenarios in the track represent the evolution of a single scenario over time - eg a careplan being updated - or if someone has created a nice graph and you want to adapt that.]</li>\n<li>Add a new resource instance from the palette to the upper right. Can be Core types, logical models or profiles (profile support is very new)</li>\n<li>The page is in 2 panes<ul>\n<li>the left pane is selects an instance (with a couple of other functions)</li>\n<li>the right pane is the editor</li>\n</ul>\n</li>\n<li>The left (instance selected) pane:<ul>\n<li>Use the list to see instances in a table - also shows references from each instance, has a link to the spec (if a core type) and has a delete link for both references and the instance itself</li>\n</ul>\n</li>\n<li>\n<p>the right (editor) pane:</p>\n<ul>\n<li>\n<p>Use the table view for editing the instance (adding data etc)</p>\n<ul>\n<li>The &gt; to the left hides/shows child elements from a Backbone element</li>\n<li>The + symbol in column 2 will duplicate the selected element (if multiple) - including any children. The 'collapse' link at the upper right is useful to hide everything except the topmost elements - kind of a tidy up link.</li>\n</ul>\n</li>\n<li>\n<p>Use the Tree view to look at a populated instance</p>\n<ul>\n<li>elements with data against them are in green bold. Selecting it shows the json data to the right</li>\n<li>the 'toggle hide empty' link to the upper right hides/shows empty elements</li>\n</ul>\n</li>\n<li>\n<p>the 'resource instance tab:</p>\n<ul>\n<li>shows the complete json instance (including the most recent validation that was performed (Note that the hapi validation seems to get confused when validating coding - don't know why, and still seems to save OK)</li>\n<li>has a validation link to validate the resource against the data server</li>\n<li>also has a tree view (not sure which tree view is the best one)</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>",
        "id": 155270811,
        "sender_full_name": "David Hay",
        "timestamp": 1547659208
    }
]