[
    {
        "content": "<p>Some general notes on designing a track </p>\n<ul>\n<li>For clinical use, a track will generally be a 'resource graph' type. When you set it up, remember to set the servers (they default to sensible R3 ones though)<ul>\n<li>the 'description' tab is where a more detailed description of the track goes - the name should be short)</li>\n<li>the 'scenarios' tab is a read-only view of the scenario descriptions)</li>\n<li>the other tabs can generally be ignored</li>\n<li>try not to have 2 people editing a single track at the same time (including adding scenarios). Results will be unpredictable</li>\n</ul>\n</li>\n<li>You can use a track (type=resource graph) in a few distinct ways (or patterns):<ul>\n<li>As a collection of largely unrelated 'static' scenarios that explore different aspects of something. Each scenario can talk about steps - but it's text only (this can be confusing and I may remove it)</li>\n<li>Where the scenarios represent the evolution of something over time. eg the first scenario represents an initial careplan. Then it is altered - which is the second scenario, and so on. Or - a changing medication list. When actually building the graphs, the import function is very helpful, as you can use the 'previous' scenario as the basis for the next one, changing as necessary.</li>\n<li>A 'workflow' - where a single 'thing' is happening that's being tracked, but the resources are different in each 'step' (step=scenario). eg representing a series of consultations about something.</li>\n</ul>\n</li>\n</ul>\n<p>The clinical assessment track looks like the third way (an initial assessment and a follow up visit) - and I created it that way. It might be possible to divide the initial assessment further - eg:<br>\n1. notes at first visit<br>\n2. then add the plan<br>\n3. then the follow up visit</p>\n<p>Not so sure about  the paediatric track. It could be the first pattern - unrelated use cases. Or - it could be 2 tracks - each dealing with a single patient. So - looking at the first child:</p>\n<ul>\n<li>scenario 1 is the findings at presentation</li>\n<li>scenario 2 is the plan (including admission</li>\n<li>scenario 3 might be the referrals </li>\n</ul>\n<p>and so forth. Might pay to think about what the 'focus' of each scenario/step might be...</p>",
        "id": 155273669,
        "sender_full_name": "David Hay",
        "timestamp": 1547661613
    }
]