[
    {
        "content": "<p>I'm thinking that it's time for me to raise a new resource that I think we need. The resource would be named something like \"ConditionDefinition\" and it would have the following kinds of content:</p>\n<ul>\n<li>a code (possibly with qualifiers like severity and stage) that identified what the condition was</li>\n<li>references to formal definition of biological knowledge about this kind of condition in ontologies</li>\n<li>lab tests to display that are relevant to this kind of condition</li>\n<li>medication value sets that are relevant to this kind of condition</li>\n<li>plan definitions that are relevant to this kind of condition</li>\n<li>possibly: pre-conditions for diagnosing this kind of condition</li>\n<li>whether severity, bodyside and stage are relevant for this condition</li>\n<li>a reference to the units/specialists/organizations for this condition</li>\n</ul>\n<p>This is intended to support application work flow around condition / problem management. it's not intended as an ontological statement of the biology of the condition. </p>\n<p>With regard to SNOMED CT, I think that if you have a ConditionDefinition for a snomed code, some of the properties I have proposed might be inferred from looking at the specializations of the root concept, but most of the information is orthogonal to SNOMED CT. Even the inferrable information is only 'what is possible' not 'what is configured'</p>\n<p>I've seen several systems in the last few weeks building work flows on some kind of equivalent definition. </p>\n<p><span class=\"user-mention\" data-user-id=\"192054\">@Viet Nguyen</span>  <span class=\"user-mention\" data-user-id=\"191487\">@Russell Leftwich</span> <span class=\"user-mention\" data-user-id=\"194478\">@Susan Matney</span> <span class=\"user-mention\" data-user-id=\"191994\">@Laura Heermann</span> <span class=\"user-mention\" data-user-id=\"191403\">@Michelle (Moseman) Miller</span></p>",
        "id": 162876325,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554779608
    },
    {
        "content": "<p>(oh and <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span>)</p>",
        "id": 162876334,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554779635
    },
    {
        "content": "<p>Grahame, I think there is, or should be, alignment with the emerging IG for Clinical Practice Guidelines on FHIR (CPGonFHIR).  We will be reviewing related use cases in the Care Planning connectathon track in Montreal.  Also adding <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span></p>",
        "id": 162878201,
        "sender_full_name": "Dave Carlson",
        "timestamp": 1554782000
    },
    {
        "content": "<p>well I always believe in alignment ;-) How would they relate?</p>",
        "id": 162878216,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554782040
    },
    {
        "content": "<p>Overlap with: pre-conditions for diagnosing this kind of condition, references to associated evidence (alignment with EBMonFHIR), lab tests that are relevant (order sets within the guideline PlanDefinition), medications that are relevant (part of the guideline)</p>",
        "id": 162878438,
        "sender_full_name": "Dave Carlson",
        "timestamp": 1554782274
    },
    {
        "content": "<ul>\n<li>how does the guide do preconditions for diagnosis? (EBMonFHIR = literature evidence - different kind of evidence)</li>\n<li>lab tests to display != to lab tests to order (in what I've been shown anyway)</li>\n<li>same for medications</li>\n</ul>",
        "id": 162878616,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554782436
    },
    {
        "content": "<p>I think this sounds interesting and probably useful.  One or more examples to look at would probably be helpful.</p>",
        "id": 162884540,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1554790805
    },
    {
        "content": "<p>Probably should be diagnostic tests instead of just lab tests, body site instead of bodyside, and medication indication rather than specific medications</p>",
        "id": 162907299,
        "sender_full_name": "Russell Leftwich",
        "timestamp": 1554814667
    },
    {
        "content": "<blockquote>\n<ul>\n<li>how does the guide do preconditions for diagnosis? (EBMonFHIR = literature evidence - different kind of evidence)</li>\n<li>lab tests to display != to lab tests to order (in what I've been shown anyway)</li>\n<li>same for medications</li>\n</ul>\n</blockquote>\n<p>Most guidelines for chronic conditions include screening criteria for diagnosis or preexisting conditions/history that indicate increased risk for the condition. We are considering how these screening conditions can be expressed in a computable guideline.  For the labs and medications, sounds like a \"flowsheet\" concept.</p>",
        "id": 162926328,
        "sender_full_name": "Dave Carlson",
        "timestamp": 1554827305
    },
    {
        "content": "<p>yes more flowsheet than biological definition. screening criteria.... we do need to express that in FHIR. I do not think that is what EBMonFHIR is doing, and I don't know if that's what I'm proposing. maybe what I'm proposing should also be that?</p>",
        "id": 162944452,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554839759
    },
    {
        "content": "<p>Is there an example condition we might use to work through some of these concepts?</p>",
        "id": 162982602,
        "sender_full_name": "Russell Leftwich",
        "timestamp": 1554883023
    },
    {
        "content": "<p>no but I guess I should make one. (Having not been shouted down!)</p>",
        "id": 162994319,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1554894623
    },
    {
        "content": "<p>Not shouted down, just clarifying the use case and boundaries :-)</p>",
        "id": 163051297,
        "sender_full_name": "Dave Carlson",
        "timestamp": 1554934541
    },
    {
        "content": "<p>Two things have occurred to me the past week that support the idea of having a ConditionDefinition.  One is the issue we discovered two years ago when starting the care plan/care management track in the connectathon.  The health concern that is the reason for referral or related to the goal for the patient is not the diagnosis or on the problem list often.  The diabetic is not referred to the foot doctor because of diabetes, but because of the risk of diabetic foot complications.  Insulin is not used to treat the diabetes, it is used because the patient has insufficient insulin.  The condition treated with the diabetic diet is not diabetes, it is the chronic elevation of blood glucose.  What we also discovered was that there are no SNOMED   CT codes for \"risk of diabetic foot complications\", or chronically elevated blood glucose. The second issue that has come up this week (again) is the clinical status of Condition.  The available status values active, inactive not really appropriate for many conditions which are by definition self limited: a common cold, non-displaced wrist fracture.  And conditions that by nature are not evident most of the time: migraine headache.  Perhaps CoditionDefinition should have an element that reflects if a condition is self-limited, permanent (amputated leg), intermittently manifest, usually chronic.</p>",
        "id": 163526220,
        "sender_full_name": "Russell Leftwich",
        "timestamp": 1555469415
    },
    {
        "content": "<p>Ok: an initial draft here for people’s comment: <a href=\"http://build.fhir.org/conditiondefinition.html\" target=\"_blank\" title=\"http://build.fhir.org/conditiondefinition.html\">http://build.fhir.org/conditiondefinition.html</a>. (Should be there in a few minutes).</p>",
        "id": 166593512,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558906986
    },
    {
        "content": "<p>I’m not entirely happy with ‘definition’ as part of the name - it’s not really the definition of a condition, so much as a set of system pointers for resources that are relevant when caring for a patient with the condition</p>",
        "id": 166593520,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558907038
    },
    {
        "content": "<p>I do not think that the core definition of a problem - in an ontological sense, or a Description logic sense, is proper business for FHIR to take up - it belongs elsewhere</p>",
        "id": 166593586,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558907106
    },
    {
        "content": "<p>Whoops. ConditionDefinition.code should be 1..1</p>",
        "id": 166595216,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558909770
    }
]