[
    {
        "content": "<p>Some summary notes for using a Logical model in Conman. Idea is that you can change the resource definition, and then use instances of that definition in conman to test out the changes. For example, in ClinicalImpression - add an element 'absent' to 'finding' to indicate that something was not present. I've set up a base model for CI - these notes are how you could alter that on the day.</p>",
        "id": 155268626,
        "sender_full_name": "David Hay",
        "timestamp": 1547657433
    },
    {
        "content": "<p>(Note that if you do change the model, then you have to add a new instance to the scenario in conman - existing ones will not be updated)</p>",
        "id": 155268671,
        "sender_full_name": "David Hay",
        "timestamp": 1547657483
    },
    {
        "content": "<p>The model I've set up (which has the finding.absent element) is at <a href=\"http://clinfhir.com/logicalModeller.html#p79er\" target=\"_blank\" title=\"http://clinfhir.com/logicalModeller.html#p79er\">http://clinfhir.com/logicalModeller.html#p79er</a></p>",
        "id": 155268734,
        "sender_full_name": "David Hay",
        "timestamp": 1547657527
    },
    {
        "content": "<p>Note also that instances created from logical models cannot be saved to a server.<br>\nAlso - this is all R4 - and there are likely still bugs to be found - they earlier they are located, the more likely I'll be able to fix them before the day)</p>",
        "id": 155268802,
        "sender_full_name": "David Hay",
        "timestamp": 1547657592
    },
    {
        "content": "<p>So - process to change the model:<br>\n1. Load the model in the logical modeller (quickest way is to click the link that is in the conman track)<br>\n2. Update the model as required (again, note that this is R4 - fresh off the mint!)<br>\n3. Save the model<br>\n4. Re-load conman (shouldn't really need to, but I noticed some weird things happening during the R4 upgrade)<br>\n5. Load the track (if you click the 'clinical' button it's easier to find)<br>\n6. select the Graph Builder tab, and the scenario you're working on<br>\n7. Add a new instance of the updated model from the 'logical models' tab to the upper right<br>\n8. edit as required</p>\n<p>Remember: </p>\n<ul>\n<li>existing instances won't be updated - you'll need to delete them and re-enter the  data / references. (suggests that focus on structure, not content)</li>\n<li>instances can't be saved on a server</li>\n</ul>",
        "id": 155269382,
        "sender_full_name": "David Hay",
        "timestamp": 1547658079
    }
]