[
    {
        "content": "<p>NHS Digital are conducting a technical review of various CareConnect profiles. </p>\n<p>Profiles are to be reviewed for technical correctness and appropriateness for use within the CareConnect API’s.</p>\n<p>As part of the technical review NHS Digital’s Interoperability Standards Team (IOPS) will be running a series of interactive web sessions on the following dates; </p>\n<p>26th April - Intro to tech review of care connect profiles: 60 mins overview and how to review presentation. This will also be drop in session for questions on the review process. </p>\n<p>16th May – Session One: Review of responses for tech review of care connect profiles <br>\n21st May* - Session Two: Review of responses for tech review of care connect profiles  <br>\n23rd May*- Session Three: Review of responses for tech review of care connect profiles  </p>\n<p>*Please note that the session 1- 3 will be dependent on the amount of feedback from the community, therefore we would suggest that you book onto earlier sessions rather than wait till the tail end of them so you are able to take part. </p>\n<p>We know that some of you will be unable to make the interactive sessions but that doesn’t mean you can’t take part, we would encourage all interested parties to get involved in the review by completing the template provided and sending back to the IOPS Team mailbox <a href=\"mailto:interoperabilityteam@nhs.net\" title=\"mailto:interoperabilityteam@nhs.net\">interoperabilityteam@nhs.net</a></p>\n<p>Closing date for all comments back is Friday 10th May, 5pm. </p>\n<p>For more information and invites please see thread <a href=\"https://interopen.ryver.com/index.html#posts/2077560\" target=\"_blank\" title=\"https://interopen.ryver.com/index.html#posts/2077560\">https://interopen.ryver.com/index.html#posts/2077560</a> on INTEROPen's Ryver site or contact <a href=\"mailto:interoperabilityteam@nhs.net\" title=\"mailto:interoperabilityteam@nhs.net\">interoperabilityteam@nhs.net</a></p>",
        "id": 163553473,
        "sender_full_name": "Marcus Fearnett",
        "timestamp": 1555502190
    }
]