[
    {
        "content": "<p>o you provide healthcare IT solutions in the NHS using the HL7 FHIR standard?</p>\n<p>Are you concerned about having to upgrade to the latest FHIR release in the future?</p>\n<p>Have you considered upgrading to the latest version of FHIR?</p>\n<p>NHSX are currently doing some analysis on how healthcare IT can continue to operate in an economy of mixed versions of technical standards. The workshop will take place on Tuesday 12th October at 1pm-2:30pm.</p>\n<p>Please join us for a discussion at <a href=\"https://www.techuk.org/what-we-deliver/events/techuk-nhsx-interopen-fhir-transforms-workshop.html\">https://www.techuk.org/what-we-deliver/events/techuk-nhsx-interopen-fhir-transforms-workshop.html</a></p>",
        "id": 256438518,
        "sender_full_name": "Sufyan Patel",
        "timestamp": 1633536754
    },
    {
        "content": "<p>Are you just talking about FHIR versions? I tend to have more problems with different data models, use cases and interaction styles. </p>\n<p>For example I'm writing a series of FHIR R4 interface for a supplier. We chose not to use a national FHIR STU3 api not because of FHIR but because it was built around an alien use case and so the interactions caused issues for our clinicians use cases.  </p>\n<p>For another provider I worked on a restful FHIR R4 API which was based on CSV feeds. The CSV spec didn't cause an issue when converting to FHIR R4 because it followed a good/national data model. I'm aware converting to FHIR STU3 had some issues but that was down to interaction styles which were again designed around very specific use cases.</p>",
        "id": 256520334,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1633579446
    },
    {
        "content": "<p>At this time it is between FHIR versions. We understand that going forwards that there is a need to implement on strategy on migrating older standards but this workshop is FHIR versions.</p>",
        "id": 256588030,
        "sender_full_name": "Sufyan Patel",
        "timestamp": 1633617407
    }
]