[
    {
        "content": "<p>\"Might be better to move this to UK stream?</p>\n<p>I don't think we have one concept of what generic receive is (in the UK). From one perspective it sounds very similar to the US Da Vinci project, a way of sending alerts or notifications (not documents) to any provider. Another is a way of sending documents to GP providers via MESH (Generic receive and Transfer of Care), in some LHCRE's they are not using MESH using IHE-MHD FHIR Transactions via HTTP instead (of MESH).\"</p>\n<p>The notifications was a thought behind the digital child health thing but the main part is the mesh document piece. At the end of the day mesh is just http + storage so....</p>",
        "id": 186759460,
        "sender_full_name": "Adam Flinton",
        "timestamp": 1580197469
    },
    {
        "content": "<p>I see mesh as a transport mechanism which is required to communicate to primary care. I dont believe developers would want use it elsewhere.<br>\nI also believe we need some work on the mesh message definitions, the dont define messages as well as they could. E.g. what resources should present, how the resources link together, etc.</p>",
        "id": 186767560,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1580205485
    },
    {
        "content": "<p>We do need a (endpoint) discovery service. So if I know the ods code for an organisation, how do I deliver it.</p>",
        "id": 186767627,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1580205572
    },
    {
        "content": "<p>What's the mailbox, IP, etc</p>",
        "id": 186767684,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1580205603
    },
    {
        "content": "<p>If we're talking about Mesh then the easiest is to get onto the opentest team. <a href=\"https://digital.nhs.uk/services/path-to-live-environments/opentest-environment\" target=\"_blank\" title=\"https://digital.nhs.uk/services/path-to-live-environments/opentest-environment\">https://digital.nhs.uk/services/path-to-live-environments/opentest-environment</a>  They can issue you with some mailbox id'es you can use to bounce stuff through &amp; test with etc. In general mesh is being used more &amp; more as it's very simple &amp; though lacking in some things (e.g. a get by Workflow-ID) is very useable.</p>",
        "id": 186862835,
        "sender_full_name": "Adam Flinton",
        "timestamp": 1580283905
    },
    {
        "content": "<p>When did MESH get added to opentest, last month or two??</p>",
        "id": 186869044,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1580290750
    },
    {
        "content": "<p>Sorry I don't agree that MESH is used more, in national systems yes but not regional or below.</p>",
        "id": 186869199,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1580290873
    },
    {
        "content": "<p>Ages ago..... We have a container which does the openvn plus nginx forwarding. Very simple.</p>",
        "id": 187218294,
        "sender_full_name": "Adam Flinton",
        "timestamp": 1580674563
    }
]