[
    {
        "content": "<p>Hi, we are looking to track the Health Authority / Region (aka Health Board in Scotland) that is responsible for a patient.   EMRs typically deduce this by doing a lookup from the postcode of the current Residential Address.   Where should this data be stored against the Patient: would it be attached to an Address itself or somewhere else?  </p>\n<p>We think that the patient.managingOrganization is better mapped to the system that 'owns' this instance of the Patient Record, rather than the organization that overall manages the patient's health. For example:  patient lives in Glasgow but is admitted to Emergency Dept in Edinburgh.  The patient.managingOrganization for the Edinburgh encounter and patient record will be an Edinburgh (Lothian) organisation if the FHIR server is connected to an Edinburgh hospital, but the patient will have a GP and normal care management in Glasgow (something the Edinburgh EMR will know based on postcode mapping).  </p>\n<p>Where do we store this distinction?  Thanks! Alan.</p>",
        "id": 245465824,
        "sender_full_name": "Alan Pinder",
        "timestamp": 1625848460
    },
    {
        "content": "<p>Patient.generalPractitioner I would say.</p>\n<p>The NHS GP/Practice is in many ways responsible for the patient, but then again the GP is part of a Health Authority (or CCG in England I think). But that is probably a property of the Practice, rather than different for each patient. You wouldn't sent a letter to the Health Authority but to the registered practice/GP.</p>",
        "id": 245482968,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1625856815
    },
    {
        "content": "<p>Yes. I understand I can do a transform from GP Practice Code to eg English CCG or Scottish HB - or the EMR may already do it. I can imagine similar Jurisdiction boundary interests in other territories (Canada provinces etc). </p>\n<p>I would like our end users of the FHIR server to have this too (for analytic use and research jurisdiction data checks eg must live in my HB/CCG/Province as well as have visited my hospital for inclusion in a research cohort).  If I have the data in some way, I am wondering where to put it?</p>",
        "id": 245549669,
        "sender_full_name": "Alan Pinder",
        "timestamp": 1625922840
    },
    {
        "content": "<p>You could put it in another Organization using a link (from GP org to Authority org) with Organization.partOf.</p>",
        "id": 245552330,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1625926073
    },
    {
        "content": "<p>That sounds good to me.</p>",
        "id": 245554777,
        "sender_full_name": "Alan Pinder",
        "timestamp": 1625928950
    }
]