[
    {
        "content": "<p>Hi All, Just curious to know if HL7 official Implementation guide available for UK-Core or for England? similar to what is there for US-Core (US) on  <a href=\"https://registry.fhir.org/guides\" title=\"https://registry.fhir.org/guides\">https://registry.fhir.org/guides</a>. <br>\nI did not found IG for UK-Core or England on the same registry(<a href=\"https://registry.fhir.org/guides\" title=\"https://registry.fhir.org/guides\">https://registry.fhir.org/guides</a>). <br>\nIs below IG link correct for England?<br>\n<a href=\"https://interopen.github.io/careconnect-base-stu3/index.html\" title=\"https://interopen.github.io/careconnect-base-stu3/index.html\">https://interopen.github.io/careconnect-base-stu3/index.html</a></p>",
        "id": 193775978,
        "sender_full_name": "Kailash",
        "timestamp": 1586787405
    },
    {
        "content": "<p>This is not an official response. That careconnect IG is the only UK/England IG for STU3. For R4 the NHS has produced this IG <a href=\"https://simplifier.net/UKCore\" title=\"https://simplifier.net/UKCore\">https://simplifier.net/UKCore</a> - that I believe is the proposed IG for UK (this IG may become a HL7 style IG in the next few weeks but that is rumour).</p>",
        "id": 193860234,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1586850360
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191687\">@Kevin Mayfield</span> , Thanks</p>",
        "id": 193863960,
        "sender_full_name": "Kailash",
        "timestamp": 1586852530
    },
    {
        "content": "<p>Hi, I have a question for careconnect IG, If I am implementing STU3 in UK (England) then do I need to comply with \"<a href=\"https://interopen.github.io/careconnect-base-stu3/index.html\">https://interopen.github.io/careconnect-base-stu3/index.html</a>\" careconnect IG? What if there are some optional extensions in profile(like extension \"EthnicCategory\" in \"Patient\" profile) and I don't want to include in my profile (local profile with my own use case) ?  Thanks</p>",
        "id": 201542249,
        "sender_full_name": "Kailash",
        "timestamp": 1592756652
    },
    {
        "content": "<p>Hi Kailash, it depends what you are doing in the UK and the context. Not all projects in the UK are related to CareConnect. If you have a business agreement or requirement to support CareConnect (or a similar scope), that is one thing, but you may have other requirements completely. If you need to convey EthnicCategory, which is a commonly collected data item in the NHS in England, with a well established value set, then it would certainly be good to use that value set and that standard extension.</p>",
        "id": 201543508,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1592758794
    },
    {
        "content": "<p>As Rik says. If you want to use ethnic category I would try to use that CodeSystem. Some of the extensions are for national (England) services rather than hospitals or systems.</p>",
        "id": 201546711,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1592763637
    }
]