[
    {
        "content": "<p>Message from the <a href=\"https://simplifier.net/guide/HL7FHIRUKCoreDesignandDevelopmentApproach/Home/AssuranceandEndorsement/UKFHIRDeliverySeniorLeadershipTeam.guide.md\">UK FHIR Delivery Senior Leadership Team</a></p>\n<blockquote>\n<p>The version of UK Core (0.3.0 Pre-Release) that has been updated following Sprint 4 of Clinical and Technical Assurance is now available as a pre-release for review. </p>\n</blockquote>\n<blockquote>\n<p>This Implementation Guide is available <a href=\"https://simplifier.net/guide/ukcoreimplementationguide0.3.0-stu1/home\">here</a> and the changes which have been applied to this version(0.3.0) are documented <a href=\"https://simplifier.net/guide/UKCoreVersionHistory/Home/UKCoreSTU1Sequence/STU1Sequence.guide.md\">here</a>.<br>\nThe issues that were highlighted in the UK Core and proposed changes are detailed <a href=\"https://simplifier.net/guide/UKCoreImplementationGuide0.2.0STU1/Home/ProposedChanges/OverviewofProposedChangesForNextRelease.guide.md\">here</a>.<br>\nThere is now an opportunity for anyone who wishes to review and raise issues during a two week review period. The review runs from 27th January 2022 until 10th February 20022 . Issues can be raised <a href=\"https://simplifier.net/HL7FHIRUKCoreR4/~issues\">here</a> (requires <a href=\"http://Simplifier.net\">Simplifier.net</a> account registration).</p>\n</blockquote>\n<blockquote>\n<p><strong>Important Note:</strong> The raising of issues should only be related to the changes done for the Sprint 4 and this is not intended to be a full review of the implementation guide. This version (0.3.0 Pre-Release) will be updated following any necessary rework and become 0.4.0 forming the base for Implementation Guide 0.5.0 which is the version to be used for the Sprint 5 of Clinical and Technical Assurance.</p>\n</blockquote>\n<blockquote>\n<p><strong>Also Note:</strong> that this is distinct from the current HL7 UK Ballot on UK Core 0.1.0. Feedback from that formal process will be integrated into newer versions at a later date.<br>\nFor more information on the HL7 UK Ballot progress see the <a href=\"https://www.hl7.org.uk/2022/01/18/2279/\">HL7 UK Website</a></p>\n</blockquote>",
        "id": 269760797,
        "sender_full_name": "Ben McAlister",
        "timestamp": 1643386762
    },
    {
        "content": "<p>One of the really interesting things we noticed in UK Core (which we did comment on in the ballot) is the approach of including workflow requirements embedded in the interop spec.  For example, The UK Core AllergyIntolerance Guidance has a blurb about <strong>the consuming system MUST prevent prescribing while degraded drug allergies are present in the patient record</strong>.    Ballot comments aside, I'm curious what folks think about this sort of approach in FHIR specs.</p>",
        "id": 269771738,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1643391102
    },
    {
        "content": "<p>Hi. May I ask a question, apologies in advance if answered elsewhere.  Why are countries defining their own fhir standards rather than using R4 to begin and extending for the few exceptions ?</p>",
        "id": 270964820,
        "sender_full_name": "F Leen",
        "timestamp": 1644233602
    },
    {
        "content": "<p>UK Core does use the core FHIR standard. What is does do is add some UK rules and guidances on top. E.g. for Patient we say (English/Welsh) NHS Number is represented as </p>\n<p>{<br>\n            \"system\": \"<a href=\"https://fhir.nhs.uk/Id/nhs-number\">https://fhir.nhs.uk/Id/nhs-number</a>\",<br>\n            \"value\": \"9000000009\"<br>\n        }</p>",
        "id": 270965550,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1644234086
    },
    {
        "content": "<p>In the UK, the NHS uses the UK edition of SNOMED. So we have some rules around that. (Not so much rules but hints)</p>",
        "id": 270965738,
        "sender_full_name": "Kevin Mayfield",
        "timestamp": 1644234213
    },
    {
        "content": "<p>Thank you for the quick answer Kevin! I found this explanation from google useful too: For instance, recording a patient's ethnicity is not allowed in certain regions, but required in others. Using profiles, the FHIR base specification can define and require an \"ethnicity\" extension in accordance with the regional policies. Therefore, profiles help countries, regions, districts, and organizations customize data in accordance with their healthcare data regulations and needs.</p>",
        "id": 270967297,
        "sender_full_name": "F Leen",
        "timestamp": 1644235113
    }
]