[
    {
        "content": "<p>In the IG, it looks like there is discussion around the use of Subscriptions, which would appear to imply the use of rest hooks for communication. I was wondering if there is any planned discussion as a part of the upcoming connect-a-thon</p>",
        "id": 197317575,
        "sender_full_name": "Matt Ping",
        "timestamp": 1589307861
    },
    {
        "content": "<p>Good question Matt. There is a view that FHIR Subscriptions can supercede the need for a separately structured specification like Da Vinci Alerts. I'm thinking that there might be a need for both. If we attempt to map the concepts in DV Alerts into the subscriptions infrastructure, this might make it apparent. For example, how would the source systems produce alerts for different sets of member/patient panels (by payer, ACO, etc.), or would this still be an intermediary function (an Event Notification Service). Assuming that it is still an intermediary function, should that service transmit alerts using fhir subscriptions as well? Does it still fit the specification?</p>",
        "id": 197326722,
        "sender_full_name": "Patrick Haren",
        "timestamp": 1589311917
    },
    {
        "content": "<p>HI Matt and Patrick - we are finally discussing subscriptions in DaVinci Alerts - as part of Connectathon 26 - we have a break out session at 12:00 PM PT on the notifications track: <a href=\"https://confluence.hl7.org/display/FHIR/2021-01+Da+Vinci+-+Notifications\">https://confluence.hl7.org/display/FHIR/2021-01+Da+Vinci+-+Notifications</a></p>",
        "id": 222891923,
        "sender_full_name": "Riki Merrick",
        "timestamp": 1610731198
    },
    {
        "content": "<p>Hey Riki, to clarify, is that this session: <a href=\"https://whova.com/portal/webapp/hlsfh_202101/Agenda/1436442\">https://whova.com/portal/webapp/hlsfh_202101/Agenda/1436442</a> ?</p>",
        "id": 222892508,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1610731423
    },
    {
        "content": "<p>correct! - the subscription discussion is now here: <a href=\"https://whova.com/portal/webapp/hlsfh_202101/Agenda/1447443\">https://whova.com/portal/webapp/hlsfh_202101/Agenda/1447443</a></p>",
        "id": 222892650,
        "sender_full_name": "Riki Merrick",
        "timestamp": 1610731457
    }
]