[
    {
        "content": "<p>On page 32 of the HL7 FHIR Bulk Data API.pdf presentation, there is a note about adding components like de-identification that act as nodes in the $export process. Is there any ideas floating around on how one might request an extra 'pipeline' item (like de-id) to run on the output (or during?) an $export operation?</p>",
        "id": 174918553,
        "sender_full_name": "Jeffrey Taylor",
        "timestamp": 1567628096
    },
    {
        "content": "<p>HL7 FHIR Bulk Data API.pdf i'm speaking of can be found here: <a href=\"https://www.hl7.org/documentcenter/public_temp_EAFAF532-1C23-BA17-0C9A3E480C937714/calendarofevents/himss/2018/HL7%20FHIR%20Bulk%20Data%20API.pdf\" target=\"_blank\" title=\"https://www.hl7.org/documentcenter/public_temp_EAFAF532-1C23-BA17-0C9A3E480C937714/calendarofevents/himss/2018/HL7%20FHIR%20Bulk%20Data%20API.pdf\">https://www.hl7.org/documentcenter/public_temp_EAFAF532-1C23-BA17-0C9A3E480C937714/calendarofevents/himss/2018/HL7%20FHIR%20Bulk%20Data%20API.pdf</a></p>",
        "id": 174918587,
        "sender_full_name": "Jeffrey Taylor",
        "timestamp": 1567628117
    },
    {
        "content": "<p>Nothing like that today; the idea is that any pipeline node might expose its own <code>$export</code> endpoint. For example, organization might deploy a bulk data server behind a de-id proxy, and tell clients about the de-id proxy endpoint (or about both, and let the clients choose which endpoint to call).</p>",
        "id": 174919583,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1567628766
    },
    {
        "content": "<p>I see. In this case, how would a request to  de-id proxy endpoint differ than the regular endpoint? Would this just be something in the DNS specifying which endpoint is de-id and which is not? Or is there an opportunity here to say something like.. <code>/Patient/$export?_someParam=some-de-id-operation-specifier</code>? Where this would do both the bulk export &amp; de-id of results.</p>",
        "id": 174920003,
        "sender_full_name": "Jeffrey Taylor",
        "timestamp": 1567629047
    },
    {
        "content": "<p>The request would be a standard export request (just issued against a server that happens to return de-id results... and as a further implementation detail, a server that happens to be implanted as a proxy, sitting in this kind of pipeline arrangement in front of a fully identified export server).</p>",
        "id": 174920184,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1567629160
    },
    {
        "content": "<p>Makes sense. Thank you for the clarification.</p>",
        "id": 174920336,
        "sender_full_name": "Jeffrey Taylor",
        "timestamp": 1567629260
    }
]