[
    {
        "content": "<p>While reading the spec, I think the description about _type parameter is confusing. For example, the first sentence says </p>\n<p><code>Only resources of the specified resource types(s) SHALL be included in the response.</code></p>\n<p>but then the following paragraph says </p>\n<p><code>However, other resources outside of the patient compartment that are helpful in interpreting the patient data (such as Organization and Practitioner) may also be returned.</code> </p>\n<p>If I send request with <code>_type=Patient</code> and server returns both <code>Patient</code> and <code>Condition</code>. According to the first sentence, the response is invalid. According to the second sentence, the response is fine.<br>\nAlso, what if server does NOT have all type of resources specified in <code>_type</code>, ie <code>_type=Patient,Condition,Practitioner</code>, but server cannot return <code>Practitioner</code>. Should server throw out the request with 4xx error?</p>",
        "id": 177277334,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1570130315
    },
    {
        "content": "<p>Another question:<br>\n<code>Servers unable to support _type SHOULD return an error</code><br>\nShould we say where the error code shall be?<br>\n<span class=\"user-mention\" data-user-id=\"191414\">@Dan Gottlieb</span> <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span></p>",
        "id": 177528987,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1570461289
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191506\">@Yunwei Wang</span> ! On your first question, I think the sentence around providing additional resources outside the patient compartment is guidance on the immediately preceding sentence around what resources the sever should make available for Patient and Group requests - eg. the set of resource types that the _type parameter can subset. When _type is provided, servers should only return the resource types specified by the parameter. The way this is written is pretty confusing though - we should definitely clarify the language (or move this sentence) in the next version of the IG.</p>",
        "id": 177536626,
        "sender_full_name": "Dan Gottlieb",
        "timestamp": 1570466092
    },
    {
        "content": "<p>In terms of errors, the IG says that \"If the client explicitly asks for export of resources that the bulk data server doesn’t support, the server SHOULD return details via an OperationOutcome resource in an error response to the request.\" Of course, for resource types that are supported but don't have data, the server would just return a response with no files.</p>",
        "id": 177536681,
        "sender_full_name": "Dan Gottlieb",
        "timestamp": 1570466132
    },
    {
        "content": "<p>Regarding error codes, I agree that 4xx seems appropriate if the _type parameter isn't supported by the server or lists an invalid resource type. The IG generally specifies using a 4xx or 5xx code for kickoff request errors, but it's probably worth adding more specific guidance in future versions. Does anyone think something other than 4xx should be used for this scenario?</p>",
        "id": 177537108,
        "sender_full_name": "Dan Gottlieb",
        "timestamp": 1570466427
    },
    {
        "content": "<p>I don't understand the definition for the _type parameter on the $export operation. The definition is:</p>\n<blockquote>\n<p>A string of comma-delimited FHIR resource types. Only resources of the specified resource types(s) SHOULD be included in the response. If this parameter is omitted, the server SHOULD return all supported resources within the scope of the client authorization. For non-system-level requests, the Patient Compartment SHOULD be used as a point of reference for recommended resources to be returned as well as other resources outside of the patient compartment that are helpful in interpreting the patient data such as Organization and Practitioner. Resource references MAY be relative URIs with the format &lt;resource type&gt;/&lt;id&gt;, or absolute URIs with the same structure rooted in the base URI for the server from which the export was performed. References will be resolved looking for a resource with the specified type and id within the file set. Note: Implementations MAY limit the resources returned to specific subsets of FHIR, such as those defined in the Argonaut Implementation Guide.</p>\n</blockquote>",
        "id": 201460313,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1592625386
    },
    {
        "content": "<p>This bit makes sense:</p>\n<blockquote>\n<p>A string of comma-delimited FHIR resource types. Only resources of the specified resource types(s) SHOULD be included in the response. If this parameter is omitted, the server SHOULD return all supported resources within the scope of the client authorization. For non-system-level requests, the Patient Compartment SHOULD be used as a point of reference for recommended resources to be returned as well as other resources outside of the patient compartment that are helpful in interpreting the patient data such as Organization and Practitioner. </p>\n</blockquote>\n<p>But this next bit.... I don't know what it's talking about:</p>\n<blockquote>\n<p>Resource references MAY be relative URIs with the format &lt;resource type&gt;/&lt;id&gt;, or absolute URIs with the same structure rooted in the base URI for the server from which the export was performed. References will be resolved looking for a resource with the specified type and id within the file set. </p>\n</blockquote>\n<p>This bit makes sense:</p>\n<blockquote>\n<p>Note: Implementations MAY limit the resources returned to specific subsets of FHIR, such as those defined in the Argonaut Implementation Guide.</p>\n</blockquote>",
        "id": 201460327,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1592625439
    },
    {
        "content": "<p>I can only guess that it's stating the the resource content might have relative or absolute references inside, e.g. From patient to the managing organization resource? Even if those are also included in the bulk export?</p>",
        "id": 201462531,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1592629573
    },
    {
        "content": "<p>if that's what it's saying it shouldn't be inside the definition of the type parameter</p>",
        "id": 201462538,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1592629599
    },
    {
        "content": "<p>Hmm.</p>",
        "id": 201462544,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1592629647
    },
    {
        "content": "<p>Yup, that paragraph is in the wrong place (I suspect it got misplaced when the params were moved into a table, and no one caught it prior to publication). I fixed it on Github a few weeks ago as part of the v1.2 work: <a href=\"https://github.com/HL7/bulk-data/commit/3e89cd152838ce82c8e0370e2bc6cab7fe0b7bca\">https://github.com/HL7/bulk-data/commit/3e89cd152838ce82c8e0370e2bc6cab7fe0b7bca</a> .</p>",
        "id": 201478447,
        "sender_full_name": "Dan Gottlieb",
        "timestamp": 1592661008
    },
    {
        "content": "<p>Looking at the operation definitions for $export, _type is defined as repeating. Does this mean that a client could in theory sent multiple comma-separated lists? Or was this cardinality only choosen to reflect the part that you can have multiple single values that should be treated as a comma-separated list?</p>",
        "id": 259267839,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1635352691
    },
    {
        "content": "<p>Yup, the language in the IG is:</p>\n<blockquote>\n<p>A client MAY repeat kick-off parameters that accept comma delimited values multiple times in a kick-off request. The server SHALL treat the values provided as if they were comma delimited values within a single instance of the parameter. Note that we will be soliciting feedback on the use of comma delimited values within parameters, and depending on the response may consider deprecating this input approach in favor of repeating parameters in a future version of this IG.</p>\n</blockquote>",
        "id": 259278179,
        "sender_full_name": "Dan Gottlieb",
        "timestamp": 1635356845
    },
    {
        "content": "<p>(This is a consequence of adding support for kick-off requests that POST a FHIR Parameters resource in v2 (which have a convention of repeating parameters when there are multiple values) while retaining support for v1's comma delimited FHIR search style parameters)</p>",
        "id": 259278845,
        "sender_full_name": "Dan Gottlieb",
        "timestamp": 1635357081
    },
    {
        "content": "<p>Alright, thanks for the clarification, will clean up my implementation :)</p>",
        "id": 259302477,
        "sender_full_name": "Alexander Zautke",
        "timestamp": 1635366879
    }
]