[
    {
        "content": "<p>The <code>_since</code> parameter should limit the results to resources modified since the given date. In most cases the client would do that if it already has the previous data, which provides basic synchronization capabilities.</p>\n<p>However, this implies that:</p>\n<ol>\n<li>Client's first export was full (no _since)</li>\n<li>The client \"remembers\" the date of the last export and passes it as <code>_since</code> parameter to the next export</li>\n</ol>\n<p>Making the first (full) export may be expensive and not always desirable. If we pair the <code>_since</code> parameter with another one called <code>_until</code> (or <code>_before</code> or whatever the best name is), then it would be possible to create clients that can \"fill in the gaps\" in the data that they already have.</p>\n<p>For example, if a client already has the data for 2019-2020 but wants to have everything starting from 2018</p>\n<ul>\n<li>Currently we have to pass <code>_since=2018</code> which works but re-exports the entire 2019</li>\n<li>Alternatively, we could split that to 2 exports and omit 2019: <code>_since=2018&amp;_until=2019</code> and <code>_since=2020</code></li>\n</ul>\n<p>Also, that could eliminate the need to make that huge first export, potentially reducing the load on servers.</p>",
        "id": 240939436,
        "sender_full_name": "Vladimir Ignatov",
        "timestamp": 1622553322
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193731\">@Vladimir Ignatov</span> thanks for bringing this up! IIRC, including _until was discussed on one of the Argonaut calls and the group ultimately concluded that while there are certainly use cases where it would be helpful (e.g., the rough pagination you mentioned, filling in a failed historical request), it didn't seem critical enough to most of the core bulk use cases to be worth expanding the number of params included in the IG.</p>",
        "id": 241062526,
        "sender_full_name": "Dan Gottlieb",
        "timestamp": 1622575363
    },
    {
        "content": "<p>That said, even if it’s not written into the spec now, since the IG allows additional parameters to be used in the kickoff request, servers that do have a strong use case to support _until can add it and test it out for possible inclusion in future versions of the IG.</p>",
        "id": 241062598,
        "sender_full_name": "Dan Gottlieb",
        "timestamp": 1622575389
    }
]