[
    {
        "content": "<p>The current doc for Asynchronous API indicates that it is client initiated via the <code>Prefer: response-async</code> header.  However, is it valid for a server to initiate the protocol without that header (I very much hope so)</p>",
        "id": 153957700,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1526002882
    },
    {
        "content": "<p>We haven't discussed this. Can you say more about why allowing this behavior would be helpful for you (as apposed to specifying that it's an error, for example)?</p>",
        "id": 153957719,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1526024465
    },
    {
        "content": "<p>I don't think the server should initiate this. I think we should define a clear way for the server to inform the client that it needs to make a request asynchronously</p>",
        "id": 153957944,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1526058330
    },
    {
        "content": "<p>We have a deployment model (to enable horizontal scaling) that means all updates are queued and processed asynchronously.</p>\n<p>This doesn't need to require a client to make the request differently; the only difference is that the response code is 202 indicating that the async protocol is in play (even if the client didn't say <code>Prefer: response-async</code>.</p>\n<p>Requiring a client to make the requests \"differently\" (ie add the header) seems needlessly onerous, when it is only the responses that need to be handled differently.</p>\n<p>However, just requiring servers to announce that they behave this way via something in the <code>CapabilityStatement</code> would be good.</p>",
        "id": 153959931,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1526278760
    },
    {
        "content": "<p>why should the server be able to decide that the client can handle an async redirect properly?</p>",
        "id": 153959972,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1526281448
    },
    {
        "content": "<p>Are you suggesting that the server should refuse to accept the request then?  I can understand that behaviour if the client includes the header <code>Prefer: return=representation</code>, but if the client expresses no explicit preference, then why can't the server choose what best suits it?</p>",
        "id": 153960083,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1526290004
    },
    {
        "content": "<p>When you add an item to your queue, do you return a <code>Location</code> header with the location where the resource will appear?</p>",
        "id": 153960123,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1526291492
    },
    {
        "content": "<p>Just trying to assess how much your server follows the rules for \"a FHIR REST API server\". The <a href=\"http://hl7.org/fhir/STU3/http.html#create\" target=\"_blank\" title=\"http://hl7.org/fhir/STU3/http.html#create\">current FHIR definition</a> is a bit limited / doesn't anticipate async creation. E.g. it says:</p>\n<blockquote>\n<p>SHALL also return a Location header</p>\n</blockquote>",
        "id": 153960124,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1526291545
    },
    {
        "content": "<p>We can return either a Location URL for status of the queue entry or for the eventual location of the created resource (since that is determined before the request is enqueued)<br>\nWe're not sure which would be better</p>",
        "id": 153960215,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1526294227
    },
    {
        "content": "<p>Most of these things will be processed very quickly, so it's probably not worth the client being forced into a poll for the result type of interaction</p>",
        "id": 153960217,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1526294325
    }
]