[
    {
        "content": "<p>Based on feedback that I have had about this, we very definitely need a very clear statement about why back-ends services authentication is recommended rather than Mutual TLS.</p>",
        "id": 153930895,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1516998572
    },
    {
        "content": "<p>also, we need to explain how the client can pass an openid token to identify the end-user (if one is known / relevant) as part of using backend services</p>",
        "id": 153930896,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1516998617
    },
    {
        "content": "<p>Agreed that it's useful to define a way to pass in information about user identity.</p>",
        "id": 153930897,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1516999683
    },
    {
        "content": "<p>re: mutual TLS, these aren't exclusive; no reason you can't also do mutual TLS, but the goal here is an application-level protocol so we can work with richer claims (like user identity, target scopes, etc) directly, rather than just knowing a client's identity.</p>",
        "id": 153930898,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1516999753
    },
    {
        "content": "<p>I understand the value proposition - but it needs to be stated clearly, because everyone asks this question</p>",
        "id": 153930899,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517000041
    },
    {
        "content": "<p>and 'rather than' was meant in terms of 'why define this rather than just say use mutual tls'. I agree that you can use both - and it's worth being clear about that as well</p>",
        "id": 153930900,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517000092
    },
    {
        "content": "<p>I have rescinded the requirement that authentication is required before client registration for at least this weekend. You can hit the registration end point directly at <a href=\"http://test.fhir.org/auth/register\" target=\"_blank\" title=\"http://test.fhir.org/auth/register\">http://test.fhir.org/auth/register</a></p>",
        "id": 153931040,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517063529
    },
    {
        "content": "<p>For anyone working on implementing the Backend Services auth protocol, I pushed a client to <a href=\"https://github.com/plangthorne/python-fhir\" target=\"_blank\" title=\"https://github.com/plangthorne/python-fhir\">https://github.com/plangthorne/python-fhir</a> - example API usage is here: <a href=\"https://github.com/plangthorne/python-fhir/blob/master/demo/BulkDataDemo.ipynb\" target=\"_blank\" title=\"https://github.com/plangthorne/python-fhir/blob/master/demo/BulkDataDemo.ipynb\">https://github.com/plangthorne/python-fhir/blob/master/demo/BulkDataDemo.ipynb</a></p>\n<p>Note the client will fail if your server implementation does not yet support auth. I hope this is useful! =)</p>",
        "id": 153932109,
        "sender_full_name": "Phil Langthorne",
        "timestamp": 1517163607
    },
    {
        "content": "<p>I am in the process of integrating with Epic as a backend service to get in the bulk of patient demographic data for my app to register those patients. My app will run independently on a separate platform  ( web/mobile ) and not the iframe in the Epic's EHR. I find this (<a href=\"https://open.epic.com/Home/DeveloperTerms\" target=\"_blank\" title=\"https://open.epic.com/Home/DeveloperTerms\">https://open.epic.com/Home/DeveloperTerms</a>) documentation a bit confusing. Is this what I would have to adhere to irrespective if it is a standalone app (mobile or web) just to use the backend service ? After reading this (<a href=\"http://www.hl7.org/fhir/smart-app-launch/\" target=\"_blank\" title=\"http://www.hl7.org/fhir/smart-app-launch/\">http://www.hl7.org/fhir/smart-app-launch/</a>), it shows that my app is a SMART app and would have to follow all the TnC's necessary for a SMART app launch on the EPIC platform but if someone would conform this, it will be helpful.</p>\n<p>Also, do we have any non SMART apps that would use FHIR and integrate with EPIC?</p>",
        "id": 189231193,
        "sender_full_name": "Amogh Thali",
        "timestamp": 1582821987
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191914\">@Danielle Friend</span></p>",
        "id": 189231426,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1582822141
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"261178\">@Amogh Thali</span> those are some good questions. We do support EHR and standalone SMART on FHIR launches.  However, the <a href=\"http://open.epic.com\" target=\"_blank\" title=\"http://open.epic.com\">open.epic.com</a> sandbox and developer terms are centered around patient facing access which doesn't sound like the use case you're describing. I just sent you an pm so we can chat more indepth about what it is you're looking for/want to do for this use case.</p>",
        "id": 189322556,
        "sender_full_name": "Danielle Friend",
        "timestamp": 1582905474
    }
]