[
    {
        "content": "<p>How does the Bulk Data retrieval process and patient Consents work together? <br>\nI.e., if the server wants to exclude resources with PHI but include observations, conditions and all other resources without PHI, there should be some way to inform the client that resources do exist but excluded for the security reason vs. no such resources and what the client gets is all what the server has. Since the server MAY decide to inform the client about that, where does the OperationOutcome go?</p>\n<p>PS. I guess there is a typo in the <em>Section 3.8 Enforcing Authorization</em>:<br>\n<em>There are several cases where a client might ask for data that the <code>client</code> cannot or will not return:</em></p>",
        "id": 226326879,
        "sender_full_name": "Shamil Nizamov",
        "timestamp": 1613339770
    },
    {
        "content": "<p>Bulk Data is an interoperability specification, not a solution design. There are many things that Bulk Data specification does not address. It enables some level of security policy thru the smart specification, but this is not intended to be a full design. Privacy tends to need to be addressed as both front-door permit/deny; but also inspection and filtering of the returned results to address residual consent rules.</p>\n<p>In other words the answer to your question is, that this is an exercise left to the implementer.</p>",
        "id": 226379619,
        "sender_full_name": "John Moehrke",
        "timestamp": 1613393276
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192195\">@Shamil</span> Thanks for spotting that typo - I fixed it in <a href=\"https://github.com/HL7/bulk-data/pull/100\">PR 100</a>.</p>",
        "id": 226398204,
        "sender_full_name": "Dan Gottlieb",
        "timestamp": 1613403514
    },
    {
        "content": "<p>Regarding your question, a server could choose to pass one or more NDJSON files containing one or more OperationOutcome resources indicating data truncation through the (slightly misnamed) error field in the bulk data <a href=\"https://hl7.org/fhir/uv/bulkdata/export/index.html#response---complete-status\">output manifest</a>. In the <a href=\"http://build.fhir.org/ig/HL7/bulk-data/export.html#response---complete-status\">draft v1.5 IG</a>, we clarified that this field may be used for information level OOs in addition to errors.</p>",
        "id": 226398237,
        "sender_full_name": "Dan Gottlieb",
        "timestamp": 1613403537
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191404\">John Moehrke</span> <a href=\"#narrow/stream/179250-bulk-data/topic/Bulk.20Data.20and.20Consent/near/226379619\">said</a>:</p>\n<blockquote>\n<p>Bulk Data is an interoperability specification, not a solution design. There are many things that Bulk Data specification does not address. It enables some level of security policy thru the smart specification, but this is not intended to be a full design. Privacy tends to need to be addressed as both front-door permit/deny; but also inspection and filtering of the returned results to address residual consent rules.</p>\n</blockquote>\n<p>Thank you. It would be great to include this exact wording to the IG.</p>",
        "id": 226459417,
        "sender_full_name": "Shamil Nizamov",
        "timestamp": 1613436003
    },
    {
        "content": "<p>This language currently in the IG seems pretty close: <a href=\"http://build.fhir.org/ig/HL7/bulk-data/export.html#security-considerations\">http://build.fhir.org/ig/HL7/bulk-data/export.html#security-considerations</a></p>",
        "id": 226517017,
        "sender_full_name": "Dan Gottlieb",
        "timestamp": 1613484725
    },
    {
        "content": "<p>\"Data access control obligations can be met with a combination of in-band restrictions such as OAuth scopes, and out-of-band restrictions, where servers limit the data returned to a specific client in accordance with local considerations (e.g. policies or regulations). For example, some clients are authorized to access sensitive mental health information and some aren’t; this authorization is defined out-of-band, but when a client requests a full data set, filtering is automatically applied by the server, restricting the data that the client receives.\"</p>",
        "id": 226517024,
        "sender_full_name": "Dan Gottlieb",
        "timestamp": 1613484729
    }
]