[
    {
        "content": "<p>I downloaded and run SMART bulkdata server RI (<a href=\"https://github.com/smart-on-fhir/bulk-data-server\">https://github.com/smart-on-fhir/bulk-data-server</a>) on my local laptop. After running it several days, I could not remember which client I have added. How do I know which clients I have registered with this server? <span class=\"user-mention\" data-user-id=\"191414\">@Dan Gottlieb</span> <span class=\"user-mention\" data-user-id=\"193731\">@Vladimir Ignatov</span></p>",
        "id": 202991472,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1594043125
    },
    {
        "content": "<p>Doesn't the server just encode the client details in the URL / Client ID (and not in a database on the server side)?  So it doesn't save registration information in a traditional sense.  Just regenerate the URL / Client ID by visiting the index page in a browser.</p>",
        "id": 202992647,
        "sender_full_name": "Robert Scanlon",
        "timestamp": 1594043694
    },
    {
        "content": "<p>That is correct. No client information is stored anywhere.</p>",
        "id": 202992885,
        "sender_full_name": "Vladimir Ignatov",
        "timestamp": 1594043862
    },
    {
        "content": "<p>Do I need to create a new client ID (for the same public key) after I restart the bulk data server?</p>",
        "id": 203006745,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1594050951
    },
    {
        "content": "<p>You don't need to create client IDs. They are created for you in the home page UI. In fact, those client IDs are simply encoded version of some of the settings you  chose there . You can paste your ClientID at <a href=\"http://jwt.io\">jwt.io</a> to see what is inside. There is no client registration, thus we have no real client IDs. It is a little odd, bit it is stateless and works perfectly for a testing server.</p>",
        "id": 203008194,
        "sender_full_name": "Vladimir Ignatov",
        "timestamp": 1594051502
    }
]