[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span> <span class=\"user-mention\" data-user-id=\"195242\">@Justin Stauffer</span>  Any updates on epic fhir bulk services? request, kickoff, status etc.</p>",
        "id": 226702993,
        "sender_full_name": "Camila Altman",
        "timestamp": 1613586598
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"300989\">@Camila Altman</span>  We're working hard on support for bulk data. Do you work with Hemanth Narra? If you'd like, I bet he would be a great source of info as our dev plans and timelines finalize,.</p>",
        "id": 226822744,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1613660480
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span> Hi! I did actually email him. I like going through all avenues to get my question answered ;)</p>",
        "id": 226823970,
        "sender_full_name": "Camila Altman",
        "timestamp": 1613660899
    },
    {
        "content": "<p>I am trying to understand the current state of bulk data in Epic, so wanted to follow-up on this thread.</p>\n<p>I'm building an app to integrate with Epic, and I am trying to figure out if I can expect most Epic installations to support bulk data access, or if I should use a different method.</p>\n<p>I see Epic has <a href=\"https://fhir.epic.com/Documentation?docId=oauth2&amp;section=BackendOAuth2Guide\">documentation about SMART Backend Services authentication</a>. Does that mean bulk data is available, or is it still a work-in-progress?</p>",
        "id": 229512525,
        "sender_full_name": "Jonah Ellman",
        "timestamp": 1615309427
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191936\">@Michael Donnelly</span> <span class=\"user-mention\" data-user-id=\"191914\">@Danielle Friend</span></p>",
        "id": 229515070,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1615310232
    },
    {
        "content": "<p>As Isaac mentioned, we are working on support for bulk data.  The question is \"when\" not \"if\".  Currently, it is not broadly available for use, however that will likely change throughout the coming year.  The exact timeline will vary for different health systems, as they will need to upgrade to a specific Epic version, and upgrade schedules vary.  Note that bulk data will require that you work directly with the health systems you want to connect to.  They will very likely require contracts and agreements before granting you access, and will need to configure your access.</p>",
        "id": 229516496,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1615310737
    },
    {
        "content": "<p>'Coming year' = 2021 or 2022 ?</p>",
        "id": 229523560,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1615312972
    },
    {
        "content": "<p>It will probably end up spanning both years really.  Some health systems will probably be taking updates from Epic earlier, and rolling those out, probably in 2021.  Other organizations may have other priorities and might be taking the updates later, even as late as 2022.  I want to emphasize again that just because a health system is using the Epic software that enables Bulk FHIR, doesn't mean clients will be able to automatically begin using it.  You'll need to have all the business agreements and implementation projects completed for each individual organization.</p>",
        "id": 229534409,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1615316933
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span> this is helpful. And yup, totally understood we'd need to work with the individual organization to get access.</p>",
        "id": 229541414,
        "sender_full_name": "Jonah Ellman",
        "timestamp": 1615319370
    },
    {
        "content": "<p>For transactionTime field in the Bulk <strong>complete status output</strong> response<br>\n1) \"[instant]: Our assumption is, post kickoff request when the first query is run to fetch data that time should be displayed in transactionTime field. Please suggest if it is correct?</p>\n<p>2) It is mentioned in the Implementation guide \"The response SHOULD NOT include any resources modified after this instant\".<br>\nSince we run multiple queries, our product is not possible to not include the resources modified after [instant]. Since it is SHOULD NOT, our assumption is it is an optional statement and we can include the resources modified after [instant]. Please confirm if our assumption is right?</p>\n<p>Reference Link: <a href=\"https://hl7.org/fhir/uv/bulkdata/export/index.html#response---complete-status\">https://hl7.org/fhir/uv/bulkdata/export/index.html#response---complete-status</a></p>\n<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>  Please see if you could assist here. <br>\nThanks</p>",
        "id": 234103867,
        "sender_full_name": "Aditya Chhabra",
        "timestamp": 1618203860
    },
    {
        "content": "<p>In general, we do not describe these APIs in terms of internals on a server (\"first query\", etc). Those details are up to you. We describe the functional expectations. In general you should look at \"SHOULD\" conformance expectations as recommendations; failing to meet them might result in warnings but not errors from a test suite.</p>",
        "id": 234158292,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618234448
    }
]