[
    {
        "content": "<p>has anyone considered an alternative to respond-async in which the server is instructed to push the results to client-specified URLs?<br>\nfor example, this could be used to transfer data to an S3 bucket without it having to go via the client</p>",
        "id": 153931288,
        "sender_full_name": "Ben Spencer",
        "timestamp": 1517076455
    },
    {
        "content": "<p>we didn't like the security considerations, though we didn't spend a lot of time on it</p>",
        "id": 153931294,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517076646
    },
    {
        "content": "<p>such as the potential to send it to an improperly secured target location?</p>",
        "id": 153931303,
        "sender_full_name": "Ben Spencer",
        "timestamp": 1517078446
    },
    {
        "content": "<p>we talked about local disks on the server. we didn't talk about amazon buckets as a target</p>",
        "id": 153931304,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517078906
    },
    {
        "content": "<p>I am currently using Azure FHIR API. Is there any process where I can insert bulk data? I am expecting to get data from multiple clients and I have to process the API requests synchronously into the server. Thanks in Advance!</p>",
        "id": 204526583,
        "sender_full_name": "PKumar",
        "timestamp": 1595322905
    },
    {
        "content": "<p>To be clear, you're talking about importing data, yes? HL7 hasn't yet formalized an import spec, but there are platform specific tools in Azure. <span class=\"user-mention\" data-user-id=\"195775\">@Michael Hansen</span> may be able to share details.</p>",
        "id": 204552450,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1595340832
    },
    {
        "content": "<p>We don't have bulk import built in the service, but we do have examples in <a href=\"https://github.com/Microsoft/fhir-server-samples\">https://github.com/Microsoft/fhir-server-samples</a> of using Azure Functions to import data. If you are looking for something command line, then I have a tool here: <a href=\"https://github.com/hansenms/FhirLoader\">https://github.com/hansenms/FhirLoader</a></p>",
        "id": 204607166,
        "sender_full_name": "Michael Hansen",
        "timestamp": 1595368397
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>  and <span class=\"user-mention\" data-user-id=\"195775\">@Michael Hansen</span> </p>\n<p>Does this mean, if I have to import bulk data, <br>\nI need to write Azure functions and interact with AZURE FHIR API to load the data?<br>\nor Should I use the open-source FHIR code provided by Azure and using it + Azure functions, I should be able to perform bulk import?</p>",
        "id": 204642197,
        "sender_full_name": "PKumar",
        "timestamp": 1595407436
    },
    {
        "content": "<p>The $import spec is not formalized and not supported in either Azure API for FHIR or the OSS FHIR Server for Azure. So you will have to write \"something\" to do bulk loading. But there are good starting points in the links I sent.</p>",
        "id": 204717969,
        "sender_full_name": "Michael Hansen",
        "timestamp": 1595449391
    }
]