[
    {
        "content": "<p>do bulk-data exports have a unique identifier? I  am working up a usecase where a set of permissions needs to flow with the set of bulk data that was exported. I am trying to figure out how to identify the whole bulk given in an easy way.</p>",
        "id": 172788825,
        "sender_full_name": "John Moehrke",
        "timestamp": 1565287893
    },
    {
        "content": "<p>Not exactly; this hasn't come up. Right now a combination of the <code>request</code> and <code>timestamp</code> fields is probably the closest thing.</p>",
        "id": 172816634,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1565312135
    },
    {
        "content": "<p>Thinking out loud... Is there a logical place to throw the terms (for now just imaging a json blob). I guess we could just attach (URL or contained) the terms into the http response entity-headers? Or is there a logical place in the FHIR encoded response?</p>",
        "id": 172847146,
        "sender_full_name": "John Moehrke",
        "timestamp": 1565354168
    },
    {
        "content": "<p>terms?</p>",
        "id": 172847188,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1565354228
    },
    {
        "content": "<p>the permission terms such as reminder to recipient that they were authorized for XYZ purpose, they must keep the data encrypted at rest, they must not re-dislose, etc... Some of these are vocabulary already in our security label valueset, so could be in Bundle.meta.security; and maybe that is sufficient for most use-cases. However there might be terms like the data must be destroyed after 90 days.</p>",
        "id": 172847336,
        "sender_full_name": "John Moehrke",
        "timestamp": 1565354370
    },
    {
        "content": "<p>The thing driving this is that some lawyers insist on seeing these 'terms' attached to the data. These lawyers are not satisfied with a B-2-B 'agreement'. Some expect this kind of thing is required by GDPR</p>",
        "id": 172847458,
        "sender_full_name": "John Moehrke",
        "timestamp": 1565354469
    },
    {
        "content": "<p>I know that most are happy separating policy from transaction. This set of people are confident that the release of data would not happen if there was not agreement.  So I am not saying that this group doesn't exist...</p>",
        "id": 172847601,
        "sender_full_name": "John Moehrke",
        "timestamp": 1565354571
    },
    {
        "content": "<p>ah, so we could add required fields to carry these terms <a href=\"https://build.fhir.org/ig/HL7/bulk-data/export/index.html#response---complete-status\" target=\"_blank\" title=\"https://build.fhir.org/ig/HL7/bulk-data/export/index.html#response---complete-status\">https://build.fhir.org/ig/HL7/bulk-data/export/index.html#response---complete-status</a>    <br>\nBut are these repeated each response? yuck. Is there response fields only returned on the first? I guess it could be in the original OperationOutcome <a href=\"https://build.fhir.org/ig/HL7/bulk-data/export/index.html#response---success\" target=\"_blank\" title=\"https://build.fhir.org/ig/HL7/bulk-data/export/index.html#response---success\">https://build.fhir.org/ig/HL7/bulk-data/export/index.html#response---success</a></p>",
        "id": 172848247,
        "sender_full_name": "John Moehrke",
        "timestamp": 1565355058
    },
    {
        "content": "<p>Note I am not looking to push this fast... just experimenting</p>",
        "id": 172848257,
        "sender_full_name": "John Moehrke",
        "timestamp": 1565355074
    },
    {
        "content": "<p>it sounds to me like a use for the Contract resource....</p>",
        "id": 172848427,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1565355221
    },
    {
        "content": "<p>yes, Contract possibly... my question is how to bind that contract with the bulk response</p>",
        "id": 172849620,
        "sender_full_name": "John Moehrke",
        "timestamp": 1565356212
    },
    {
        "content": "<p>Right now you can put a Contract inside of <code>.extension.terms</code>.</p>",
        "id": 172876233,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1565375340
    },
    {
        "content": "<p>(The bulk data JSON response format gives you free rein over an \"extension\" property.)</p>",
        "id": 172876268,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1565375361
    },
    {
        "content": "<blockquote>\n<p>The thing driving this is that some lawyers insist on seeing these 'terms' attached to the data. These lawyers are not satisfied with a B-2-B 'agreement'. Some expect this kind of thing is required by GDPR</p>\n</blockquote>\n<p>This aligns with the  discussion we had on the Security stream. I for one expect something like this to be required for proper data traceability: <br>\nCompanies have the obligation to inform who has a given subject's data.<br>\nNot only \"Hospital A has 2 contracts with company B that may require sending data\" but <br>\n\"Data from patient X was sent from Hospital A to Company B  because they need it for Purpose XYZ as stated in contract 1\"</p>",
        "id": 172922567,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1565439102
    },
    {
        "content": "<p>I think there is something  linking the transfer and the contract, and not a direct link. <br>\nPerhaps that something is a contract clause, perhaps it is an assertion by the DPO. But Contract may be too big a blanket.</p>",
        "id": 172922679,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1565439306
    },
    {
        "content": "<p>Wouldn't that be a consent to use?</p>",
        "id": 172923439,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1565440830
    },
    {
        "content": "<p>That is my spot : No, i don't think it is a consent (as in \"expression of agreement\"). In my use cases I am considering that the patient does not need to consent that this data is shared. <br>\nThere is something there and it should be close to our consent construct, but it does not depend on the patient having a say.</p>",
        "id": 172953550,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1565499337
    },
    {
        "content": "<blockquote>\n<p>Wouldn't that be a consent to use?</p>\n</blockquote>\n<p>Brian, I think there are cases where Consent would be explicitly captured, but there are also other cases where a consent is not necessary but a chain of trust and terms of use must be written down. ALSO, in either of these cases there will likely be equal cases where there is no need for the facts to be inserted into the stream, from those times when participants feel they need to carry the facts in the stream. Thus I am looking for how to do that for those second cases. Carrying one or more consents, or one or more contracts, is a possible once we determine how something can be carried. I think Josh mention of .extension.terms seems the best shot for now.</p>",
        "id": 172977501,
        "sender_full_name": "John Moehrke",
        "timestamp": 1565546267
    },
    {
        "content": "<p>Ok cool. I wasn't intending patient consents, but no matter.</p>",
        "id": 172986572,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1565563696
    },
    {
        "content": "<p>Brian, I am also trying to encode nonPatient permissions in a Consent with no subject. This has uncovered a few modeling gaps, as the current design is rather focused on a Patient as the scope of the Consent. Thus when something else is scope, like Organization or Practitioner, there is a gap.</p>",
        "id": 173019327,
        "sender_full_name": "John Moehrke",
        "timestamp": 1565613473
    },
    {
        "content": "<p>These are not unique or special for bulk-data, but bulk-data really accentuates the issue. Sorry to make it look like I am picking on bulk-data.</p>",
        "id": 173019554,
        "sender_full_name": "John Moehrke",
        "timestamp": 1565613714
    }
]