[
    {
        "content": "<p>inferno <code>Auth-11: Token endpoint requires scope</code> claims that the server should reject requests to the token endpoint that do not specify a scope.</p>\n<p>In my opinion, the bulk data spec requirement around supplying scope is really a requirement on the client.<br>\nA server should be allowed to grant some set of default scopes even if the client has not explicitly requested them.<br>\nI think this test should be removed from the suite.</p>",
        "id": 253445898,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1631723771
    },
    {
        "content": "<p>To clarify, the test is intentionally omitting the <code>scope</code> parameter and expects the server to reply with an error instead of granting a \"default scope\".</p>",
        "id": 253446479,
        "sender_full_name": "Vladimir Ignatov",
        "timestamp": 1631723956
    },
    {
        "content": "<p>Our implementation is still failing this inferno test.  Is there anything we can do to help move this one forward?  Maybe open an issue on the inferno-community and/or bdt repos?</p>",
        "id": 267638967,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1641932197
    },
    {
        "content": "<p>That makes sense to me, but scope is a required request parameter in the IG. <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> is it valid to allow an empty string for scope in a backend services request (or in an app launch request for that matter)?</p>",
        "id": 267655823,
        "sender_full_name": "Dan Gottlieb",
        "timestamp": 1641940190
    },
    {
        "content": "<blockquote>\n<p>A server should be allowed to grant some set of default scopes even if the client has not explicitly requested them.</p>\n</blockquote>\n<p>We had this discussion for SMART App Launch and <a href=\"http://jira.hl7.org/browse/FHIR-32221\">FHIR-32221</a> documents our choices (and what we chose <em>not</em> to say). Generally speaking: we want clients to request the scopes they need, but servers ultimately use this as  one (of potentially many) inputs into the decision about what scopes to grant.</p>",
        "id": 267657760,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1641941302
    },
    {
        "content": "<p>Trivially I believe that a client providing a scope parameter with an empty value meets the letter of our current spec.</p>",
        "id": 267657804,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1641941332
    },
    {
        "content": "<p>So test \"Auth-11: The server should reject requests to the token endpoint that do not specify a scope\" is valid, but test \"Auth-12: The server should reject requests to the token endpoint that are requesting an empty scope\" is not?</p>",
        "id": 267658031,
        "sender_full_name": "Dan Gottlieb",
        "timestamp": 1641941452
    },
    {
        "content": "<p>I think that'd be my technical reading; and I don't hate that too much.</p>",
        "id": 267659884,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1641942453
    },
    {
        "content": "<p>i don't have any issue saying clients SHALL pass scopes.  but thats a little different than saying servers SHALL reject clients that don't.<br>\nhere inferno is acting as the client and violating this part of the spec, but since we're outside the spec anyway, I think our server should be allowed to assign some default scopes (or no scopes at all) instead of being forced to reject the request<br>\nso i disagree that Auth-11 is a valid (or useful) test</p>",
        "id": 267666573,
        "sender_full_name": "Lee Surprenant",
        "timestamp": 1641946864
    },
    {
        "content": "<p>Fair point, seems reasonable to treat it as a requirement on the client to provide, but not on the sever to require.</p>",
        "id": 267747277,
        "sender_full_name": "Dan Gottlieb",
        "timestamp": 1642004377
    }
]