[
    {
        "content": "<p>The DocumentReference resource enables a FHIR server to return either links to documents or the documents themselves as embedded binary; the server makes the decision as to which. Are there any expectations with bulk FHIR? On one hand, the bulk paradigm would seem to favor sending the document contents in bulk as embedded binary. On the other hand, this could make the response data sets enormous. Any thoughts on what the current spec implies, and if we should plan an enhancement to enable the client to specify?</p>",
        "id": 207961256,
        "sender_full_name": "Doug Pratt",
        "timestamp": 1598361559
    },
    {
        "content": "<p>there are IG for specific use-cases that declare constraints. Most that I know mandate use of Binary and not embedded base64 encoded. So, are you expecting bulk data api to override these?</p>",
        "id": 207962128,
        "sender_full_name": "John Moehrke",
        "timestamp": 1598362007
    },
    {
        "content": "<p>This is one of the areas we took up as part of The Argonaut 2020 project on bulk data this year. We will be testing this among other improvements at the connectathon in September.</p>",
        "id": 207963082,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1598362472
    },
    {
        "content": "<p>The specific changes we put in place with respect to attachment content (which includes document reference attachments) are visible at <a href=\"https://github.com/HL7/bulk-data/pull/64/files\">https://github.com/HL7/bulk-data/pull/64/files</a></p>",
        "id": 207963134,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1598362498
    },
    {
        "content": "<p>To see them rendered in context you can browse the continuous integration build at <a href=\"http://build.fhir.org/ig/HL7/bulk-data/export/index.html\">http://build.fhir.org/ig/HL7/bulk-data/export/index.html</a></p>",
        "id": 207963304,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1598362592
    },
    {
        "content": "<p>Thank you, I will review those links.</p>",
        "id": 207963374,
        "sender_full_name": "Doug Pratt",
        "timestamp": 1598362641
    },
    {
        "content": "<p>(search that page for the word \"attachment\" and the word \"binary\" to see the relevant guidance.)</p>",
        "id": 207963390,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1598362648
    },
    {
        "content": "<p>Hey – Michael from Cerner here, our team is working on capacity planning related to Bulk Data requests for DocumentReference and Binary resources. We wanted to solicit feedback/input from the client community on use cases that inform the latency, frequency, and volume of <em>document content</em> requests. Likely to be returned in the form of Binary resources.</p>\n<p>For example, request patterns for Binary document content or use cases aligned with retrieving full document content in large volume.</p>",
        "id": 227106325,
        "sender_full_name": "Michael Turman",
        "timestamp": 1613843094
    },
    {
        "content": "<p>Bumping this thread.<br>\nLooking to understand when a 'Bulk Data Consumer' would want to return document content (binary) referenced within a DocRef resource. Do consumers expect to retrieve <em>all</em> document content on the heels of receiving DocRefs? Or to put it another way, what request patterns/use cases are being designed with respect to Bulk document data?</p>",
        "id": 227610941,
        "sender_full_name": "Michael Turman",
        "timestamp": 1614178828
    }
]