[
    {
        "content": "<p>Does anywhere in Bulk Data IG specify is empty line is NDJSON is valid?<br>\nNDJSON spec says \"The parser MAY silently ignore empty lines, e.g. \\n\\n.\"<br>\n1) If a NDJSON file has empty line, is that valid?<br>\n2) If the NDJSON file is empty, is that valid?<br>\n<span class=\"user-mention\" data-user-id=\"191414\">@Dan Gottlieb</span> <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span></p>",
        "id": 196834685,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1588888173
    },
    {
        "content": "<p>I don't know why we would establish anything different from the spec. Are you encountering some sort of issue?</p>",
        "id": 196844451,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1588895196
    },
    {
        "content": "<p>Yes. I received an empty export file.</p>",
        "id": 196897681,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1588945947
    },
    {
        "content": "<p>Gotcha. And is it your understanding that The server had no resources for you and chose to inform you in this fashion?</p>",
        "id": 196899482,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1588946858
    },
    {
        "content": "<p>It could be either the server does not that resource or the file export failed. IMO either case, server should not list that resource in output result. I am still thinking how to deal with empty line in the middle of a file. I may just ignore the empty line.</p>",
        "id": 196901882,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1588948067
    },
    {
        "content": "<p>Ignoring empty lines in the middle of a file seems like the right thing. Ignoring invalid JSON lines in the middle of a file might also be the right thing ;-)</p>",
        "id": 196907107,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1588950519
    },
    {
        "content": "<p><code>Each JSON text MUST conform to the [RFC7159] standard</code> I don't think I can \"ignore\" an invalid line.</p>",
        "id": 197171230,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1589214701
    },
    {
        "content": "<p>On the client side (when consuming/parsing) I would ignore every kind of new lines - leading, trailing or inside. On the back-end, when generating NDJSON, I believe one should avoid them all if possible.</p>",
        "id": 197176163,
        "sender_full_name": "Vladimir Ignatov",
        "timestamp": 1589217055
    }
]