[
    {
        "content": "<p>Has anyone had success testing Bulk Export on the Epic test environments?</p>",
        "id": 270736779,
        "sender_full_name": "Justin Kenel",
        "timestamp": 1643991418
    },
    {
        "content": "<p>Justin - are you testing in the sandbox on <a href=\"http://fhir.epic.com\">fhir.epic.com</a>? If so, you can always reach out to <a href=\"mailto:open@epic.com\">open@epic.com</a> for help.</p>",
        "id": 270739086,
        "sender_full_name": "Aaron Beal",
        "timestamp": 1643992366
    },
    {
        "content": "<p>Hey Aaron! Thanks for responding. Last I checked they said <a href=\"http://fhir.epic.com\">fhir.epic.com</a> didn't have any groups defined, so there wasn't any way to export from it. Do you know if that's changed?</p>",
        "id": 270740066,
        "sender_full_name": "Justin Kenel",
        "timestamp": 1643992781
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span></p>",
        "id": 270740397,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1643992931
    },
    {
        "content": "<p>The issue is less about actual group creation, and more that our Bulk Export requires an admin grant a client access to a specific group.  We don't currently have a process to grant group access to arbitrary clients on the <a href=\"http://fhir.epic.com\">fhir.epic.com</a> sandbox.  It is something we have on our backlog of sandbox features, but no promises on if/when we'll get to it.</p>\n<p>I don't really want to sound like I'm marketing App Orchard, but since you get a dedicated Epic admin in AO, they can set up group access for you in the AO sandbox.  That does require AO membership though.  The other option is to work with the specific health systems you'll be connecting to (since you'll need to do that anyway), and test in their TST systems rather than the <a href=\"http://fhir.epic.com\">fhir.epic.com</a> sandbox (which also has the advantage of testing with representative data from the actual health system).</p>",
        "id": 270763265,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1644003777
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span> thanks for that explanation</p>",
        "id": 270767285,
        "sender_full_name": "Justin Kenel",
        "timestamp": 1644005782
    }
]