[
    {
        "content": "<p>Hi All,<br>\nWe have a non-FHIR based registry of patient cohorts which we will be using as the basis for our Group Resources when querying for our Bulk FHIR implementation. We have a lot of complex role/security/ consent based processing associated with these groups. It's a lot more simple (and safe) to not display any of these patients in Group.member because the cohorts can be very large and processing all those rules at runtime is costly. </p>\n<p>While it does appear that having no Group.member is fine with actual=false (i.e. member.empty() or (actual = true)), my question is: Would returning Group resources that are, actual=false, member.empty(), and characteristic.empty() be particularly problematic for bulk FHIR client implementations? If a client actually did an $export on our Groups, they would get all the data the user is authorized to receive per our rule eval. </p>\n<p>TIA!</p>",
        "id": 255755933,
        "sender_full_name": "Matthew Spielman",
        "timestamp": 1633099755
    },
    {
        "content": "<p>Bulk client do not really need the Group resource itself, you can even not implement it at all (beside the $export operation) - and save you the trouble.</p>",
        "id": 255756822,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1633100107
    },
    {
        "content": "<p>Yes, I am aware of that. This is a business driver on how we want to expose the data in our system via bulk FHIR. Our customers are particularly focused on research use cases; they want to be able to expose these Cohorts on a per-study basis so that a researcher (such as a pharmaceutical company) can only access the data they are authorized (and paid) for.</p>",
        "id": 255757172,
        "sender_full_name": "Matthew Spielman",
        "timestamp": 1633100251
    },
    {
        "content": "<p>Bulk data client may need to find the target group for export by regular group searching. I think it is up to the server to decide how to help client finding the correct group.</p>",
        "id": 255764910,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1633103398
    },
    {
        "content": "<p>For example, client may need to know this group is for \"patient aged 20-39 years old, with smoking history, and lived in zip code 55555\" but not list of patient in that group.</p>",
        "id": 255765310,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1633103531
    },
    {
        "content": "<p>Thanks, that's helpful. I just wanted to make sure we're not doing something that is permitted by the specification but not implementable by any of the FHIR bulk clients.</p>",
        "id": 255766580,
        "sender_full_name": "Matthew Spielman",
        "timestamp": 1633103985
    }
]