[
    {
        "content": "<p>In the draft bulk import spec there is a mention of preserving client provided resource ids from the import source - <a href=\"https://github.com/smart-on-fhir/bulk-import/blob/master/import.md#preserving-resource-ids\">https://github.com/smart-on-fhir/bulk-import/blob/master/import.md#preserving-resource-ids</a>. An unregistered extension is shown. \"<a href=\"http://hl7.org/fhir/StructureDefinition/import-source\">http://hl7.org/fhir/StructureDefinition/import-source</a>\". The body of import-source is wanting to look like a standard identifier type. But the draft doc captures it as system\\identifier where identifier is a string with &lt;resourceType&gt;\\&lt;id&gt; instead of the extension just having the same structure as a field of type identifier with system, value, and type fields. I'm working on an implementation. Wanted to get some opinions on if you would see this staying as documented as it moves forward or if you see it being changed to just align with identifier type.</p>",
        "id": 228506576,
        "sender_full_name": "Chad Evans",
        "timestamp": 1614728005
    },
    {
        "content": "<blockquote>\n<p>instead of the extension just having the same structure as a field of type identifier with system, value, and type fields</p>\n</blockquote>\n<p>Oh, it looks like we just accidentally wrote <code>identifier</code> when we meant <code>value</code>. I <a href=\"https://github.com/smart-on-fhir/bulk-import/commit/69c68ac00b197b7bb81eeb555cb4c6d30f278818\">fixed</a> this just now.</p>\n<p>In case it's not clear: this spec hasn't seen much input lately, and hasn't ever been implemented; it's a pretty sketchy draft (and as you discovered, our example snippets haven't been validated).</p>",
        "id": 228507357,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1614728417
    },
    {
        "content": "<p>Thanks for the response. When the topic does pick up, let me know. I would be happy to contribute what we learn from our implementation back to the specification.</p>",
        "id": 228612745,
        "sender_full_name": "Chad Evans",
        "timestamp": 1614785974
    }
]