[
    {
        "content": "<p>Hi Everyone, </p>\n<p>I'm trying to explore and learn more about FHIR bulk data. <br>\nI've not full understanding of implementing the FHIR client/server for bulk FHIR transfers, that's what I'm trying to learn out of this exercise so bear with me. </p>\n<p>a) I'm managed to somehow run the following code repository and can see how it works from my machine. <br>\n<a href=\"https://github.com/smart-on-fhir/bulk-data-tools\" target=\"_blank\" title=\"https://github.com/smart-on-fhir/bulk-data-tools\">https://github.com/smart-on-fhir/bulk-data-tools</a></p>\n<p>I've question about above code repository. What else needs to be done converting CSV/json/ndjson transformations to FHIR resource? (how can I do that mapping, as have never done that before,) with bulk data?</p>\n<p>I'm lost on how to use the following code repository myself? How can it be run on a laptop? <br>\n<a href=\"https://github.com/HL7/bulk-data\" target=\"_blank\" title=\"https://github.com/HL7/bulk-data\">https://github.com/HL7/bulk-data</a></p>\n<p>Thanks,<br>\nM.</p>",
        "id": 182069472,
        "sender_full_name": "Muhammad",
        "timestamp": 1574898395
    },
    {
        "content": "<p>Can you say more about what you want to accomplish? What are you starting with, and what would you like to happen?</p>",
        "id": 182199678,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1575055835
    },
    {
        "content": "<p>Hi @Josh, Thanks for the reply, I want to create a in house solution which is for FHIR based integration. </p>\n<p>I got multpile CSV files that I used for data load in the past without using FHIR of course. Now I want to build custom interface which transforms CSV files into the FHIR and store them into legacy SQL server database. Each business objects CSV files need to be mapped against a FHIR resource ( I don't know how can I do that). once somehow I'm able to do it. I don't know how can I further use FHIR resource to put it in the SQL server. </p>\n<p>Currently it is one way data, ideally I would like to extend this on two data integration purely through FHIR. The idea may seem redundant but what I'm actually trying to achieve is the build FHIR understanding and capability for one solution. </p>\n<p>Can you guide me in this case. Do let me know if you need more details. </p>\n<p>Thanks, <br>\nM.</p>",
        "id": 182304986,
        "sender_full_name": "Muhammad",
        "timestamp": 1575242655
    },
    {
        "content": "<p>Thanks for sharing some of these details. I don't thinkthe reference implementation is going to be any great help here, because it does not contemplate things such as transforming CSV files or storing resources in an arbitrary SQL database. The reference implementation is designed as a standalone service that simply allows clients to test the API surface area.</p>",
        "id": 182306873,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1575246182
    },
    {
        "content": "<p>I totally agree on that Josh, I'm not looking for 100% implementation rather I'm looking for basic documentations by following which I can run and build on FHIR by myself. I've found bulk data looks very promising for my needs. I want to test FHIR with dotnet /javascript stack. Right now I'm struggling to find any tutorial based on that. Think of it is getting started section with the tech stack if that is possible. </p>\n<p>I've literally gone through lot of documentations but still don't make fully sense to me even conceptually at least. Like how should I at least approach my API area for FHIR. </p>\n<p>Thanks,</p>",
        "id": 182307664,
        "sender_full_name": "Muhammad",
        "timestamp": 1575247548
    },
    {
        "content": "<p>I've gone through lots of open sources repos which has zero explanations. The rest of the FHIR documents are pure theoretical.</p>",
        "id": 182307794,
        "sender_full_name": "Muhammad",
        "timestamp": 1575247764
    },
    {
        "content": "<p>let's see if we can work through any conceptual questions here. I agree it would be helpful to have more documentation that covers a variety of use cases -- but perhaps if we can get to the core of some of your challenges that will help us know what documents to write :-)</p>",
        "id": 182312438,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1575256679
    },
    {
        "content": "<p>Thanks Josh, for now I want to run the following  repo</p>\n<p><a href=\"https://github.com/HL7/bulk-data\" target=\"_blank\" title=\"https://github.com/HL7/bulk-data\">https://github.com/HL7/bulk-data</a></p>\n<p>What steps I should follow to successfully run it for any particular scenario without using SMART launcher?</p>",
        "id": 182318547,
        "sender_full_name": "Muhammad",
        "timestamp": 1575267147
    },
    {
        "content": "<p>The repo you've linked to is the specification, so it's not something you can \"run\" per se. (Technically, you'd run the FHIR IG Publisher against the repo to generate a static site -- but this is what you'll find already at <a href=\"http://build.fhir.org/ig/HL7/bulk-data/\" target=\"_blank\" title=\"http://build.fhir.org/ig/HL7/bulk-data/\">http://build.fhir.org/ig/HL7/bulk-data/</a> (the FHIR CI build site).</p>",
        "id": 182381470,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1575315696
    },
    {
        "content": "<p>Hi Josh, Thanks for explaining this. I missed IG for bulk data. <br>\nCan you share more details for how to do FHIR IG Publisher for <a href=\"http://build.fhir.org/ig/HL7/bulk-data/\" target=\"_blank\" title=\"http://build.fhir.org/ig/HL7/bulk-data/\">http://build.fhir.org/ig/HL7/bulk-data/</a>?</p>\n<p>The links you've shared are really helpful.</p>",
        "id": 182399634,
        "sender_full_name": "Muhammad",
        "timestamp": 1575328398
    },
    {
        "content": "<p>Sure! The basic docs live at <a href=\"https://wiki.hl7.org/FHIR_IG_Publishing_tool\" target=\"_blank\" title=\"https://wiki.hl7.org/FHIR_IG_Publishing_tool\">https://wiki.hl7.org/FHIR_IG_Publishing_tool</a> (and the key file in the bulk data repository is <code>ig.json</code>).</p>",
        "id": 182407453,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1575336092
    }
]