[
    {
        "content": "<p>Hello:<br>\nWe would require the guidance and suggestion in the Patient/System Export for all the resources. When we are allowing the open export query we are facing the technical troubles with large number of transaction that are getting considered for export. Though we are making file size to 100000 transaction per file.</p>\n<p>Do we have any mechanism to restrict the systems to export certain amount of data per request i.e. either using _typefilter or _since or anything else that is inline with the Implementation requirement or Law Requirements? Please suggest.</p>",
        "id": 274376203,
        "sender_full_name": "Nihar",
        "timestamp": 1646651097
    },
    {
        "content": "<p>Can you provide more context for the questions? Are you developing a bulk data API server? Are you leveraging an existing server technology and trying to configure it? Or are you wondering about the standard itself?</p>",
        "id": 274398995,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1646663520
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> : We are actually leveraging an existing server technology and trying to configure it for Bulk Support. What we are trying to do is, considering the kick-off request for all patient data and for all the resources and this is creating the technical troubles when it comes to volume of data that it generates to consider in the ndjson files.</p>",
        "id": 274422816,
        "sender_full_name": "Nihar",
        "timestamp": 1646672713
    },
    {
        "content": "<p>OK -- it sounds like you may want to reach out to whoever is providing your server technology to ask if they support these features (<code>_since</code>, <code>_typeFilter</code>, etc).</p>",
        "id": 274442202,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1646680102
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> : I think I really made some mistake in explanation or answer...!!! We are an EHR dealing under the Oncology Specialty and trying to Build the BULK FHIR Functionality, we are facing some technical troubles while catering to the request for our client with bulk request for all patients and all resources because of Volume that it tries to collect from the database (70 - 100 Million).<br>\nTo resolve this we need your suggestions with following queries...: </p>\n<ol>\n<li>Can we mandate other systems who are seeking the BULK Patient Data from our EHR System to use _typefilters OR _since so that we can limit the # of transactions for exchange per request? This mandate can we declare under the Server Capability Statement?</li>\n<li>If Point 1 is not appropriate then is there any other way that we can handle this technical concern? We need your suggestion.</li>\n</ol>",
        "id": 274501952,
        "sender_full_name": "Nihar",
        "timestamp": 1646721113
    },
    {
        "content": "<p>Ah. No, you can't force clients to add parameters that limit their data request (at least,  if you need to claim conformance to the bulk data IG).</p>\n<p>Are you going for ONC certification? That requirement does allow you to support only group level export rather than sidewide export.  But my best advice is that you should engineer your system to work for all data (even if it's slow).</p>",
        "id": 274546772,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1646749245
    },
    {
        "content": "<p>Throttling a request like this such that it doesn't impact database performance seems very reasonable.  That would have implications on the run-time for a request for 100 million patients, but if someone is requesting 100 million patients I think they should have the expectation that it would take a while (personally I'd expect days or longer).</p>",
        "id": 274547591,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1646749606
    },
    {
        "content": "<p>I think the request was about 100M resources not 100M patients, though I may have misunderstood.</p>",
        "id": 274547697,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1646749672
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> : Yes, we are going for the ONC Certification and what you mean is, for ONC Certification, it does allow to only comply with Group Export...?? Would it be accepted if we don't support the system export and Patient Export? Please guide.<br>\nAnd understood we cannot mandate for specific filters or even we don't have any other options to deal with this. We need to configure the server/database to handle those open requests in terms of conformance with BULK DATA IG.<br>\nAlso, the request is for the 100M resources and not 100M Patients but even considering 100M Resources of all the patients it is creating database/server to create technical troubles for us. Shouldn't we have some mechanism to limit the data PER REQUEST as the Server?</p>",
        "id": 274648494,
        "sender_full_name": "Nihar",
        "timestamp": 1646807580
    },
    {
        "content": "<p><a href=\"https://www.healthit.gov/test-method/standardized-api-patient-and-population-services#test_procedure\">https://www.healthit.gov/test-method/standardized-api-patient-and-population-services#test_procedure</a> has ONC's test methods, which document <code>group-export</code> as the focus.</p>\n<blockquote>\n<p>Shouldn't we have some mechanism to limit the data PER REQUEST as the Server?</p>\n</blockquote>\n<p>A  key purpose of bulk export is to enable exporting all the US Core data that is known about a group of patients. If you impose limits, this purpose would not be met.</p>",
        "id": 274689529,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1646833713
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>: Thank you so much for the clarification and suggestions under this topic. </p>\n<p>A follow-up question on ONC's Test Methods link that you have sent - When they mention as </p>\n<p>FOR SEARCH - \"The health IT developer demonstrates the ability of the Health IT Module to support the “capabilities” interaction as specified in the standard adopted in § 170.215(a)(1), including support for a “CapabilityStatement” as specified in the standard adopted in § 170.215(a)(1) <strong><em>and implementation specification adopted in § 170.215(a)(4).</em></strong>\"</p>\n<p>FOR RESPONSE - \"The health IT developer demonstrates the ability of the Health IT Module to support a successful data response according to the implementation adopted in § 170.215(a)(4).\"</p>\n<p>Does it mean that ideally we need to comply with the § 170.215(a)(4) HL7® FHIR® Bulk Data Access (Flat FHIR®) (V1.0.1:STU 1) i.e. Patient, System and Group Export mentioned as per IG..? Along with the focused method for Group Export that will be definitely tested...? Please Guide.</p>",
        "id": 274696022,
        "sender_full_name": "Nihar",
        "timestamp": 1646836606
    },
    {
        "content": "<p>The testing process will evaluate your server on its ability to export the full data set for a population (group) of patients. You can try out the inferno testing tool to see exactly what API surface area is covered. <a href=\"https://inferno.healthit.gov/\">https://inferno.healthit.gov/</a></p>",
        "id": 274697385,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1646837191
    },
    {
        "content": "<p>I'll add to Josh's comments above that you can and probably <em>should</em> provide ways for the healthcare organization to control what content is returned about a group.  The EHR vendor shouldn't be making decisions about limiting data, but the data holder (healthcare organizations) can limit data based on their policies, agreements and use cases.  The EHR vendor can provide tools that empower the healthcare organizations to manage the exchange of the data they hold.</p>",
        "id": 274697483,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1646837233
    },
    {
        "content": "<p>Thank you so much <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> for the clarity and suggestion.<br>\nAlso, <span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span> : Thank you so much. Understood your point too, we as the Vendor should not be making the decisions about the data limitations whereas we should leave to our clients as to what data volume they want to exchange to another 3rd party systems.<br>\nReally appreciate all your support.</p>",
        "id": 274868414,
        "sender_full_name": "Nihar",
        "timestamp": 1646933485
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191764\">@Cooper Thompson</span> the Epic bulk data implementation has a lot of references to not going over 1000 patients. Do your comments here mean the scale in this thread is supported by Epic?</p>",
        "id": 275193727,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1647233186
    },
    {
        "content": "<p>The \"1000 patient\" number is an order of magnitude recommendation, not a technical limit.  That recommendation is also based only on internal testing (since we don't have much real-world data yet).  We may revise those recommendations as we get real-world performance numbers.  But ultimately, the larger your patient population, the longer your job will take to run (for those who are familiar with Epic, we are using fairly conservative throttle settings for the export process).  I would expect that exporting millions of patients would take longer than a client is likely to want to wait, but that depends on a lot of factors.</p>",
        "id": 275236486,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1647265245
    },
    {
        "content": "<p>Awesome, makes sense</p>",
        "id": 275267879,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1647277680
    }
]