[
    {
        "content": "<p>Hello All,<br>\nOurs is a product startup in VA and we are engaged in building patient self sovereign PHR and providing a 360 view of the record (The longitudinal View). As part of this exercise our product needs to integrate with multiple provider networks (EHRs) to build this patient record into our system. At the moment we are building an integration layer using FHIR to extract PHR from EPIC from a provider network.  I have a few questions and I need your guidance/experience on this - </p>\n<p>1. Is FHIR (both the resource model and API) a good candidate for building a longitudinal view. <br>\n2. What is the most effective way of building PHR history for a given period, say 6 months<br>\n3. what is the most effective way to receive delta into our system, the changes that has occurred in a given FHIR resource such as an Encounter or a Medication in the source EHR  from a particular date. </p>\n<p>Do appreciate your response.</p>\n<p>Note: I could get into specifics on FHIR resources and the specific fields. I guess that will be too detail at this time and will clutter. I will providing more supporting information once I receive response.</p>\n<p>Thank you</p>\n<p>Warm Regards,<br>\nVijay</p>",
        "id": 157923877,
        "sender_full_name": "Vijay",
        "timestamp": 1549705879
    },
    {
        "content": "<p>Yes, it is a good candidate. You user requests like ../Observation?patient=&lt;PATIENT ID&gt;&amp;_lastUpdated=ge&lt;DATETIME&gt; to get all observations for the patient updated after the specified date-time - repeated for all resources you are interested in<br>\nCaveat: some systems (I think including Epic) do not support _lastUpdated search parameter, in that case you have to get all the data and filter it on the client</p>",
        "id": 157939399,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1549735381
    },
    {
        "content": "<p>(you would not be using bulk data - so this is the wrong stream to place this question, Implementers is better)</p>",
        "id": 157939413,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1549735411
    }
]