[
    {
        "content": "<p>I'm working on an IG for registry submissions of large amounts of data (thousands of submission Bundles).  To do this, I'd like to use an operation to do the initial upload, possibly using a Binary resource as the input with an NDJSON file as the attachment.<br>\nThis would return an immediate OperationOutcome saying the upload is successful and then attaching a polling endpoint where an NDJON file of OperationOutcomes would be found that would give results of processing each line of the submission file.<br>\nThe registry is not willing to be fetching the data, they want the upload file.<br>\nSo, what would the headers look like for each step?  Everywhere I look seems to use a GET as the trigger for async and I want to use a POST of a Binary.  <br>\nI wanted to use OperationOutcome.location to show the polling point but it's deprecated, so I'm assuming it has to be in the 202 Content-Location response</p>",
        "id": 267589050,
        "sender_full_name": "David Pyke",
        "timestamp": 1641911586
    },
    {
        "content": "<p>I'm not quite understanding the flow. It sounds like a case for bulk import, but you're saying the bulk import spec is not workable?</p>",
        "id": 267595692,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1641914176
    },
    {
        "content": "<p>Right, unless I'm reading it wrong.  Bulk Import relies on the receiver fetching the data.  My receiver wants to have an NDJSON file uploaded, then set a polling point where the NDJSON file of OperationOutcome resources can be fetched, once all the lines in the uploaded file have been validated</p>",
        "id": 267595994,
        "sender_full_name": "David Pyke",
        "timestamp": 1641914303
    },
    {
        "content": "<p>So, my plan is to POST a Binary with the uploaded file</p>",
        "id": 267596113,
        "sender_full_name": "David Pyke",
        "timestamp": 1641914346
    },
    {
        "content": "<p>But what are the Operation Outcomes describing? And what's the rationale about \"wants to have\"?</p>",
        "id": 267596435,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1641914489
    },
    {
        "content": "<p>The 202 Accepted would have a OperationOutcome with results of verifying the JSON is correct and polling location where the OperationOutcomes that describe if the individual lines validate against the registry data dictionary requirements</p>",
        "id": 267596486,
        "sender_full_name": "David Pyke",
        "timestamp": 1641914516
    },
    {
        "content": "<p>Their workflow is currently based on file submissions.  THey don't want to fetch all the Bundles for each encounter that triggered a submission</p>",
        "id": 267596654,
        "sender_full_name": "David Pyke",
        "timestamp": 1641914570
    },
    {
        "content": "<p>THere could be thousands of submissions as a periodic submission set</p>",
        "id": 267596711,
        "sender_full_name": "David Pyke",
        "timestamp": 1641914591
    },
    {
        "content": "<blockquote>\n<p>So, my plan is to POST a Binary with the uploaded file</p>\n</blockquote>\n<p>You need an async custom operation, bulk import does not work like that</p>",
        "id": 267596761,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1641914615
    },
    {
        "content": "<p>Yep, that's why I'm here</p>",
        "id": 267596787,
        "sender_full_name": "David Pyke",
        "timestamp": 1641914629
    },
    {
        "content": "<p>THe async FHIR docs don't talk about POST as the trigger so I'm a little confused</p>",
        "id": 267597012,
        "sender_full_name": "David Pyke",
        "timestamp": 1641914723
    },
    {
        "content": "<p>Who in your design David is responsible for running the validations on each FHIR resource? And who is dereferencing the URLs provided in the bulk manifest?</p>",
        "id": 267599048,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1641915498
    },
    {
        "content": "<p>It would be the registry that receives the data</p>",
        "id": 267599137,
        "sender_full_name": "David Pyke",
        "timestamp": 1641915534
    },
    {
        "content": "<p>But you're just going to synchronously upload gigabytes of data? With no resume capabilities, and no ability to control parallelism?</p>",
        "id": 267599226,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1641915570
    },
    {
        "content": "<p>That's what they want.  We're giving other options but they want this one spec'd out</p>",
        "id": 267599290,
        "sender_full_name": "David Pyke",
        "timestamp": 1641915600
    },
    {
        "content": "<p>Is there room to discuss?</p>",
        "id": 267600091,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1641915935
    },
    {
        "content": "<p>There hasn't been so far.  I keep trying, though</p>",
        "id": 267600263,
        "sender_full_name": "David Pyke",
        "timestamp": 1641916004
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191414\">@Dan Gottlieb</span> , can you post an example of what the response should look like when a bulk data client queries for all the Groups in the FHIR server it is authorized to see?</p>",
        "id": 267613935,
        "sender_full_name": "Raj Sankuratri",
        "timestamp": 1641921311
    }
]