[
    {
        "content": "<p>The DaVinci Risk Adjustment IG has defined a $report operation (<a href=\"https://build.fhir.org/ig/HL7/davinci-ra/OperationDefinition-report.html\">https://build.fhir.org/ig/HL7/davinci-ra/OperationDefinition-report.html</a>). The $report operation's subject parameter can reference a Group of patients and it returns a Bundle for each patient within the Group. We would appreciate your feedback on paging and bulk data implementation for this operation. Our questions are:</p>\n<p>Which signature is better to allow for both paging and bulk data implementation of an operation: 1) Return a single Bundle, defined as a set of Bundles, possibly paged, or 2) Return Bundle 0..* and implement some extensions to Parameters to support paging of results? Thanks</p>",
        "id": 263383102,
        "sender_full_name": "Yan Heras",
        "timestamp": 1638409009
    },
    {
        "content": "<p>We don't have standardized semantics for taking an arbitrary operation and \"making it bulk\". I generally think we should, in FHIR Core. But until then, you might want to document explicit behavior that when called synchronously, your operation returns a Parameters with</p>\n<ul>\n<li><code>result</code> -- 0..*, each result includes a Bundle resource inline</li>\n<li><code>next</code> -- 0..1, URL that acts as a continuation link for the next page of results</li>\n</ul>\n<p>...and that when called with <code>Prefer: respond-async</code> your operation instead behaves like the <code>$export</code> -- that is:  eventually returning a bulk manifest where all the output entries are ndjson files full of Bundles</p>",
        "id": 263383490,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1638409443
    },
    {
        "content": "<p>Thank you Josh! I am copying <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> <span class=\"user-mention\" data-user-id=\"217210\">@Rob Reynolds</span> <span class=\"user-mention\" data-user-id=\"191924\">@Linda</span></p>",
        "id": 263385388,
        "sender_full_name": "Yan Heras",
        "timestamp": 1638411233
    }
]