[
    {
        "content": "<p>In the patient- or group- bulk data request, looking for clarity on how to interpret the _type parameter when it includes the Provenance resource.</p>\n<p>Take an example where on the patient- or group- level $export, the  _type = Patient, AllergyIntolernace, Provenance - what is intended?  Is Provenance to be returned for each resource included in the list – in this case Patient and AllergyIntolerance?  </p>\n<p>Take another example where on the patient or group $export, the _type= Provenance.  Is the intention that this would be an invalid request?</p>\n<p><span class=\"user-mention\" data-user-id=\"191414\">@Dan Gottlieb</span> <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span></p>",
        "id": 194720116,
        "sender_full_name": "Michelle Vondercrone",
        "timestamp": 1587409986
    },
    {
        "content": "<p>Insights anyone?</p>",
        "id": 195054615,
        "sender_full_name": "Michelle Vondercrone",
        "timestamp": 1587645849
    },
    {
        "content": "<p>Our server export Provenance for all resources. If you specify only Provenance I think it export just the provenances for the patients - but not sure</p>",
        "id": 195055507,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1587646309
    },
    {
        "content": "<p>Provenance can be attached to anything (Provenance.target), it is a reverse Include relationship. I suspect in bulk data you want a simple way to indicate that you do NOT want any Provenance, you want comprehensive Provenance of everything, you want only the last Provenance on everything, you want Provenance only on resources of a specific type (e..g Observation)...   right?   Is this the intention of the current bulk data provenance function? Is this beyond intended? Is this a blindspot that should be clarified?</p>",
        "id": 195057105,
        "sender_full_name": "John Moehrke",
        "timestamp": 1587647089
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"258504\">@Michelle Vondercrone</span>  The IG describes the _type parameter as restricting the resources returned, so if a server returns a Provenance resource for each included resource as part of the full patient or group bulk export response I'd expect setting _type= Provenance to limit the response to just those</p>",
        "id": 195068240,
        "sender_full_name": "Dan Gottlieb",
        "timestamp": 1587651930
    },
    {
        "content": "<p>It does, but I agree that it's unclear if that means \"all provenance records for all the data for this patient\" or \"all provenance records for data we're also returning\" or \"only last provenance record for each item we're returning\"</p>",
        "id": 195075996,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1587654830
    },
    {
        "content": "<p>The first seems not useful in the context of bulk data and provenance, but that's exactly what _type means for all other resources you would list, correct?</p>",
        "id": 195076106,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1587654864
    },
    {
        "content": "<p>Yup, agreed. If a client requests _type=AllergyIntolernace,Provenance, I'd expect the server to return Provenance resources associated with resources in the patient compartment including but not limited to AllergyIntollerance, which is probably more data than the client generally wants.</p>",
        "id": 195083314,
        "sender_full_name": "Dan Gottlieb",
        "timestamp": 1587657947
    },
    {
        "content": "<p>I don't think there's anything in the IG that precludes a server from defining a specific behavior around this though - eg. I only return the most recent Provenance resource for a given resource and/or I only return Provenance associated with resources in the output data set.</p>",
        "id": 195083326,
        "sender_full_name": "Dan Gottlieb",
        "timestamp": 1587657951
    },
    {
        "content": "<p>It seems like the open question is whether there's a practical need for a negotiation around this at run time, where a server supports multiple of these approaches (eg. I return most recent Provenance resource or I return all Provenance resources) and the client needs the ability to choose. Of course, servers are free to define a custom request parameter, but if there are many different servers that are going to support runtime options around which Provenance resources are returned, we'll want to define something standard.</p>",
        "id": 195083534,
        "sender_full_name": "Dan Gottlieb",
        "timestamp": 1587658036
    },
    {
        "content": "<p>Since this is part of USCDI/bulk data regulation from ONC, I think we may want to land on a standard approach that meets the needs of the consumer</p>",
        "id": 195083741,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1587658132
    },
    {
        "content": "<p>That's fair - do you have a sense of what kind of Provenance data API users are asking for (most recent, all history, only for specific resources, none, etc)?</p>",
        "id": 195084336,
        "sender_full_name": "Dan Gottlieb",
        "timestamp": 1587658417
    },
    {
        "content": "<p>I <em>think</em> for the single patient APIs it's just the \"last jump\" (as a floor requirement)</p>",
        "id": 195084628,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1587658557
    },
    {
        "content": "<p>so most recent</p>",
        "id": 195084707,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1587658582
    },
    {
        "content": "<p>So in the absence of specific use cases requiring something else, a reasonable floor might be that servers providing the USCDI dataset return the most recent Provenance resource for each of the other resources being returned in the bulk response dataset (subject to the _since filter, and unless _type is populated and doesn't include Provenance)?</p>",
        "id": 195085865,
        "sender_full_name": "Dan Gottlieb",
        "timestamp": 1587659115
    },
    {
        "content": "<p>I'm trying to pull up the USCore reqs... <br>\n<a href=\"http://hl7.org/fhir/us/core/StructureDefinition-us-core-provenance.html\" title=\"http://hl7.org/fhir/us/core/StructureDefinition-us-core-provenance.html\">http://hl7.org/fhir/us/core/StructureDefinition-us-core-provenance.html</a></p>",
        "id": 195086437,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1587659365
    },
    {
        "content": "<p>So, USCore requires the revInclude per resource to be able to pull related provenances</p>",
        "id": 195086484,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1587659394
    },
    {
        "content": "<p>Which is experimental still for bulk :)</p>",
        "id": 195086643,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1587659459
    },
    {
        "content": "<p>Would be interested in use cases that exist that would want something other than last provenance, provenance related to other items in bulk...</p>",
        "id": 195086693,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1587659486
    },
    {
        "content": "<p>Yup, me too! If we don't need a param to negotiate different approaches per request, this feels a bit like an expansion of the predefined bulk \"data set\" definitions we started on in v1 of the IG: <a href=\"https://hl7.org/fhir/uv/bulkdata/index.html#us-core-data-for-interoperability\" title=\"https://hl7.org/fhir/uv/bulkdata/index.html#us-core-data-for-interoperability\">https://hl7.org/fhir/uv/bulkdata/index.html#us-core-data-for-interoperability</a></p>",
        "id": 195087465,
        "sender_full_name": "Dan Gottlieb",
        "timestamp": 1587659862
    },
    {
        "content": "<p>that is why I pointed out that Provenance  is typically retrieved using _revinclude... so, to just put Provenance in the bulk data access can't mean _revinclude as a special case, what if you did want a bulk data transfer of all provenance associated with some  subject? We don't know that use-case today, but it could happen (legal medical records audit for safety and records retention compliance).</p>",
        "id": 195193344,
        "sender_full_name": "John Moehrke",
        "timestamp": 1587737628
    },
    {
        "content": "<p>A _revinclude gives you comprehensive provenance (as comprehensive as the system has, which might be shallow or might be very deep). So I don't think this is what you want either.  The emerging \"Basic Provenance IG\" definition might be a good subset to request, this is  provenance of Author, and if the data was authored elsewhere the organization from which it came. The IG allows other provenance, but sets this as the minimal.</p>",
        "id": 195193802,
        "sender_full_name": "John Moehrke",
        "timestamp": 1587737795
    },
    {
        "content": "<p>I think as a goal in this year's Argonaut project we should include adding guidance for these kinds of questions. I am probably stating the obvious :-)</p>",
        "id": 195198270,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1587739564
    },
    {
        "content": "<p>I created <a href=\"https://github.com/HL7/bulk-data/issues/67\" title=\"https://github.com/HL7/bulk-data/issues/67\">https://github.com/HL7/bulk-data/issues/67</a> to capture this.</p>",
        "id": 195425687,
        "sender_full_name": "Dan Gottlieb",
        "timestamp": 1587997980
    }
]