[
    {
        "content": "<p>Hello: We are implementing the Registration Process For Bulk Client and we have few queries related to the public and private key Pair -</p>\n<blockquote>\n<p>Do we need to mandatorily implement functions for X.509 certificate for Public &amp; Private Key Pair &amp; X.509 certificate Thumbprint, to have client upload the Pair of Keys during registration...?? Please suggest.</p>\n</blockquote>\n<p>Thanks in advance.</p>",
        "id": 250359412,
        "sender_full_name": "Nihar",
        "timestamp": 1629728898
    },
    {
        "content": "<ul>\n<li>Generate the key pair however you want. The client only needs the private key to function.</li>\n<li>The private key can be JWK, PEM, or whatever your code is working with.</li>\n<li>The public key must be JWK</li>\n<li>If the server you are registering with supports JWKS URL auth, put your public JWK in a JWKS and host that on public location. Then provide that as jwks url at registration</li>\n<li>If the server you are registering with does not support JWKS URL auth,  then you will have to provide that public JWK at registration</li>\n</ul>\n<p>In any case, you DO NOT upload a key pair anywhere.</p>",
        "id": 250360973,
        "sender_full_name": "Vladimir Ignatov",
        "timestamp": 1629729601
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"193731\">@Vladimir Ignatov</span> : <br>\nIt means Private Key is never required to reach to server for authorization and authentication, <br>\nwhat I mean is: \"Client uploads the Public Key during registration then Client during the access token request creates the JWT that is signed by Private Key...after that when the JWT reaches to the Server, server validates the signature only using the Public Key\"<br>\nPlease suggest, is this the correct understanding..?</p>",
        "id": 250367315,
        "sender_full_name": "Nihar",
        "timestamp": 1629732254
    },
    {
        "content": "<p>Exactly! The private key must remain private and not reach any servers. Your client uses it to sign the JWT. Because the server knows what the corresponding public key is (provided at registration or fetched from a jwks url later), it will be able to verify that your token has been signed with the correct private key - the one that only you have access to.</p>",
        "id": 250368237,
        "sender_full_name": "Vladimir Ignatov",
        "timestamp": 1629732650
    },
    {
        "content": "<p>I think this is something the \"Security for Scalable Registration, Authentication, and Authorization\" implementation guide that is out for ballot is trying to clarify -- <a href=\"http://hl7.org/fhir/us/udap-security/2021Sep/index.html\">http://hl7.org/fhir/us/udap-security/2021Sep/index.html</a></p>",
        "id": 250368666,
        "sender_full_name": "John Moehrke",
        "timestamp": 1629732878
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193731\">@Vladimir Ignatov</span> : Thank you much for the clarity and getting us to the  correct implementation direction. Understood the process.<br>\n<span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> : In the implementation guide, it defines that x5c will be a required parameter in future so does it mean that implementing the function of X509 Certification to the Public Keys will be mandatory under the client registration process. Are we understanding this correctly from the ballot implementation guide? Please suggest.</p>",
        "id": 250395336,
        "sender_full_name": "Nihar",
        "timestamp": 1629744793
    },
    {
        "content": "<p>please submit a comment on the ballot</p>",
        "id": 250395472,
        "sender_full_name": "John Moehrke",
        "timestamp": 1629744853
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> : Thank you for the clarification. Can you please also guide us on to submit a comment on the ballot..!!!</p>",
        "id": 250492692,
        "sender_full_name": "Nihar",
        "timestamp": 1629815246
    },
    {
        "content": "<p>the bottom of the spec has the link to making comments -- look for \"Propose a Change\"</p>",
        "id": 250493375,
        "sender_full_name": "John Moehrke",
        "timestamp": 1629815505
    },
    {
        "content": "<p>You'll need to do a one-time (free) registration and a human will confirm that you seem like a real human.  After that, you can submit feedback at will.</p>",
        "id": 250494260,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1629815852
    }
]