[
    {
        "content": "<p>I just watched a walk through of a hack on a bulk data interface by Inon Shkedy, one of the authors of the OWASP top ten. Not a FHIR bulk data interface, but one that's somewhat similar</p>\n<p>The vulnerability he found involved the interplay between the way the api used Amazon S3 and the way it validated requests. The clear intent of the API developer was that using UUID ids meant they couldn't be hacked... well, no.</p>\n<p>I thought that this would be an opportune point to remind people: ensure that you validate every request against the user token, and be <em>very suspicious</em> of providing files through S3 (or any other bucket) and assuming that people can't guess UUIDs and so that's an acceptable level of security</p>",
        "id": 278170982,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1649341285
    },
    {
        "content": "<p>When you say UUIDs, you're not talking about high entropy URLs in general? Interested to understand more here; would be great if you can link to details.</p>",
        "id": 278172161,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1649341796
    },
    {
        "content": "<p>yes high entropy APIs in general</p>",
        "id": 278178242,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1649344090
    },
    {
        "content": "<p>it was a presentation made at APISecure. Don't know if it will be published. See <a href=\"https://apisecure.co\">https://apisecure.co</a></p>",
        "id": 278178368,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1649344137
    },
    {
        "content": "<p>something in the design allowed Inon to find out the id of a file that belonged to another account - that was a design fault, but that really was his point - entropy leaks and bingo</p>",
        "id": 278178587,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1649344231
    },
    {
        "content": "<p>I suspect that you will see details of this kind of attack in an upcoming OWASP version. The presenter was one of the OWASP authors, and he indicated a revision is coming.</p>",
        "id": 278183776,
        "sender_full_name": "John Moehrke",
        "timestamp": 1649346213
    }
]