[
    {
        "content": "<p>I'd like to know the status of bulk data $import. Is this moving at a slower pace than export or not at all?</p>",
        "id": 237178428,
        "sender_full_name": "Peter Bernhardt",
        "timestamp": 1620055034
    },
    {
        "content": "<p>There's no formal standards work happening around an $import operation, but we've had consistent community interest around a cluster of related use cases. <span class=\"user-mention\" data-user-id=\"191414\">@Dan Gottlieb</span> has been working on some proposal's for import that better leverage existing <em>export</em> capabilities.</p>",
        "id": 237179123,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1620055294
    },
    {
        "content": "<p>Yup, good timing on the question - I'm hoping to have a draft of a new proposal posted in the next week  or two to start to collect early feedback. As Josh pointed out though, the standards work recently has been around getting v2 of bulk export finished.</p>",
        "id": 237180249,
        "sender_full_name": "Dan Gottlieb",
        "timestamp": 1620055733
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191414\">@Dan Gottlieb</span> is there any update on the status of bulk data $import?</p>",
        "id": 244320802,
        "sender_full_name": "Jenny Reay",
        "timestamp": 1624989193
    },
    {
        "content": "<p>Yup! I posted a writeup of my thoughts on a potential bulk import approach at  <a href=\"https://github.com/smart-on-fhir/bulk-import/blob/master/import-pnp.md\">https://github.com/smart-on-fhir/bulk-import/blob/master/import-pnp.md</a> .</p>",
        "id": 244333180,
        "sender_full_name": "Dan Gottlieb",
        "timestamp": 1624994394
    },
    {
        "content": "<p>Of course, there isn't currently an active standards project around bulk import so my goal with this is just to get some ideas on paper to support initial prototyping and as starting point for folks to contribute their ideas. Open to suggestions, alternative directions, etc!</p>",
        "id": 244333261,
        "sender_full_name": "Dan Gottlieb",
        "timestamp": 1624994418
    },
    {
        "content": "<p><span aria-label=\"wave\" class=\"emoji emoji-1f44b\" role=\"img\" title=\"wave\">:wave:</span> We're interested in testing the new PnP spec. We're planning to develop a client or server or both, but we're not sure if we'll have it ready by Sept, it might take us until the Jan '22 Connectathon.</p>",
        "id": 244337111,
        "sender_full_name": "Sam Sayer",
        "timestamp": 1624996197
    },
    {
        "content": "<p>Happy to speak to any other interested parties</p>",
        "id": 244337235,
        "sender_full_name": "Sam Sayer",
        "timestamp": 1624996238
    }
]