[
    {
        "content": "<p>In an environment in which all systems expose a FHIR API, and where Bulk Data is used for the E and L in ETL, what would the T look like? What kind of steps would one recommend (as a general best practice) ? Systems may use different FHIR profiles or versions, just to mention one of the challenges.</p>\n<p>I've created an initial list, but I'm pretty sure (if you're in the data warehousing business) you know of others that would be appropriate. (The list will be used as part of a module in one of Firely's FHIR training courses, so it's technology/system/platform agnostic).  </p>\n<p>*Cleaning (correct corrupt or incomplete data):<br>\nDe-duplication, data quality assessment of candidate data<br>\nUsing statistical methods<br>\n*Mapping / Enriching:<br>\nFHIR Profile based mapping<br>\nE.g. Translate codes, Subset: remove data elements, or resources <br>\nAggregation, summarization (new data elements or resources)<br>\n*Review: <br>\nValidation (profiles, business rules, against “master data” registries), referential integrity between FHIR resources<br>\n(Partial) rejection of data</p>",
        "id": 219614152,
        "sender_full_name": "René Spronk",
        "timestamp": 1607698047
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span>, this seems like a good start!</p>",
        "id": 219990416,
        "sender_full_name": "Dan Gottlieb",
        "timestamp": 1608044381
    },
    {
        "content": "<p>I'd also think about adding de-identification (for example, <a href=\"https://github.com/microsoft/FHIR-Tools-for-Anonymization\">https://github.com/microsoft/FHIR-Tools-for-Anonymization</a> which works directly on ndjson files), and NLP to build structured FHIR from unstructured notes (for example, <a href=\"https://github.com/BD2KOnFHIR/NLP2FHIR\">https://github.com/BD2KOnFHIR/NLP2FHIR</a> and <a href=\"https://aws.amazon.com/blogs/aws/amazon-comprehend-medical-natural-language-processing-for-healthcare-customers/\">https://aws.amazon.com/blogs/aws/amazon-comprehend-medical-natural-language-processing-for-healthcare-customers/</a>) to the \"enriching\" section.</p>",
        "id": 219990456,
        "sender_full_name": "Dan Gottlieb",
        "timestamp": 1608044396
    },
    {
        "content": "<p>Also, as part of a larger project, I've done some early stage work drafting and prototyping a set of transformations to make direct querying of the imported FHIR data more efficient at <a href=\"https://github.com/sync-for-science/a3/blob/master/algorithm.md\">https://github.com/sync-for-science/a3/blob/master/algorithm.md</a> . This includes things like standardizing references and converting all date elements into periods for querying (eg. a date of \"2019\" will be transformed into a period of \"2019-01-01\" to \"2019-12-31\").</p>",
        "id": 219990602,
        "sender_full_name": "Dan Gottlieb",
        "timestamp": 1608044460
    },
    {
        "content": "<p>Thanks. I've had a call with someone with a data warehousing background, and these kinds of T activities are obviously not limited to data warehousing. They would apply wherever one has a use to import/receive data from any other system (where one also has ones own data). Zooming out there all aspects of data quality management.</p>",
        "id": 220089364,
        "sender_full_name": "René Spronk",
        "timestamp": 1608108080
    },
    {
        "content": "<p>NLP may be acceptable in some projects (and not in others), but it's certainly worthwhile to discuss. Standardizing references: e.g. to convert them all into 'full URLs'?</p>",
        "id": 220089515,
        "sender_full_name": "René Spronk",
        "timestamp": 1608108183
    },
    {
        "content": "<p>Even if one has one single FHIR based system (with little or no exchanges with others), data quality is an organizational/provenance type of issue, so discussing data quality will even be valuable in such scenarios. Detection of 'low quality data', and labeling it as such for additional processing or human review would be very useful in any setting.</p>",
        "id": 220089705,
        "sender_full_name": "René Spronk",
        "timestamp": 1608108347
    }
]