[
    {
        "content": "<p>I would like to combine <a href=\"https://www.hl7.org/fhir/clinicalreasoning-quality-reporting.html\">Quality Reporting</a> with bulk data export. The MeasureReport resource contains a <a href=\"https://www.hl7.org/fhir/measurereport-definitions.html#MeasureReport.group.population.subjectResults\">reference to a list resource</a> which contains the patients of a population. After that list resource is created by the quality reporting module, I would like to export all resources for that patients by invoking $export on that List resource.</p>\n<p>I know that $export is defined for the Group resource. Is it possible to define $export also for the List resource?</p>",
        "id": 200417360,
        "sender_full_name": "Alexander Kiel",
        "timestamp": 1591796605
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> Based on discussion in FHIR-I, it seems that MeasureReport should point to Group rather than List?</p>",
        "id": 200426180,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591800512
    },
    {
        "content": "<p>The challenge with using Group is that Measures aren't _always_ patient-based, you can have measures that are based on encounters, or procedures, or any other type of non-participant resource.</p>",
        "id": 200547591,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1591883946
    },
    {
        "content": "<p>Rather than using $export per se, we've been looking at just using the fact that you can request asynchronous response using a bulk-data format for any operation. We're expanding $care-gaps, for example, to return 1..* Bundle, with the expectation that a server could use bulk data transfer of the resulting bundles.</p>",
        "id": 200551442,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1591885611
    },
    {
        "content": "<p>I suppose another option would be to define a /MeasureReport/id/$export</p>",
        "id": 200551502,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1591885654
    },
    {
        "content": "<blockquote>\n<p>The challenge with using Group is that Measures aren't _always_ patient-based, you can have measures that are based on encounters, or procedures, or any other type of non-participant resource.</p>\n</blockquote>\n<p>Thats right. For example, we use Specimen as Measure subject.</p>\n<blockquote>\n<p>Rather than using $export per se, we've been looking at just using the fact that you can request asynchronous response using a bulk-data format for any operation.</p>\n</blockquote>\n<p>What is the request, you have in mind, that would return all population subjects possibly including related resources? The List resource alone contains only references to its entries. How could I possibly get bundles (one per page) of the referenced list entries? How could I include related resources in that bundles? The only idea, I have, is to get the List resource and use FHIR search with all the logical-ids of its entries.</p>\n<blockquote>\n<p>I suppose another option would be to define a /MeasureReport/id/$export</p>\n</blockquote>\n<p>That would be a possibility with the disadvantage that one couldn't address the individual populations of the report. </p>\n<p>I have not fully understand the semantic difference between the List and the Group resource. One thing I have noticed is, that Groups only allow a single type of members, where Lists allow mixed type members. As far as I can overlook it, Measures are always about a single subject type. So groups would work here. But of corse there is the <a href=\"https://www.hl7.org/fhir/valueset-group-type.html\">GroupType</a> value set with a required binding, which constraints the possible types of resources in a Group. Is there any particular reason why the set of types is contained in this way?</p>\n<p>On the other hand, is there a good reason why the entries of a List resource should not be exportable? I see that it would be helpful if the List were single typed. Especially for exporting related resources according the compartment definition of that type. But otherwise, just exporting the bare resources of a list should be not a problem.</p>",
        "id": 200588560,
        "sender_full_name": "Alexander Kiel",
        "timestamp": 1591901228
    },
    {
        "content": "<p>from the decision in FHIR-I last week the idea would be: if a Measure <em>is</em> defined over a set of patients, then Group would be the preferred resource to capture that set.</p>",
        "id": 200589469,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1591901688
    },
    {
        "content": "<p><a href=\"http://jira.hl7.org/browse/FHIR-27083\">FHIR#27083</a>: </p>\n<blockquote>\n<p>For use cases where Group is suitable (e.g. for a list of Patients to be viewed on a dashboard), the Group resource should be preferred to the List resource. The underlying rationale is that a collection of patients, practitioners, etc is likely to be of interest as the subject of a measure, observation, communication, etc, which Group is intended to support.</p>\n</blockquote>",
        "id": 200589513,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1591901714
    },
    {
        "content": "<p>Groups are intended to point to collections of individuals that can be passive subjects of actions but can't take collective responsibility.  If you're intending to have mixtures of things, then List is fine I guess.</p>",
        "id": 200591500,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591902725
    },
    {
        "content": "<p>It may be that you need both - Group for when you're defining a passive group by criteria and List when you're defining arbitrary enumerated collections of whatever.</p>",
        "id": 200591631,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591902793
    },
    {
        "content": "<p>Wait, what does \"passive\" mean?</p>",
        "id": 200628010,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1591927130
    },
    {
        "content": "<p>Lloyd, are you saying that for a set of Patients, there's a situation where you'd prefer List to Group?</p>",
        "id": 200628027,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1591927164
    },
    {
        "content": "<p>No.  I'm saying that if you need to be able to have arbitrary collections of anything, you can't use Group.  My slight preference for Measure is to have a choice of Group of List.  The downside of that is that you could technically use both, which isn't ideal.  Perhaps both with explicit guidance to use Group for the things it supports?</p>",
        "id": 200628746,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591928138
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> You suggest that the <a href=\"https://www.hl7.org/fhir/measurereport-definitions.html#MeasureReport.group.population.subjectResults\">subjectResults</a> reference in various locations of MeasureReport should be expanded to also allow Group. In addition, guiding should be given that subject-list reports of Measures over Patients should generate Group resources rather than List resources.</p>\n<p>This change would solve my issue. Should I file an Issue in JIRA?</p>",
        "id": 200658796,
        "sender_full_name": "Alexander Kiel",
        "timestamp": 1591961299
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span></p>",
        "id": 200684247,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1591975497
    },
    {
        "content": "<p>Yes, please do submit a tracker on that, thank you!</p>",
        "id": 200695481,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1591980864
    }
]