[
    {
        "content": "<p>I'm looking at the specification linked here and wondering what the optionality of the different request types are:<br>\n<a href=\"https://github.com/smart-on-fhir/fhir-bulk-data-docs\" target=\"_blank\" title=\"https://github.com/smart-on-fhir/fhir-bulk-data-docs\">https://github.com/smart-on-fhir/fhir-bulk-data-docs</a></p>\n<p>Some are obvious but mainly what I am not sure of is whether the File Request is required to be supported by the FHIR server. </p>\n<p>I'm not exactly sure where I got this impression but I was thinking the output/url returned in the Status response was not required to be an actual resolvable URL. Is that accurate?</p>\n<p>Sorry for embedding two questions into one post here... So regardless of the answer to the question above, if support for some requests are optional, could that be added to the proposal page somewhere? Thanks.</p>",
        "id": 153940159,
        "sender_full_name": "Justin Stauffer",
        "timestamp": 1519413709
    },
    {
        "content": "<p>what would be the point of a server that didn't support the File Request?</p>",
        "id": 153940160,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1519413812
    },
    {
        "content": "<p>I was under the impression that the files could be exchanged in some out of band manner (such as SFTP or whatever). Is that not accurate?</p>",
        "id": 153940161,
        "sender_full_name": "Justin Stauffer",
        "timestamp": 1519413980
    },
    {
        "content": "<p>I don't think that's part of the spec</p>",
        "id": 153940163,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1519414058
    },
    {
        "content": "<p>OK, thanks. Must be just a misunderstanding on my part then.</p>",
        "id": 153940164,
        "sender_full_name": "Justin Stauffer",
        "timestamp": 1519414130
    },
    {
        "content": "<p>a really early version of the spec did have something very like that. But on discussion, early on, we removed it. http is as effective as any other pull option. And push options all raise security / management issues</p>",
        "id": 153940165,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1519414243
    }
]