[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193764\">@Ricky Bloomfield</span> - I noticed that <a href=\"https://www.apple.com/newsroom/2021/03/apple-maps-now-displays-covid-19-vaccination-locations/\">Apple had a press release</a> about an Apple tool (built in partnership with Boston Children's) for displaying vaccine availability.  It looks like that loads data via CSV import.  Is there an option (now or in the near future) to use the <a href=\"https://github.com/smart-on-fhir/smart-scheduling-links/blob/master/specification.md\">SMART Scheduling Links</a> spec to load that in?</p>",
        "id": 231068170,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1616178066
    },
    {
        "content": "<p>It looks like most of the columns in the CSV overlap with the SMART Scheduling Links spec. Exceptions are \"Requires Referral\", \"Requires Appointment\" and \"Vaccination Location Type\".</p>",
        "id": 231068536,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1616178206
    },
    {
        "content": "<p>It looks like you have a direct VaccineFinder feed, so I guess if VaccineFinder is using SMART Scheduling Links, it ends up being the same.  I guess I'm not really sure if there is a real use case for loading data <em>not</em> from VaccineFinder but still using SMART Scheduling Links.</p>",
        "id": 231069057,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1616178454
    },
    {
        "content": "<p>I believe <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> may know more about that! I don't think SMART Scheduling Links is necessary to shuttle the data to Apple for display in Maps, but any of those sites could use SMART Scheduling Links to make it easier to schedule!</p>",
        "id": 231076162,
        "sender_full_name": "Ricky Bloomfield",
        "timestamp": 1616181398
    },
    {
        "content": "<p>Re: UX, I think the opportunity would be to push availability data into maps (or whatever app people are using) to give them a view about <em>when</em> appointment slots are available, and a deep link to booking those slots.</p>",
        "id": 231077060,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1616181824
    },
    {
        "content": "<p>Hi all.  It’s very important to delineate FHIR Slots vs FHIR Scheduling.  As we see with “categorical” search (eg ‘vaccines near me’ rather than ‘vaccines at specific provider X’), availability feeds are often what is needed at the first step in the user journey — before scheduling transactions.  As the current FHIR standard for Slots notes there is also a good IETF standard deployed for this already and supported in iCalendar format.</p>\n<p>I’m in touch with the IETF leads from my organization and y’all may wish to rally quickly with their BOF process.</p>\n<p>C. Daboo from Apple also proposed RFC 7953 in 2016.</p>\n<p><a href=\"https://tools.ietf.org/html/rfc7953\">https://tools.ietf.org/html/rfc7953</a></p>\n<p><a href=\"https://www.ietf.org/about/participate/tao/\">https://www.ietf.org/about/participate/tao/</a></p>\n<p>Thanks,<br>\nHenry</p>",
        "id": 231097652,
        "sender_full_name": "Henry Wei",
        "timestamp": 1616192498
    },
    {
        "content": "<p>Re: availability, the aim with Scheduling Links is that you can publish this information at any granularity (# per day, or specific times) just by changing the granularity of the slots you publish. Are there particular aspects of this design that cause you concern <span class=\"user-mention\" data-user-id=\"254431\">@Henry Wei</span>? (Also: hi, and welcome!)</p>",
        "id": 231097959,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1616192695
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 231098463,
        "sender_full_name": "Henry Wei",
        "timestamp": 1616193062
    },
    {
        "content": "<p>Scheduling links exist today actually.  Google Maps indexes these and also providers and businesses update their links at Google My Business (once they are verified).  These scheduling links differ dramatically from Availability Feeds which are deployed for other self-scheduling verticals (eg restaurants).</p>\n<p>The Availability feeds also disaggregate into two flavors:<br>\nProduct Availability<br>\nService Availability</p>\n<p>For an example (I am not recommending this but pointing at an existing deployed Availability feed model) see Developer Center guidance here:</p>\n<p><a href=\"https://developers.google.com/maps-booking/reference/feed-specifications/availability-feed\">https://developers.google.com/maps-booking/reference/feed-specifications/availability-feed</a></p>",
        "id": 231098499,
        "sender_full_name": "Henry Wei",
        "timestamp": 1616193096
    },
    {
        "content": "<p>There are clearly a lot of potential APIs that work for this use case; the aim was to standardize one based on our collective healthcare service and scheduling knowledge, in a way that fits for COVID-19 but also for broader \"slot discovery\" use cases. This provides a way to describe Locations, Schedules that include detailed clinical servicse offered, HealthcareService metadata (if we need them), etc -- so it's a pretty natural direction.</p>",
        "id": 231099241,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1616193555
    },
    {
        "content": "<p>That said, I'd be interested to see how the Locations, Schedules, and Slots from <a href=\"https://github.com/smart-on-fhir/smart-scheduling-links/blob/master/examples/%24bulk-publish\">https://github.com/smart-on-fhir/smart-scheduling-links/blob/master/examples/%24bulk-publish</a> would map into the framework you're describing. May be worth building a conversion demo?</p>",
        "id": 231099265,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1616193583
    },
    {
        "content": "<p>It may be worth getting already-publishing entities’ perspective — quickly —- as to how easy or difficult the standard proposed at <a href=\"https://github.com/smart-on-fhir/smart-scheduling-links/blob/ea0333bf2b8a576c962a04f7db5d3770d1a1bdfc/specification.md\">https://github.com/smart-on-fhir/smart-scheduling-links/blob/ea0333bf2b8a576c962a04f7db5d3770d1a1bdfc/specification.md</a> would be to implement.  </p>\n<p>Conversion demo is maybe not so relevant here, as Google is a receiving endpoint for the feed type example I posted above — which is not currently used for healthcare vertical. </p>\n<p>But the design pattern would separate out availability of supply of goods, versus availability of the human service (appointments).</p>\n<p>Slot Publisher would be good for the latter.  But this part may have some Site Reliability Engineering considerations to consider a pub/sub mode rather than periodic polling:</p>\n<p>“A client queries the manifest on a regular basis, e.g. once every 1-5 minutes. The client iterates through the links in the manifest file to retrieve any Location, Schedule, or Slot files it is interested in...”</p>\n<p>Feeds, in contrast, are pushed (rather than pulled).</p>\n<p>Net-net the content standard should be aligned, but the transmission mode — “push” versus periodic poll-and-pull — matters a lot because (from talking with scheduling aggregators on the market today) some legacy EHR systems and middleware are likely to implement the Slot calculation itself as a fairly inefficient loops through the entire schedule.</p>",
        "id": 231102776,
        "sender_full_name": "Henry Wei",
        "timestamp": 1616195838
    },
    {
        "content": "<p>I’ll try to see if I can get Yijie Hong, our Engineering lead looking at this, in on this thread.  He may comment directly as Issues in the GitHub repo, <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> .  The issue is that the polling data itself can be a large block for some sources, and the interval has similarly been problematic.</p>\n<p>The data container standard should still be ok though.  It’s just the on-demand query mechanism vs push-subscription mechanism that may need some consideration for pragmatic implementation — as many orgs may balk at on-demand if they are unprepared to implement rate limiting and other throttling mechanisms (or their backends can’t support API performance at the service level objectives of the API).</p>",
        "id": 231103748,
        "sender_full_name": "Henry Wei",
        "timestamp": 1616196471
    },
    {
        "content": "<p>I’ll try to see if I can get Yijie Hong, our Engineering lead looking at this, in on this thread.  He may comment directly as Issues in the GitHub repo, <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> .  The issue is that the polling data itself can be a large block for some sources, and the interval has similarly been problematic.</p>\n<p>The data container standard should still be ok though.  It’s just the on-demand query mechanism vs push-subscription mechanism that may need some consideration for pragmatic implementation — as many orgs may balk at on-demand if they are unprepared to implement rate limiting and other throttling mechanisms (or their backends can’t support API performance at the SLO / service level objective needed of most modern APIs).</p>",
        "id": 231103853,
        "sender_full_name": "Henry Wei",
        "timestamp": 1616196536
    },
    {
        "content": "<p>Re: push vs pull, one challenge here is whether you need to set up custom agreements / configuration for every source to send data to every relying app (as this set of apps grows). The initial USDS spec (from which the Scheduling Links pattern derives) was pull based too. Publishing static files works well (e.g.) from cloud storage buckets /  CDNs.</p>",
        "id": 231118201,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1616211228
    },
    {
        "content": "<p>Good point <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> .  Periodic polling might incur some type of agreement also, though, especially to avoid peaks / overloads.</p>\n<p>Josh, this feels an awful lot like the 2012-2013 discussion we had on push vs pull with Blue Button then, and also more recent CARIN BB IG discussions last year on how notifications of updates can be pushed to downstream entities (perhaps belt-and-suspenders to  continuous polling).  For example, downstream PHR apps can then be notified of updates rather than continuous polling.</p>\n<p>So perhaps a well-articulated “push” mode implementation guidance for data sources and data receivers can be stated in the spec.  This would be either as a very lightweight signal to initiate a “pull” might also apply here.  That said, I believe FHIR R4 discusses existing resources as being deployable as either push or pull.</p>\n<p><a href=\"https://www.hl7.org/fhir/pushpull.html\">https://www.hl7.org/fhir/pushpull.html</a></p>\n<p>The other possibility is meta-data to indicate “this is how often these data will be updated” — future tense.  This can set expectations for data receivers to tailor their polling requests to a) the right interval and b) potentially the right time of day / night Eg if EHRs are doing overnight calculations of availability from new bookings and cancellation during the day before.</p>\n<p>While these seem extraneous, they can add resilience to the system now, up front, rather than risk API overloads and refactoring later.</p>\n<p>So basically 1) push mode and 2) setting expectations of how often pulls make sense.  </p>\n<p>These overload conditions are also difficult failure modes to test at Connectathons.</p>\n<p>I also agree on static file publication as another potential — and articulating a standard for how those published files ought to be “picked up” and the files themselves named and formatted, especially given the CDN scaling advantages.  These too should probably carry meta-data to set expectations for if/when the next update is due to appear either at a file level, and/or at an individual record level.</p>",
        "id": 231119500,
        "sender_full_name": "Henry Wei",
        "timestamp": 1616212869
    }
]