[
    {
        "content": "<p>I've added to the <a href=\"https://docs.google.com/spreadsheets/d/1Fh0zwCjKYh4D-Mp1k5uxzINh6GG0yI1ezko49VaJV2c/edit#gid=0\">Connectathon spreadsheet</a> some details for a Walgreens <code>$bulk-publish</code> endpoint, working with the team there to wrap their existing API. It's not yet compliant, but it's a start (with caveats described in the comments).</p>",
        "id": 234867699,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618585190
    },
    {
        "content": "<p>I've got an updated version of Walgreens data being published  now to <a href=\"https://wbaschedulinglinks.blob.core.windows.net/fhir/$bulk-publish\">https://wbaschedulinglinks.blob.core.windows.net/fhir/$bulk-publish</a> -- a few notes:</p>\n<ul>\n<li>Added NPI for each location -- these are available for each pharmacy location and presumably are good cross-organizational identifiers. Do others have/use NPIs for locations?  (FHIR defines an Identifier System of <code>http://hl7.org/fhir/sid/us-npi</code> for these, which is what I'm using.)</li>\n<li>Added lat/lon for each location</li>\n<li>Added county for each location</li>\n<li>Latency of slot data is now ~0-5 min, rather than the 0-20min I had previously</li>\n</ul>",
        "id": 238675936,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1620937620
    },
    {
        "content": "<p>I was a little unclear from the call last week and didn't have much luck getting in touch with Amy Park about it: is this effectively Walgreens’s official API right now?</p>",
        "id": 239153959,
        "sender_full_name": "Rob Brackett",
        "timestamp": 1621282920
    },
    {
        "content": "<p>We can continue to try to clarify this; I'm still hoping to hear about finer grained access. In the meantime, I think \"effectively\" this is the official Scheduling Links API, so what you say is correct (though to be clear, Walgreens does have a non-standards-based official API, which is currently the source for what I've published above).</p>",
        "id": 239186524,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1621302867
    },
    {
        "content": "<p><span aria-label=\"thumbs up\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"thumbs up\">:thumbs_up:</span> Thanks, that helps! I’ll start using this ASAP, and will also make sure to ask about it in the call tomorrow.</p>",
        "id": 239189801,
        "sender_full_name": "Rob Brackett",
        "timestamp": 1621305437
    }
]