[
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"406306\">@Nick Muerdter</span> for this comment:</p>\n<blockquote>\n<p>Sub-Brands: This is probably the least important issue and there are potential workarounds, but just thought I’d ask. For certain pharmacy providers, they have many brands their stores might operate under (eg, Kroger has King Soopers, City Market, etc). I realize these providers may choose a variety of ways to publish their data, so this may be a more specific question for them, but I’m just curious if there would be any recommendations for how to represent this data. Ideally, I’d like to be able to easily group the stores by these brands that users are actually familiar with. In the spec, this information may be embedded in the location name, or could be possibly be derived from the location’s URL, but I’m not sure there’s anywhere this is super clearly separated out if you wanted to be able to programmatically handle these type of brands. But this may be out of scope, and that’s also fine.</p>\n</blockquote>\n<p>It's a great question, and it begs another: how are <em>main</em> brands communicated? I'm guessing you might be treating a slot as a \"Kroger\" slot because it's coming from a Kroger <code>$bulk-publish</code> endpoint, but that pattern breaks down in the case of aggregators re-publishing info from multiple sources. I think we might want to give stronger advice that the <code>Location.name</code> field should at least contain consumer-relevant branding like \"Kroger Store #123\" or \"City Market Store #456\".</p>",
        "id": 235531014,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1619018740
    },
    {
        "content": "<p>Beyond that, if we really wanted to lean into the FHIR models here, a <code>Location.managingOrganization</code> can provide a display name for the org in charge of a location, or could even link to an <code>Organization</code> resource that's part of a hierarchy via <code>Organization.partOf</code> (but as the complexity grows, I worry about the challenges of implementers \"getting it right\").</p>",
        "id": 235531235,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1619018814
    },
    {
        "content": "<p>So maybe the easy steps here is:</p>\n<ul>\n<li>Document that <a href=\"http://Location.name\">Location.name</a> SHOULD include some branding that consumers should recognize (e.g., at the level of a sub-brand if relevant, or brand if not)</li>\n</ul>\n<p>... does that help, and is it enough?</p>",
        "id": 235531540,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1619018920
    },
    {
        "content": "<p>For Kroger at least, I'm expecting that our location name's will be comparable to what is currently available on <a href=\"http://VaccineFinder.org\">VaccineFinder.org</a>, so for example \"Ralphs Pharmacy #xxxxx\".</p>",
        "id": 235536545,
        "sender_full_name": "Ryan Owens",
        "timestamp": 1619020840
    },
    {
        "content": "<p>Yeah, I think if this information were included in the name, that would fulfill most use-cases.</p>\n<p>The only thing this maybe makes more difficult is if you're trying to actually organize and filter the data based on these sub-brands, since then you'd have to rely on free-form text matching of the name field, and that can obviously be more error-prone. I don't feel particularly strongly about this, though, just mentioning it as a potential use-case, since I had a lot of requests on Vaccine Spotter to filter by pharmacy brand (although I think the primary reason why was people getting frustrated with certain pharmacy websites), so this could be a bit more difficult to do with this data model. But I'm not sure this use-case is all that important. <span aria-label=\"shrug\" class=\"emoji emoji-1f937\" role=\"img\" title=\"shrug\">:shrug:</span></p>",
        "id": 235539985,
        "sender_full_name": "Nick Muerdter",
        "timestamp": 1619022164
    },
    {
        "content": "<p>Yeah, I think some naming advice here would go a long way; it'd let tools like Vaccine Spotter maintain a manual list of sub-brands with associated regexes or something -- it's not perfect but seems let it wouldn't be a blocker. I'll add a quick PR.</p>",
        "id": 235540226,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1619022265
    },
    {
        "content": "<p>Added <a href=\"https://github.com/smart-on-fhir/smart-scheduling-links/pull/31\">https://github.com/smart-on-fhir/smart-scheduling-links/pull/31</a> -- comments or tweaks welcome!</p>",
        "id": 235540530,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1619022390
    }
]