[
    {
        "content": "<p>A requirement from the start has been identifying locations by their VTrckS PIN. In theory (see <a href=\"https://www.cdc.gov/vaccines/covid-19/reporting/vtrcks/index.html\">https://www.cdc.gov/vaccines/covid-19/reporting/vtrcks/index.html</a>) any location administering vaccinations should have one, and this identifier is important for cross-referencing Slot data against datasets on vaccine availability. For folks on the Slot Publisher side: do you have these PINs in your database somewhere? (Or is there a <em>different</em> way that you support this cross-referencing?)</p>",
        "id": 234902901,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618598811
    },
    {
        "content": "<p>Is there an assumption here that the scheduling system will have some insight into the vaccine allotment and storage systems?  We built in a way for our health systems to specify an identifier on their schedulable locations, but I know we've had a lot of concerns with that being successful.  I haven't fully grokked what exactly the VTrckS PIN represents.  Is it something that has an obvious link to a schedulable location?  I though it was more about allotment and maybe storage.</p>",
        "id": 234910632,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1618602555
    },
    {
        "content": "<p>It's tied to locations, to the best of my understanding. I think the goal isn't that scheduling systems would deeply understand it but that a database of locations would include it, so tools like vaccine finder could join data across these modalities.</p>",
        "id": 234910926,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618602691
    },
    {
        "content": "<p>Wouldn't it be possible for one schedulable location to administer vaccines from different lots associated with different PINs?  Should we send multiple PINs per location?  Or would we need to split out two location records for the same physical location if they admin from different allotments?</p>",
        "id": 234911357,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1618602891
    },
    {
        "content": "<p>My understanding was that PINs correspond to locations, but my understanding is limited :-) Hoping someone here can share what they know.</p>",
        "id": 234911845,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618603094
    },
    {
        "content": "<p>Right.  But which location.  The storage location or the schedulable admin location?</p>",
        "id": 234912310,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1618603302
    },
    {
        "content": "<p>For example, we had a vaccine clinic at Epic in one of our cafeterias.  That is what would be scheduled.  Would that have a VTrcksPIN assigned?</p>",
        "id": 234912494,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1618603384
    },
    {
        "content": "<p>It could be many administration locations all using the same VTrcks PIN in that example.</p>",
        "id": 234914517,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618604358
    },
    {
        "content": "<p>But I'm not clear about whether anyone has experience working with these PINs</p>",
        "id": 234914582,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618604394
    },
    {
        "content": "<p>I <em>think</em> it might be many-to-many.  You could have many locations using the same PIN, but also one location using multiple PINs.</p>",
        "id": 234916039,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1618605086
    },
    {
        "content": "<p>That's fair, and if this is the case it would be straightforward enough to list multiple instances of a pin on a single location. Any idea how we can get the answer to this question?</p>",
        "id": 234926863,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618609868
    },
    {
        "content": "<p>Our team was building off of the pre-4/6 spec and believed that VTrckS PIN was optional (per the spec from before April 6th). Our complexity is that our scheduling system does not have the VTrckS PIN information. We have two separate lines of business that administer vaccines (our pharmacies and our health clinics). For one of our lines of business, we do have a backend system that has the VTrckS PIN but we would prefer to not have to integrate this solution with that system. For our other line of business, the backend is a SaaS solution and we do not have access to pull VTrckS PIN data from that system at this time. We also had concerns about limited value in the data for the reasons discussed above (we will have multiple locations sharing VTrckS PINs). For all of those reasons and to avoid adding delays to deployment, our team decided to not include VTrckS PIN data in our initial release and to come back later and consider adding it. I will go back to the team with the updated spec and see what they think, but requiring VTrckS PINs may delay our ability to provide data.</p>",
        "id": 235173745,
        "sender_full_name": "Ryan Owens",
        "timestamp": 1618836444
    },
    {
        "content": "<p>Ah - I didn't see the commit that made the VTRckS PIN required.  If \"required\" means \"must-support\" (using US Core definition), then I guess we are compliant, but if it means 1..1, then we aren't (and won't be).</p>",
        "id": 235183742,
        "sender_full_name": "Cooper Thompson",
        "timestamp": 1618840462
    },
    {
        "content": "<p>At this stage I would interpret it as \"we've heard the US digital Services team say this field is critical, and we want to push to understand any concerns about what it would take to supply.\"</p>",
        "id": 235187362,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618841730
    },
    {
        "content": "<p>So far I think we are hearing that it may be many to one with locations, and possibly many to many. It's not yet clear to me how we determine which of these the case.</p>",
        "id": 235187489,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618841771
    },
    {
        "content": "<p>Our understanding is that the VTrcks Pin is assigned based on information from the IIS and how they onboard departments. For example, we heard from WIR (Wisconsin’s immunization registry) that they assigned their internal WIR pins based on where the vaccine is stored, not administered. While this example was for WI, we have heard that the specific onboarding process varies state by state. We are not confident that the VTrcks Pin will accurately represent a location where a patient is scheduled, which means it could not effectively be used for this use case.</p>",
        "id": 235188363,
        "sender_full_name": "Nell Lapres",
        "timestamp": 1618842067
    },
    {
        "content": "<p>the context here is very helpful. I'm not sure I understand the conclusion. If the association between administering sites and storage locations is many to one as you are describing, they can still be correlated and it might be possible to know that the storage facility associated with a given administration site does not have supply (through external stock data sources).</p>",
        "id": 235189083,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618842319
    },
    {
        "content": "<p>I think the association could possibly be many-to-many (for example: a state has separate storage locations for Moderna and Pfizer due to different storage requirements, each of which sends to the same administration location), but you could still correlate between them I think</p>",
        "id": 235189455,
        "sender_full_name": "Michael O'Keefe",
        "timestamp": 1618842447
    },
    {
        "content": "<p>That use case would imply that the upper bound on VTrckS PIN would want to be &gt;1 though</p>",
        "id": 235189709,
        "sender_full_name": "Michael O'Keefe",
        "timestamp": 1618842550
    },
    {
        "content": "<p>Agree that it could be many to many. In our earlier discussions it sounded like the VTrcks pin was expected to be a unique identifier for a schedulable location. It sounds like we are not saying that here so want to make sure that is clear/allowed in the specs.</p>\n<p>One other point, I do not expect all of our organizations have this stored in this system so it may be additional implementation work for organizations to implement (although it shouldn't be a prohibitive amount of additional work).</p>",
        "id": 235191483,
        "sender_full_name": "Nell Lapres",
        "timestamp": 1618843202
    },
    {
        "content": "<p>On our side, Nell's last statement generally represents my org's situation. We don't have the PIN in our scheduling system. We can get it in some of our cases but not all. We know the work required to add it. That work is not free though and will delay our ability to supply data by a not yet determined amount, but I would expect it to be measured in weeks, not days.</p>",
        "id": 235192534,
        "sender_full_name": "Ryan Owens",
        "timestamp": 1618843609
    },
    {
        "content": "<p>So as far as connectathon work goes, I think \"include 1 or more VTrckS PINs if you have them, omit otherwise\" is the right plan. We can bring this us as a discussion topic for our wrap-up meeting Thursday, and hopefully get some domain experts to join.</p>",
        "id": 235197260,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618844946
    },
    {
        "content": "<p>FWIW, I recall the question about VTrckS PINs coming up back when the proposed standard was an original thing and not FHIR-based. I think I had suggested VTrckS PINs would be good based on our experience in NJ, which at the time had a fairly 1:1 correspondence between actual locations we had identified and PINs (with a handful of locations not having a PIN, so we expected they’d just have a meaningless identifier). It seemed valuable to have a working identifier that multiple parties involved would presumably know about and which would help connect multiple systems. (There was no concept of other, additional identifiers in the design at that point.)</p>\n<p>Since then, we’ve both learned about more locations in NJ where this wasn’t the case and have seen more ad-hoc clinics with no easily associatable VTrckS PIN, so if I were asked again, I’d agree with the conclusion here that VTrckS PINs may often be unavailable, and may not be the most useful as a location identifier anyway.</p>",
        "id": 235297975,
        "sender_full_name": "Rob Brackett",
        "timestamp": 1618902405
    },
    {
        "content": "<p>Thanks Rob!</p>",
        "id": 235364087,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618932628
    },
    {
        "content": "<p>We will aim to get the right folks from usds on our wrap-up call Thursday so we can talk through the details, but the assessment here seems compelling to me.</p>",
        "id": 235364137,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618932644
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"340597\">@Ryan Owens</span> for the reminder on today's call; I fixed <a href=\"https://github.com/smart-on-fhir/smart-scheduling-links/issues/33\">#33</a>, on VTrckS PINs and advice on other identifiers -- <a href=\"https://github.com/smart-on-fhir/smart-scheduling-links/blob/master/specification.md#location-file\">https://github.com/smart-on-fhir/smart-scheduling-links/blob/master/specification.md#location-file</a> has the updated guidance on <code>Location.identifer</code>.</p>",
        "id": 236438018,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1619575088
    },
    {
        "content": "<p>{<br>\n\"error_description\": \"The access token is missing\",<br>\n\"error\": \"invalid_request\"<br>\n}</p>",
        "id": 241978696,
        "sender_full_name": "Hemanth Gorur",
        "timestamp": 1623182884
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"410156\">@Hemanth Gorur</span> You might want to move that to the “Publisher: Kroger” topic: <a href=\"#narrow/stream/281612-smart.2Fscheduling-links/topic/Publisher.3A.20Kroger\">https://chat.fhir.org/#narrow/stream/281612-smart.2Fscheduling-links/topic/Publisher.3A.20Kroger</a></p>",
        "id": 241978957,
        "sender_full_name": "Rob Brackett",
        "timestamp": 1623183018
    },
    {
        "content": "<p>I wasn't terribly clear after the call yesterday. Some people said it is required and others said it is not. </p>\n<p>Should Rite Aid include this as a must-have or a nice-to-have or is it not necessary?</p>\n<p>Thank you!</p>",
        "id": 242879091,
        "sender_full_name": "Patrick Stuart",
        "timestamp": 1623849782
    },
    {
        "content": "<p>I think that depends on what you want the API to do for you. If you are just concerned with complying with the specification, including VTrckS PINs is a \"should\" in the truest sense: it is not a requirement, but is more than just a nice-to-have; it’s <em>strongly encouraged</em> if you have the data.</p>\n<p>If you are concerned with implementing the specification <em>so that your data shows up on vaccines.gov,</em> that’s a very different matter, and <span class=\"user-mention\" data-user-id=\"410156\">@Hemanth Gorur</span> is the person who can best tell you what’s required there.</p>\n<p>If you are concerned with providing a useful public API for state &amp; local governments or community health initiatives to do outreach work, get people vaccinated or do other analysis, VTrckS PINs are generally not a requirement, but super helpful. Having a real identifier that can be used to link stores up with other data (e.g. using a store number instead of the store’s zip code) is a virtual requirement.</p>",
        "id": 242906020,
        "sender_full_name": "Rob Brackett",
        "timestamp": 1623860979
    }
]