[
    {
        "content": "<p>US Core recommends that an “active” medication list can be obtained using only the MedicationRequest resource.  However the reference implementation for this RWD track is looking at various test servers and we can see that different approaches have been followed on different servers.  Some indeed follow US core while others make much greater use of MedicationStatement.  It would be very helpful to have Vendor opinions on the adequacy of US Core recommendations for collecting concomitant medication information for subjects on a clinical trial.<br>\nThanks - Hugh</p>",
        "id": 221655772,
        "sender_full_name": "Hugh Glover",
        "timestamp": 1609858952
    },
    {
        "content": "<p>In looking at the Release 5 Preview #3 spec, I don’t see MedicationStatement listed as a resource. Is MedicationStatement going to be replaced by MedicationUsage in R5?</p>",
        "id": 222642440,
        "sender_full_name": "Joe Mundi",
        "timestamp": 1610570469
    },
    {
        "content": "<p>Yes. That is my understanding. It is just a name change.</p>",
        "id": 222642763,
        "sender_full_name": "Charles Yaghmour",
        "timestamp": 1610570641
    },
    {
        "content": "<p>I used MedicationAdministration sofar, but that seems to be for inpatient only. I will try to extend with MedicationStatement. Important for SDTM I think is that it has start- and possibly an end-date (effectiveDate/effectivePeriod).  Essentially, for CM, I think we should always go for whatever we can get - that is always better dan CRF collected data that has its source from the remembrance of the subject.</p>",
        "id": 222707783,
        "sender_full_name": "Jozef Aerts",
        "timestamp": 1610625427
    },
    {
        "content": "<p>On the HAPI-FHIR test server, there are 31539 entries for MedicationStatement, but most of them do not have any information about start/stop date or period. What does this mean if this information is missing?<br>\nFor MedicationAdministration, there are 1975 entries, and most have information about start/stop date or period.</p>",
        "id": 222708456,
        "sender_full_name": "Jozef Aerts",
        "timestamp": 1610625956
    },
    {
        "content": "<p>The public servers contain a lot of resources put there as tests and cannot be taken as representative of how an EHR works.  That is why we added a specific set of test patients.  We need to have a number of test servers from EHR vendors for the next phase of this work.</p>",
        "id": 222716059,
        "sender_full_name": "Hugh Glover",
        "timestamp": 1610630827
    },
    {
        "content": "<p>I agree. Maybe an application should query for both to be complete? I think most of us (well, at least me) do not have sufficient experience with real live implementations to know how that works out in the case of RWD.</p>",
        "id": 222718061,
        "sender_full_name": "Jozef Aerts",
        "timestamp": 1610631840
    }
]