[
    {
        "content": "<p>Dear Charles and Hugh,</p>\n<p>Many thanks for the excellent session yesterday! <br>\nI tried out the application and it works very well. My congratulations for that!</p>\n<p>I however believe I am already much further. I developed an application last year (but without GUI) that retrieves FHIR resources from any possible FHIR server and transforms them into SDTM DM, LB, VS, MB (microbiology - Corona test results), CM, MH, and RELREC (between CM and MH) datasets, and SV. I use Dataset-XML format instead of CSV, so that the datasets can be inspected in the open source \"Smart Submission Dataset Viewer\" (<a href=\"https://sourceforge.net/projects/smart-submission-dataset-viewe/\">https://sourceforge.net/projects/smart-submission-dataset-viewe/</a> ). I presented these results and gave a demo at the CDISC US Interchange last Autumn. A movie of the presentation and the demo can be found at: <a href=\"https://youtu.be/TNPvoE4mkRU\">https://youtu.be/TNPvoE4mkRU</a><br>\nThe application is open source and the source code can be found at: <a href=\"https://sourceforge.net/p/fhirloinc2sdtm/code/ci/master/tree/\">https://sourceforge.net/p/fhirloinc2sdtm/code/ci/master/tree/</a> </p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"TNPvoE4mkRU\" href=\"https://youtu.be/TNPvoE4mkRU\"><img src=\"https://i.ytimg.com/vi/TNPvoE4mkRU/default.jpg\"></a></div><p>I wonder what the best way would be for me to contribute to this Connectathon. Will there be an opportunity for attendees to  demonstrate what they did so far on this topic? Or is the best way that I invite the attendees to have a look at the movie on YouTube? Reason is that I do not what to interfere with the program, but on the other hand, I think it is worth having a look at what people like me have done so far.</p>\n<p>If you could have a look at the movie and then judge whether that work is in the scope of the Connectathon, that would be great!</p>\n<p>Best regards,<br>\nJozef</p>",
        "id": 222703547,
        "sender_full_name": "Jozef Aerts",
        "timestamp": 1610622229
    },
    {
        "content": "<p>It sounds to me as if a quick demo would be in order - Charles is in charge of agendas so it is up to him to decide how to manage this I think.</p>",
        "id": 222703835,
        "sender_full_name": "Hugh Glover",
        "timestamp": 1610622386
    }
]