[
    {
        "content": "<p>I would like to see brief rationales for the times taken. </p>\n<p>e.g. 4A - Increased wait to a release that actually makes key clinical stuff normative - gets pushed back by at least a year, probably longer. </p>\n<p>What is going to cause more than a year's delay? </p>\n<p>Is it ballots, that absolutely have to take 2 or 3 cycles (a lot of elapsed time but maybe not a full year's solid effort - and perhaps could be done in parallel with other things). </p>\n<p>Or is it processes that could in theory be accelerated with more resources, better systems etc.</p>",
        "id": 205528328,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1596140807
    },
    {
        "content": "<p>We can't reasonably ballot in parallel.  We can't have two different releases of the same spec going to ballot simultaneously.  The work groups are also going to have trouble focusing on multiple releases simultaneously in terms of QA and preparation.    As well, there's a huge amount of tooling and publication stuff that would be involved.  Realistically, Sept. 2021 would be the soonest we could start an R5 - and that would mean zero downtime in between.</p>",
        "id": 205528705,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1596141007
    },
    {
        "content": "<p>Sept 2021 - is that to start balloting R5? Does that correspond to R5 \"gets pushed back by at least a year probably more\". When would R5 be otherwise?</p>",
        "id": 205532254,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1596142995
    },
    {
        "content": "<p>R5 would go to ballot Jan 2021.  Sept 2021 is a schedule with no downtime so starting R5 Jan 2022 is more realistic if we do R4b</p>",
        "id": 205550139,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1596159209
    },
    {
        "content": "<p>Lloyd, can you clarify what R5 going to ballot in Jan 2021 includes?  Could the GI tools be used or is this just a review of the resources? The Medication Definition resources would be included and there would be 3 ballot cycles and then published in 2022.  The early posts made it sound like no R5 anything until second half of 2021.</p>",
        "id": 207000845,
        "sender_full_name": "Catherine Hosage Norman",
        "timestamp": 1597458100
    },
    {
        "content": "<p>Lloyd's post is regarding different timing options. AFAIK, there is no decision yet made on what the next ballot will look like.</p>",
        "id": 207002810,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1597461970
    },
    {
        "content": "<p>There is no firm decision on timing.  The earliest ballot can happen is January.  The earliest publication of <em>anything</em> could happen is end of Q2 2021.  And that would be assuming a very limited scope.  A full release would mean later publication - Q3 or Q4 2021.</p>",
        "id": 207785132,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1598206996
    },
    {
        "content": "<p>Is there some place I can see the differences between R4 and the latest proposed R5 changes? I see this some changes listed: <a href=\"https://build.fhir.org/history.html\">https://build.fhir.org/history.html</a>. Is this the place to look?</p>",
        "id": 213831267,
        "sender_full_name": "Gopal Menon",
        "timestamp": 1603134685
    },
    {
        "content": "<p>We won't come up with a comprehensive list of R5 changes until the time R5 goes out to ballot.  For now, the only source of changes is looking at Jira tracker items (which is pretty fine-grained).  Also note that some of the changes may well change again or even be reversed before the official R5 release is published in a couple of years.</p>",
        "id": 213860774,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1603151460
    },
    {
        "content": "<p>There's also a 'Compare to R4' link at the bottom of each page in the Current Build which is useful if you're aware of where the changes might be.</p>",
        "id": 213865150,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1603155252
    },
    {
        "content": "<p>Thanks!!!</p>",
        "id": 213944879,
        "sender_full_name": "Gopal Menon",
        "timestamp": 1603211625
    },
    {
        "content": "<p>Except if the resource changed names.  Then you get a error.</p>",
        "id": 214755305,
        "sender_full_name": "Catherine Hosage Norman",
        "timestamp": 1603828628
    },
    {
        "content": "<p>that means that the name change wasn't recorded somewhere...</p>",
        "id": 214762446,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1603831829
    },
    {
        "content": "<p>It would be nice to see a diff between CapabilityStatement2 and CapabilityStatement :-)</p>",
        "id": 214805695,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1603872941
    },
    {
        "content": "<p>Is there an expected date when R5 would be published?</p>",
        "id": 248494217,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1628177562
    },
    {
        "content": "<p>Current target is Q3 or Q4 2022</p>",
        "id": 248495612,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1628178195
    },
    {
        "content": "<p>Is there an expected time when SUSHI and IG tool will support R5.  It recognizes the resource SubstanceDefintion, but not  the elements inside. </p>\n<p>This line:  * <a href=\"http://SubstanceDefinition.name.name\">SubstanceDefinition.name.name</a> 0..* MS<br>\ngets this error<br>\ninfo  Converting FSH to FHIR resources...<br>\nerror No element found at path <a href=\"http://SubstanceDefinition.name.name\">SubstanceDefinition.name.name</a> for DrugSubstance, skipping rule<br>\n  File: C:\\FHIR-us-pq-cmc\\input\\fsh\\DefinitionalResources.fsh</p>\n<p>It is odd that the error message says DrugSubstance and not SubstanceDefinition</p>",
        "id": 248993899,
        "sender_full_name": "Catherine Hosage Norman",
        "timestamp": 1628609112
    },
    {
        "content": "<p>IG Publisher and SUSHI are different questions.  The IGPublisher <em>should</em> support R5 IGs now, and if it doesn't, it suggests there's a bug.  Ask about SUSHI support on the <a class=\"stream\" data-stream-id=\"215610\" href=\"/#narrow/stream/215610-shorthand\">#shorthand</a> stream.</p>",
        "id": 248996275,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1628610234
    }
]