[
    {
        "content": "<p>Hi there, <br>\ngiven a  situation where..</p>\n<ul>\n<li>\n<p>it is not possible to reliably infer the observations for a patient related to a Trial on the basis of time and observation-metadata, references to an encounter or whatever criteria... <br>\nand </p>\n</li>\n<li>\n<p>the customer is willing to change their process allowing their central Service-Request-Application to add the trial ID whenever they send a trial related service request...</p>\n</li>\n</ul>\n<p>Where would you put - or rather - how would you represent that trial ID in a FHIR Resource? </p>\n<ul>\n<li>In the ServiceRequest itself? (I don't see a decent place for putting the ID)</li>\n<li>by referencing from ServiceRequest to a CarePlan which (In this case we use the <code>based-on</code> reference) - which via extension points to ResearchStudy containing the Identifier (Business Identifier for study)? .</li>\n<li>Something completely different if none of the suggestions make  sense and I'm completely off the mark?</li>\n</ul>",
        "id": 248469715,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1628166407
    },
    {
        "content": "<p>There's a standard extension that allows many resources to be tied to a ResearchStudy (<a href=\"http://build.fhir.org/extension-workflow-researchstudy.html\">http://build.fhir.org/extension-workflow-researchstudy.html</a>).  ServiceRequest isn't in that list yet, though it should be.  Care to submit a change request?</p>",
        "id": 248488966,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1628175371
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  - I'll submit the change request as a Jira in BR&amp;R.</p>",
        "id": 248506860,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1628183430
    },
    {
        "content": "<p>For posterity, here is the link to the jira <a href=\"https://jira.hl7.org/browse/FHIR-33147\">https://jira.hl7.org/browse/FHIR-33147</a> - sadly still no feedback.<br>\n<span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> in personal discussion, someone floated the idea of splitting the encounter I.E. introducing a study-related sub encounter to distingush between study-related Service Requests and all others. </p>\n<p>While it appears to be a neat short cut, I think it propagates the present state of anarchy because AFAIK there is no standard pattern for (semantically) structuring encounters and sub encounters. </p>\n<p>Hence I think that change request in the Jira is still valid. Or do you have any feedback or alternative thoughts since?</p>",
        "id": 251763284,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1630607386
    },
    {
        "content": "<p>This was raised less than a month ago.  It takes most work groups a few months to get to new issues.  (Sometimes much longer.)  So I wouldn't give up on it.  If you want to push for faster resolution, you can engage with the work group co-chairs and/or attend some of their calls and see if the request can be expedited.</p>",
        "id": 251763957,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1630607614
    },
    {
        "content": "<p>Too bad it's in OO, which I don't attend. I'll hang on a while till we have to make a final call on this.<br>\nThanks.</p>",
        "id": 251767021,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1630608777
    },
    {
        "content": "<p>We've been looking at this in principle as part of the SoA work.  Our approach is a little less direct (and not complete as yet).  We are linking a study design PD to the ResearchStudy via the protocol attribute and then assigning the study related actions as PD/AD for each planned event.  We intend to use the AD to generate the ServiceRequest/Task resources and then track them that way.  I'm not sure about needing a research study attribute on service requests where the information should be able to be inferred.</p>",
        "id": 253067707,
        "sender_full_name": "Geoff Low",
        "timestamp": 1631529324
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"192121\">@Geoff Low</span> thanks. Can you explain what you are referring to by PD / AD? Am not acquainted with those acronyms.</p>",
        "id": 253115598,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1631549163
    },
    {
        "content": "<p>Sure, PlanDefinition and ActivityDefinition (apologies)</p>",
        "id": 253120446,
        "sender_full_name": "Geoff Low",
        "timestamp": 1631550950
    },
    {
        "content": "<p>OK - I've been there (in thought) too. That's theory lessons for an Ideal world. The downside is that it requires a big bang for the whole shebang. Try to look at this from the point of view of a hospital team, their knowledge and the infrastructure available there - both EMR-wise and in terms of FHIR-capability. Also, name me a sponsor, who today or in the next few months will supply sites with a Protocol as PlanDefinition. You're putting the bar to high to getting anyone bootstrapped  with  relating any FHIR Data in the EMR with a ResearchStudy in an approachable way today or in the forseeable future.</p>",
        "id": 253133877,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1631556390
    },
    {
        "content": "<p>That said, I’ll run this through. I could generate the PD/AD. The challenge will be reducing that structure for it to be consumed by the proprietary and limited means available in the EMR or relevant hospital systems.<br>\n<span class=\"user-mention\" data-user-id=\"192121\">@Geoff Low</span>  Do you have a reference PD/AD for a Protocol to try this out?</p>",
        "id": 253134173,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1631556520
    },
    {
        "content": "<p>Keep in mind that a PlanDefinition could be almost entirely narrative.  How well coded/computable the protocol is is quite flexible.  Agree that there aren't a whole lot of sponsors expressing computable protocols at the moment, but insofar as they're sharing protocol at all, PlanDefinition is the mechanism to do that in FHIR.  Over time, the degree of computable precision can grow based on the level of sophistication the industry feels is worthwhile.  (And the good news is that there's a great deal of work happening in terms of \"fully\" computable protocols in the clinical decision support space, so there's a different portion of the industry that's forging the trail and building tools that the research community can leverage if/when they're ready.)</p>",
        "id": 253137582,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631557956
    },
    {
        "content": "<p>we've been building out the following: <a href=\"https://phuse-org.github.io/fhir-schedule-of-activities-ig/index.html\">https://phuse-org.github.io/fhir-schedule-of-activities-ig/index.html</a></p>",
        "id": 253154984,
        "sender_full_name": "Geoff Low",
        "timestamp": 1631564867
    },
    {
        "content": "<p>we have a set of three simplified examples on <a href=\"https://confluence.hl7.org/display/FHIR/2021-09+Vulcan+-+Schedule+of+Activities\">https://confluence.hl7.org/display/FHIR/2021-09+Vulcan+-+Schedule+of+Activities</a> as bundles</p>",
        "id": 253155943,
        "sender_full_name": "Geoff Low",
        "timestamp": 1631565274
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> I agree. My point of view is getting this done with the mandatory systems we have today - with all their limitations. The bottleneck is the EMR or whatever sofware you have managing the Order Entry - there is no way around that system (for all sort of Orders including Lab Orders) unless you want to break hospital policies. In the 10 or so systems I deal with, I'd be lucky to be able to add a custom key-value pair as additional metadata to the order.  As long as I can keep the  added complexity which Geoff is proposing to be infornt or behind that bottleneck, and just have a small linking reference included in the HIS/CPOE, all is good.  Going over Geoffs' suggestion again It looks doable despite the overhead.</p>",
        "id": 253162029,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1631567935
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192121\">@Geoff Low</span> - thanks for those references.</p>",
        "id": 253162256,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1631567997
    },
    {
        "content": "<p>No worries, we're meeting as part of the connectathon so if you wanted to come hangout that would be good.  We're a little myopic on the topic of how data gets collected, as a really broad generalisation we have a series of boxes on a form with names that mean something to us, but there's little understanding of the workflow over and above done/not-done.</p>",
        "id": 253205166,
        "sender_full_name": "Geoff Low",
        "timestamp": 1631601865
    }
]