[
    {
        "content": "<p>There are certain clinical guidelines like AHA ASCVD risk scoring etc that result in certain recommendations that may note the use of certain medications or lab tests or procedures. I've looked at  Clinical Practice Guidelines (<a href=\"http://hl7.org/fhir/uv/cpg/\">http://hl7.org/fhir/uv/cpg/</a>), while this is great, We had a minor scoped use case, where we're looking for a specific resource that only holds that \"recommended content\" for that specific patient. I didn't think it can be <code>Observation</code>, any particular resource that might be suited for this?</p>\n<p><a href=\"https://www.hl7.org/fhir/riskassessment.html\">RiskAssessment</a> looks useful?</p>",
        "id": 231823019,
        "sender_full_name": "Raheel Sayeed",
        "timestamp": 1616686278
    },
    {
        "content": "<p>For a specific risk score for a patient, yes, RiskAssessment. For a potential issue, like a drug-drug interaction, DetectedIssue. For a recommendation to perform some action, like a medication or a procedure, one of the request resource with an intent of \"proposal\".</p>",
        "id": 231879960,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1616708112
    },
    {
        "content": "<p>And just to note that CPG can be used just for scoped down content like that, many of the content IGs that currently implement CPG are just a handful of recommendations, or even a calculator. The intent is to provide patterns of usage so that recommendations can be tied back to guidelines (and ultimately supporting evidence) consistently.</p>",
        "id": 231880293,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1616708264
    },
    {
        "content": "<p>Thanks Bryn. Because the guideline recommendation would be a medication, I guess I'd use a \"MedicationRequest\". However, sometimes theres only a broad categorical direction. Like \"Use broad spectrum antibiotics\", \"use high intensity statins\" without a specifying the generic medication itself.</p>",
        "id": 231906590,
        "sender_full_name": "Raheel Sayeed",
        "timestamp": 1616726454
    },
    {
        "content": "<p>Perhaps <code>CommunicationRequest</code> would be more appropriate for the guideline recommendations like 'Physical exercise', 'Diet', etc..</p>",
        "id": 231984032,
        "sender_full_name": "Raheel Sayeed",
        "timestamp": 1616772486
    },
    {
        "content": "<p>If the aim is \"please talk to X about Y\" then <code>CommunicationRequest</code> makes sense. But for guideline telling a patient <em>do</em> something, I'm not sure what the generic recommendation is. There's <code>ServiceRequest</code> (where you can set <code>ServiceRequest.performer</code> to be the patient), which is suitable for exercises (explicitly listed in the resource scope).</p>",
        "id": 231996904,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1616777148
    },
    {
        "content": "<p>And for specifics on diet you might want to use <code>NutritionOrder</code>; but it's a mess to try to slot coarsed-grained guidance into a bunch of <em>different</em> specific FHIR resources (some in Meds, some in Services, some in Nutrition...)</p>",
        "id": 231997175,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1616777229
    }
]