[
    {
        "content": "<p>any work on <a href=\"https://clinicaltrials.gov/\" target=\"_blank\" title=\"https://clinicaltrials.gov/\">https://clinicaltrials.gov/</a> studies? graphql via FHIR, for example?</p>",
        "id": 167975232,
        "sender_full_name": "Dan Connolly",
        "timestamp": 1560364839
    },
    {
        "content": "<p>ah: <a href=\"https://www.ncbi.nlm.nih.gov/pubmed/30147028\" target=\"_blank\" title=\"https://www.ncbi.nlm.nih.gov/pubmed/30147028\">https://www.ncbi.nlm.nih.gov/pubmed/30147028</a> Investigating the Capabilities of FHIR Search for Clinical Trial Phenotyping 2018</p>",
        "id": 167975900,
        "sender_full_name": "Dan Connolly",
        "timestamp": 1560365373
    },
    {
        "content": "<p>\"Using a randomly sampled subset of 303 eligibility criteria from <a href=\"http://ClinicalTrials.gov\" target=\"_blank\" title=\"http://ClinicalTrials.gov\">ClinicalTrials.gov</a> yielded a 34 % success rate in representing them using the FHIR search semantics.\"</p>",
        "id": 167976011,
        "sender_full_name": "Dan Connolly",
        "timestamp": 1560365427
    },
    {
        "content": "<p>Does anyone know whether there is any interest on the part of <a href=\"http://clinicaltrials.gov\" target=\"_blank\" title=\"http://clinicaltrials.gov\">clinicaltrials.gov</a> to make  eligibility criteria machine readable for FHIR?</p>",
        "id": 170620278,
        "sender_full_name": "Simone Heckmann",
        "timestamp": 1562840357
    },
    {
        "content": "<blockquote>\n<p>Does anyone know whether there is any interest on the part of <a href=\"http://clinicaltrials.gov\" target=\"_blank\" title=\"http://clinicaltrials.gov\">clinicaltrials.gov</a> to make  eligibility criteria machine readable for FHIR?</p>\n</blockquote>\n<p>There's a team there working on outcomes reporting - a year or two ago MR I/E was being discussed. I'll follow up and get back to you on this.</p>",
        "id": 171238166,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1563523722
    },
    {
        "content": "<blockquote>\n<p>There's a team there working on outcomes reporting - a year or two ago MR I/E was being discussed. I'll follow up and get back to you on this.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span>  Sent you the contact details privately sind they are not on zulip.</p>",
        "id": 171373972,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1563717963
    },
    {
        "content": "<p>There are a bunch of companies who offer services in this vein.  The issue is that currently it's just a text blob, with some agreed conventions.  I just did some simple parsing in <a href=\"https://github.com/glow-mdsol/clinical_trials/blob/develop/clinical_trials/helpers.py#L4\" target=\"_blank\" title=\"https://github.com/glow-mdsol/clinical_trials/blob/develop/clinical_trials/helpers.py#L4\">https://github.com/glow-mdsol/clinical_trials/blob/develop/clinical_trials/helpers.py#L4</a> to partition the elements based on paragraphing but it's nowhere near what I think you're talking about.</p>",
        "id": 172776334,
        "sender_full_name": "Geoff Low",
        "timestamp": 1565278909
    },
    {
        "content": "<p>The CTTI database rolls it all into a single column (varchar(5000) or thereabouts), so I'd recommend starting with that data source (as many ML/AI providers are using that as a EDA source)</p>",
        "id": 172790958,
        "sender_full_name": "Geoff Low",
        "timestamp": 1565289143
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192121\">@Geoff Low</span> viz. parsing: Same approach here tokenizing with support of a term server. Some observations: <br>\n- Deducting the positive/negative phrasing of I/E is harder than you'd expect. Alot of protocols are badly written. But it's also that that data does not contain the full protocol. <br>\n- Also, you can have quite some biomarker information in the trial endpoint descriptions. The scores there also shed light an the collective. But mostly, if you are after \"what data to extract\" for the survey / evaluation the endpoint info is indispensable. <br>\nAll things considered, this is all pre-processing. There's no way around re-structuring the stuff manually and the world would be a better place if clinical researchers had the tools and means to structure and validate this stuff upfront.</p>",
        "id": 172978040,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1565547197
    },
    {
        "content": "<p>Oh, I know exactly how difficult it is.  In PhUSE we spent around 6 months looking at modelling an ontology to represent the Eligibility Criteria with little really to show for it.  The IMI initiative spent quite a bit of time on it and put together a model from recollection, but like you say the way the criteria are phrased makes it really difficult to get to the bottom of what something more than \"Male, Age &gt;= 18\".   The sooner we can get medical writers to build criteria using lego blocks the better for all parties.  Some studies are now reporting the full protocol (and ICF) in Clinical Trials - I added a facet to the python project to automatically pull the document if it's declared.<br>\nI also agree also about the endpoints, however the use case most people linger on is \"given this clinical trial protocol document, can you tell me whether I will be able to recruit enough suitable candidates from a pool of patients\" and if a machine could do that it would be super.  There's such a large amount of time (and money) spent on getting patients onto a study that it's a really viable market for multiple companies to do just that (horrendous over simplification of course, many of these orgs spend considerable resources accessing, cleaning and indexing patient data).  </p>\n<p>When we get to the point that eligibility can be described in such a way that machine readability is the rule then we can move on to having subjects self identify for research using their personal health record, or use CDS hooks to streamline the process in an EHR system.  Prior studies have found that in general people are quite altruistic when it comes to drug research.</p>",
        "id": 172984120,
        "sender_full_name": "Geoff Low",
        "timestamp": 1565558818
    },
    {
        "content": "<p>there are EHR vendor provided solutions. I know in a historic case I was involved in, these kinds of cohort probes were carefully crafted so as to provide useful information to the clinical trial, while not exposing Privacy. Once accepted, there were other privacy and safety procedures to notify the potential participants to get them engaged with the trial. All of this is not easy, especially to do it right. We hear publicly about when it is NOT done right, we do not hear about all the cases where it was done right. Again, doing it right (privacy and safety) is hard, and the work needed to do it right is valuable to everyone.</p>",
        "id": 173024918,
        "sender_full_name": "John Moehrke",
        "timestamp": 1565617905
    }
]