[
    {
        "content": "<p>Copied from Implementation Stream:<br>\nIs there an existing method to express endpoint adjudication of clinical trial data (e.g., by local or central adjudication committees) for regulators (FDA, EMA, etc.)? For example, adjudication by a Practioner as part of a ResearchStudy for a ResearchSubject relating to an AdverseEvent, MedicationAdministration, Observation, etc. Thanks in advance!</p>",
        "id": 255426759,
        "sender_full_name": "Mike Hamidi",
        "timestamp": 1632931925
    },
    {
        "content": "<p>Hi Mike, the only perspective I can offer with EA and EACs in relation to FHIR is  with a local Endpoint Adjudication Audit, which was quite similar to an SDV Audit with the diifference that the local adjudication processes had to be transparent (in FDA Speak  \"tracible\") . All relevant data including practioners involved  are continuously collected - including Provenance and AuditEvent. During the Audit a few key endpoint values were given on the basis of which a tracibility report was generated and compared to the reported decision. The \"only\" value was/is that we provided mitigation for  systems in the process which did not support auditrails. The pocess was formally acknowledged. I</p>\n<p>I  think you are after something different - some structure for the EA to be tracible in the final study report. Right?</p>",
        "id": 255557168,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1633001647
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194020\">@Gustav Vella</span> That is correct. We need something that can be a 1..* EA associated with the patient records. It should also have the ability to assess another EA practitioner's outcome (agree or disagree). In the end, a final EA should be identified (e.g., a boolean acceptance flag). I'm in the middle of identifying potential gaps for using FHIR in clinical research (outside of the FHIR-to-CDISC IG).</p>",
        "id": 255564918,
        "sender_full_name": "Mike Hamidi",
        "timestamp": 1633005221
    },
    {
        "content": "<p>This sounds to me like a ClinicalAssessment/ clinical consultation  encounter on the one hand and related Questionnaire on the other for evaluating the assessment. The worlflow itself seems to be very similar to that of a tumor board for which there are successful FHIR implementationss to draw some practical inspiration from. Sorry not to be of much help but it definitely got me curious. I'll ask around.</p>",
        "id": 255636673,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1633031361
    },
    {
        "content": "<p>Would the practitoners doing EA always be part of the trial group.. or would there be external parctitioners (as in an external DSMB)?  Are the practitioners being randomized and you als0 need to capture that information?</p>",
        "id": 255638652,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1633032082
    },
    {
        "content": "<p>Practitioners as part of a committee would usually be doing the EA. The conditions and details of EA can vary by study design. Here's a general background <a href=\"https://www.bumc.bu.edu/crro/files/2020/01/Clinical-Adjudication-Committees_JR_Jan-8-2019.pdf\">https://www.bumc.bu.edu/crro/files/2020/01/Clinical-Adjudication-Committees_JR_Jan-8-2019.pdf</a></p>",
        "id": 255670037,
        "sender_full_name": "Mike Hamidi",
        "timestamp": 1633047346
    }
]