[
    {
        "content": "<p>ResearchStudy R4 allows references to 0..* groups <a href=\"https://hl7.org/fhir/researchstudy-definitions.html#ResearchStudy.enrollment\">https://hl7.org/fhir/researchstudy-definitions.html#ResearchStudy.enrollment</a><br>\nResearchStudy R5 allows references to 0..1 groups <a href=\"https://hl7.org/fhir/2021May/researchstudy-definitions.html#ResearchStudy.recruitment.eligibility\">https://hl7.org/fhir/2021May/researchstudy-definitions.html#ResearchStudy.recruitment.eligibility</a></p>\n<p>While I could express I/E via multiple groups in R4 I can't do that any more in R5. What's the Idea for this change? Am I missing something?</p>",
        "id": 257773546,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1634336202
    },
    {
        "content": "<p>Good question.  Group allows \"ANDing\" of characteristics.  If you want \"ORing\" of characteristics, your only option is distinct groups.  <span class=\"user-mention\" data-user-id=\"196523\">@Hugh Glover</span> ?</p>",
        "id": 257775884,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1634337547
    },
    {
        "content": "<p>Yeah \"ORing\" is exactly our (<span class=\"user-mention\" data-user-id=\"250725\">@Clemens</span> ) case.</p>",
        "id": 257833054,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1634391972
    },
    {
        "content": "<p>Would be nice to clarify how to model OR criteria  in R5. We have implemented I/E criteria screening in R4 using FHIR groups (OR criteria by using different, distinct groups)</p>",
        "id": 257999081,
        "sender_full_name": "Clemens Scherer",
        "timestamp": 1634548668
    },
    {
        "content": "<p>I've asked this question before and not got an answer :(</p>",
        "id": 258058118,
        "sender_full_name": "Hugh Glover",
        "timestamp": 1634574753
    },
    {
        "content": "<p>Where did the change to the cardinality come from?</p>",
        "id": 258063349,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1634576682
    },
    {
        "content": "<p>This is how the Vulcan SoA was conceptualizing it (i.e. groups). A lingering question is 1..* I/E amendments and sub-study I/E enrollments (i.e., overall complexity in real-world setting across sites).</p>",
        "id": 258084890,
        "sender_full_name": "Mike Hamidi",
        "timestamp": 1634584991
    },
    {
        "content": "<p>Hugh was so kind as to put it on the Agenda for discussion tonight. Hope this clarifies the thinking. I'm using constructs very similar to those here <a href=\"https://www.devdays.com/wp-content/uploads/2020/08/Community-Bulk-Export-API-DevDays-2020-Virtual.pdf\">https://www.devdays.com/wp-content/uploads/2020/08/Community-Bulk-Export-API-DevDays-2020-Virtual.pdf</a> and am using alot R5 elements via  <a href=\"http://hl7.org/fhir/r4/versions.html#extensions\">http://hl7.org/fhir/r4/versions.html#extensions</a> because of the significant improvements for ReSubj and ReStudy in R5 and obvioulsly would like be sure things remin R5 compatible.</p>",
        "id": 258151231,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1634627490
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196523\">@Hugh Glover</span> explained the rationale for the change in yesterdays call. I'm doing my best here to summarize. What I got is as follows:</p>\n<blockquote>\n<p>Looking at the listing of elements and attributes in <em>ResearchStudy</em>, there is a <em>recruitment</em> block as Backbone element with the <strong>eligibility</strong> attribute referring to a <em>Group</em> defining Inclusion and exclusion criteria. <del>We also have the <em>actualGroup</em> attribute referring to a <em>Group</em>, in this case defining the group of participants who were actually enrolled in study. </del> (I struck this though since not really relevant for this discussion)</p>\n</blockquote>\n<blockquote>\n<p>If we look at the <em>Group</em> resource, you have the <em>Group.member</em> as backbone element, defining who or what is in group. Multiple members are possible, each containing an <em>Group.member.entity</em> attribute that can take a reference to the group resource itself as value. Hence, you can have multiple members and thus, via <em>entity</em> multiple groups.</p>\n</blockquote>\n<blockquote>\n<p>According to <span class=\"user-mention silent\" data-user-id=\"196523\">Hugh Glover</span> , the argument by <span class=\"user-mention silent\" data-user-id=\"192085\">Brian Alper</span>  for suggesting the changes was that you got a 0..* in Group.member, where you define top level groups e.g. which distinguish between inclusion or exclusion so you would have 2 groups at that level and within each of those you'd have as many component groups as you actually wanted. Hence, by having 0...1 in <em>ResearchStudy.recruitment.eligibility</em> you provide a single base to a hierarchical structure and you walked your way down, branching off in tidy distinct Group resources.</p>\n</blockquote>",
        "id": 258403465,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1634749048
    },
    {
        "content": "<p>What do I think of this? Instinctively I prefer flat structures. Leaving that instinct aside, it always depends on what you want to do. If you want to make things more legible, packaging I/E in different groups is helpful. If you want to process and query the stuff (query on group traits), the change makes things complicated or not possible at all.</p>\n<p>The first thing that comes to mind is the following case/user story:</p>\n<blockquote>\n<p>As physician, I want to find the appropriate <em>Study</em> for a patient. The System should show me all ResearchStudies with following inclusion criteria. ...</p>\n</blockquote>\n<p>That type of search is not possible with this construct because afaik you don’t have recursive reference support in search. Am I wrong?</p>",
        "id": 258403738,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1634749129
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193430\">@Alexander Zautke</span> you are my source of wisdom regarding search.</p>",
        "id": 258405436,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1634749720
    },
    {
        "content": "<p>I'm not understanding that logic.  ResearchStudy.recruitment.eligibility is 0..1 - and there you're definitely not listing specific patients yet - you've only got criteria.  And if you're specifying criteria, you're going to need AND + OR.  The only way to get the latter is multiple repetitions of Group.</p>\n<p>For ResearchStudy.recruitment.actual <em>if</em> the preseumption is that you're always listing group members, not criteria, then 0..1 is probably ok.  However, if you wanted to indicate which set of members you had for each combination of eligibility criteria, then you'd probably want the 'actual' to mirror the 'eligibility' in terms of criteria - in addition to enumerating the members.</p>",
        "id": 258417781,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1634754064
    },
    {
        "content": "<p>No, the case I'm assuming the change will cause trouble with is not when searching for patients but when <strong>searching for trials</strong> which match specific traits of my patient against the traits/criteria in the I/E groups related to the trial. Hence, when I want to find a trial for a given patient using a search operation.</p>\n<p>That's the only issue I see with the spec change right now.</p>",
        "id": 258424360,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1634756440
    },
    {
        "content": "<p>I would assume ResearchStudy.recruitment is 0..1 as retrospective studies do not require recruitment - determined, e.g., via ResearchStudy.primaryPurposeType. To me, it seems that you can have 1..* ResearchStudy.recruitment.eligibility grouping sets. For example, when there are multiple I/E amendments. However, which patients are in which I/E group is based on ResearchStudy.recruitment.actualGroup. </p>\n<p>Side note, I think there should be conditions when ResearchStudy.recruitment is 1..* because those supporting elements would have conditions to their requirement. For instance, if an interventional clinical trial has ResearchStudy.recruitment then an expectation for ResearchStudy.recruitment.eligibility, ResearchStudy.recruitment.targetNumber, etc. would be true. Again, this is something being evaluated by the Vulcan SoA.</p>",
        "id": 258552005,
        "sender_full_name": "Mike Hamidi",
        "timestamp": 1634825470
    },
    {
        "content": "<p>For a retrospective study, you could still potentially use 'recruitment' to track which Patient records were deemed in scope for the analysis.</p>",
        "id": 258563325,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1634829010
    },
    {
        "content": "<p>A ResearchStudy Resource could be used without a recruitment element if you are building/describing a protocol and have not yet determined the group/population/sample enrollment/eligibility criteria.  The Resource instance does not have to be completely filled out to be meaningful.</p>\n<p>If a research study includes multiple groups they can be described in the comparisonGroup element which is 0..* while the recruitment element is 0..1 for the overall group/population for the entire ResearchStudy.</p>\n<p>The Group Resource contains 0..* characteristics for describing inclusion and exclusion criteria.  If you want to search for clinical trials (research studies) which contain specific inclusion criteria within the group eligibility criteria there are 2 ways to consider doing this:<br>\n1) Use the ResearchStudy.classification, ResearchStudy.condition, and ResearchStudy.keyword, and ResearchStudy.location elements -- until more and more groups are defined in coded structured data in Group Resources this will be needed<br>\n2) Search the Group resource referenced by the ResearchStudy for the eligibility criteria of interest.  This does require mapping through the reference to the Group Resource then search the characteristic elements of the referenced resource.</p>\n<p>Also the actual group does not need to use Group.members -- often the actual group will have a quantity and could included characteristics without disclosing who the members are.</p>",
        "id": 258581429,
        "sender_full_name": "Brian Alper",
        "timestamp": 1634835672
    },
    {
        "content": "<p>first off, thanks for following-up.. very clear explanation.. </p>\n<p><span class=\"user-mention silent\" data-user-id=\"192085\">Brian Alper</span> <a href=\"#narrow/stream/179290-research/topic/Differences.20in.20Inclusion.2FExclusion.20between.20R4.20and.20R5/near/258581429\">said</a>:</p>\n<blockquote>\n<p>If you want to search for clinical trials (research studies) which contain specific inclusion criteria within the group eligibility criteria there are 2 ways to consider doing this:<br>\n1) [...]<br>\n2) Search the Group resource referenced by the ResearchStudy for the eligibility criteria of interest.  <strong>This does require mapping through the reference to the Group Resource</strong> then search the characteristic elements of the referenced resource.</p>\n</blockquote>\n<p>I'm not sure what you exactly mean by \"mapping through the reference\" - could you elaborate on that? In the case of the hierarchical structure  , we'll have to map through several references.</p>",
        "id": 258587846,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1634838213
    },
    {
        "content": "<p>I don't know how FHIR search API works, but for other data transformations I have been able to call a resource by following the value in the reference element, interrogate the resource for known data values (such as characteristic containing desired strings), and complete a \"search\" in a for-loop.  This may not be scalable the way I have done it but I haven't built search engines.  I think there are discussions about using FHIR for data exchange vs. using FHIR for data store. Others may have a lot more understanding for this.</p>",
        "id": 258590720,
        "sender_full_name": "Brian Alper",
        "timestamp": 1634839258
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191320\">Lloyd McKenzie</span> <a href=\"#narrow/stream/179290-research/topic/Differences.20in.20Inclusion.2FExclusion.20between.20R4.20and.20R5/near/258417781\">said</a>:</p>\n<blockquote>\n<p>I'm not understanding that logic.  ResearchStudy.recruitment.eligibility is 0..1 - and there you're definitely not listing specific patients yet - you've only got criteria.  And if you're specifying criteria, you're going to need AND + OR.  The only way to get the latter is multiple repetitions of Group.</p>\n<p>For ResearchStudy.recruitment.actual <em>if</em> the preseumption is that you're always listing group members, not criteria, then 0..1 is probably ok.  However, if you wanted to indicate which set of members you had for each combination of eligibility criteria, then you'd probably want the 'actual' to mirror the 'eligibility' in terms of criteria - in addition to enumerating the members.</p>\n</blockquote>\n<p>As Lloyd stated indirectly, FHIR Group has the rule \"Can only have members if group is \"actual\". So if want to prospectively search patients for your clinical trials in a hospital by  using I/E criteria with AND and OR  conjunctions,  you are not allowed to use the BackboneElement \"member\" in FHIR group (no \"actual\" but descriptive group). Therefore, you have to use multiple groups for enrollment (0...*), each representing a certain subset of I/E criteria  - for example:  A AND (B OR C) would lead to the two groups A AND B, A AND C.</p>",
        "id": 258598939,
        "sender_full_name": "Clemens Scherer",
        "timestamp": 1634842672
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"250725\">@Clemens Scherer</span>  has a good point here. Let me try and pick this up again, rephrase, and clarify misundertandings. </p>\n<p>We are not takling about \"actual\" groups but of groups defined descriptively via characteristics.<br>\nFor the \"members\" attribute both in R4 and in build R5 we have the rule \"Can only have members if group is \"actual\" member.empty() or (actual = true)\". </p>\n<p>Inclusion/Exclusion groups are definitely not \"actual\" but descriptive groups defining chracteristics. Hence, according to the definition, we can't use the backbone element \"members\" for defining the I/E criteria.</p>",
        "id": 259419684,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1635440365
    },
    {
        "content": "<p>If you want to define inclusion/exclusion criteria (whether the group is actual=false, actual=true with no member data or actual=true with member data), the inclusion/exclusion criteria would be defined in the characteristic element (using exclude=true for exclusion criteria).  </p>\n<p>You can define Group A = Group B criteria AND Group C criteria by creating 2 characteristic elements in Group A to reference the other 2 groups.  This approach will mean that Group A is smaller than Group B and Group C combined because you are expressing the combination of both sets of criteria.  </p>\n<p>If you wanted to define Group A as having members of Group B and Group C you could use member but that would only work for \"actual\" groups.  </p>\n<p>If you want to express Group A has the characteristics of Group B or Group C, I don't think there is an easy way to do it in the current Group Resource structure and we would probably need a Group.characteristic.value[x] option of Expression data type.  There is a FHIR tracker <a href=\"https://jira.hl7.org/browse/FHIR-33264\">https://jira.hl7.org/browse/FHIR-33264</a> to suggest adding Expression datatype to Group.characteristic.value[x] for other reasons.</p>",
        "id": 259462453,
        "sender_full_name": "Brian Alper",
        "timestamp": 1635461483
    }
]