[
    {
        "content": "<p>Hello everybody</p>\n<p>We are evaluating how a hospital could handle the data processing of it's internal studies with a CDR that implements FHIR. <br>\nAn internal study for example is comparing different ways of inserting catheter. </p>\n<p>Process (It's only a proof of concept, therefore kept simple): <br>\na) create a study <br>\nb) add a patient to the study <br>\nc) capture the data <br>\nd) close the study </p>\n<p>I tried to find the corresponding fhir ressources which led to the following questsions:  <br>\n1) Is it correct that the study itself can be represented with the  ResearchStudy Resource (Step a) ?<br>\n2) How do I link a patient or encounter to the study (Step b)  <br>\n3) Are there typical ressources used to capture the data or are you free to use an observation Ressource, Diagnostic Ressource,... (Step c)<br>\n4) Why do I only find the ImagingStudy being linked in several other ressources e.g. the Observation Ressources \"part of\" value,  but not the RessearchStudy? </p>\n<p>Thanks in advance for all the help<br>\nGreeting Michael</p>",
        "id": 235149670,
        "sender_full_name": "Traven",
        "timestamp": 1618823406
    },
    {
        "content": "<p>1 - yes<br>\n2 - ResearchSubject ties a Patient to a ResearchStudy and tracks their status within the study.  Encounter is linked through Patient, though there's also an extension where you can tie resources directly to ResearchStudy if there's a need to distinguish which patient encounters are tied to the study and which aren't</p>\n<ol start=\"3\">\n<li>Data would typically be captured using standard resources.</li>\n<li>Links to ResearchStudy are through an extension - because we don't believe that most systems that support the resources also support tying to ResearchStudy</li>\n</ol>",
        "id": 235187638,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1618841827
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> , I think i now got the idea:</p>\n<p>A) You have a ResearchSubject Ressource which contains<br>\n       1) a \"study\" element, which references a ResearchStudy Ressource<br>\n       2) a  \"individual\" element, which references a Patient</p>\n<p>B) You then create e.g. a Observation Ressource with the researchStudy Extension (<a href=\"https://build.fhir.org/extension-workflow-researchstudy.html\">https://build.fhir.org/extension-workflow-researchstudy.html</a>)</p>\n<p>With those linkage it should be possible to get either all the data for a study or just from a specific patient.</p>",
        "id": 235207753,
        "sender_full_name": "Traven",
        "timestamp": 1618848912
    },
    {
        "content": "<p>Something I don't understand : Why does the ResearchSubject Ressource only reference to One Patient (Cardinality 1:1). <br>\nUsually there are several patients taking part in studys? I therefore expected it to be 1:*  <span aria-label=\"thinking\" class=\"emoji emoji-1f914\" role=\"img\" title=\"thinking\">:thinking:</span></p>",
        "id": 235507221,
        "sender_full_name": "Traven",
        "timestamp": 1619010943
    },
    {
        "content": "<p>my understanding is that the ResearchSubject resource represents an individual state within a study -- <a href=\"http://hl7.org/fhir/researchsubject.html#statemachine\">http://hl7.org/fhir/researchsubject.html#statemachine</a></p>\n<p>Not the cohort. </p>\n<p>The cohort would be the list of all ResearchSubjects with a .study with the value of the ResearchStudy (id) of interest.</p>",
        "id": 235508742,
        "sender_full_name": "John Moehrke",
        "timestamp": 1619011495
    },
    {
        "content": "<p>Ah okay, meaning if I have a ResearchStudy Ressource \"SampleStuy\" with Id X and to list all the patient that take part in I would have to<br>\n1) List all the Ressource ResearchStubject Ressources that have a .study  _id = X <br>\n2) Looping through results of 1) and list the Patient Reference in the individual segment</p>\n<p>Is this correct or is there an easier way?</p>",
        "id": 235510399,
        "sender_full_name": "Traven",
        "timestamp": 1619012044
    },
    {
        "content": "<p>that is pretty easy</p>",
        "id": 235510659,
        "sender_full_name": "John Moehrke",
        "timestamp": 1619012138
    },
    {
        "content": "<p>You can do all that with a single query using <code>_include</code>.  ResearchSubject represents the linkage for each patient - because each will have different enrollment dates, be part of different arms, have different statuses, etc.</p>",
        "id": 235529928,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1619018395
    },
    {
        "content": "<p>thanks <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>  and <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  I am still rather new to FHIR so all the advice I can get is very helpful</p>",
        "id": 235538237,
        "sender_full_name": "Traven",
        "timestamp": 1619021466
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  May I ask for help again?<br>\nI looked up \"_include\" search and found the following example in the documentation<br>\nExample: GET [base]/MedicationRequest?_include=MedicationRequest:patient  <br>\nExplanation: This search requests all matching MedicationRequests, to include any patient that the medication prescriptions in the result set refer to</p>\n<p>So I tried the following search on the test server: <br>\n<a href=\"http://hapi.fhir.org/baseR4/MedicationRequest?_include=MedicationRequest:patient=2045294\">http://hapi.fhir.org/baseR4/MedicationRequest?_include=MedicationRequest:patient=2045294</a></p>\n<p>I expected it to result in a Bundle only containing MeddicationRequest with a patient ressource of id = 2045294. <br>\nThis did not happen, it lists also MeddicationRequest  for different patients. </p>\n<p>How can I use the \"_inclucde\" query to get a Ressource that includes a certain Ressource for a specific value?</p>",
        "id": 235588463,
        "sender_full_name": "Traven",
        "timestamp": 1619042031
    },
    {
        "content": "<p>_include says \"for all matching MedicationRequests you find, also bring back these related resources\".  The filters on what MedicationRequests should come back are outside the _include.  (Key thing to be aware of is that you can't have more than one \"=\" in a clause.)<br>\nWhat you want is:<br>\n<code>http://hapi.fhir.org/baseR4/MedicationRequest?patient=2045294&amp;_include=MedicationRequest:patient</code></p>",
        "id": 235591818,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1619043933
    }
]