[
    {
        "content": "<p>Hi there, I had a vague impression of seeing an implemention of - or an intention by EMA to implement - FHIR profiles for the individual case safety reports (ICSRs). Can't find anything of the sort. <br>\nDoes anyone here have any information whether this is done, is being done or will be done? We are re-implementing our Pharma E2B interface and I was hoping to make use of the efforts in FHIRing up our Safety System.</p>",
        "id": 204556889,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1595343030
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span> <span class=\"user-mention\" data-user-id=\"191651\">@Rik Smithies</span> - I've found this recent post <a href=\"#narrow/stream/179240-Announcements/topic/.5BHL7.20JIRA.5D.20FHIR.20Implementation.20Guide.20for.20ICSR.20Submissions.2E.2E.2E\">https://chat.fhir.org/#narrow/stream/179240-Announcements/topic/.5BHL7.20JIRA.5D.20FHIR.20Implementation.20Guide.20for.20ICSR.20Submissions.2E.2E.2E</a> - however no specific mention of ICH E2B(R3). Is this within the scope of  the IG ?</p>",
        "id": 204634818,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1595400299
    },
    {
        "content": "<p>Yes, sort of.  The guide is focusing on FDA submissions to FAERS and VAERS.  FAERS currently uses ICH E2B(R2) with local extensions while VAERS uses ICH E2B(R3) with local extensions.  I have mapped both R2 and R3 to FHIR but our profiles only handle the Transfusion and Vaccination use cases.</p>",
        "id": 204670930,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1595427287
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192166\">@Jean Duteau</span>  that's very helpful, very precise. Is the work a closed job or can we build on top of it and extend beyond your use cases?</p>",
        "id": 204704838,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1595442829
    },
    {
        "content": "<p>You should reach out to the HL7 Vulcan Accelerator.  I presented to them last week and they will be doing exactly what you asked - building on top of it and extending beyond our use cases.  Basically, I believe that they'll take my mapping and then build more in-depth profiles off of that.</p>",
        "id": 204705048,
        "sender_full_name": "Jean Duteau",
        "timestamp": 1595442913
    },
    {
        "content": "<p>Thanks!</p>",
        "id": 204705232,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1595442995
    }
]