[
    {
        "content": "<p>So let the party begin: what about a machine readable study protocol by Christmas? What about doing in 4 months what CDISC hasn't done with PRM in 10 years? Doing this in FHIR makes way more sense coz that's the language closest to our EMR and our study subjects are in final account patients at our care centers.</p>\n<p>If we take a protocol guideline <a href=\"https://e-protocol.od.nih.gov\" target=\"_blank\" title=\"https://e-protocol.od.nih.gov\">https://e-protocol.od.nih.gov</a> and take the juicy and hard bits which will really help us, I'd focus on schedule of activites, dosing and administration.</p>\n<p>That would be the first agenda</p>\n<p>SCHEDULE OF ACTIVITIES (SOA)</p>\n<blockquote>\n<p>The <strong>schedule of activities</strong> must capture the <strong>procedures</strong> that will be accomplished at <strong>each study visit</strong>. This includes any <strong>tests</strong> that are used for <strong>eligibility</strong>, participant randomization or stratification, or decisions on study intervention discontinuation. <strong>Procedures that contribute to participant eligibility</strong> should be distinctly annotated to distinguish between other routine procedures and. <strong>study objectives</strong> and <strong>endpoints</strong> should also be annotated.  Other procedures should be done sparingly and with consideration, as they may add unnecessary complexity and detract from recruitment. <br>\n<strong>Allowable windows</strong> should be stated for all <strong>visits</strong>. To determine the appropriate windows, consider feasibility and <strong>relevance of the visit time points to study endpoints</strong> (e.g., pharmacokinetic <strong>(PK) studies may allow little or no variation, with required time points measured in minutes or hours, whereas a 6-month follow-up visit might have a window of several weeks)</strong>.  </p>\n</blockquote>\n<p>Key concepts:</p>\n<ul>\n<li>schedule of activities</li>\n<li>procedures</li>\n<li>study visit</li>\n<li>procedures at each study visit</li>\n<li>tests</li>\n<li>eligibility, randomization, stratification</li>\n<li>Allowable windows for visits</li>\n<li>Relevance of the visit time points to study endpoints</li>\n</ul>",
        "id": 153982739,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1533585652
    },
    {
        "content": "<p>DOSING AND ADMINISTRATION</p>\n<blockquote>\n<p>Describe the procedures for selecting each participant's dose of study intervention and control product.  For drugs, that includes the timing of dosing (e.g., time of day, interval), the duration (e.g., the length of time study participants will be administered the study intervention), the planned route of administration (e.g., oral, nasal, intramuscular), and the relation of dosing to meals.  </p>\n</blockquote>\n<p>Key concepts:</p>\n<ul>\n<li>procedures for selecting each participant's dose of study intervention and control product</li>\n<li>timing of dosing (e.g., time of day, interval)</li>\n<li>duration (e.g., the length of time study participants will be administered the study intervention)</li>\n<li>planned route of administration (e.g., oral, nasal, intramuscular)</li>\n<li>relation of dosing to meals.  </li>\n</ul>\n<blockquote>\n<p>State the <strong>starting dose</strong> and schedule of the study intervention and control product, including the maximum and minimum duration for those participants who continue in the study. For example, in some oncology trials for participants with no available therapeutic alternatives, intervention continues even after disease progression. In this instance, consider alternative designs that enable participants to rollover to a continued treatment arm and include appropriate instructions to guide this implementation.   </p>\n</blockquote>\n<p>Key concepts:</p>\n<ul>\n<li>starting dose</li>\n<li>schedule of the study intervention and control product</li>\n</ul>\n<blockquote>\n<p>If applicable, <strong>describe the dose escalation scheme</strong> and <strong>dose regimen (using exact dose, rather than percentages)</strong>. State any <strong>minimum period required before a participant’s dose might be raised to the next higher dose or dose range</strong>.  If applicable, the protocol should state the <strong>conditions under which a dose change will be made</strong>, particularly in regard to failure to respond or to toxic or untoward changes in stipulated indicators (e.g., white blood cell count in cancer chemotherapy).  <strong>Address dose modifications for specific abnormal laboratory values of concern</strong> or <strong>other adverse events (AEs) that are known to be associated with the planned study intervention</strong>.  The protocol must state explicitly <strong>the dose-limiting effects that are anticipated</strong>.  Provide <strong>criteria that will be used to determine dose escalations</strong>.  If a participant is responding positively to the intervention, the protocol should specify whether study intervention administration would progress to still higher doses.  <strong>If appropriate, provide a dose de-escalation schema with intervention modifications</strong>.  Do not restate reasons for withdrawal of participants.  Cross-reference relevant sections, as appropriate. </p>\n</blockquote>\n<p>key concepts:</p>\n<ul>\n<li>dose escalation scheme</li>\n<li>dose regimen (using exact dose, rather than percentages)</li>\n<li>any minimum period required before a participant’s dose might be raised to the next higher dose or dose range</li>\n<li>conditions under which a dose change will be made</li>\n<li>particularly in regard to failure to respond or to toxic or untoward changes in stipulated indicators (e.g., white blood cell count in cancer chemotherapy).  </li>\n<li>dose modifications</li>\n<li>for specific abnormal laboratory values of concern</li>\n<li>for other adverse events (AEs) that are known to be associated with the planned study intervention</li>\n</ul>\n<blockquote>\n<p>Any specific <strong>instructions to study participants about when or how to prepare and take the dose(s) should be described</strong>, including <strong>how delayed or missed doses should be handled</strong>.  Include any specific instructions or safety precautions for administration of the study intervention.  Discuss the maximum hold time once thawed/mixed, if appropriate, before administration. <br>\nWhile much of the above section is specific to drugs, similar considerations apply to certain devices. For example, some devices have adjustable settings including those related to energy delivery to participants. Other devices must be sized correctly for individual participants. Similar to the discussion above for dosage of drugs, such considerations should be described for devices, as applicable. </p>\n</blockquote>\n<p>Key concepts:</p>\n<ul>\n<li>how delayed or missed doses should be handled.</li>\n</ul>\n<p>Is that a start?</p>",
        "id": 153982741,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1533585746
    },
    {
        "content": "<p>That's quite the way to kick off the thread :)</p>",
        "id": 153982808,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533591069
    },
    {
        "content": "<p>I think there's a few interesting things we can pursue.  One is absolutely defining how to represent clinical protocols in FHIR - not positioned as \"let's do this because CDISC hasn't\" - I don't think that framing is helpful.  Rather \"let's make sure the things we need are actually in FHIR and use some of our requirements to exercise FHIR in a way that it hasn't been previously\".  Part of that will likely include ability to map to and from what CDISC <em>can</em> do.</p>\n<p>The reality is that FHIR may well be able to model protocols to a greater level of sophistication than authors can be bothered with and than clinical systems will care to engage with.  So something else to consider is what level of protocol exposure will let us drive the degree of EHR behavior we need. </p>\n<p>A second area to explore is how much change would we actually need in the EHR and how much can we leverage things like SMART and CDS Hooks to let us \"plug in\" to the EHR to do things without EHRs needing to change much, if at all.</p>\n<p>A third area to explore is defining data expectations - what can Questionnaire/QuestionnaireResponse, SDC and profiles do in terms of simplification of data collection processes?</p>",
        "id": 153982810,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533591427
    },
    {
        "content": "<p>All good stuff!  </p>\n<p>Take a look at <a href=\"http://wiki.hl7.org/index.php?title=201809_Clinical_Research\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=201809_Clinical_Research\">Scenario 4 of the Clinical Research Stream of the Connectthon</a>.  While its couched in terms of ODM I think the core question is demonstrating a schedule of activities in FHIR.</p>\n<p>I'm wary of the \"lets represent a protocol in FHIR\" because a Protocol is quite a substantial beast but the elements Gustav has pulled out are a good subset.</p>",
        "id": 153983035,
        "sender_full_name": "Hugh Glover",
        "timestamp": 1533630569
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196523\">@Hugh Glover</span>  thanks for feedback. Is there any work  product/outcome in term of resources/profiles for Scenario 4?</p>",
        "id": 153983052,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1533636498
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <br>\nas to first point. That set is the minimal level of exposure we need. I'd add adverse events and basic ResearchSubject linking to medical record. In the coming weeks I'll make a suggestion for modifications needed <a href=\"http://build.fhir.org/researchsubject.html#statemachine\" target=\"_blank\" title=\"http://build.fhir.org/researchsubject.html#statemachine\">http://build.fhir.org/researchsubject.html#statemachine</a> here. I still have to test things out to be absolutely positvely sure that they are really are missing.</p>\n<p>second point. scopes &amp; launch context is tricky.  but there are feasible workarounds eg for my app the parameters are</p>\n<ul>\n<li>patientid: identifier of current patient context from which the app was launched</li>\n<li>username: name of current EHR user launching the app</li>\n<li>fhirbase: URL of the FHIR server endpoint</li>\n</ul>\n<p>For example:<br>\nhttps://{app-launch-url}?patientid=12345&amp;username=jdoe&amp;fhirbase={fhir-server-url}<br>\nWhile the fhirbase parameter can be set statically at setup time, both username and patientid must be populated by the EHR at runtime. Most EHR vendors offer placeholders to create dynamic launch urls.</p>\n<p>we'll need to help end users with a shortlist of what to demand from their vendors and offer them workarounds if their vendors don't comply.</p>\n<p>third point. yes ! the stuff going on with questionnaires right now will help.</p>",
        "id": 153983054,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1533637624
    },
    {
        "content": "<p>Its on my list to start doing some prep, and there will be a section on the BR&amp;R confluence pages to hold it.</p>",
        "id": 153983084,
        "sender_full_name": "Hugh Glover",
        "timestamp": 1533646030
    },
    {
        "content": "<p>Don't really understand linking ResearchSubject to the medical record.  The only link for ResearchSubject is its existence.  All other linkages would be through Patient to ResearchSubject and to Study.</p>",
        "id": 153983144,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533652572
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> as a data modeler, I wholeheartedly agree...ResearchSubject would be a role that a Patient can play.  And in a perfect world, we would have all of those connections in the data.  But it's not what we are seeing in the data we receive.  There are some situations where the patient is anonymized.  The data sources don't have a patient number - they only know our subject ID - so that's all they provide.  Having to go through Patient forces either the data source or the data consumer to create \"fake\" data, just to fill in the gaps.  Sigh...</p>",
        "id": 153983160,
        "sender_full_name": "Christine D",
        "timestamp": 1533654848
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> yeah sorry the wording:  The real subject only becomes a research subject  in a FHIR aware EMR with the existence of ResearchSubject. In practice you'd have an app to generate that coz the emr does not speak fhir an has no concept of a subject or a tiral. In germany you'd be translating V2 messages to FHIR resources. Our app obviously runs on a FHIR Serever and invoke it as described in previous post. From the perspective of the clinician the app links patients to trials and makes them study subjects. You have these relationships: PID 1234 &lt;--&gt; Trial  xyz &lt;--&gt; ScreeningID 015, Subject ID 4673 and status of patient in the trial...</p>\n<p>That's where you hook in: the absolute minimum you have to implement before building apps for the fancy stuff - visits, screening tests, study medication etc.</p>",
        "id": 153983164,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1533655097
    },
    {
        "content": "<p>In FHIR, ResearchSubject is less a role and more a 'participation' - it represents a particular patient's involvment in a particular study rather than a generic capacity to be involved in studies.  In an anonymized situation, you're not creating \"fake\" data - you're creating an anonymized view of data - you're going to similarly anonymize everything else because it won't just be the patient resource that will require anonymization - you'll need to think about narrative in all of the resources and in some cases you may need to anonymize other things too.  ResearchSubject doesn't have any \"person\" data at all - it's all about the activity of involvment in the study.</p>",
        "id": 153983200,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533658969
    },
    {
        "content": "<p>I've crated a dummy data set for a schedule of activities at (<a href=\"http://confluence.hl7.org/display/BRR/Connectathon+2018-08+Scenario+4\" target=\"_blank\" title=\"http://confluence.hl7.org/display/BRR/Connectathon+2018-08+Scenario+4\">http://confluence.hl7.org/display/BRR/Connectathon+2018-08+Scenario+4</a>).  This is intended as a starting point to throw things at.  For instance do we also want to consider recruitment at this point?  Do we want sample inclusion and exclusion criteria? ...</p>",
        "id": 153983696,
        "sender_full_name": "Hugh Glover",
        "timestamp": 1533743893
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196523\">@Hugh Glover</span>   Would this help us get an idea of the contents of the ODM file?  <a href=\"https://docs.openclinica.com/3.1/technical-documents/openclinica-and-cdisc-odm-specifications/mapping-openclinica-elements-odm\" target=\"_blank\" title=\"https://docs.openclinica.com/3.1/technical-documents/openclinica-and-cdisc-odm-specifications/mapping-openclinica-elements-odm\">https://docs.openclinica.com/3.1/technical-documents/openclinica-and-cdisc-odm-specifications/mapping-openclinica-elements-odm</a></p>",
        "id": 153984201,
        "sender_full_name": "Christine D",
        "timestamp": 1533824293
    },
    {
        "content": "<p><a href=\"https://simplifier.net/test20171092\" target=\"_blank\" title=\"https://simplifier.net/test20171092\">https://simplifier.net/test20171092</a></p>\n<p><span class=\"user-mention\" data-user-id=\"194020\">@Gustav Vella</span> Can you please take a look and give feedback?</p>",
        "id": 153985563,
        "sender_full_name": "Markus Döring",
        "timestamp": 1534102671
    },
    {
        "content": "<p>extension <a href=\"https://simplifier.net/test20171092/ResearchStudy-reference/~json\" target=\"_blank\" title=\"https://simplifier.net/test20171092/ResearchStudy-reference/~json\">https://simplifier.net/test20171092/ResearchStudy-reference/~json</a> looks good - you elaborated on suggestion by <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 153985564,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1534102817
    },
    {
        "content": "<p>The study reference is a standard extension - <a href=\"http://build.fhir.org/extension-event-researchstudy.html\" target=\"_blank\" title=\"http://build.fhir.org/extension-event-researchstudy.html\">http://build.fhir.org/extension-event-researchstudy.html</a></p>",
        "id": 153985565,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1534103004
    },
    {
        "content": "<p>The trial has 3 Investigational Substances - you modeled 2  .. <a href=\"https://simplifier.net/test20171092/ActivityDefinition-example1/~json\" target=\"_blank\" title=\"https://simplifier.net/test20171092/ActivityDefinition-example1/~json\">https://simplifier.net/test20171092/ActivityDefinition-example1/~json</a></p>",
        "id": 153985566,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1534103031
    },
    {
        "content": "<p>looks good . Is it possible to put the dates relative and not absolute?</p>",
        "id": 153985567,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1534103063
    },
    {
        "content": "<p>I mean relative to the beginning of treatment? .. ok but still that's an approach</p>",
        "id": 153985568,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1534103118
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> you are right - would be great if you make that official soon. What <span class=\"user-mention\" data-user-id=\"195369\">@Markus Döring</span>  did is limited to encounter</p>",
        "id": 153985569,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1534103379
    },
    {
        "content": "<p>Cool so you partially covered a few basic concepts</p>",
        "id": 153985570,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1534104159
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194020\">@Gustav Vella</span> - it is an \"official\" extension.  It will be published as part of R4 at the end of the year.</p>",
        "id": 153985571,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1534104251
    },
    {
        "content": "<p><a href=\"https://simplifier.net/test20171092/activitydefinition-example-2\" target=\"_blank\" title=\"https://simplifier.net/test20171092/activitydefinition-example-2\">https://simplifier.net/test20171092/activitydefinition-example-2</a> - so here same question. It would be interesting to define the schedule relative to start of treatment</p>",
        "id": 153985572,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1534104315
    },
    {
        "content": "<p>But that would be on a higher level up in the hierarchy. It kicks off the schedule for all 3 Substances</p>",
        "id": 153985573,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1534104416
    },
    {
        "content": "<p>maybe <a href=\"http://build.fhir.org/codesystem-research-subject-status.html#research-subject-status-on-study-intervention\" target=\"_blank\" title=\"http://build.fhir.org/codesystem-research-subject-status.html#research-subject-status-on-study-intervention\">http://build.fhir.org/codesystem-research-subject-status.html#research-subject-status-on-study-intervention</a></p>",
        "id": 153985574,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1534104424
    },
    {
        "content": "<p>cf. On-study-intervention:  The person is receiving the treatment or participating in an activity (e.g. yoga, diet, etc.) that the study is evaluating.</p>",
        "id": 153985575,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1534104474
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194020\">@Gustav Vella</span> Mentioning the kickoff for the schedule, do you mean one kickoff for the whole study or a separate one for every participant?</p>",
        "id": 153985576,
        "sender_full_name": "Markus Döring",
        "timestamp": 1534104718
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195369\">@Markus Döring</span> no start of treatment date means the date the research subject starts treatment in the trial. it's  relative to the enrollment of that patient</p>",
        "id": 153985577,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1534104766
    },
    {
        "content": "<p>Patients are not recruited at once but in a recruitment window - say 6 or 12 months depending on how difficult it would be to get all the subjects you need.  Regarding the Visit Schedule, what's really tricky is that there could be a tolerable delay, where you'd reset the schedule for the following visits relative to that delay. Say the subject has an infection or any other adverse event, you'd have to wait till the study subjects are in a state to continue treatment with the investigational drug (it all depends on what is stipulated by the protocol)</p>",
        "id": 153985578,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1534104910
    },
    {
        "content": "<p>but the delay has a tolerable range \"Allowable Window\"  - if the patient delays too long - depending on the trial they'd fall out for the major statistical analysis and would remain in the trial with the \"Intent to Treat\". The Allowable windows of delay in the schedule may be different for each investigational drug in the same trial.</p>",
        "id": 153985579,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1534105029
    },
    {
        "content": "<p>Falling out of the allowable window of delay for a substance may have consequences for the further treatment. Eg. in CLL protocols - which you are using as examples here - it would no longer makes sense to have the patient endure a painful bone marrow biopsy at final assessment (last visit of the treatment phase) once the patient is no longer fully compliant with the regimen/study protocol</p>",
        "id": 153985580,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1534105244
    },
    {
        "content": "<p>We model and calculate the allowable windows for all visits within the application for each trial. It would make sense for the sponsor to publish that data in FHIR for an EDC system to import to at least reduce that part of the burden. With regards to the rules for calculating a new schedule and deactivating certain procedures: that is presently all proprietary. There again a standardized machine readable version would be of great benefit - especially if both your EDC as well as your EMR are aware of the FHIR API.</p>",
        "id": 153985581,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1534105663
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191450\">@Simone Heckmann</span> you hinted using the timing element. If we were to use that (i.e BackboneElement) to model a schedule, it would also handle offsets <a href=\"http://build.fhir.org/datatypes.html#Timing\" target=\"_blank\" title=\"http://build.fhir.org/datatypes.html#Timing\">http://build.fhir.org/datatypes.html#Timing</a><br>\nI can declare an offset in ActivityDefinition <a href=\"https://www.hl7.org/fhir/activitydefinition-definitions.html#ActivityDefinition.timing_x_\" target=\"_blank\" title=\"https://www.hl7.org/fhir/activitydefinition-definitions.html#ActivityDefinition.timing_x_\">https://www.hl7.org/fhir/activitydefinition-definitions.html#ActivityDefinition.timing_x_</a></p>\n<p>The MedicationRequest .definition field allows a reference to ActivityDefinition - thus linking from specific to abstract. Absolute offset (real date) would be stored in MedicationStatement. The application would check MedicationStatement.effective against ActivityDefinition.timing - the result would have to be &lt; than Timing.offset for continuation on the schedule per protocol. </p>\n<p>The Schedule is a property of the trial. On enrollment, the schedule becomes a property of the research subject. I really am at a loss how to stuff that information in ResearchSubject.</p>\n<p>A possible approach: The Schedule  is in ActivityDefinition. Pat. enrolls  and the application would create mulltiple MedicationReqests and Encounters. You put the absolute dates in there. Every time you have an offset you recalculate the dates. Would that be an approach?</p>",
        "id": 153986382,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1534263541
    },
    {
        "content": "<p>The study points to a protocol (PlanDefinition).  The specific schedule for a ResearchSubject would be a CarePlan.  If we wanted to support ResearchSubject having a pointer to the CarePlan describing the patient's schedule (whether as core or as extension), that would be reasonable.</p>",
        "id": 153986395,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1534264526
    },
    {
        "content": "<p>Encounters are events - they won't exist until the patient shows up.</p>",
        "id": 153986396,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1534264553
    },
    {
        "content": "<p>Yeah CarePlan - I keep forgetting that. Thanks!</p>",
        "id": 153986405,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1534265009
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> Thank you for pointing out the CarePlan - I forgot about that one.</p>\n<p>The reference between ResearchSubject and CarePlan sounds like a good idea to me.<br>\nHowever it would already be possible to chain the resources together by using the reverse chaining concept wouldn't it?<br>\nMeaning: The Patient is referenced in the ResearchSubject and vice reverse chaining it would be possible to get the CarePlan.</p>\n<p>So the concrete reference would be mostly saving time and server resources - or do I miss something?</p>",
        "id": 153986407,
        "sender_full_name": "Markus Döring",
        "timestamp": 1534265170
    },
    {
        "content": "<p>It would be easier to model and more intuitive</p>",
        "id": 153986410,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1534265279
    },
    {
        "content": "<p>You could have a CarePlan that points to the Patient that is the ResearchSubject and also have the CarePlan point to the ResearchStudy saying \"this plan is relevant to the study\".  But nothing prevents there from being 10+ such CarePlans.  If you want to say \"<em>This</em> is the authoritative CarePlan for this ResearchSubject\", an explicit link would be needed.</p>",
        "id": 153986412,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1534266124
    },
    {
        "content": "<p>So you are arguing that an extension does make sense here... right?</p>",
        "id": 153986413,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1534266669
    },
    {
        "content": "<p>Either extension or core element - you'll have to decide how common it is for systems that track a particular patient's involvement in a study to have a fully-defined schedule for each patient.</p>",
        "id": 153986482,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1534277041
    },
    {
        "content": "<p>A couple questions have emerged....<br>\n1. How does Appointment factor into this? Are you envisioning that we go from PlanDefinition/ActivityDefinition (to get the number of visits and their frequency for the trial requirements) to CarePlan to AppointmentRequest (requested visit for subject) to Appointment (scheduled visit for subject) to Encounter (if/when visit actually happens)?  <br>\n2. We are struggling with fitting the trial setup and visit schedule into PlanDefinition and ActivityDefinition.  It may be a definition issue.  Suggestions?</p>",
        "id": 153989781,
        "sender_full_name": "Christine D",
        "timestamp": 1534854153
    },
    {
        "content": "<p>On the second item (since it seems like it would impact the first), can you elaborate on the issue?</p>",
        "id": 153989802,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1534860082
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196587\">@Lorraine Spencer</span> what are your thoughts on this?</p>",
        "id": 153990128,
        "sender_full_name": "Christine D",
        "timestamp": 1534942646
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span>    From Lorraine:  If we want a protocol level plan that accounts for visits AND activities required within the visits, I still do not see a resource for Visit under which to nest Activities and scheduling (for example acquisition of vitals must precede venipuncture).</p>",
        "id": 153990403,
        "sender_full_name": "Christine D",
        "timestamp": 1535033701
    },
    {
        "content": "<p>Can it be modeled with a nested action? So something like:</p>",
        "id": 153990417,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1535034735
    },
    {
        "content": "<div class=\"codehilite\"><pre><span></span>&lt;PlanDefinition&gt;\n  &lt;action id=&quot;visit-1-group&quot;&gt;\n    &lt;title value=&quot;Visit 1 Group&quot;/&gt;\n    &lt;action id=&quot;visit-1&quot;&gt;\n      &lt;title value=&quot;Visit 1&quot;/&gt;\n      &lt;definition value=&quot;ActivityDefinition/visit-definition&quot;/&gt;\n    &lt;/action&gt;\n    &lt;action value=&quot;visit-1-activities&quot;&gt;\n      &lt;title value=&quot;Visit 1 Activities&quot;/&gt;\n      &lt;relatedAction&gt;\n        &lt;actionId value=&quot;visit-1&quot;/&gt;\n        &lt;relationship value=&quot;concurrent&quot;/&gt;\n      &lt;/relatedAction&gt;\n      &lt;action value=&quot;record-vitals&quot;&gt;\n        &lt;title value=&quot;Record Vitals&quot;/&gt;\n        &lt;definition value=&quot;ActivityDefinition/record-vitals-definition&quot;/&gt;\n      &lt;/action&gt;\n      &lt;action value=&quot;venipuncture&quot;&gt;\n        &lt;title value=&quot;Venipuncture&quot;/&gt;\n        &lt;relatedAction&gt;\n          &lt;actionId value=&quot;record-vitals&quot;/&gt;\n          &lt;relationship value=&quot;after&quot;/&gt;\n        &lt;/relatedAction&gt;\n        &lt;definition value=&quot;ActivityDefinition/venipuncture&quot;/&gt;\n      &lt;/action&gt;\n    &lt;/action&gt;\n  &lt;/action&gt;\n&lt;/PlanDefinition&gt;\n</pre></div>",
        "id": 153990418,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1535034737
    },
    {
        "content": "<p>That would then be realized as a RequestGroup with the same pattern and relationships.</p>",
        "id": 153990419,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1535034773
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196442\">@Christine D</span> There's no such thing as AppointmentRequest.  You'd have a CarePlan that indicated when you expected visits to occur.  The actual booking (and confirming participants) would happen through Appointment/AppointmentResponse.  When the actual visit occurred, you'd have the Encounter.</p>",
        "id": 153990438,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1535038207
    },
    {
        "content": "<p>Apologies as I meant Appointment Request (with a space, the process).  Thanks for clarifying the flow from CarePlan to Appointment to Encounter.</p>",
        "id": 153990452,
        "sender_full_name": "Christine D",
        "timestamp": 1535039927
    },
    {
        "content": "<p>Note that there doesn't have to be a CarePlan (and doesn't even have to be an Appointment).  But if you're trying to derive things strictly from a protocol and include all the steps, that would be the flow.</p>",
        "id": 153990460,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1535041787
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span>  Why a RelatedAction and not a nested Action?  To me RelatedAction with a relationship value of \"Concurrent\" implies it happens to be going on at the same time, not that it is part of the composition of the \"parent\" action.</p>",
        "id": 153991217,
        "sender_full_name": "Hugh Glover",
        "timestamp": 1535458385
    },
    {
        "content": "<p>So that's a good point, but we have so far tried to avoid mixing groups and actions. The description of the action element is \"an action or group of actions\", and for simplicity we've tried to stick to that separation (we've even talked about an invariant that would enforce it). It's a discussion worth having though, it might make sense to support nested actions but we would need to document the expected semantics.</p>",
        "id": 153991677,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1535571093
    }
]