[
    {
        "content": "<p>Given the following 2 feasibility scenarios, where sites are executing queries for a CRO, Sponsor or ResearchNetwork:</p>\n<p>Scenario 1 </p>\n<ul>\n<li>All data for that query is available in the local FHIR CDR </li>\n<li>No quality control required. I.E. there is no need to look into the individual patient records</li>\n<li>Result: Aggregate Info (patient count and counts on specific criteria) are sent out to the requester. </li>\n</ul>\n<p>Scenario 2</p>\n<ul>\n<li>Not all data is available in a structured way in my CDR </li>\n<li>The query can only help reduce the search space</li>\n<li>I have to view individual records, view medical notes and decide on a patient to patient basis whether the patient fulfilled the criteria or not.<br>\nResult: Aggregate Info (patient count and counts on specific criteria) are sent out to the requester after completing a screening process.  </li>\n</ul>\n<p>Both scenarios are not immediately part of a Research Study - but are activities which may lead to a site in participating in one. Yet, for both cases the sites need to issue automated standard reports to IRB, invoices to the CRO/Sponsor/ Research Network requesting the feasibility. These activities are identical or similar to other activities for research studies already modelled around the concept of ResearchStudy and implemented on the sites involved.</p>\n<p>Also, Scenario 2 involves processes which are identical to those in pre-screening. All these processes are modelled around ResearchSubject and ResearchStudy. Hence, I’d like to deal with both activities within processes established for Research Studies.</p>\n<p>There are good reasons for terminating the feasibility “studies” once the process is completed in some cases but there are also good reasons for using the same business ID and letting the process follow through once the trial is actually initiated and once the site decides to participate (approval process on site, Recruitment, ….)</p>\n<p>In most cases it makes more sense to terminate the fesibility “studies” and loosely relate them to the proper study. </p>\n<p>I have two questions:</p>\n<ol>\n<li>What’s the general thought on how to draw the line between feasibility and proper studies in the conceptual world of FHIR - are they studies of their own or part of a study?</li>\n<li>Would the partOf reference <a href=\"https://hl7.org/fhir/2021May/researchstudy-definitions.html#ResearchStudy.partOf\">https://hl7.org/fhir/2021May/researchstudy-definitions.html#ResearchStudy.partOf</a> be the appropriate way to loosely relate both Studies? <br>\nThe short description says “Part of larger study” - which makes sense here<br>\nThe Definition says “A larger research study of which this particular study is a component or step” - that would also make sense<br>\nThe requirements description says “Allows breaking a study into components (e.g. by study site) each with their own PI, status, enrollment, etc.” - the example is not what I’m looking for and extremely rare - but it’s just an example. ‘Breaking a study into components’ fits. </li>\n</ol>\n<p>Glad to hear your thoughts.</p>",
        "id": 257429490,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1634155764
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194020\">@Gustav Vella</span> I would think if the ResearchStudy definition aligns. A feasibility study would be <strong>done prior</strong> to the main study. With that in mind, it also becomes a timing concept in respect to the broader ResearchStudy (1..*). This leaves the question if the feasibility study (being prior) is part of the larger main study using ResearchStudy.partOf (i.e., chicken before the egg). I also noticed that the \"RelatesTo\" may be another option if the practicality of existing ResearchStudy elements do not work. However, I would suspect that ResearchStudy.primaryPurposeType=\"feasibility-study\" could fulfill this condition. </p>\n<p>\"Extension: RelatesTo<br>\nMany clinical studies have a component sub-study and the partOf attribute should be used for this. There may also be documents such as a PDF of the protocol or consent forms and these should be linked using relatedAretfact. However there may be more complex relations to other studies people organizations or artefacts and the RelatesTo extension is provided to record these.\"</p>\n<p>I welcome additional feedback from others as well.</p>",
        "id": 258065957,
        "sender_full_name": "Mike Hamidi",
        "timestamp": 1634577597
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"440666\">Mike Hamidi</span> <a href=\"#narrow/stream/179290-research/topic/Relating.20feasibilities.20to.20studies/near/258065957\">said</a>:</p>\n<blockquote>\n<p>However, I would suspect that ResearchStudy.primaryPurposeType=\"feasibility-study\" could fulfill this condition. </p>\n</blockquote>\n<p>Focussing on <strong>primaryPurposeType</strong>, which presently takes the following values:  <em>treatment | prevention | diagnostic | supportive-care | screening | health-services-research | basic-science | device-feasibility</em> I think adding <em>feasibility-study</em> totally makes sense.</p>\n<p>If no one totally opposes, I'll put a jira for that change.</p>",
        "id": 258208972,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1634655277
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"440666\">Mike Hamidi</span> <a href=\"#narrow/stream/179290-research/topic/Relating.20feasibilities.20to.20studies/near/258065957\">said</a>:</p>\n<blockquote>\n<p>This leaves the question if the feasibility study (being prior) is part of the larger main study using ResearchStudy.partOf (i.e., chicken before the egg). I also noticed that the \"RelatesTo\" may be another option if the practicality of existing ResearchStudy elements do not work. <br>\n...<br>\n\"Extension: RelatesTo<br>\nMany clinical studies have a component sub-study and the partOf attribute should be used for this. There may also be documents such as a PDF of the protocol or consent forms and these should be linked using relatedAretfact. However there may be more complex relations to other studies people organizations or artefacts and the RelatesTo extension is provided to record these.\"</p>\n</blockquote>\n<p>I'd say the <strong>ResearchStudy.partOf</strong> might fit for screening (if the screening is a seperate study - as does sometimes happen) but does not fit for a feasibility - the feasibility  is work done prior to confirm that a specific study is feasible. If that Artefact is still of any value and needs to be related to the trial for posterity, adaptation purposes/ reuse or whatever, I'd go for <strong>Extension: relatesTo</strong></p>",
        "id": 258211007,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1634655937
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194020\">@Gustav Vella</span> I would try primaryPurposeType as the low-hanging fruit. If that does not work, then the relatesTo may be adaptable. In such a case, the ResearchStudy between feasibility and primary can be linked.</p>",
        "id": 258230489,
        "sender_full_name": "Mike Hamidi",
        "timestamp": 1634662230
    },
    {
        "content": "<p>I think it depends on the perspective of the sponsoring organization.  If they consider the feasibility-study to be a 'part' of the overall process, using part-of is legitimate.  (Particularly if any of the data gathered in the preliminary study is going to be used as part of the final analysis.)  In other cases, the two might be considered completely distinct and relatesTo is a better fit.</p>",
        "id": 258241939,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1634665839
    },
    {
        "content": "<p>A straw-poll before I submit a Jira: Any feelings about <strong>adding 'feasibility-study' to primaryPurposeType in ResearchStudy</strong>?</p>\n<p>It presently takes the following values: treatment | prevention | diagnostic | supportive-care | screening | health-services-research | basic-science | device-feasibility </p>\n<p>would be good to have some feedback here before.</p>\n<p><span class=\"user-mention silent\" data-user-id=\"194020\">Gustav Vella</span> <a href=\"#narrow/stream/179290-research/topic/Relating.20feasibilities.20to.20studies/near/258208972\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"440666\">Mike Hamidi</span> <a href=\"#narrow/stream/179290-research/topic/Relating.20feasibilities.20to.20studies/near/258065957\">said</a>:</p>\n<blockquote>\n<p>However, I would suspect that ResearchStudy.primaryPurposeType=\"feasibility-study\" could fulfill this condition. </p>\n</blockquote>\n<p>Focussing on <strong>primaryPurposeType</strong>, which presently takes the following values:  <em>treatment | prevention | diagnostic | supportive-care | screening | health-services-research | basic-science | device-feasibility</em> I think adding <em>feasibility-study</em> totally makes sense.</p>\n<p>If no one totally opposes, I'll put a jira for that change.</p>\n</blockquote>",
        "id": 271198853,
        "sender_full_name": "Gustav Vella",
        "timestamp": 1644358319
    },
    {
        "content": "<p>Do you have a proposed definition for it?</p>",
        "id": 271205589,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644361810
    },
    {
        "content": "<p>(that clearly differentiates it from the others)</p>",
        "id": 271205599,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644361819
    },
    {
        "content": "<p>A couple starting points are <strong>1)</strong> \"Feasibility studies are relied on to produce a set of findings that help determine whether an intervention should be recommended for efficacy testing.\" (<a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC2859314/\">Am J Prev Med. Source</a>), and <strong>2)</strong> \"to capture preliminary safety and effectiveness<br>\ninformation on a near-final or final device design; to adequately plan an appropriate pivotal study. (<a href=\"https://www.fda.gov/media/90419/download\">FDA IDE Source </a>)<br>\nThe definition could be modified to apply to the case here.</p>",
        "id": 271339946,
        "sender_full_name": "Mike Hamidi",
        "timestamp": 1644437230
    },
    {
        "content": "<p>One of the challenges is that 'device-feasibility' is already a code.  So if we want to introduce a more generic code, we'd have to ensure there was a specialization relationship between them.</p>",
        "id": 271342404,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644438461
    },
    {
        "content": "<p>Good point. <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 271346656,
        "sender_full_name": "Mike Hamidi",
        "timestamp": 1644440449
    }
]