[
    {
        "content": "<p>We need TTP operations like add-pseudonym, re-identify, etc. Is there work done on this already? Thanks.</p>",
        "id": 161239433,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1553083454
    },
    {
        "content": "<p>There is no way to define a service that will de-identify without knowing what the intended use of the data is, and what level of risk is acceptable. This activity is done by a team of people working on risk management relative to these factors. This activity often needs to prototype various algorithms to determine that the resulting data-set would meet the target risk level. This activity will result in a customized algorithm for that project and that data.   I have proposed a service that could be given this algorithm definition, but the practical reality is that technology has not advanced to that point yet.  see <a href=\"https://healthcaresecprivacy.blogspot.com/2017/09/fhir-and-bulk-de-identification.html\" target=\"_blank\" title=\"https://healthcaresecprivacy.blogspot.com/2017/09/fhir-and-bulk-de-identification.html\">https://healthcaresecprivacy.blogspot.com/2017/09/fhir-and-bulk-de-identification.html</a></p>",
        "id": 161348071,
        "sender_full_name": "John Moehrke",
        "timestamp": 1553177274
    },
    {
        "content": "<p>We choose to define a $pseudo operation with parameters researchStudy and subject. The result is a parameter with the pseudoSubject. We wanted a FHIR way to access the pseudo service.</p>",
        "id": 166358372,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1558616743
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191421\">@Michael van der Zel</span> How do you deal with (technical) id's of FHIR instances? These id's are pseudonyms themselves.</p>",
        "id": 168491683,
        "sender_full_name": "Bram Wesselo",
        "timestamp": 1560937033
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195911\">@Bram Wesselo</span>  I've been thinking about what you mean with your question and am still not sure. My first response would be that I don't want to use the (technical) id's. It would be better to explicitly assign id's in a pseudonym namespace. And besides that we also use non-FHIR systems in the chain.</p>",
        "id": 168794397,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1561296742
    }
]