[
    {
        "content": "<p>Please use this chat stream to discuss the ArtifactAssessment FHIR Resource Proposal <a href=\"https://confluence.hl7.org/display/FHIR/ArtifactAssessment+Fhir+Resource+Proposal\">https://confluence.hl7.org/display/FHIR/ArtifactAssessment+Fhir+Resource+Proposal</a> in preparation for FMG meeting October 13. The latest version of the proposed ArtifactAssessment StructureDefinition is at <a href=\"https://docs.google.com/spreadsheets/d/19-s6b9W0gosa-Cr5fxJtqThrTY0HView/edit#gid=1310064706\">https://docs.google.com/spreadsheets/d/19-s6b9W0gosa-Cr5fxJtqThrTY0HView/edit#gid=1310064706</a></p>\n<p>Please comment on any changes desired to the StructureDefinition to fit your needs. One element to provide feedback for is the ArifactAssessment.contributorship element which is a backbone element with many contained elements (see <a href=\"http://build.fhir.org/citation.html\">build.fhir.org/citation.html</a> for Citation.relatedArtifact.contributorship). All of this data can be handled by a Citation Resource with use of ArifactAssessment.citeAsReference, and rater-specific attribution can be handled in the content. If so, are there minimum metadata elements to include at the Resource level (when not referencing a Citation Resource for attribution), such as ArtifactAssessment.publisher and <a href=\"http://ArifactAssessment.author\">ArifactAssessment.author</a> ?</p>\n<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"192205\">@Lisa Nelson</span> <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span></p>",
        "id": 256482596,
        "sender_full_name": "Brian Alper",
        "timestamp": 1633553526
    },
    {
        "content": "<p>I don't understand why ratedArtifact isn't Reference or perhaps a choice of Reference|uri.  That gives you a proper FHIR reference, a display, a resource type built in.<br>\nI don't understand having 'note' on annotation.  This is one set of comments by one person at one time.  Having a whole set of annotations seems weird to me (and questionable as to whether it falls into the 80% across use-cases)<br>\nIn general, I think there's some challenges with the 80% rule here.  For example, do we really expect that 80% of the systems that use this resource will capture copyright information about a comment?  If not, then copyright should be an extension, not a core element.</p>",
        "id": 256490686,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1633557213
    },
    {
        "content": "<p>If we want to use a canonical url AND a display for the ratedArtifact, can we use the Reference data type and provide the canonical url in the reference element?  If not, that is why we created the more complex data patterns? I believe  <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> was going to suggest a canonicalReference datatype which could then be a little simpler.</p>\n<p>We could simplify to note 0..* string or note 0..* markdown.   We have used note 0..* Annotation in many other resources, but in this resource there are already other structures for the author of the note as a separate component.  If there is a use case that needs to add timestamps to notes that could be handled by extension.</p>\n<p>The 80% rule may be different if considering 80% of systems using the resource for \"evidence/community knowledge\" as the ratedArtifact vs. 80% of systems using the resource for \"patient data/medical records\" as the ratedArtifact. Copyright is much more frequent concern in the former vs. confidentiality in the latter.  Is there a \"related concept\" that would have use with a markdown datatype for the medical records context, e.g. naming the element rightsManagement or usageRights rather than copyright?  Or is this better as an extension?  Having the freeToShare boolean element may be a lot easier for common usage so an extension for copyright seems fine.</p>",
        "id": 256506810,
        "sender_full_name": "Brian Alper",
        "timestamp": 1633567571
    },
    {
        "content": "<p>If you want a display with a canonical URL, there's a standard extension for that.  You're not allowed to use Reference and canonical together.  Bryn can propose canonicalReference, but I think we're too far down the road for that.</p>\n<p>The 80% would typically be across the full set of systems using the resource.  Items that are critical to indicate utility of a resource to a narrow community might still be considered, but we generally want to ensure that the base resource doesn't contain a bunch of esoteric stuff that isn't at least going to make sense and be logical for the common uses.</p>",
        "id": 256513585,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1633573082
    },
    {
        "content": "<p>In the spreadsheet for the proposed StructuredDefinition <a href=\"https://docs.google.com/spreadsheets/d/19-s6b9W0gosa-Cr5fxJtqThrTY0HView/edit#gid=1710816721\">https://docs.google.com/spreadsheets/d/19-s6b9W0gosa-Cr5fxJtqThrTY0HView/edit#gid=1710816721</a> we added an ArtifactAssessment sheet and in that the first change we made was to delete the contributorship element -- we will handle this with citeAsReference or extensions if needed</p>",
        "id": 256576607,
        "sender_full_name": "Brian Alper",
        "timestamp": 1633613159
    },
    {
        "content": "<p>We replaced 6 elements with: ArtifactAssessment.ratedArtifact[x]    0..1    Reference(Any)|uri</p>",
        "id": 256577298,
        "sender_full_name": "Brian Alper",
        "timestamp": 1633613414
    },
    {
        "content": "<p>You might consider renaming \"ratedArtifact\" with just \"artifact\", given that comments aren't necessarily \"ratings\".</p>",
        "id": 256577735,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1633613572
    },
    {
        "content": "<p>We changed note datatype from Annotation to markdown</p>",
        "id": 256578103,
        "sender_full_name": "Brian Alper",
        "timestamp": 1633613722
    },
    {
        "content": "<p>Good idea. We changed it and the cardinality to be required to:<br>\nArtifactAssessment.artifact[x]  1..1    Reference(Any)|uri  The artifact assessed, commented upon or rated. Use uri for the canonical reference</p>",
        "id": 256578448,
        "sender_full_name": "Brian Alper",
        "timestamp": 1633613867
    },
    {
        "content": "<p>Should \"copyright\" be renamed to \"rightsManagement\" for better interoperability outside of the US? (Discussed on 10/7 SDWG call.) <span class=\"user-mention\" data-user-id=\"192205\">@Lisa Nelson</span></p>",
        "id": 256601080,
        "sender_full_name": "Matt Szczepankiewicz",
        "timestamp": 1633621799
    },
    {
        "content": "<p>ArtifactAssessment.copyright was changed to ArtifactAssessment.rightsManagement following discussion with SD WG.</p>",
        "id": 256601626,
        "sender_full_name": "Brian Alper",
        "timestamp": 1633621991
    },
    {
        "content": "<p>copyright is the generic term we use in other resources, so if the meaning is the same, consistent naming would be preferred.</p>",
        "id": 256607764,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1633624185
    },
    {
        "content": "<p>change the element name back to ArtifactAssessment.copyright in the spreadsheet for proposed StructureDefinition which now addresses all the items noted in this chat stream</p>",
        "id": 257396169,
        "sender_full_name": "Brian Alper",
        "timestamp": 1634142793
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  Do you think Scope of Coverage should be changed to:<br>\nThe ArtifactAssessment Resource provides a structure to communicate any content about a knowledge artifact, including comments, corrections, classifications, and ratings. The ArtifactAssessment Resource is used when the content attribution and management rights differs from the Resource being commented upon. The scope is intended to cover assessments (added information) regarding clinical records about individual human subjects,  assessments (added information) regarding healthcare provision for individual persons (such as care plans), and assessments (added information) regarding knowledge artifacts related to community knowledge such as scientific evidence and group-oriented guidance.</p>",
        "id": 257437200,
        "sender_full_name": "Brian Alper",
        "timestamp": 1634158904
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  Do you think Resource appropriateness should be changed to:<br>\nAcross healthcare communities, there are an extensive number of comments and corrections regarding resources where the commenter is not able or permitted to modify the resource content, and there are many situations in which assessments with classifications and ratings of medical record content are made by parties who would not include the assessments in the medical record. Across the academic, scientific, quality measurement development, and clinical decision support communities there is an extensive need to report assessments and feedback about knowledge artifacts. These artifact assessments may take multiple forms (including text, classifications, ratings or measurements) and may or may not be created, queried and maintained independently from the artifact being rated or commented upon.</p>",
        "id": 257437940,
        "sender_full_name": "Brian Alper",
        "timestamp": 1634159201
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> Does it make sense to add to Resource Boundaries:<br>\nObservation Resource is used extensively for observations about people, groups, devices, locations, substances, and procedures -- all of which are physical entities and the subject element may Reference a Resource to represent the physical entity. ArtifiactAssessment may be used for observations where the subject is a knowledge artifact and the artifact element may Reference a Resource that is the knowledge artifact.</p>",
        "id": 257438890,
        "sender_full_name": "Brian Alper",
        "timestamp": 1634159597
    },
    {
        "content": "<p>regarding scope, <span class=\"user-mention\" data-user-id=\"192085\">@Brian Alper</span> I winder, what 's a \"knowledge artifact\" - as FHIR project lead, I would say it's one of these:</p>",
        "id": 257683047,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634297528
    },
    {
        "content": "<p><a href=\"/user_uploads/10155/87UhdvH-9GCIER8m8Z-3SxZ9/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/87UhdvH-9GCIER8m8Z-3SxZ9/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/87UhdvH-9GCIER8m8Z-3SxZ9/image.png\"></a></div>",
        "id": 257683084,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634297553
    },
    {
        "content": "<p>perhaps that needs some clarification? what makes something an artifact you can assess?</p>",
        "id": 257683121,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634297574
    },
    {
        "content": "<p>appropriateness:</p>\n<blockquote>\n<p>not able or permitted to modify the resource content</p>\n</blockquote>\n<p>Well, it's not always that they're not able or permitted, it's that they don't want to change it, merely to propose / discuss issues that may lead to changes or actions elsewhere</p>",
        "id": 257683277,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634297649
    },
    {
        "content": "<p>definitely need to add that the boundaries, but I think it needs additional work</p>",
        "id": 257683322,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634297682
    },
    {
        "content": "<p>there's the definitional question of what's a knowledge artifact.</p>",
        "id": 257683369,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634297706
    },
    {
        "content": "<p>but also: observations are precise facts made on real world entities... at least I think they're real world entities (?). Does this mean you'd use ArtifactAssessment for anything unreal?</p>",
        "id": 257683547,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634297778
    },
    {
        "content": "<p>I think that needs additional work.</p>",
        "id": 257683552,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634297786
    },
    {
        "content": "<p>And it would be good to add openEHR CKM to the list of inputs, along with <span class=\"user-mention\" data-user-id=\"191417\">@Theo Stolker</span>'s care plan review system which is real world prior art in that space</p>",
        "id": 257683645,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634297829
    },
    {
        "content": "<p>@Grahame Grieve To describe 'knowledge artifact' which is like Resource and to address the use case when one has management rights -- Do you think Scope of Coverage should be changed to:<br>\nThe ArtifactAssessment Resource provides a structure to communicate judgments or qualitative data about a knowledge artifact (a set of data with a known identity or URL by which it can be accessed), including comments, corrections, classifications, and ratings. The ArtifactAssessment Resource is used when the content attribution and management rights differs from the Resource being commented upon, or the commenter desires to separate the comments from the target Resource. The scope is intended to cover assessments (added information) regarding clinical records about individual human subjects, assessments (added information) regarding healthcare provision for individual persons (such as care plans), and assessments (added information) regarding knowledge artifacts related to community knowledge such as scientific evidence and group-oriented guidance.</p>",
        "id": 257684380,
        "sender_full_name": "Brian Alper",
        "timestamp": 1634298252
    },
    {
        "content": "<p>Is this sentence real?  That is why I tried to distinguish physical entities from digital entities or information-only entities or knowledge artifacts.</p>",
        "id": 257684612,
        "sender_full_name": "Brian Alper",
        "timestamp": 1634298401
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> Do you suggest to add openEHR CKM as a use case?  I don't see where it has a resource or component like ArtifactAssessment as a Content Source for the StructureDefinition.<br>\nAlso, do you have a link to find more about <span class=\"user-mention\" data-user-id=\"191417\">@Theo Stolker</span> 's care plan review system?</p>",
        "id": 257685110,
        "sender_full_name": "Brian Alper",
        "timestamp": 1634298701
    },
    {
        "content": "<p>Patient Empowerment wants to use this to comment on <em>everything</em>.  I.e. they could comment on a Condition or Allergy or Procedure or any other resource.  So I don't think \"Knowledge Artifact\" is relevant.  This could also be used to allow clinicians to comment on clinical resource instances created by others (when and as organizational culture allows) when they can't update the instances directly.</p>",
        "id": 257707648,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1634308493
    },
    {
        "content": "<p>You could use the word \"Resource\" when referring to a \"Knowledge Artifact\" that is represented in a FHIR Resource, but does the word \"Resource\" imply \"FHIR Resource\" or is it also used to refer to external 'resources' that are not in FHIR formats?  IF it can apply to non-FHIR resources, then we can just call it Resource and drop the knowledge artifact phrase.</p>",
        "id": 257727048,
        "sender_full_name": "Brian Alper",
        "timestamp": 1634315769
    },
    {
        "content": "<p>You can use 'Record' - it's pretty generic</p>",
        "id": 257728856,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1634316540
    },
    {
        "content": "<p>How about:<br>\nThe ArtifactAssessment Resource provides a structure to communicate judgments or qualitative data about a record (a set of data with a known identity or URL by which it can be accessed), including comments, corrections, classifications, and ratings. The ArtifactAssessment Resource is used when the content attribution and management rights differs from the record being commented upon, or the commenter desires to separate the comments from the target record. The scope is intended to cover assessments (added information) regarding clinical records about individual human subjects, assessments (added information) regarding healthcare provision for individual persons (such as care plans), and assessments (added information) regarding records related to community knowledge such as scientific evidence and group-oriented guidance.</p>",
        "id": 257732934,
        "sender_full_name": "Brian Alper",
        "timestamp": 1634318163
    },
    {
        "content": "<p>I would change \"a set of data\" to \"a resource or other set of data...\"</p>",
        "id": 257740100,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1634321163
    },
    {
        "content": "<p>I feel that this is muddied the water with observation</p>",
        "id": 257747773,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634324430
    },
    {
        "content": "<p>but it's a bit better</p>",
        "id": 257747794,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634324436
    },
    {
        "content": "<p>openEHR CKM - the review process itself is a functional use of artifactAssessment</p>",
        "id": 257747843,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634324455
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> I have updated the Resource Proposal <a href=\"https://confluence.hl7.org/display/FHIR/ArtifactAssessment+Fhir+Resource+Proposal\">https://confluence.hl7.org/display/FHIR/ArtifactAssessment+Fhir+Resource+Proposal</a> with all of the concepts noted above except for the Observation Resource mention.  Does this version look ready for Wednesday's FMG meeting?</p>",
        "id": 257934576,
        "sender_full_name": "Brian Alper",
        "timestamp": 1634491569
    },
    {
        "content": "<p>this is better, yes. Now, <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> we said we would draw wider attention to it...</p>",
        "id": 257945588,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634501998
    },
    {
        "content": "<p>the committers channel?</p>",
        "id": 257945630,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634502006
    },
    {
        "content": "<p>I'm looking at the draft resource and still have a bunch of questions:</p>\n<ul>\n<li>what's the usecase for \"approvalDate\" and \"lastReviewDate\" - who would be reviewing comments and why?  And why is this core on a comment against a resource when it's typically not core for the resources being commented on?</li>\n<li>Definition for freeToShare is confusing to me.  This isn't a concept we have anywhere else in FHIR.  Is it core?  Definitely needs a clearer definition</li>\n<li>Contributorship says \"see Citation\", but there is no Citation backbone element</li>\n<li>I thought we said that ratedArtifact would just be a choice of reference|canonical|uri?</li>\n<li>I thought we were dropping 'annotation' for note and just making it a simple markdown element?</li>\n<li>what's the difference between note and description?</li>\n<li>Why is rating 0..*</li>\n<li>It seems that we have a recursive structure, except we're duplicating stuff on the root.  Why not have the base structure on the root as 0..1 with component that recurses to that base structure</li>\n<li>Given that rating is optional, 'rater' should be 'commenter'</li>\n<li>The two value sets for certainty and type don't seem to be defined</li>\n<li>If you're going to track a 'disposition', just a code isn't enough.  You need a reason for rejections or details for persuasive if mod</li>\n<li>\"application\" seems like extension space.</li>\n</ul>",
        "id": 257958028,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1634513919
    },
    {
        "content": "<p>First look at the ArtifactAssessment Resource tab at <a href=\"https://docs.google.com/spreadsheets/d/19-s6b9W0gosa-Cr5fxJtqThrTY0HView/edit#gid=1710816721\">https://docs.google.com/spreadsheets/d/19-s6b9W0gosa-Cr5fxJtqThrTY0HView/edit#gid=1710816721</a> instead of the original ArtifactComment Resource tab when we started this chat stream. </p>\n<p>ArtifactAssessments are used for many things other than comments, and when a group is using it to report their collective ratings (such as a guideline development panel) there can easily be uses of approvalDate and lastReviewDate for the collective group effort.  Remember this resource was started to meet complex needs in the EBM domain.</p>\n<p>freeToShare is a simple boolean that could be considered a yes/no indicator whether this comment/classification/rating is open to the public or not. Again really important (core) for original intent of this resource.  I changed the short and long definitions to \"Acceptable to publicly share the resource content\" and \"Acceptable to publicly share the comment, classifier or rating\"</p>\n<p>contributorship is removed</p>\n<p>ratedArtifact is now artifact[x] with datatype choices of Reference(Any)|uri</p>\n<p>note is now simply markdown</p>\n<p>description is the primary human-readable summary -- note is used for any additional human-readable comments</p>\n<p>There are many situations where there can be 2 or more ratings for the same \"type\" -- when used for ratings (e.g. rating \"risk of bias\") you could have ratings of both \"high risk\" and \"favors the intervention\" for the same \"type\" being \"risk of bias\"; when using the elements for classifiers, you could have one type (\"keyword\") and multiple ratings (multiple keywords as codeable concepts).</p>\n<p>There are many elements at the root that are not currently expected in the recursive components.  Would it be preferable to add 6 more elements to the root (to be recursive using the base resource) or keep the current proposed structure (in which 11 additional elements are not repeated in the recursive structure)?   I created ArtifactAssessment 2 as another tab to show it all recursive from the root.  This is simpler for the Resource StructureDefinition and I changed a relatedComment element to become a relatedArtifact element.  This could be easier overall if implementers don't find it confusing to ignore many elements on recursive use.</p>\n<p>rating is optional, classifying is optional, commenting is optional -- we could change \"rater\" to \"assessor\" or leave as rater -- major concern with using the term \"commenter\" is confusion when used for ratings/assessments and thinking it is someone commenting on the rating/assessment rather than the rater/assessor -- other terms could be \"author\" or \"creator\"</p>\n<p>EvidenceCertaintyType is defined at <a href=\"http://build.fhir.org/valueset-certainty-type.html\">http://build.fhir.org/valueset-certainty-type.html</a><br>\nEvidenceCertaintyRating is defined at <a href=\"http://build.fhir.org/valueset-certainty-rating.html\">http://build.fhir.org/valueset-certainty-rating.html</a><br>\nThe value sets do not have \"Evidence\" in the URL but have \"Evidence\" in the Name and Title as these value sets were created for the Evidence Resource.   For this broader use case they are provided as Example bindings.  There is no expectation for a Preferred, Extensible or Required binding for these elements that can be used for so many different use cases.</p>\n<p>if you are going to track a 'disposition' and use an ArtifactAssessment Resource to do it, you would then use the \"comment/classifier/rating\" elements to elements to express a reason for rejections or details for persuasive if mod -- these rules can be described in Profiles and Implementation Guides.</p>\n<p>If application were an \"extension\" then perhaps \"disposition\" should be an \"extension\" also, but several others may want the application in the core. Overall this is more of a base resource and it would be easier to implement tighter profiles for ArtifactComment, ArtifactClassifier, ArtifactRating, ArtifactRequest, and ArtifactResponse rather than creating extensions for each of these common base profiles or creating 5 base resources with a lot of overlapping elements.  Perhaps ArtifactAssessment Resource is like a resource pattern (like MetadataResource Resource) and you then have 6 base resources using the pattern -- the 5 named already and ArtifactCommentRating which supports multiple types in the same resource.</p>",
        "id": 257962109,
        "sender_full_name": "Brian Alper",
        "timestamp": 1634518167
    },
    {
        "content": "<p>Is there a reason for keeping the original version of the resource?  At least make the 'official' version of the resource the first tab.</p>\n<p>My question is why are approvalDate and lastReviewDate core.  Also, who is approving or reviewing?</p>\n<p>freeToShare sounds like it's already covered by <a href=\"http://Resource.meta.security\">Resource.meta.security</a> which is where we flag resources that are open to the public or have patient, provider or other types of sensitvities.</p>\n<p>ratedArtifact should just be called 'artifact' or maybe 'focusArtifact' because rating often won't even come into play.</p>\n<p>If description is a summary, then call it summary</p>\n<p>note should be 0..1 not 0..*.  It's markdown.  You can have as many paragraphs as you like - no need for multiple repetitions.</p>\n<p>Add a rationale that explains and provide examples for multiple ratings</p>\n<p>My comment on recursion is \"can't the original commenter rate the artifact?  If so why not rename 'component' to 'comment' and drop note &amp; description  and make 'comment' 0..1.  Then at the root you've got a single comment with multiple ratings and an author, plus the ability to recurse for comments about the comment</p>\n<p>How about rename 'rater' to 'author'?</p>\n<p>There's no ability to associate 'comments' to a disposition that I can see - and a disposition is definitely distinct from comments about a comment.</p>\n<p>I'm ok with disposition being an extension, but application is even more an extension.  I.e. some moderate percentage of systems that track comments will bother to track dispositions.  And a much smaller subset will track details of application (beyond perhaps updating 'status')</p>",
        "id": 257967011,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1634523019
    },
    {
        "content": "<p><a href=\"https://docs.google.com/spreadsheets/d/19-s6b9W0gosa-Cr5fxJtqThrTY0HView/edit#gid=873638642\">https://docs.google.com/spreadsheets/d/19-s6b9W0gosa-Cr5fxJtqThrTY0HView/edit#gid=873638642</a> will now show ArtifactAssessment 3 on the first tab.  Not deleting the others yet as this is rapidly shifting and it would be difficult to reconstruct based only on the Zulip chat to see the progression.</p>\n<p>We dropped the application elements as we realize we can use component elements of the core resource to reproduce all the concepts in the application element.  Even workflowStatus and disposition could potentially be type and classifier elements though many may prefer to have these separately available as codes instead of CodeableConcepts.</p>\n<p>We renamed the combined description and note to summary, renamed rating to classifier (easier to understand why you need 0..*), and renamed rater to author.</p>\n<p>approvalDate and lastReviewDate are inherited from MetadataResource Resource as the underlying pattern and would have considerable meaningful use in the EBM domain. Also in the quality improvement and legal domains if using the resource to report assessments by committee.</p>\n<p>using <a href=\"http://meta.security\">meta.security</a> as a Coding with no \"freeToShare\" in the large extensible value set will be cumbersome for this simple boolean and we would end up with an extension anyway.  We may find this freeToShare useful enough to add it to the MetadataResource Resource pattern and it would not help the community to make it harder to do at first then change it as we expect frequent use in short times with our expected implementations.  There have been national and international consortial efforts wanting to share classifier tags across large systems, and this ArtifactAssessment Resource is the core resource for this function.</p>",
        "id": 258021657,
        "sender_full_name": "Brian Alper",
        "timestamp": 1634560778
    },
    {
        "content": "<p>security workgroup has worked hard to make .meta.security the place for this kind of tagging. Having it in the same place in all resources is exactly why .meta.security exists. Your comment about the valueset has no relevance.  (we are in the process of cleaning it up, but the size of a valueset has no relevance on the use of a code). You can define a code and a specific meaning.<br>\nWhy would you need an extension anyway? I have not been following well enough to understand.</p>",
        "id": 258023126,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634561372
    },
    {
        "content": "<p>If we could add the codes FREETOSHARE and NOTFREETOSHARE this would essentially be 2 different meta.security.code element values that could serve as the simple boolean for use interfaces.  Do we have to define a code system for these 2 codes to use it this way?</p>",
        "id": 258025425,
        "sender_full_name": "Brian Alper",
        "timestamp": 1634562365
    },
    {
        "content": "<p>yes you can do that. These might also be good to propose as addtions to the core codesystem. Do both, and adjust if they get accepted in the core codesystem.</p>",
        "id": 258034204,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634566053
    },
    {
        "content": "<p>My leaning would be to have a <a href=\"http://meta.security\">meta.security</a> code that says \"unrestricted\".  If that's present, then you're free to share.  If not, then you're not.  (And details about what the restrictions are would be conveyed by other codes.)</p>",
        "id": 258043915,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1634569781
    },
    {
        "content": "<p>The unrestricted code exists and has a definition \"Privacy metadata indicating that no level of protection is required to safeguard personal and healthcare information that has been disclosed by an authorized individual without restrictions on its use.\" so we think may be inaccurate when referring to ArtifactAssessment content that is not personal and healthcare information.</p>",
        "id": 258050419,
        "sender_full_name": "Brian Alper",
        "timestamp": 1634572123
    },
    {
        "content": "<p>Why would that be inaccurate?  It may be that the definition should just clarify that it also covers non-personal information</p>",
        "id": 258052263,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1634572765
    },
    {
        "content": "<p>This isn't really a metadata resource.  It's a generic resource that can be used for anything.  I'm not saying you can't have approvalDate and lastReviewDate, just that they seem like they should be extensions.</p>",
        "id": 258052688,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1634572896
    },
    {
        "content": "<p>on the security front. are we taking about the overall tendency of ArtifactAssessment (the <a href=\"http://build.fhir.org/security.html#SecPrivConsiderations\">http://build.fhir.org/security.html#SecPrivConsiderations</a> ), or are we talking about tagging an instance (the use of .meta.security)? -- The case you are speaking of seems to be covered by the Confidentiality Code value \"L\" which is designed to show that there are no privacy impacting data within that instance - <a href=\"https://terminology.hl7.org/CodeSystem-v3-Confidentiality.html#v3-Confidentiality-L\">https://terminology.hl7.org/CodeSystem-v3-Confidentiality.html#v3-Confidentiality-L</a></p>",
        "id": 258075982,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634581484
    },
    {
        "content": "<p>overall, the knowledge resources would certainly seem to be <a href=\"http://build.fhir.org/security.html#Anonymous\">http://build.fhir.org/security.html#Anonymous</a> or possibly <a href=\"http://build.fhir.org/security.html#Business\">http://build.fhir.org/security.html#Business</a>; but as this resource starts to expand the scope to ALL FHIR resoruces, then it needs to be identified as tendency to ALL classifications <a href=\"http://build.fhir.org/security.html#Unknowable\">http://build.fhir.org/security.html#Unknowable</a>.</p>",
        "id": 258076248,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634581598
    },
    {
        "content": "<p>We are talking about the tagging of instances with the use of <a href=\"http://meta.security\">meta.security</a> -- each ArtifactAssessment Resource instance can have a tag to determine the openness to sharing with others.  When the instance contains personal data, then the concepts of privacy and corresponding codes make sense. When the instance contains intellectual property considered for publication, then the concepts of copyright and rights management authorization are more relevant than the concepts of personal data protection. If the codes for simple \"free to share\" concepts are not immediately clear to implementers the community will use a freeToShare extension instead of <a href=\"http://meta.security\">meta.security</a> -- there is a substantial community in the digital publishing space that will not catch on to FHIR quickly if this simple concept is made too complicated.</p>",
        "id": 258203788,
        "sender_full_name": "Brian Alper",
        "timestamp": 1634653633
    },
    {
        "content": "<p>\"The MetadataResource represents resources that carry additional publication metadata over other canonical resources, describing their review and use in more details.\" This is a key driver for the ArtifactAssessment Resource, and the very reason we are discussing freeToShare and other additional publication metadata concepts.  After viewing the introductory statement to PlanDefinition Resource Proposal we will add the following to the first line of the ArtifactAssessment Resource Proposal:</p>\n<p>The ArtifactAssessment Resource represents one or more assessments of another record or resource. The resource captures metadata about the assessment, as well as the data for the results of the assessment which may include comments, classifications, ratings, questions, and responses.</p>",
        "id": 258204486,
        "sender_full_name": "Brian Alper",
        "timestamp": 1634653866
    },
    {
        "content": "<p><a href=\"http://meta.security\">meta.security</a> is about data protection policies in general, not only about personal information.  It's just that the vast majority of codes defined are in the \"personal data\" space because that's where most of the identified need has come from.</p>",
        "id": 258252501,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1634669713
    },
    {
        "content": "<p>yes, so you are looking for licensing vocabulary.  Very mind opening concept. These vocabulary do exist, we should use them. Yes, these vocabulary can be used on .meta.security.</p>\n<ul>\n<li>Creative Commons vocabulary -- <a href=\"https://creativecommons.org/about/cclicenses/\">https://creativecommons.org/about/cclicenses/</a></li>\n<li>others?<br>\nwe should look to existing vocabulary if it fits. but certainly could go beyond.</li>\n</ul>",
        "id": 258273649,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634678278
    },
    {
        "content": "<p>This said... we have brought copyright in as a first-class element in some resources (e.g. StructureDefinition.copyright). Where these exist, they tend to just be narrative. Very interesting to use the .meta.security to hold a code when appropriate. Such as when HL7 publishes an IG it tends to be published as <a href=\"http://creativecommons.org/publicdomain/zero/1.0/\">http://creativecommons.org/publicdomain/zero/1.0/</a></p>",
        "id": 258274417,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634678483
    },
    {
        "content": "<p>code can only say what kind of license, not who the license holder is... but I do like the idea. and I do think this is consistent with .meta.security.</p>",
        "id": 258274567,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634678535
    },
    {
        "content": "<p>2021-10-21 discussion with OO changed the proposed Resource Boundaries to include:</p>\n<p>Observation Resource is used extensively for observations about people, groups, devices, locations, substances, and procedures – not about the record describing these entities. ArtifiactAssessment is used for observations where the subject is the artifact or record, not the entity described by the artifact.  Simple \"assessments\" about an Observation such as status, dataAbsentReason, interpretation and note would use the Observation Resource where this is already structured. ArtifactAssessment Resource may be used for complex assessments of an Observation such as justifications for reasons to correct the record.</p>",
        "id": 258589872,
        "sender_full_name": "Brian Alper",
        "timestamp": 1634838965
    },
    {
        "content": "<p>Will Observation be updated to make clear that they don't cover Observations about records?</p>",
        "id": 258610727,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1634847569
    },
    {
        "content": "<p>well, hard for Brian to answer that. Someone should create a task to ask OO to make that clarification</p>",
        "id": 258898503,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1635109660
    },
    {
        "content": "<p>ArtifactAssessment resource is in the build now: <a href=\"https://build.fhir.org/artifactassessment.html\">https://build.fhir.org/artifactassessment.html</a></p>",
        "id": 262516537,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1637703175
    }
]