[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192085\">@Brian Alper</span> While we working on ARHQ recommendations, this is fields for certainty/strength, such as this is \"high confidence\" vs \"low confidence\". We thought about using citedArtifact.classifier but we could not find a proper value for classifier.type. I would like to raise a ticket to add values to the value set. Another option would be we create extensions for this. What's your thought?</p>",
        "id": 270580321,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1643907168
    },
    {
        "content": "<p>The value set for Citation.citedArtifact.classifier.type could grow tremendously if every possible type is handled by adding values to the Extensible value set. If needed to do it in Citation directly, a Profile may be preferred. However we recently established ArtifactAssessment Resource to better handle classifications, especially for recommendations.  So one solution is to create your classifications as ArtifactAssessment Resources and associate those resources with the Citation Resource.   Another solution is to use the EBMRecommendation Profile of ArtifactAssessment which we are creating specifically to support this type of classification and specification of recommendations.  The EBMonFHIR (CDS sub-WG) COKA Recommendation Profile Working Group meets on Thursdays at 10 am Eastern.</p>",
        "id": 270627727,
        "sender_full_name": "Brian Alper",
        "timestamp": 1643927076
    },
    {
        "content": "<p>Thanks Brian. ArtifactAssessment is very promising. There is one problem. ArtifactAssessment.artifact is required and either Reference, canonical or uri. What we want to assess is the Citation.citedArtifact. So Reference does not work for them. Those artifact are imported so some of them do not have \"official\" canonical/url. To use this resource, our only option is to fake a url which is really nasty.</p>",
        "id": 270723338,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1643985641
    },
    {
        "content": "<p>If you are creating a Citation Resource for the recommendation, you could then use ArtifactAssessment.artifactReference.reference(Citation), or if you just want a string to describe the artifact you could use ArtifactAssessment.artifactReference.display</p>",
        "id": 270743613,
        "sender_full_name": "Brian Alper",
        "timestamp": 1643994471
    },
    {
        "content": "<p>Is ArtifactAssessment a assessment for the referenced Citation or the citedArtifact in the referencedCitation? This is not clear from the summary of this resource type.<br>\nWe decided to create an extension. The main driving force is that client wants to get both recommendation and score in one query.</p>",
        "id": 270763294,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1644003802
    },
    {
        "content": "<p>ArtifactAssessment.content.path can be used to express citedArtifact to effectively get there.   ArtifactAssessment can also be used as a contained resource so retrieved in the same query.   At some point it depends on whether you prefer extensions or paths without extensions. We are still learning and adjusting our models and expect soon to be creating a CPGonEBMonFHIR IG to support expression of guideline recommendations.   So we will be working this out a bit more formally.</p>",
        "id": 270781793,
        "sender_full_name": "Brian Alper",
        "timestamp": 1644013762
    },
    {
        "content": "<p>Check out the developments in COKA that may provide a better framework for using Citation to classify 'strength of recommendation':</p>\n<p>The Computable EBM Tools Development Working Group and Recommendation Profile Working Group re-modeled the approach to a “Recommendation” with several considerations including:<br>\n(1) The guideline development community often uses the “Evidence-to-Decision Framework” to describe the multiple factors or determinants in making a recommendation (i.e., making the decision for what to recommend), and documenting the deliberation (recording the judgments made regarding each of these factors) is the data best represented in ArtifactAssessment Resource structure.   The PlanDefinition Resource structure is established for the description of what is recommended in a form more suitable for implementation (interoperable interaction with health records data).<br>\n(2) The shared decision making community often focuses on a process to facilitate the individual’s understanding and autonomy regarding factors or determinants (like those noted above) to make a personal decision. The data structure for “sharing the evidence including evidence for all factors or determinants” can be similar to #1.<br>\n(3) Whether referring to the “Recommendation” or the “Decision”, the core concept is similar. Whether referring to it for a target population or target individual, the core concept is similar. The core concept we are trying to model is the coordination of the end-result (“Recommendation” or “Decision”), the judgments or justifications for the related factors or determinants, and the expression of variables defining the “what” and “who” the recommendation or decision is about.</p>\n<p>With all these considerations, our current thinking is:<br>\n(1) We use the Citation Resource as a structure that can map to all the other resources and concepts noted.<br>\n(2) We define an EBMDecisionMap Profile of Citation Resource to provide a simpler (constrained) model for this focus.<br>\n(3) We may define corresponding profiles, such as EBMDecisionRating Profile of ArtifactAssessment, CPGRecommendationDefinition Profile of PlanDefinition, and NetEffect Profile of Evidence.<br>\n(4) We should create an EBM Decision Map Implementation Guide (IG) as a major contribution to the EBMonFHIR project.</p>\n<p>We will change the name of the COKA Recommendation Profile Working Group to the COKA EBM Decision Map Working Group.</p>",
        "id": 271578951,
        "sender_full_name": "Brian Alper",
        "timestamp": 1644587484
    }
]