[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192085\">@Brian Alper</span> Thank you for the valuable discussion from last week's Connectathon. I<br>\nI am wondering what the Citation.classifier is. Apparently the description of this element does not match the values in the binding value set.</p>",
        "id": 223400113,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1611161130
    },
    {
        "content": "<p>The Citation.classifier element is used for any number of classification tags.   Many classification schemes can be applied using the CodeableConcept datatype.  The description \"Used for many classifiers including PublicationType, CitationSubset, MeshHeading, Chemical\" is intended to convey 4 example classification schemes, each of which could have their own code systems. The binding provided as \"Citation Classifier (Extensible)\" is a limited set suggesting a preference to use these terms specifically when classifying a citation as one of these concepts.  Perhaps we should make the binding Example instead of Extensible.</p>",
        "id": 223420900,
        "sender_full_name": "Brian Alper",
        "timestamp": 1611170079
    },
    {
        "content": "<p>Yes. example binding is more suitable here. Do you need a tracker item?</p>",
        "id": 223421454,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1611170329
    },
    {
        "content": "<p>EvidenceReport Resource is still Maturity Level 0 so you can suggest the change through the EBMonFHIR/COKA meetings (or we can just use this chat to suggest it).  We are documenting the changes in the COKA daily updates (email me at <a href=\"mailto:balper@computablepublishing.com\">balper@computablepublishing.com</a> if you want to be added to that distribution list) so we don't need to do the tracker items.  That may change as the project and maturity levels get adjusted but for now that can work.</p>",
        "id": 223459192,
        "sender_full_name": "Brian Alper",
        "timestamp": 1611191835
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192085\">@Brian Alper</span> Is there any quarter at WGM scheduled for EMBonFHIR discussion?</p>",
        "id": 223660950,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1611331495
    },
    {
        "content": "<p>EBMonFHIR will be covered Wednesday 1/27 Q2 in the BRR Work Group, then Thursday Q2 in the CDS (and CQI) Work Group -- these are both 2 pm Eastern time (11 am Pacific time)</p>",
        "id": 223661691,
        "sender_full_name": "Brian Alper",
        "timestamp": 1611331775
    }
]