[
    {
        "content": "<p>The description says \"The publisher of the Citation, not the publisher of the article being cited\". Which elements should I use for the publisher, dates (review date, publish date, etc) of the cited artifact?</p>",
        "id": 226886721,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1613685047
    },
    {
        "content": "<p>I feel there should be two separate set of proerpties for Citation: 1) The properties for the citation itself 2) the properties for the cited artifacts. For example, I would like to say the status of this citation but also the status of the cited research document. In some uses cases, the 2nd set of properties is more important. The current Citation mixes these two set together without clear indication. For example, Citation.contributorship, is it contributors to the cited document or contributors to the citation?<br>\nI suggested to add an element called \"citedArtifact\" and move attributes related to the cited artifact under this element. <span class=\"user-mention\" data-user-id=\"192085\">@Brian Alper</span></p>",
        "id": 227013415,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1613762217
    },
    {
        "content": "<p>Yunwei -- Your suggestion makes it clear that is is important to distinguish data elements about the Resource (set of properties for the citation itself, ie METADATA) from data elements that are the primary reasons for the Resource's existence (set of properties for the cited artifacts, ie DATA). This concept is not unique to the Citation Resource and could be applied to any knowledge Resource.  It may also have 3 levels -- Metadata about the Resource itself, Metadata about the knowledge the Resource represents, and Data Description that is the knowledge the Resource represents.  Perhaps  we should create a resourceMetadata element to contain both metadata sets of properties rather than a resourceContent element to contain the DATA.   Then a resourceMetadata.contributorship element could be provided to provide this data for contributorship to the resource itself. <span class=\"user-mention\" data-user-id=\"191506\">@Yunwei Wang</span> <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span>  <span class=\"user-mention\" data-user-id=\"220253\">@Khalid Shahin</span></p>",
        "id": 227170646,
        "sender_full_name": "Brian Alper",
        "timestamp": 1613917264
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192085\">@Brian Alper</span>  In general, a FHIR resource represents a real-world concept. For example, Patient represents patient demographics concept in a clinical setting. Evidence represents a machine-readable evidence concept. Citation is different since it contains two different sets of attributes, as we have discussed.</p>\n<p>I think the first step is to identify if an attribute belongs to citation, or cited knowledge, or both. Then the next step is to consider redesigning Citation with proper grouping of attributes. My colleague Carmela Couderc has some questions/suggestions on the attributes in Citation resource. We will email you those.</p>",
        "id": 227445406,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1614092975
    }
]