[
    {
        "content": "<p>I am a little bit confused</p>",
        "id": 222677693,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1610596652
    },
    {
        "content": "<p>Subject is declaring the scope that the artifact is written in, and there are only a handful of them, and they are declared (and understood) by the information model. Like Patient, Location, Organization, they're like Compartments.</p>",
        "id": 222679866,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1610599788
    },
    {
        "content": "<p>UseContext is for describing structured criteria that describe when, where, why, and for whom an artifact is appropriate.</p>",
        "id": 222679937,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1610599851
    },
    {
        "content": "<p>In a decision support rule, for example, the subject is Patient, which means the logic is written from the perspective of a patient, so if the logic accesses MedicationRequests, it's understood that it's only MedicationRequests for the patient in context.</p>",
        "id": 222679999,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1610599935
    },
    {
        "content": "<p>The use context for that same decision support rule might say the rule is appropriate for use in an inpatient setting, for patients with a substance misuse disorder, and by a pain management specialist.</p>",
        "id": 222680008,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1610599980
    },
    {
        "content": "<p>Bryn's replies refer to other FHIR resources in the Clinical Reasoning space, but Yunwei is asking about EvidenceReport Resource.</p>\n<p>The useContext element is inherited from ancestors so is, as Bryn suggests, available for describing structured criteria that describe the situations in which the artifact is intended to be used.</p>\n<p>The subject element in an EvidenceReport is a compound element containing any number of characteristics.   Unlike a decision rule (where the subject is often a singular concept to represent the target of application), the subject of an EvidenceReport is for a structured definition of what the evidence report is about.  If you were to create a report of the effect of dexamethasone on symptoms in people with COVID-19 reported in a research study in a journal publication, the subject could include 4 characteristics: the intervention = dexamethasone, the outcome = symptoms, the population = COVID-19, and the Citation = the citation for the journal article.</p>",
        "id": 222704592,
        "sender_full_name": "Brian Alper",
        "timestamp": 1610622867
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> and <span class=\"user-mention\" data-user-id=\"192085\">@Brian Alper</span> Yes my question is about EvidenceReport in EBM. I feel there is an overlap between useContext and subject. In your example, the people with COVID-19 could be either \"which the artifact is intended to be used\" or \"what the artifact is about\".<br>\nAlso in current R5 preview, there is no search parameter defined for subject.</p>",
        "id": 222734358,
        "sender_full_name": "Yunwei Wang",
        "timestamp": 1610638772
    },
    {
        "content": "<p>You can use EvidenceReport.useContext to express the concept of condition=COVID-19 if you are supporting a system that recognizes a 'context for use' for application (accessing) this EvidenceReport related to COVID-19.</p>\n<p>You can use EvidenceReport.subject to express the concept of condition=COVID-19 if you are specifying the focus of the report (the subject matter, what the report is about) included COVID-19.</p>\n<p>You can use EvidenceReport.section to express the concept of condition=COVID-19 if you want this concept to be part of the content of the report.</p>\n<p>You can potentially have a situation in which all 3 of these concepts apply.   The different elements (useContext, subject, section) allow you the precisely specify these related but not equal concepts.</p>\n<p>Adding search parameters for subject is an excellent suggestion.  Let's follow up after the Connectathon to review how we do this.</p>",
        "id": 222847405,
        "sender_full_name": "Brian Alper",
        "timestamp": 1610711168
    }
]