[
    {
        "content": "<p>Have we discussed, instead of defining extensions to stick in the Bundle that does a notification, instead defining a new bundle type 'subscription' that has a first resource 'SubscriptionStatus' - this resource could allow a client to reset it's listening stream too</p>",
        "id": 181622330,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1574415584
    },
    {
        "content": "<p>using extensions on Meta does feel a bit like working around a design decision (ie Bundle not supporting extensions)...</p>",
        "id": 181623471,
        "sender_full_name": "David Hay",
        "timestamp": 1574416595
    },
    {
        "content": "<p>Yes, we discussed this at the FHIR-I session at the last WGM in Atlanta... I will try and find the vote/notes from it.</p>",
        "id": 181624425,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1574417464
    },
    {
        "content": "<p>It was discussed with <a href=\"http://jira.hl7.org/browse/FHIR-23859\" target=\"_blank\" title=\"http://jira.hl7.org/browse/FHIR-23859\">GF#23859</a>, but does not appear to have made it into the notes.  Likely because of the note: \"(Note, this resolution was lost and then re-written by reviewing minutes.)\"</p>",
        "id": 181624742,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1574417731
    },
    {
        "content": "<p>I can't remember if there wasn't enough interest to vote or if there wasn't enough to pass... I'm fine with making a new issue to bring it up at the next FHIR-I call.</p>",
        "id": 181624860,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1574417820
    },
    {
        "content": "<p>Tagging <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> because I remember discussing it with him after the session</p>",
        "id": 181625534,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1574418463
    },
    {
        "content": "<p>Indeed at the first FHIR infrastructure session at the last working group eating we talked through three options. The sentiment in the room was \"don't create a new bundle type if history could work\", but I wouldn't mind revisiting if there was interest in adding first class properties for notifications.</p>",
        "id": 181648493,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1574436860
    },
    {
        "content": "<p>Per feedback, I am going to start modelling out the new resource to use when Subscriptions are sending bundles (to replace the current extensions on bundle.meta).</p>\n<p>Having gone through renaming Topic to SubscriptionTopic, I am in no hurry to rename another resource.  So, it's poll time again - please vote for your favorite name for the above-mentioned resource so that I don't have to do it twice!</p>\n<p>At first pass, the resource will include: <code>subscription-event-count</code>, <code>subscription-status</code>, <code>subscription-url</code>, and possibly <code>subscription-topic-url</code> and <code>bundle-event-count</code>.</p>\n<p>It will be required as entry[0] in notification bundles.  I've listed everything I've heard suggested so far in alphabetical order.  Please feel free to add if there is something logical that I've missed.  Polling will be open until I get around to defining the resource :-)</p>\n<p>Thanks!</p>",
        "id": 183198119,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1576096000
    },
    {
        "content": "<p>/poll Subscription Bundle Resource Name (to replace extensions)<br>\nSubscriptionHeader<br>\nSubscriptionInfo<br>\nSubscriptionMeta<br>\nSubscriptionNotificationHeader<br>\nSubscriptionNotificationInfo<br>\nSubscriptionStatus</p>",
        "id": 183198125,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1576096005
    },
    {
        "content": "<p>(For me, the key consideration is: we want the name of this resource to work in the context of <code>Bundle.entry[0]</code> for notification bundle, and also in the context of an operation like \"tell me the volatile status details of this subscription\" (say, <code>Subscription/:id/$status</code>.)</p>",
        "id": 183200743,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1576097664
    },
    {
        "content": "<p>Re: Josh: True, it has been asked (and is being discussed) if the volatile fields such as <code>eventCount</code> shouldn't be moved out of the <code>Subscription</code> resource (e.g., to prevent creating a new version of the resource for every notification sent by the system).  With this new resource being added, it makes that decision easier (for me at least).</p>",
        "id": 183201036,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1576097888
    },
    {
        "content": "<p>So, informal poll/question: do we feel like we're doin this just to work around the limitation on bundle and that it should be a capability? Or do we really feel this is something that should live separately from Subscription?</p>",
        "id": 183271575,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1576165653
    },
    {
        "content": "<blockquote>\n<p>So, informal poll/question: do we feel like we're doin this just to work around the limitation on bundle and that it should be a capability? Or do we really feel this is something that should live separately from Subscription?</p>\n</blockquote>\n<p>Yes.</p>\n<p>=)</p>\n<p>Seriously though, I feel like either piece is enough to stand on its own - the fact that both can use the same solution means that the decision was easier (for me at least).</p>",
        "id": 183272317,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1576166099
    },
    {
        "content": "<p>By popular demand: there is a new <a href=\"https://forms.office.com/Pages/ResponsePage.aspx?id=v4j5cvGGr0GRqy180BHbR3_dnSdVFHxEtcOYzItm0qRUOTJLTjRLSjNRMDVTVVlIR1I1WlozQldHOS4u\" title=\"https://forms.office.com/Pages/ResponsePage.aspx?id=v4j5cvGGr0GRqy180BHbR3_dnSdVFHxEtcOYzItm0qRUOTJLTjRLSjNRMDVTVVlIR1I1WlozQldHOS4u\">poll</a> for the additional subscription resource.</p>\n<p>Edit: updated poll type</p>",
        "id": 192284346,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1585587141
    },
    {
        "content": "<p>Updated the poll above, had accidentally set to Quiz instead of Form.  If you took it already, please do the new one.</p>",
        "id": 192300220,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1585593975
    },
    {
        "content": "<p>I voted again, I hope I got it right <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span> <br>\nAnd just to clarify, the reason I was looking for another vote is that I believe there is a significant value for defining a Notification that goes beyond its use with explicit subscription.</p>",
        "id": 192307272,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1585597272
    },
    {
        "content": "<p>Yep, have the vote.  That was the problem with the first one - since it was a quiz type it just told me how many people agreed with my arbitrary input sorting.</p>\n<p>Personally, I'm not fussed about the name at all - I just don't want to rename it once I've created it in the spec.</p>",
        "id": 192308077,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1585597645
    }
]