[
    {
        "content": "<p>Several connectathons ago, we looked at tieing subscriptions to event definitions, so that systems could offer a small set of possible subscriptions to consumers, to limit the system exposure to indefinite amounts of processing. What happened with that - anyone still interested? </p>\n<p><span class=\"user-mention\" data-user-id=\"191356\">@Jenni Syed</span> <span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span> <span class=\"user-mention\" data-user-id=\"195589\">@Joyce Dunlop</span></p>",
        "id": 161823174,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1553654561
    },
    {
        "content": "<p>I don't think I participated in that directly outside of some discussions around making Subscription more event driven or leaving the definitions more \"rest-like\"</p>",
        "id": 161861476,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1553695220
    },
    {
        "content": "<p>If there's interest, I could add something to the upcoming connectathon track</p>",
        "id": 161861528,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1553695253
    },
    {
        "content": "<p>looking at subscription for Argonauat and will definately look at this as a topic</p>",
        "id": 161867480,
        "sender_full_name": "Eric Haas",
        "timestamp": 1553698775
    },
    {
        "content": "<p>I hadn't heard of that approach but sounds interesting to me, would be interested to talk about it in May.</p>",
        "id": 161884874,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1553709829
    },
    {
        "content": "<p>I still think this is a tremendous idea.. Less because of the coded event definitions (which are neat but less useful to me), but I loved the model for using a FHIRPath expression. I'd be in for participating in a connectathon track around it.</p>",
        "id": 161887550,
        "sender_full_name": "James Agnew",
        "timestamp": 1553711594
    },
    {
        "content": "<p>the EHR interest was around capping the workload associated with processing subscriptions. e.g. event + patient. My current subscription model does not scale to 100k+ subscriptions</p>",
        "id": 161890679,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1553713551
    },
    {
        "content": "<p>Following up around this conversation: we've been thinking about using EventDefinnition as the basis of some of our subscription work in <a class=\"stream\" data-stream-id=\"179175\" href=\"/#narrow/stream/179175-argonaut\">#argonaut</a> this year. \"Simple\" use cases include subscribing to admission events for a given patient, or for all patients with a given Patient.givenPractitioner. It wasn't clear how to do this with simple EventDefinitions, so I've written up <a href=\"https://gist.github.com/jmandel/f57fda6ce92174af663abe13cbb4612e\" target=\"_blank\" title=\"https://gist.github.com/jmandel/f57fda6ce92174af663abe13cbb4612e\">some thoughts here</a> about how to filter a very broad event stream, with a simple/small set of pre-defined filters (each backed by a FHIRPath expression, for systems that know/speak FHIRPath).</p>",
        "id": 164702633,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1556799660
    },
    {
        "content": "<p>I think the idea of parameterization is really key to scaling - if there are use cases that genuinely require subscribing to many thousands of arbitrary and unrelated FHIR search queries, I'd be interested to hear of them but they're going to be prohibitively expensive to support. A few parameterized conditions with thousands of instantiations (triggers) is much better.</p>\n<p>In your proposal, what gets communicated to the endpoint? It might be very helpful to have a general-purpose endpoint that receives the trigger values in the notification payload.</p>",
        "id": 164707867,
        "sender_full_name": "Paul Church",
        "timestamp": 1556803819
    },
    {
        "content": "<p>Also, if your conditions can look at both the previous and updated state of the resource, can they trigger on deletions? Whatever syntax handles creates (%previous doesn't exist) ought to also handle the updated state not existing.</p>",
        "id": 164709900,
        "sender_full_name": "Paul Church",
        "timestamp": 1556805380
    },
    {
        "content": "<blockquote>\n<p>In your proposal, what gets communicated to the endpoint? It might be very helpful to have a general-purpose endpoint that receives the trigger values in the notification payload.</p>\n</blockquote>\n<p>For the Argonaut use cases: just a ping (i.e., a POST with empty payload) meets the basic requirements.</p>",
        "id": 164712306,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1556807146
    },
    {
        "content": "<blockquote>\n<p>I think the idea of parameterization is really key to scaling</p>\n</blockquote>\n<p>Agreed; that's why I'm hoping we can get down to a few key filters, parameterized in this way (but I can't tell if you're agreeing with this parameterized approach I'm proposing, or if you're expressing a critique ;-))</p>",
        "id": 164712395,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1556807183
    },
    {
        "content": "<blockquote>\n<p>can they trigger on deletions? Whatever syntax handles creates (%previous doesn't exist) ought to also handle the updated state not existing.</p>\n</blockquote>\n<p>Yes, that's right on both counts (either <code>%previous</code> or <code>this</code> may be null)</p>",
        "id": 164712481,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1556807227
    },
    {
        "content": "<p>I'm also not sure if I'm agreeing or critiquing, that depends on whether I can come up with a highly scalable implementation of EventFilter evaluation. ;-)</p>\n<p>It's a good design in terms of expressive power. I just want to be confident that it's a direction that will really address scalability. Are the expressions on EventFilter.condition limited to \"&lt;field&gt; = &lt;parameter&gt;\"?</p>",
        "id": 164727746,
        "sender_full_name": "Paul Church",
        "timestamp": 1556818359
    },
    {
        "content": "<p>In your example, your subscription is tied to a single patient through the eventStreamParameter:</p>\n<p>\"eventStreamParameter\": [<br>\n    {\"name\": \"patientId\", \"value\": \"Patient/123\"}]</p>\n<p>Assuming we are monitoring very large numbers of patients, we either end up with a very large number of subscriptions (if there are different endpoints for different patients), or (if they’re all going to the same endpoint) perhaps just one subscription with a very large number of patientId values in the eventStreamParameter list (I’m assuming the patientId parameter can be repeated):</p>\n<p>\"eventStreamParameter\": [<br>\n    {\"name\": \"patientId\", \"value\": \"Patient/1”},<br>\n    {\"name\": \"patientId\", \"value\": \"Patient/2”},<br>\n     …<br>\n    {\"name\": \"patientId\", \"value\": \"Patient/n”},<br>\n]</p>\n<p>In these examples, it’s the patient ID that’s the factor that results in a large number of expression evaluations that we want to be sure we can optimize for. Or more specifically, every resource change will need to be evaluated once for EACH eventStreamParameter value, to check if that resource matches that value.</p>\n<p>If we’re monitoring 10,000 patients, then we’re going to need to evaluate the EventFilter expression (which is where the eventStreamParameter value is actually used) 10,000 times for every resource change (to see if that change matches any one of the 10,000 patients we’re interested in). There might be some interesting optimizations we can do if we can keep that filter expression simple and make some assumptions about it, but that gets very tricky. Right now, I think that expression could even be changed to “not equals” (\"expression\": \"%current.subject != %patientId”), in which case the list of patientIds becomes the patients we’re NOT interested in (probably no real use case for that, but theoretically possible).</p>\n<p>However, if we had a mechanism that could be read as “notify me when &lt;Field&gt; has one of these &lt;values&gt; AND &lt;complicated expression&gt;”, then we could optimize with a pre-filter on the 1st half of that statement and only have to evaluate the &lt;complicated expression&gt; if the pre-filter is passed.</p>\n<p>In the patient example, this would read as “notify me when &lt;Patient ID&gt; has one of these &lt;list of patient ID values&gt; AND &lt;complicated expression&gt;”. The pre-filter is whether “this” patient is one of the patients in our list.</p>\n<p>This would allow you to build an index that maps field (e.g. Patient ID) to Subscriptions. When a resource change comes in, you could look up this index to find the set of Subscriptions that might be relevant to this change. Which would be only the set of Subscriptions relevant to the one patient, a small set. Then evaluating &lt;complicated filtering expression&gt; is only being done for the patients it needs to be done for, and only once per patient.</p>\n<p>One way to do this might be to add a “targetedResources” (better name needed?) list to the subscription, which becomes our pre-filter:</p>\n<p>{<br>\n  \"resourceType\": \"Subscription\",<br>\n  \"eventStream\": [<br>\n    {\"reference\": \"EventDefinition/admission\"},<br>\n  “targetedResources”: [<br>\n    {“field”: “%current.subject“, “values”: [<br>\n    “Patient/1”,<br>\n    “Patient/2”,<br>\n    “Patient/n”,<br>\n    ]<br>\n    }]<br>\n}</p>\n<p>The interpretation of this is that for every entry in targetedResources, the specified field must have one of the specified values, or the subscription doesn’t apply. In this case, the patient must be one of those in the list, else you can ignore this subscription.</p>",
        "id": 164849818,
        "sender_full_name": "Patrick Cosmo",
        "timestamp": 1556945227
    },
    {
        "content": "<p>For those at the connectathon, we have a breakout scheduled today at 4pm Eastern in Salon 1 to discuss this</p>",
        "id": 164868992,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1556977591
    },
    {
        "content": "<blockquote>\n<p>Are the expressions on EventFilter.condition limited to \"&lt;field&gt; = &lt;parameter&gt;\"?</p>\n</blockquote>\n<p>In general no, though of course a server might impose limitations -- and some servers might just have a fixed list of expressions they support (i.e., just named events, without really using the fhirpath)</p>",
        "id": 164869678,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1556978761
    },
    {
        "content": "<p>For efficient server implementations: many distinct client subscriptions need to land in and be evaluated by consolidated servers processes -- i.e., a new client creating a new (small/narrow) subscription might update a behind-the-scenes list of patients for which the \"by-patient\" filter is applied (or any other filter, for that matter).</p>",
        "id": 164869934,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1556979174
    },
    {
        "content": "<p>Notes from the previous conversation are now on the track page: <a href=\"https://confluence.hl7.org/display/FHIR/2019-05+Subscriptions+Track#id-2019-05SubscriptionsTrack-NotesfromSaturdayBreakout\" target=\"_blank\" title=\"https://confluence.hl7.org/display/FHIR/2019-05+Subscriptions+Track#id-2019-05SubscriptionsTrack-NotesfromSaturdayBreakout\">https://confluence.hl7.org/display/FHIR/2019-05+Subscriptions+Track#id-2019-05SubscriptionsTrack-NotesfromSaturdayBreakout</a></p>",
        "id": 164888503,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1557006499
    },
    {
        "content": "<p>The next breakout for this topic is Sunday at 3pm in Salon 6</p>",
        "id": 164888508,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1557006513
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> <span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span>  Feel free to add more context to the notes where it's missing</p>",
        "id": 164888529,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1557006563
    },
    {
        "content": "<p>I have an alternative proposal: <a href=\"https://github.com/CareEvolution/Public/blob/master/Subscriptions.md\" target=\"_blank\" title=\"https://github.com/CareEvolution/Public/blob/master/Subscriptions.md\">https://github.com/CareEvolution/Public/blob/master/Subscriptions.md</a></p>",
        "id": 165083103,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1557243731
    },
    {
        "content": "<p>Will you be at Q1 discussion tomorrow (Wed) <span class=\"user-mention\" data-user-id=\"191912\">@Michele Mottini</span> ?</p>",
        "id": 165134329,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1557291192
    },
    {
        "content": "<p>Re: your proposal, thanks for writing this up! The following:</p>\n<blockquote>\n<p>that fire when the data set changes = the List change = resources are added or removed from it or any of their associated properties change.</p>\n</blockquote>\n<p>Seems to indicate that there's no way to restrict firing of subscription events to specific events (e.g., specific status changes on the set of resources that belong to the list). Is that right?</p>",
        "id": 165134476,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1557291384
    },
    {
        "content": "<p>Also, for a list like \"Admissions in last 24 hours\", where is the constraint of \"24 hours\" expressed? Just in the description?</p>",
        "id": 165134558,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1557291520
    },
    {
        "content": "<p>(And otherwise, how do Lists avoid growing arbitrarily large over time?)</p>",
        "id": 165134570,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1557291552
    },
    {
        "content": "<p>In preparation for FHIR-I Q1: The <a href=\"https://docs.google.com/document/d/1FkrBY6gykrCFkeRWLWdrpdIPSho6s-yvVu_CaZ9lQhs/edit?ts=5ccf3464\" target=\"_blank\" title=\"https://docs.google.com/document/d/1FkrBY6gykrCFkeRWLWdrpdIPSho6s-yvVu_CaZ9lQhs/edit?ts=5ccf3464\">proposal discussed</a> in the Sunday meeting that is linked to from the notes, seems not to be publicly accessible. <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> <span class=\"user-mention\" data-user-id=\"191356\">@Jenni Syed</span> ?</p>",
        "id": 165150711,
        "sender_full_name": "Christiaan Knaap",
        "timestamp": 1557311215
    },
    {
        "content": "<p>Thsnks -- I'm fixing this</p>",
        "id": 165153816,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1557314397
    },
    {
        "content": "<p>Hmm, it looks like it <a href=\"https://docs.google.com/document/d/1FkrBY6gykrCFkeRWLWdrpdIPSho6s-yvVu_CaZ9lQhs/edit?usp=drivesdk\" target=\"_blank\" title=\"https://docs.google.com/document/d/1FkrBY6gykrCFkeRWLWdrpdIPSho6s-yvVu_CaZ9lQhs/edit?usp=drivesdk\">should already be accessible here</a></p>",
        "id": 165153908,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1557314469
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> : no, I am no longer in Montreal, I was there only for the conectathon</p>\n<blockquote>\n<p>Seems to indicate that there's no way to restrict firing of subscription events to specific events </p>\n</blockquote>\n<p>Yes, you can - changes in the data sets (List with properties) are the events, so you can restrict to whatever you are interested in - assuming the server knows how to identify that thing.</p>\n<blockquote>\n<p>Also, for a list like \"Admissions in last 24 hours\", where is the constraint of \"24 hours\" expressed? Just in the description?</p>\n</blockquote>\n<p>How the data sets are defined is not specified - so there is no definition there of what count as an admission, or an admission in the last 24 hours. It is assumed that the server knows (more likely it has some internal logic to define those things) and that knowledge is exposed in the data sets. (I am thinking about a way to define data sets using query criteria and paths)</p>\n<blockquote>\n<p>(And otherwise, how do Lists avoid growing arbitrarily large over time?)</p>\n</blockquote>\n<p>Depends on the list - if there is some kind of time limit like 'Admission in 24 hours' they won't grow too much, but of course if you have just 'Admissions' eventually it can be as large as your entire patient population (if it is a pretty sick population...)</p>",
        "id": 165158791,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1557319223
    }
]