[
    {
        "content": "<p>Overall, I think that the potential for FHIR Subscriptions is to enable FHIR \"push\" without requiring the external app to maintain a significant database of content.</p>\n<p>The current spec is based around the idea that a clinical system uses FHIR resources as its native database format and executes subscribed FHIR queries against every resource as it's created or modified. This would work well for custom built middleware and FHIR reference implementations, but generally not for systems that implement clinical workflow.</p>\n<p>I think that most clinical systems, mine included, are event-based. An implementable subscription criteria would rather be based on an event and then narrowed to specific attributes.</p>\n<p>I've been trying to think about specific, practical use-cases for FHIR subscriptions. Most of them are more targeted subscriptions. </p>\n<p>Some use-cases for FHIR Subscriptions:</p>\n<ul>\n<li>Family caregiver app subscribes to lab results and location information about their inpatient family member.</li>\n<li>Patient grants an aggregator or app access to their clinical record for purposes of clinical research. </li>\n<li>Clinician-facing inpatient \"census board\" subscribes to patient location within a specific department.</li>\n<li>Provider-facing app subscribes to abnormal lab results about patients on their patient list</li>\n<li>Provider-facing app subscribes to admitted patient location changes for a specific department or facility.</li>\n<li>Syndromic surveillance system monitors all new patient conditions for a given set of snomed codes.</li>\n</ul>\n<p>Overall, I think that an event model is more appropriate for a more specific subscription. A FHIR search model is more appropriate for the transfer of a fuller, richer set of data.</p>",
        "id": 153889137,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1494435474
    },
    {
        "content": "<p>I agree that an event based model is preferable, having implemented subscription (and saying that as a native FHIR store ;-)</p>",
        "id": 153889145,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1494436467
    }
]