[
    {
        "content": "<p>I want to subscribe to all Observations that come from a certain patient. However, information about the patient has not yet been uploaded to the server. To protect PHI, the only information I have about the patient is the information that will go into the identifier. In fact, that is all that is present in the resource besides the profile. But searching on a Patient identifier is not required so subscribing to Patients based upon the identifier is also not something one can rely on.</p>\n<p>Since I know the profile, the only way I can see to do this is to subscribe to all Patients resources that have this profile and then looking for those Patient resources that have the correct identifiers. In that manner I can subscribe to Observations whose subject has the logical id of those patient resources. Is this the best I can do (on all servers that support subscription of Patient and Observation resources)?</p>",
        "id": 164381613,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1556449171
    },
    {
        "content": "<blockquote>\n<p>subscribe to all Patients resources that have this profile</p>\n</blockquote>\n<p>That's a problem - you're associated secret knowledge with the profile - you don't want any resource that happens to meet the profile to fire a subscription, right?</p>",
        "id": 164381694,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1556449301
    },
    {
        "content": "<blockquote>\n<blockquote>\n<p>subscribe to all Patients resources that have this profile</p>\n</blockquote>\n<p>That's a problem - you're associated secret knowledge with the profile - you don't want any resource that happens to meet the profile to fire a subscription, right?</p>\n</blockquote>\n<p>I didn't but at the moment I do not see how to (generically) avoid it. So I will get every Patient resource that supports the PHD Patient profile. In theory that could be quite a few since the only thing required are certain fields in the identifier. I would simply have to ignore those Patient resources that didn't have the identifiers I was looking for. On the other hand, there may not be so many in the end because not every resource that could potentially support the profile will indicate so in the meta.profile element whereas PHD IG complaint PHGs shall populate the element.</p>",
        "id": 164382152,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1556450004
    },
    {
        "content": "<p>why does it matter that they conform to the profile? I feel as though that can't be really what you want; you want all observations of a type..?</p>",
        "id": 164517350,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1556608820
    }
]