[
    {
        "content": "<p>Assuming in a given subscription where main criteria and additional criteria have different resources,  need clarification on use cases when all criteria will be considered true.<br>\nFor example, assuming  a subscription(Id:SUB_1) exists with main criteria referring to Patient: (Patient?id=Patient/123) and additional criteria referring to Encounter resource: (Encounter?subject=Patient/123) of the patient.<br>\nwhen a new Encounter resource is added for the patient(Id:123)  will this hold good to trigger a notification for the subscription(Id:SUB_1)  though Patient details remain unchanged?</p>",
        "id": 221628856,
        "sender_full_name": "Nandha K",
        "timestamp": 1609840478
    },
    {
        "content": "<p>Having multiple trigger resources constitutes an <code>or</code> operation, so any match would cause a notification.  (The reasoning is that <code>and</code> checks can be joined in the trigger itself).</p>",
        "id": 221663414,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1609862466
    },
    {
        "content": "<p>I believe when you mean multiple trigger it means multiple criteria(or filterBy as in R5 specification). With that understanding, while referring  R5 link for \"filterBy\" element( link below mentioned) in Subscription, the explanation as given: \"When multiple filters are applied, evaluates to true if all the conditions are met; otherwise it returns false.(i.e., logical AND).\"</p>\n<p>Link for \"filterBy\" element:<br>\n<a href=\"https://build.fhir.org/subscription-definitions.html#Subscription.filterBy\">https://build.fhir.org/subscription-definitions.html#Subscription.filterBy</a></p>\n<p>According to R5 explanation, when multiple filters(or triggers) referring to different resources exist in a subscription then from example in my previous comment, though Encounter resource is added new but patient details remain same the notification should not be sent.</p>\n<p>Questions:</p>\n<ol>\n<li>Is it (Logical OR )/ (Logical AND to be applied when multiple filters(triggers) exist ?</li>\n<li>If Logical AND is to be applied for multiple filters, kindly explain with a scenario</li>\n</ol>",
        "id": 221785039,
        "sender_full_name": "Nandha K",
        "timestamp": 1609949105
    },
    {
        "content": "<p>There are two situations now (due to changes from the last connectathon), so this text could probably use another update with more clarification.</p>\n<ul>\n<li>\n<p>Multiple filters on a single resource trigger (e.g., <code>Encounter</code>).  In that scenario, the conditions are joined with <code>and</code> (as described).  So, if you wanted to have filters for both <code>Encounter.subject</code> (e.g., <code>Patient/123</code>) and <code>Encounter.class</code> (e.g., <code>http://terminology.hl7.org/CodeSystem/v3-ActCode|AMB</code>), that is perfectly doable.  Specifying both means that you want to be notified when there is a new Ambulatory Encounter for Patient 123.</p>\n</li>\n<li>\n<p>Multiple filters on multiple resource triggers (e.g., <code>Encounter</code> and <code>Patient</code>).  In that scenario, the conditions are applied only to the specified resource(1).  Each resource trigger is intended to be evaluated separately(2), so this is essentially an <code>or</code>. (I believe this is the part that needs further documentation.).</p>\n</li>\n</ul>\n<p>(1): We apparently need more documentation for when <code>Subscription.filterBy.resourceType</code> is not specified as well.  I believe the 'best' behavior would be to check resource triggers for matching <code>canFilterBy.searchParamName</code> matches and apply to each of those, but we need to have a discussion on what is reasonable for servers to implement.</p>\n<p>(2): The reasoning here is that multiple resource triggers represent different ways of triggering the notification (e.g., I want to capture 'Status A to Status B' and 'Status B to Status C' only, which requires two different triggers.  Other identified scenarios are possible within a single resource trigger.</p>\n<p>I'm having trouble with the example you are providing, and could use some clarification.  Are you asking for a notification when there is a new Encounter <em>and</em> that a Patient's information has changed?  I'm not sure how that would be triggered other than a transaction including both changes and a server that evaluates subscriptions on the transaction result instead of individual operations (this hasn't come up yet, so I'm not sure if implementers plan to or not).  Could you provide a little more information about the use case you are describing?</p>",
        "id": 221802188,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1609957054
    },
    {
        "content": "<p>Thanks for your detailed explanation on single resource and multiple resource triggers. As you mentioned, the R5 documentation needs an update. I was thinking on terms of multiple resources triggers. Your explanation with example had clarified my doubts on same when logical OR operation will be considered to trigger notifications. Also, currently I don't have use case where in a single transaction(bundle) to monitor multiple resources for notification. I will leave it to implementers <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>",
        "id": 221950376,
        "sender_full_name": "Nandha K",
        "timestamp": 1610031206
    },
    {
        "content": "<p>No problem!  If you could file a Jira ticket asking for clarification, I would appreciate it.  Cheers!</p>",
        "id": 221962606,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1610036329
    },
    {
        "content": "<p>Have not raised ticket in Jira before .. I would like to take your help for the same</p>",
        "id": 222743064,
        "sender_full_name": "Nandha K",
        "timestamp": 1610641997
    },
    {
        "content": "<p><a href=\"https://jira.hl7.org/secure/CreateIssue.jspa?pid=11200&amp;issuetype=11300\">https://jira.hl7.org/secure/CreateIssue.jspa?pid=11200&amp;issuetype=11300</a> has a starting point if you're not registered in Jira yet.</p>",
        "id": 222755346,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1610646777
    },
    {
        "content": "<p>Once you have an account, <a href=\"http://hl7.org/fhir-issues\">http://hl7.org/fhir-issues</a> has a \"create\" button at the top that will let you submit an issue.</p>",
        "id": 222755438,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1610646809
    },
    {
        "content": "<p><a href=\"https://confluence.hl7.org/display/HL7/Specification+Feedback\">https://confluence.hl7.org/display/HL7/Specification+Feedback</a> has good background on how to get started.</p>",
        "id": 222781341,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1610657117
    },
    {
        "content": "<p>Created a ticket successfully :)<br>\n<a href=\"https://jira.hl7.org/browse/FHIR-30383\">https://jira.hl7.org/browse/FHIR-30383</a></p>",
        "id": 222786005,
        "sender_full_name": "Nandha K",
        "timestamp": 1610659270
    }
]