[
    {
        "content": "<p>Is there a best practice around including a resource in subscription notification bundle using the <code>id-only</code> method when that resource contains required fields? For example, if I have an admission notification and I'd like to include <code>id-only</code> resources for both Patient and Encounter - I'm not going to be able to do that without also including Encounter.status and Encounter.class. Or is this just generally expected to be the way that id-only payloads work? </p>\n<p>I'm trying to create some examples using FSH and finding this limitation - namely FSH won't let me generate a bundle with encounter with only <code>identifier</code> present. </p>\n<p>I can share my FSH if it helps.</p>",
        "id": 254440529,
        "sender_full_name": "Nick Hatt",
        "timestamp": 1632345236
    },
    {
        "content": "<p>Hi Nick, if you are using <code>id-only</code>, then the id is populated via <code>Bundle.entry.fullUrl</code>, and the <code>resource</code> element is not present.  An example from the spec can be seen <a href=\"https://argonautproject.github.io/subscription-backport-ig/Bundle-notification-id-only.json.html\">here</a>, while the FSH file that defines all those examples is <a href=\"https://github.com/HL7/fhir-subscription-backport-ig/blob/master/input/fsh/BackportNotification.fsh\">here</a>.</p>\n<p>Hope this helps!</p>",
        "id": 254441752,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1632345829
    },
    {
        "content": "<p>That makes perfect sense thanks <span class=\"user-mention\" data-user-id=\"222054\">@Gino Canessa</span> ! I never thought about bundle.entry without .resource, but yeah that's totally allowed.  <a href=\"http://build.fhir.org/subscription.html#payloads-id-only\">http://build.fhir.org/subscription.html#payloads-id-only</a> &lt;- would it make sense to you to call out that the resource element should not be present for id-only?</p>",
        "id": 254535118,
        "sender_full_name": "Nick Hatt",
        "timestamp": 1632403868
    },
    {
        "content": "<p>It also seems like there's a developer experience problem here - it's not guaranteed that I can infer what the resourceType is from the fullUrl, or request.url. So as a developer, if I want to know what all was in the notification I have to go and fetch each resource and then figure out which resource is which. Otherwise, I'm stuck doing fullUrl.indexOf('Patient') to try and guess that a particular entry is the patient entry. </p>\n<p>I realize there's nothing stopping me from using <code>full-resource</code> and just constraining things down to minimize data exposure, and use the <code>data-absent-reason</code> extension to work around <code>Encounter</code> and such, but that feels like it defeats the purpose.</p>",
        "id": 254539682,
        "sender_full_name": "Nick Hatt",
        "timestamp": 1632405706
    },
    {
        "content": "<p>I am hesitant about about inserting <code>full-resource</code> entries that are essentially blank just to get the resource type.  We could add guidance to encourage implementers to fill out the <code>Reference.type</code>, in <code>SubscriptionStatus.notificationEvent.focus</code> and <code>SubscriptionStatus.notificationEvent.additionalContext</code>, especially when using <code>id-only</code>.  (Those elements aren't in the R5 CI build yet, since I've been focused make sure the <a href=\"http://build.fhir.org/branches/R4B/subscriptionstatus.html\">R4B version</a> is ready to go - I'll be updating R5 once R4B is 'final'.)  I'm happy to file the ticket for that change, but will note that we need to review in case including the resource types leaks PHI.  We could also propose an extension for that same information, but need to worry about the same issue.</p>\n<p>Good catch on calling that out that <code>Bundle.entry.resource</code> should be excluded!  Would you mind filing a ticket for the change request?</p>\n<p>Also, just a note that FHIR URLs should follow the <code>[base]/[type]/[id]?[parameters]</code> pattern (<a href=\"https://www.hl7.org/fhir/http.html#read\">http page</a>).  So if/when they need to be parsed, it's at least not as bad as repeatedly searching the URL for string matches.</p>",
        "id": 254606098,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1632431482
    },
    {
        "content": "<p>You got it <span class=\"user-mention\" data-user-id=\"222054\">@Gino Canessa</span> - it's good motivation to get my Jira account set up. </p>\n<p>Point taken about fullUrl, but<code>Bundle.fullUrl</code> is a <code>uri</code> type though - so it could be <code>uuid</code>, or use something like <code>[base]/DiagnosticReport?identifier=1045813</code> (<a href=\"http://build.fhir.org/resource.html#identifiers\">http://build.fhir.org/resource.html#identifiers</a>). If the publisher is sending uuids they are probably just being rude, but the \"business identifier\" reference use case seems more valid, especially as groups like Carequality are looking at subscriptions as a way to build out event notifications for otherwise unaffiliated groups - with potentially multiple hops in between.</p>",
        "id": 254703657,
        "sender_full_name": "Nick Hatt",
        "timestamp": 1632490197
    }
]