[
    {
        "content": "<p>As discussed at the San Diego Work Group Meeting just now, FHIR-I has accepted to be co-sponsor for the work on FHIR-based context-synhronization. The formal PSS is here: <a href=\"https://drive.google.com/open?id=165BU5ZmUyuwxz4kg2dtjRWkNM7o4u2PrdcIKSxP94Ts\" target=\"_blank\" title=\"https://drive.google.com/open?id=165BU5ZmUyuwxz4kg2dtjRWkNM7o4u2PrdcIKSxP94Ts\">https://drive.google.com/open?id=165BU5ZmUyuwxz4kg2dtjRWkNM7o4u2PrdcIKSxP94Ts</a></p>",
        "id": 153907634,
        "sender_full_name": "Ewout Kramer",
        "timestamp": 1505331113
    },
    {
        "content": "<p>I've added a draft resource for this based on the specs developed so far: <a href=\"http://build.fhir.org/usersession.html\" target=\"_blank\" title=\"http://build.fhir.org/usersession.html\">http://build.fhir.org/usersession.html</a></p>",
        "id": 153919810,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1510770209
    },
    {
        "content": "<p>I've added my thoughts as TODOs in the resource, very interested in feedback and review. Particularly <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> <span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span> <span class=\"user-mention\" data-user-id=\"191355\">@Kevin Shekleton</span></p>",
        "id": 153919811,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1510770248
    },
    {
        "content": "<p>Thanks for the mention <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> ! It would be helpful if you could spell out a bit of the use case as part of that page. In particular I'm trying to get my head around the rationale for having a session be limited to a single workstation but permit multiple users. In the context you're envisioning, which parties would be able to issue changes to this session? And which parties would subscribe to learn about the changes? Does workstation refer to a physical device? Would a mobile phone be a workstation?</p>",
        "id": 153919881,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1510791583
    },
    {
        "content": "<p>I certainly agree about multiple users - what's the use case for that?</p>",
        "id": 153919888,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1510799249
    },
    {
        "content": "<p>That's my bad, I missed that, cardinality of user should be 1..1, fixing now.</p>",
        "id": 153919926,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1510822542
    },
    {
        "content": "<p>As far as workstation, I agree, and my notes on that are that I think that could just be a Device reference, that's what I see it as, the user's device, whatever that is, a laptop, desktop, tablet, mobile, etc.</p>",
        "id": 153919927,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1510822609
    },
    {
        "content": "<p>As far as who could submit changes, I was thinking of this as a read-only resource from the client's perspective, and systems could subscribe to it to synchronize their context. For example, we would use this to synchronize the current patient in a user's context if we're providing asynchronous decision support for the current user.</p>",
        "id": 153919928,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1510822838
    },
    {
        "content": "<p>but who can initiate a change to the focus? I think that more than application can - certainly can in ccow and it's a core part of the radiologist workflow</p>",
        "id": 153919938,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1510825360
    },
    {
        "content": "<p>Committed a few updates, still waiting for feedback from Isaac before I make any change to  the workstation element though.</p>",
        "id": 153919940,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1510825517
    },
    {
        "content": "<p>That's a good point on changing focus, but wouldn't that be a different session, but for the same user, because it's a different device?</p>",
        "id": 153919943,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1510825823
    },
    {
        "content": "<p>but the point is to share the session</p>",
        "id": 153919944,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1510825884
    },
    {
        "content": "<p>Maybe, I thought the point was just to be able to synchronize the information between the sessions. Otherwise, \"workstation\" would have to be 1..*, right?</p>",
        "id": 153919945,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1510825985
    },
    {
        "content": "<p>maybe so</p>",
        "id": 153919946,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1510826026
    },
    {
        "content": "<p>is there a compelling current use-case (current implementations of CCOW) that actually have multiple workstations in a session? I know that the cath-lab tried to use this to coordinate all the machines in the cath-lab. But I don't know if adding that complexity today is as useful as the trouble it will bring.</p>",
        "id": 153920039,
        "sender_full_name": "John Moehrke",
        "timestamp": 1510845280
    },
    {
        "content": "<p>I don't want to hurt the efforts, but bring up CCOW only in a constructive way.... Lets learn and improve...  CCOW has an abstract model, and two concrete models. FHIR could be seen as a third concrete model (or not)...  Mapping to their abstract model can help us be complete. Mapping to their risk model can help us not re-learn failure-modes...  See <a href=\"http://www.hl7.org/implement/standards/product_brief.cfm?product_id=1\" target=\"_blank\" title=\"http://www.hl7.org/implement/standards/product_brief.cfm?product_id=1\">http://www.hl7.org/implement/standards/product_brief.cfm?product_id=1</a></p>",
        "id": 153920041,
        "sender_full_name": "John Moehrke",
        "timestamp": 1510845573
    },
    {
        "content": "<p>Thankfully much of the complexity of CCOW is totally not necessary.. such as patient and user mapping gents pluggability; and the context manager itself (as the FHIR Server fills this, right?)    We also have OAuth (e.g. SMART) to manage other parts that were very complex in CCOW.... So I am mostly pointing at the data model from CCOW, and the risks of context sharing that they outline.</p>",
        "id": 153920047,
        "sender_full_name": "John Moehrke",
        "timestamp": 1510846780
    },
    {
        "content": "<p>Sooo.. since we are focused on the resource design, go directly to the ccow_subjects document, and show a mapping in the FHIR resource to the ccow_subjects.</p>",
        "id": 153920048,
        "sender_full_name": "John Moehrke",
        "timestamp": 1510846780
    },
    {
        "content": "<p>Is there a reason why it is  currently modeled with the context as a completely open ended structure? I would have expected we would have had specific workflow resources. Expanding beyond that seems like could be done using the open ended structure. So I like the opended, but would have expected workflow would have been called out explicitly so that it is more directly useable.</p>",
        "id": 153920049,
        "sender_full_name": "John Moehrke",
        "timestamp": 1510847505
    },
    {
        "content": "<p>For example.. if you take the TL,DR approach to the CCOW spec... it ends up defining a structure of Patient, Encounter, Observation, DICOM.</p>",
        "id": 153920051,
        "sender_full_name": "John Moehrke",
        "timestamp": 1510847588
    },
    {
        "content": "<p>but why restrict to that? DIagnosticReport?</p>",
        "id": 153920052,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1510847689
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span>  - wow, it's like this is a real FHIR resource! Thanks for doing this work. </p>\n<p>re: workstation<br>\nI'm defined this element as: Location that identifies the physical place at which the user's session is occurring. For the purposes of context synchronization, this is intended to represent the user's workstation.</p>\n<p>Is that a FHIR Device? Is it a FHIR Location? </p>\n<p>In practice, today's prod integrations typically use a hostname or ip address. This is why I suggested CodeableConcept, instead of Reference.</p>",
        "id": 153920795,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1511298397
    },
    {
        "content": "<p>That would not be a CodableConcept, It might be an Identifier. But most likely would be an EndPoint</p>",
        "id": 153920797,
        "sender_full_name": "John Moehrke",
        "timestamp": 1511298790
    },
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> , the endpoint resource seems to require that one can talk to the workstation and that's not necessarily the case, right?</p>",
        "id": 153920798,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1511299427
    },
    {
        "content": "<p>Location is pretty clearly scoped to physical places, which doesn't quite seem to match.</p>",
        "id": 153920800,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1511299592
    },
    {
        "content": "<p>Would it make sense to add something like \"Reading Room workstation\" to this list: <a href=\"https://www.hl7.org/fhir/valueset-device-kind.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/valueset-device-kind.html\">https://www.hl7.org/fhir/valueset-device-kind.html</a>?</p>",
        "id": 153920801,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1511299667
    },
    {
        "content": "<p>It seems to me that you would potentially want to capture both the Device (i.e. the machine running the process that has the session) and the Location (where the user is) although I see this as both less useful and more problematic.</p>",
        "id": 153920802,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1511299705
    },
    {
        "content": "<p>I think for a context synchronization use case, it should really be a Device.</p>",
        "id": 153920803,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1511299722
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> - I think that make sense. Any suggestions on the device.type?</p>",
        "id": 153920810,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1511301385
    },
    {
        "content": "<p>choice... could be any of those, right? best part of core FHIR resouce modeling is you can define it multiple way</p>",
        "id": 153920812,
        "sender_full_name": "John Moehrke",
        "timestamp": 1511302030
    },
    {
        "content": "<p>The current example binding is for medical devices, but we've used Device in CDS contexts to represent a CDS Service, for example. Would be nice to define a value set for device type appropriate to the space, but not sure what granularity to use. Maybe start with something really simple, \"Desktop | Tablet | Mobile\"?</p>",
        "id": 153920843,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1511304838
    }
]