[
    {
        "content": "<p>Is there interest in a January connectathon for subscriptions? If so, what are you most interested in testing out? If there is interest, is there someone that can take track (or co-) lead this time around? I currently have a conflict on Friday the 15th.</p>",
        "id": 216879888,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1605537891
    },
    {
        "content": "<p>Given that we're planning to ballot the \"Subscriptions Backport IG\" in the January cycle, it'd be great to get some experience with this at the connectathon</p>",
        "id": 216902739,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1605547265
    },
    {
        "content": "<p>Hi Jenni, I'm happy to co-lead, if you like.  I'd offer to take the track entirely, but you're better at filing Jira tickets  :-)</p>",
        "id": 216909073,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1605550069
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191356\">@Jenni Syed</span> do you want to start the track page, or would you like me to?</p>",
        "id": 216924046,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1605557153
    },
    {
        "content": "<p>I can kick it off :)</p>",
        "id": 216925483,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1605557717
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"222054\">@Gino Canessa</span>  I will take the offer to co-lead, but want to make sure you would really really need to be there on the last day (report out) b/c my conflict is with most of that day :)</p>",
        "id": 216925550,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1605557746
    },
    {
        "content": "<p>wasn't sure if you were going to run a different track</p>",
        "id": 216925581,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1605557758
    },
    {
        "content": "<p>No worries (that's why it took me a while to respond).  I'll have another track I'm supporting, but can commit to parking myself in subscriptions in general (and on Friday in particular).  Though, I think people will be disappointed with my report-out vs. yours  =)</p>",
        "id": 216927625,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1605558621
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"222054\">@Gino Canessa</span>  double-check my links to the backport IG (especially in scenarios): <a href=\"https://confluence.hl7.org/display/FHIR/2021-01+Subscriptions+Track\">https://confluence.hl7.org/display/FHIR/2021-01+Subscriptions+Track</a></p>",
        "id": 216948244,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1605569828
    },
    {
        "content": "<p>I also linked to the reference impl in the section that is supposed to describe what servers/clients should come prepared with</p>",
        "id": 216948269,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1605569851
    },
    {
        "content": "<p>Everything looks good to me, thanks!</p>",
        "id": 216994549,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1605614984
    },
    {
        "content": "<p>Ok all, this is an informal poll for timezones. I would like to make sure anyone planning on participating has a chance to dial in during normal waking hours to the track orientation....</p>",
        "id": 217007891,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1605622895
    },
    {
        "content": "<p>If you're participating, let me know what time zone you're in here :) If you know of someone that you think would like to participate, nag them to come provide timezone here by the end of the week so I can schedule the orientation call prior to people being out for holidays :)</p>",
        "id": 217008044,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1605622953
    },
    {
        "content": "<p>I will record the call as well</p>",
        "id": 217008103,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1605622981
    },
    {
        "content": "<p>/poll Informal Poll for Time Zones<br>\nUS Eastern (UTC-5)<br>\nUS Central (UTC-6)<br>\nUS Mountain (UTC-7)<br>\nUS Pacific (UTC-8)</p>",
        "id": 217008916,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1605623384
    },
    {
        "content": "<p>Right now I have this penciled in for Friday, Dec 11 @ 12:00 Central time</p>",
        "id": 218333558,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1606764453
    },
    {
        "content": "<p>let me know if this will be problematic for anyone (I'll wait a bit before publishing the invite)</p>",
        "id": 218333655,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1606764489
    },
    {
        "content": "<p>Orientation meeting: Friday, December 11th at 12:00 Central Time </p>\n<p>Details on confluence: <a href=\"https://confluence.hl7.org/display/FHIR/2021-01+Subscriptions+Track\">https://confluence.hl7.org/display/FHIR/2021-01+Subscriptions+Track</a></p>",
        "id": 218483052,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1606857517
    },
    {
        "content": "<p>Ummm. 11th... Fixed</p>",
        "id": 218483340,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1606857692
    },
    {
        "content": "<p>It looks like we have some Pacific time peeps - everyone ok with a 10:00 Central time kickoff on the first day of the connectathon (Jan 13th)?</p>",
        "id": 218572208,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1606922918
    },
    {
        "content": "<p>And then daily \"wrap ups\" at 16:00 Central time?</p>",
        "id": 218572332,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1606922978
    },
    {
        "content": "<p>We are looking to lean on this track for Davinci alerts and cdex.</p>",
        "id": 218630373,
        "sender_full_name": "Eric Haas",
        "timestamp": 1606948693
    },
    {
        "content": "<p>Gino your app essential does the adt use case right</p>",
        "id": 218630401,
        "sender_full_name": "Eric Haas",
        "timestamp": 1606948714
    },
    {
        "content": "<p>?</p>",
        "id": 218630404,
        "sender_full_name": "Eric Haas",
        "timestamp": 1606948716
    },
    {
        "content": "<p>The RI supports admit (checks for new/update Encounter with status of <code>in-progress</code>).  It will be current with both the R5 version and the R4 backport for the connectathon.  Is there something else you need?</p>",
        "id": 218631982,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1606949656
    },
    {
        "content": "<p>... transfer and discharge ...</p>",
        "id": 218665342,
        "sender_full_name": "Eric Haas",
        "timestamp": 1606984563
    },
    {
        "content": "<p>Yes, I know what the D &amp; T are for =).  I just haven't defined and implemented topics for transfer and discharge yet.  I'm happy to add those topics (and others besides), but I don't know if I'm confident enough in defining them to make reusable (documented) ones.</p>\n<p>E.g., a simple 'encounter end' could be <code>Encounter.status</code> = <code>completed</code> (this mirrors the 'encounter start' in use today).  This would be pretty straightforward to add support for.</p>\n<p>If you are looking for more complex admit/discharge definitions (e.g., using fields in <code>Encounter.hospitalization</code>), I don't have definitions like that yet.  Again, I'm willing to put some time here, but would need others to contribute definitions/experience.</p>\n<p>For transfer, a 'quick' definition would probably just be any change in <code>Encounter.location</code> (again, would likely be simple to implement).  I have no doubt that would be insufficient for actual use, but if that meets testing needs I can add it to my list.</p>\n<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span> Do you have flows defined for connectathon testing already?  If so, I can look at those and see what can be done.</p>",
        "id": 218739590,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1607022278
    },
    {
        "content": "<p>For discharge  I agree the Encounter.status is completed.   in a simple FHIR centric model.    ( Of course as you know for Da Vinci Alerts,  we side stepped what exactly triggers and event leaving that to the implementer to decide)  Transfers are in the eye of the beholder and could be treated as  a discharge and admit in one organization and a transfer in another.  One way it to have the <code>encounter.status</code> still = 'in-progress' and <code>encounter.hospitalization.admitSource</code> =  'transfer'.  But that may not be the way is done IRL.  Our  connectathon testing is very simple and  documented here:  <a href=\"https://confluence.hl7.org/display/FHIR/2021-01+Da+Vinci+-+Notifications\">https://confluence.hl7.org/display/FHIR/2021-01+Da+Vinci+-+Notifications</a></p>",
        "id": 218743610,
        "sender_full_name": "Eric Haas",
        "timestamp": 1607024197
    },
    {
        "content": "<p>I will try to update my app to do subscriptions using your server before the connectathon.</p>",
        "id": 218743790,
        "sender_full_name": "Eric Haas",
        "timestamp": 1607024292
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191401\">Eric Haas</span> <a href=\"#narrow/stream/179229-subscriptions/topic/January.20Connectathon.202021/near/218743610\">said</a>:</p>\n<blockquote>\n<p>Of course as you know for Da Vinci Alerts,  we side stepped what exactly triggers and event leaving that to the implementer to decide</p>\n</blockquote>\n<p>Yes, but you're asking me to implement them  :-)</p>",
        "id": 218745152,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1607024952
    },
    {
        "content": "<p>Makes sense - I have a list of additions/updates for the RI, so I'll add this to my list.  That said, the server is sending subscription-style bundles (<code>history</code> in R4 backport) and not Message Bundles.  Is that an issue?</p>",
        "id": 218745547,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1607025154
    },
    {
        "content": "<p>Reminder that we'll have our kick off tomorrow at 12:00 Central time! It will be recorded for those that can't attend</p>",
        "id": 219549672,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1607643914
    },
    {
        "content": "<p>The track orientation page has been updated with our recording of the overview session.</p>",
        "id": 220031137,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1608061196
    },
    {
        "content": "<p>It would be nice to have some more topics available for testing .. encounters are good, but some other status changes would be nice. By the way (I haven't tested yet): is <a href=\"http://server.subscriptions.argo.run\">server.subscriptions.argo.run</a> up and running when it comes to Subscriptions? There's only 1 topic on that server, and there are no Subscriptions resources at all. Is the data reset every 24hrs ?</p>",
        "id": 221139412,
        "sender_full_name": "René Spronk",
        "timestamp": 1609253560
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"222054\">@Gino Canessa</span> ^^</p>",
        "id": 221232398,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1609351345
    },
    {
        "content": "<p>I know he was working on a few other topics</p>",
        "id": 221232416,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1609351365
    },
    {
        "content": "<p>Documentation is here for the reference implementation: <a href=\"https://microsoft-healthcare-madison.github.io/argonaut-subscription-info/\">https://microsoft-healthcare-madison.github.io/argonaut-subscription-info/</a></p>",
        "id": 221232756,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1609351619
    },
    {
        "content": "<p>Hi Rene, it is online with the September 2019 Connectathon version of the models (there have been a few minor changes since, but there has not been a release for January yet).  I'm in the process of adding Discharge and Transfer topics (among other updates), but those are both Encounter based as well.  Is there a particular topic you would like to see?  As long as it's not too painful to add to the proxy, I'd be happy to do so.</p>\n<p>The subscriptions get cleaned up automatically when they expire, which is forced to (I believe) one hour.  This has been sufficient for testing so far, but I'm happy to extend it if needed.</p>",
        "id": 221235639,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1609354025
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"222054\">@Gino Canessa</span> - the encounter use case is probably the best (realistic) one for testing [and for use in training courses]. During the subscription exercise of the training course I'll run a simple script to create/activate/finish encounters at regular intervals to ensure relevant events will happen. </p>\n<p>According to the docs this is a proxy for the public FHIR R4 server, so I can just point my event-simulator script at that server.  <br>\nBTW, could non-Argonaut topic Canonical URLs be used? I always try to use non-realm-specific artefacts..</p>",
        "id": 221274437,
        "sender_full_name": "René Spronk",
        "timestamp": 1609398912
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> The proxy is what handles all of the subscription work, so it will need to have the subscriptions run through it, as well as any triggering events.</p>\n<p>So far, that is the canonical we've been using (given that no others have/had) been defined.  I can look at what can be done simply next week.</p>",
        "id": 221326399,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1609460361
    },
    {
        "content": "<p>It may make sense to at least have a set of 'example biding' SubscriptionTopic definitions with predefined canonical URLs in R5, e.g. for the equivalent of A01, A02, A03, A04 and some other popular v2 ADT events. (Mind you: the same would be true for TriggerEvents definitions for FHIR messages, but there, given low uptake, this hasn't yet been done).</p>",
        "id": 221345777,
        "sender_full_name": "René Spronk",
        "timestamp": 1609496275
    },
    {
        "content": "<p>Yes, getting that started was the goal of the <a href=\"https://github.com/argonautproject/subscriptions/blob/master/encounters-ig.md\">Argonaut Encounters IG</a> (keeping in mind it is an informal IG).  Once R5 is supported, SubscriptionTopics will be available on the FHIR registry, but without R5 support we can't put them there yet.  At the same time, it doesn't make sense to build out a new directory, since the FHIR registry is a logical place for them to live.</p>\n<p>As to including more topics R5, I'd be happy to support that effort.  I'm not sure what bar needs to be met for 'examples' that have usable canonical URLs (I'll try to bring this up at the next FHIR-I call).  I ask because if we want to build canonical definitions for such common topics (e.g., admission), we probably need to reach out to essentially every working group for feedback.</p>",
        "id": 221549653,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1609779552
    },
    {
        "content": "<p>I think we need at least an informal definitions of the topics for the connectathon, I can't find them.  ( I am not trying to be pedantic, but I think its important to be simple and clear on this point \"Should search or read using the $topic-list operation on the server.\" )</p>",
        "id": 221551461,
        "sender_full_name": "Eric Haas",
        "timestamp": 1609780290
    },
    {
        "content": "<p>So far, I've been using the <a href=\"https://github.com/argonautproject/subscriptions/blob/master/canonical/subscriptiontopic-encounter-start.json\">Encounter Start</a> from the Argo IG.  There is a matching <a href=\"https://github.com/argonautproject/subscriptions/blob/master/canonical/subscriptiontopic-encounter-end.json\">Encounter End</a> defined there as well.</p>\n<p>For the additional topics René asked about, my plan has been to create a 'canonical' version on the GH repo and implement that.  Accessing the server via R5 would also return the topic.</p>",
        "id": 221553031,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1609781013
    },
    {
        "content": "<p>If we need more info available, that's good feedback  =)</p>",
        "id": 221553267,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1609781122
    },
    {
        "content": "<p>I get an error when I try to use my test client endpoint</p>\n<p><a href=\"http://healthedatainc2.pythonanywhere.com/webhook\">http://healthedatainc2.pythonanywhere.com/webhook</a></p>\n<p>\"Failed to connect to Client Host\"  Is there something I am missing?</p>",
        "id": 221733249,
        "sender_full_name": "Eric Haas",
        "timestamp": 1609908082
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191356\">@Jenni Syed</span> <br>\n I am Nipun Garg working with Philips .<br>\nWe are working on Integration area and helping EMR's to connect to different Philips devices/application<br>\nI am identified to execute Subscription track- and for us suitable actor would be client.<br>\nWe would like to test Web Socket connection as Subscription client:<br>\nDo we know any partners(Subscription Server) with whom i can pair and check what they are currently supporting and define by code behavior accordingly</p>",
        "id": 221745447,
        "sender_full_name": "nipun garg",
        "timestamp": 1609923265
    },
    {
        "content": "<p>Even I am try to look for sample message based on the workflow for Websocket using the below link<br>\n<a href=\"http://build.fhir.org/ig/HL7/fhir-subscription-backport-ig/channels.html\">http://build.fhir.org/ig/HL7/fhir-subscription-backport-ig/channels.html</a><br>\nBut I am unable to find the sample URL and message for WS connectivity/Authentication which has to be passed from client to server.</p>",
        "id": 221855063,
        "sender_full_name": "nipun garg",
        "timestamp": 1609992787
    },
    {
        "content": "<p>I thought the Microsoft demo server supported websockets: <a href=\"https://microsoft-healthcare-madison.github.io/argonaut-subscription-info/\">https://microsoft-healthcare-madison.github.io/argonaut-subscription-info/</a></p>",
        "id": 221968525,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1610038731
    },
    {
        "content": "<p><a href=\"https://server.subscriptions.argo.run/metadata\">https://server.subscriptions.argo.run/metadata</a></p>",
        "id": 221968692,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1610038793
    },
    {
        "content": "<p>I see some websocket extensions, at least :)</p>",
        "id": 221968758,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1610038805
    },
    {
        "content": "<p>I know the Cerner server doesn't currently support it</p>",
        "id": 221968900,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1610038857
    },
    {
        "content": "<p>It does, though I am in the process of updating it so it can be used with the backport (it was R5 before).  I'm not sure exactly what is in the current deployed version.</p>",
        "id": 221969473,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1610039061
    },
    {
        "content": "<p>Does this provides the capability to authenticate WS connection using token? <span class=\"user-mention\" data-user-id=\"222054\">@Gino Canessa</span> . Let us know once this is available as we need to test it before Monday so we are prepared for Connectathon</p>",
        "id": 222068810,
        "sender_full_name": "nipun garg",
        "timestamp": 1610110632
    },
    {
        "content": "<p>HI <span class=\"user-mention\" data-user-id=\"191356\">@Jenni Syed</span> <span class=\"user-mention\" data-user-id=\"222054\">@Gino Canessa</span>  . Is the Web Socket server now ready for us to test tomorrow. The Microsoft Server is not up to date. Can you please check and revert as we need to perform a dry run and test with any server which serves Web Socket functionality.</p>",
        "id": 222667710,
        "sender_full_name": "nipun garg",
        "timestamp": 1610584723
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191723\">@nipun garg</span> .  As I have mentioned a few times now, I am working on updates to that server.  Please try to keep in mind this is not a product, but a reference implementation we make available to aid in development and testing.  I will let you know when it is updated.</p>",
        "id": 222669595,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1610586228
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"222054\">@Gino Canessa</span>  for the information . My question was more towards understanding if any partner has registered as WebSocket Server as I couldn't find that information on Test server page list.</p>",
        "id": 222670902,
        "sender_full_name": "nipun garg",
        "timestamp": 1610587552
    },
    {
        "content": "<p>I haven't looked yet (as I've been trying to finish this implementation).  In general, websocket testing has been somewhat light (rest-hook appears to be the general preference), but we'll take a survey and update lists and expectations when we kick off tomorrow.</p>",
        "id": 222671074,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1610587739
    },
    {
        "content": "<p>PSA: the software at <a href=\"http://subscriptions.argo.run\">subscriptions.argo.run</a> has been updated.  If you've been using it previously, note that the server URLs have changed (I've separated out the R4 and R5 endpoints).  The UI in the <code>Playground</code>-&gt;<code>Websocket Playground</code> is still a bit rough, but I plan to keep working on it over the course of the Connectathon.  Feel free to tinker tonight, but I'll plan on doing a walkthrough / tour during the kickoff in the morning.</p>\n<p>I'll also note that I haven't updated the documentation yet.  Depending on how involved the connectathon is, this should be updated within the next couple of days too.</p>\n<p>See you all in the morning, cheers!</p>",
        "id": 222679601,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1610599323
    },
    {
        "content": "<p>Hi All, looking forward to seeing everyone at the kickoff in a little over an hour. In the meantime, I added a signup sheet that you should go add yourself (and your client or Server) to: <a href=\"http://bit.ly/sub1-2021\">http://bit.ly/sub1-2021</a></p>",
        "id": 222727062,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1610635984
    },
    {
        "content": "<p>For info on the Cerner R4/R5 Subscription servers checkout: <a href=\"https://github.com/averyallen/wgm_notes/tree/jan_2021\">https://github.com/averyallen/wgm_notes/tree/jan_2021</a></p>",
        "id": 222741299,
        "sender_full_name": "Avery Allen",
        "timestamp": 1610641295
    },
    {
        "content": "<p>Operation definition in R5: <a href=\"http://build.fhir.org/subscription-operation-get-ws-binding-token.html\">http://build.fhir.org/subscription-operation-get-ws-binding-token.html</a> , will be in the backport IG after ballot.</p>",
        "id": 222745386,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1610642884
    },
    {
        "content": "<p>Noting the issue discovered today during the call that $status in the backport is missing the /id/$status definition  (Logged <a href=\"http://jira.hl7.org/browse/FHIR-30365\">FHIR#30365</a> )</p>",
        "id": 222751500,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1610645254
    },
    {
        "content": "<p>Also noting the question about how to do logical OR vs AND in the backport vs r5. This comes back to this discussion: <a href=\"#narrow/stream/179229-subscriptions/topic/How.20to.20interpret.20multiple.20criteria.20in.20a.20backported.20subscr.2E.2E.2E/near/221802188\">https://chat.fhir.org/#narrow/stream/179229-subscriptions/topic/How.20to.20interpret.20multiple.20criteria.20in.20a.20backported.20subscr.2E.2E.2E/near/221802188</a> was the discussion</p>",
        "id": 222752756,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1610645720
    },
    {
        "content": "<p>Issue: should the status operation (both r4 and r5) support GET  (indicate that operation doesn't affect state) (Logged <a href=\"http://jira.hl7.org/browse/FHIR-30367\">FHIR#30367</a> and <a href=\"http://jira.hl7.org/browse/FHIR-30368\">FHIR#30368</a> for R4 backport and R5)</p>",
        "id": 222752989,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1610645825
    },
    {
        "content": "<p>Log a jira to describe the goal of <a href=\"http://build.fhir.org/ig/HL7/fhir-subscription-backport-ig/#about-this-guide\">http://build.fhir.org/ig/HL7/fhir-subscription-backport-ig/#about-this-guide</a> (clarify it's not functional parity, and that there are IGs that drive you to the backport), clarify that the topic operation assumes that the canonical is defined in an IG or described in the server doc, etc... (Logged <a href=\"http://jira.hl7.org/browse/FHIR-30386\">FHIR#30386</a> )</p>",
        "id": 222753837,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1610646195
    },
    {
        "content": "<p>hey Gino here is my resthook endpoint:  \"<a href=\"http://healthedatainc2.pythonanywhere.com/webhook\">http://healthedatainc2.pythonanywhere.com/webhook</a>\"</p>\n<p>here is a screenshot of the app trying to point to it...</p>\n<p><a href=\"/user_uploads/10155/L1OGxIuSrk5chXz5xSUjYrxD/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/L1OGxIuSrk5chXz5xSUjYrxD/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/L1OGxIuSrk5chXz5xSUjYrxD/image.png\"></a></div>",
        "id": 222759869,
        "sender_full_name": "Eric Haas",
        "timestamp": 1610648567
    },
    {
        "content": "<p>and here is the error  I am getting...</p>\n<p><a href=\"/user_uploads/10155/pdh9s-7xcaNsWdP-SIMGCL-c/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/pdh9s-7xcaNsWdP-SIMGCL-c/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/pdh9s-7xcaNsWdP-SIMGCL-c/image.png\"></a></div>",
        "id": 222759958,
        "sender_full_name": "Eric Haas",
        "timestamp": 1610648608
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>  pushing up now, should be online in about 5 minutes.  In the playground there is now an option for <code>EXTERNAL REST Hook</code> in the channel type.  When selected, there is a text box where you can set the URL for the endpoint to be used.  Note that when using this, notifications will NOT come through to the UI.</p>\n<p><span class=\"user-mention\" data-user-id=\"370716\">@Nandha K</span> , I believe you were looking for the same functionality.</p>",
        "id": 222770823,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1610652912
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"222054\">@Gino Canessa</span> <span class=\"user-mention\" data-user-id=\"191356\">@Jenni Syed</span>  : I have executed the use case with Philips acting as client. Do you want to see and provide nay inputs on the use case executed</p>",
        "id": 222779139,
        "sender_full_name": "nipun garg",
        "timestamp": 1610656090
    },
    {
        "content": "<p>Thanks, Gino it works great....</p>\n<p><a href=\"/user_uploads/10155/ASMAa5mVDeS0qNAoCW7nFGx6/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/ASMAa5mVDeS0qNAoCW7nFGx6/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/ASMAa5mVDeS0qNAoCW7nFGx6/image.png\"></a></div>",
        "id": 222794620,
        "sender_full_name": "Eric Haas",
        "timestamp": 1610663318
    },
    {
        "content": "<p>Outstanding!</p>",
        "id": 222794803,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1610663423
    },
    {
        "content": "<p>is there a complete set of synthea data associated with these patients?</p>",
        "id": 222794923,
        "sender_full_name": "Eric Haas",
        "timestamp": 1610663511
    },
    {
        "content": "<p>Thanks everyone for all the great effort during the connectathon!  And thanks <span class=\"user-mention\" data-user-id=\"191356\">@Jenni Syed</span> in particular!  Have a great weekend everyone.  Cheers!</p>",
        "id": 222933197,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1610748968
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"222054\">@Gino Canessa</span> ! Life saver <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 222933384,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1610749023
    }
]