[
    {
        "content": "<p>X-Post - <a href=\"#narrow/stream/179166-implementers/topic/subscriptions/near/213805700\">https://chat.fhir.org/#narrow/stream/179166-implementers/topic/subscriptions/near/213805700</a></p>\n<p>Hi all - <br>\nI'm building a system for taking FHIR data and mastering (MDM) certain elements, and pushing certain elements to a data lake. The data we get (mostly practitioner/practitionerRole resources) can come in massive batches at times (1000s of resource entries). If that happens, and if we have a SubscriptionTopic and Subscription set up with a rest hook, how will that data be pushed? I know during the querying process, the pagination limits a page to 200 resources. Will the subscription post multiple bundles in that case of 200 resources? Or Would it post a larger bundle? Or would it fail? Any guidance here would be super helpful. I'm sure the 200-item limit is a configuration that can be changed, but my question stands regardless of if the posted bundle is &gt; the limit of # of resources on a page. Thanks in advance</p>",
        "id": 213806935,
        "sender_full_name": "OS",
        "timestamp": 1603122983
    },
    {
        "content": "<p>Interesting question - so far we've been leaving this up to the server's discretion (e.g., when to bundle, and how many).  In this case, we probably do need some way to establish a 'max' for the bundling process, so that the server doesn't try to send more entries than the receiver accepts.  Do you want to open a Jira for this?</p>",
        "id": 213808365,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1603123622
    },
    {
        "content": "<p>Sure thing! Just so I understand though, is the current out-of-the-box behavior that the resources will not be paginated and the (HAPI) FHIR server will try to send the entire set? Or will it still send a paginated/truncated bundle over?</p>",
        "id": 213824394,
        "sender_full_name": "OS",
        "timestamp": 1603131185
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"285887\">OS</span> <a href=\"#narrow/stream/179229-subscriptions/topic/Large.20Message.20Bundle/near/213824394\">said</a>:</p>\n<blockquote>\n<p>Sure thing! Just so I understand though, is the current out-of-the-box behavior that the resources will not be paginated and the (HAPI) FHIR server will try to send the entire set? Or will it still send a paginated/truncated bundle over?</p>\n</blockquote>\n<p>Added the following issue in JIRA: <a href=\"https://jira.hl7.org/browse/FHIR-29315\">https://jira.hl7.org/browse/FHIR-29315</a> and cc'd you on it as well. If you have any thoughts on what the current out-of-box behavior would be, that'd be very much appreciated! Thanks!</p>",
        "id": 213825372,
        "sender_full_name": "OS",
        "timestamp": 1603131679
    },
    {
        "content": "<p>Notification bundles don't have any sort of pagination support.  There's simply a bundle that contains 'x' number of notifications within it.  So far, we've left it entirely up to the server implementation to decide when to bundle multiple notifications together and how many to do.</p>\n<p>I think there should be some way for a client to specify their upper bounds on the notifications, but I don't know if that should be an element on the Subscription or an extension, and if it should be count or size.</p>",
        "id": 213826958,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1603132505
    },
    {
        "content": "<p>It seems to me that it should follow the default paging size for $everything.  That way it's consistent and defaults to 20</p>",
        "id": 213827054,
        "sender_full_name": "David Pyke",
        "timestamp": 1603132560
    },
    {
        "content": "<p>That's an option - though it sets a single expectation instead of leaving it per-client (e.g., a lightweight client connected via websockets has the same hard cap as a large batch-processing server).</p>",
        "id": 213827692,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1603132895
    },
    {
        "content": "<p>Maybe I am missing some context, but why is it expected that with subscription there will be notifications for 1000s of resources?</p>",
        "id": 213828263,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1603133178
    },
    {
        "content": "<p>This could happen, for example, if you have broad subscriptions looking for all changes to resources of a particular type. Imagine a subscription to all changes in Practitioners, coupled with a server that has just performed a transaction-based loading of a pile of practitioners -- a client's subscription could accumulate a bunch of events all at once.</p>",
        "id": 213829413,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1603133731
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191315\">Josh Mandel</span> <a href=\"#narrow/stream/179229-subscriptions/topic/Large.20Message.20Bundle/near/213829413\">said</a>:</p>\n<blockquote>\n<p>This could happen, for example, if you have broad subscriptions looking for all changes to resources of a particular type. Imagine a subscription to all changes in Practitioners, coupled with a server that has just performed a transaction-based loading of a pile of practitioners -- a client's subscription could accumulate a bunch of events all at once.</p>\n</blockquote>\n<p>This is precisely our use case. <br>\nI like your option <span class=\"user-mention\" data-user-id=\"192587\">@David Pyke</span>  - from a developer's point of view, that gives me something that I can start from in my conversations with clients. I totally get your pov <span class=\"user-mention\" data-user-id=\"222054\">@Gino Canessa</span>  - however, I think the safety of having a default to start with would result in more predictable behavior, rather than encountering edge cases  when a server unexpectedly spikes for example. </p>\n<p>In any case, <span class=\"user-mention\" data-user-id=\"222054\">@Gino Canessa</span>  is correct this is an implementation question, I probably need to pose this to a HAPI workgroup. Thanks for the responses!</p>",
        "id": 213833900,
        "sender_full_name": "OS",
        "timestamp": 1603136041
    },
    {
        "content": "<p>Sounds good - please do keep in mind that the decision to batch is (and will stay) up to the server (e.g., whether to batch notifications or send single ones).</p>",
        "id": 213837462,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1603137785
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"222054\">Gino Canessa</span> <a href=\"#narrow/stream/179229-subscriptions/topic/Large.20Message.20Bundle/near/213837462\">said</a>:</p>\n<blockquote>\n<p>Sounds good - please do keep in mind that the decision to batch is (and will stay) up to the server (e.g., whether to batch notifications or send single ones).</p>\n</blockquote>\n<p>Absolutely! Humble suggestion - perhaps the documentation should make that explicit. It may just be me, but when I saw that the results are returned as a bundle, I automatically assumed it was batch (but that may be my own mistake)</p>",
        "id": 213839380,
        "sender_full_name": "OS",
        "timestamp": 1603138671
    },
    {
        "content": "<p>Thanks for the feedback - I'll look at that section when I'm updating docs this week.</p>",
        "id": 213841756,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1603139652
    }
]