[
    {
        "content": "<p>I work on a Radiology reporting package and we spoke with some folks at RSNA about FHIR Cast.  </p>\n<p>I'm a little confused as to the difference between FHIR Cast and Subscriptions.</p>\n<p>I also see some info on replacing CCOW as a standard (which I think is a great idea), but FHIR Cast seems implies an EMR driven workflow to do basic patient/user context sharing, when CCOW was driver agnostic.  This seems like a big limitation, especially in Radiology.  Wondering if anyone can point me in the right direction to where the discussions are going on?</p>",
        "id": 153928660,
        "sender_full_name": "Jeremy Richardson",
        "timestamp": 1515779854
    },
    {
        "content": "<p>right here, pretty much. FHIRCast is just a fancy name for FHIR subscriptions</p>",
        "id": 153928668,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1515793336
    },
    {
        "content": "<p>can you elaborate on why you think it's EMR driven workflow only?</p>",
        "id": 153928669,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1515793352
    },
    {
        "content": "<p>Maybe it's just a missing example, but I see: \"EHR notifies app of change\" here: <a href=\"http://fhircast.org/#synchronize\" target=\"_blank\" title=\"http://fhircast.org/#synchronize\">http://fhircast.org/#synchronize</a><br>\nI don't see an \"App notifies EHR of change\"</p>",
        "id": 153928673,
        "sender_full_name": "Jeremy Richardson",
        "timestamp": 1515794546
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span> perhaps you can enhance this.</p>",
        "id": 153928675,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1515794953
    },
    {
        "content": "<p>Hey @<strong>Jeremy</strong> , I had hoped to describe this with:</p>\n<blockquote>\n<p>For simplicity, the below describes an app synchronizing with an EHR, but any user-facing application can synchronize with FHIRcast. While less common, bidirectional communication between multiple applications is also possible.</p>\n</blockquote>\n<p>But is sounds like that's not clear enough. Overall, the two roles are the \"FHIR Server \"and the \"subscribing app\". We are using the term EHR and app for these two roles. </p>\n<p>I'll update the page to make the above, quoted sentence more explicit.</p>",
        "id": 153928687,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1515797109
    },
    {
        "content": "<p>Jeremy, do you see MModal playing the role of the \"FHIR Server\"?</p>",
        "id": 153928688,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1515797151
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span> For some applications, yes.  However I’m currently interested in context sharing, in particular user, Patient, exam (not sure what the fhir object is called)...  in radiology, every reporting app/pacs combination has its own integration.</p>",
        "id": 153928710,
        "sender_full_name": "Jeremy Richardson",
        "timestamp": 1515876420
    },
    {
        "content": "<p>I’m trying to mentally map the use cases in fhircast to ccow but only see parts.</p>",
        "id": 153928711,
        "sender_full_name": "Jeremy Richardson",
        "timestamp": 1515876554
    },
    {
        "content": "<p>I’m a fhir novice, so I’m sure I’m missing some things</p>",
        "id": 153928712,
        "sender_full_name": "Jeremy Richardson",
        "timestamp": 1515876637
    },
    {
        "content": "<p>One set of questions I had from the patient sync example: <br>\n\"focus\" : [<br>\n    \"Patient/789\",<br>\n    \"Encounter/100009181\"<br>\n  ],<br>\nIs 789 the MRN?  If so, is there a way to disambiguate different assigning systems?<br>\nIf it's not the MRN and is the FHIR server's internal Patient ID, then the client would have to make an additional call to the FHIR server to understand how to map internally.  If this is the case -- well it leads to more questions...</p>",
        "id": 153928714,
        "sender_full_name": "Jeremy Richardson",
        "timestamp": 1515878802
    },
    {
        "content": "<p>yes it's an internal ID, and the client would either have to already have encountered that patient ID and know the patient, or it would have to look it up</p>",
        "id": 153928719,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1515879971
    }
]