[
    {
        "content": "<p>I've seen discussion on building reliable delivery mechanisms from the client side by using eventsSinceSubscriptionStart and so on.  Has anyone seen an open source implementation of this?  I think I need such a mechanism.  No sense in reimplementing the wheel.</p>",
        "id": 252536591,
        "sender_full_name": "Dan Tripp",
        "timestamp": 1631136745
    },
    {
        "content": "<p>Hi Dan, I've been working on a library for this the past few weeks. I'm adding a widget to the reference client UI to POC what a client state-machine would look like, and after that I'm planning to publish an npm package for it. If that's not your stack, I'm also considering rewriting the algorithm in dotnet.</p>",
        "id": 253098452,
        "sender_full_name": "adam strickland",
        "timestamp": 1631543170
    },
    {
        "content": "<p>Right on.  I'm working in Java, but regardless, I'd like to see the state machine part and discuss it.  See you tomorrow / Wednesday, I assume.</p>",
        "id": 253153661,
        "sender_full_name": "Dan Tripp",
        "timestamp": 1631564356
    },
    {
        "content": "<p>I have it on my list to work through this as well - it sounds like a good topic for a breakout session during the connectathon.  We can leave it ad hoc, or schedule something, preferably during a build/test/etc. time.  If you have a preference, just let me know.  Thanks!</p>",
        "id": 253155164,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1631564937
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"222054\">Gino Canessa</span> <a href=\"#narrow/stream/179229-subscriptions/topic/Reliable.20delivery.20implementations/near/253155164\">said</a>:</p>\n<blockquote>\n<p>I have it on my list to work through this as well - it sounds like a good topic for a breakout session during the connectathon.  We can leave it ad hoc, or schedule something, preferably during a build/test/etc. time.  If you have a preference, just let me know.  Thanks!</p>\n</blockquote>\n<p>Scheduling something would be great, if feasible.  I'm flexible time-wise - let me know any time to meet.  I'm trying to figure out how to recover from missed events by using the $events operation, and it's not as straightforward as I had (naively) hoped.</p>",
        "id": 253178819,
        "sender_full_name": "Dan Tripp",
        "timestamp": 1631577660
    },
    {
        "content": "<p>FYI - My edits to the reference implementation are <a href=\"https://github.com/madaster97/argonaut-subscription-client-ui/tree/comm-status-card\">here</a>. It's just a new panel in the playground.</p>",
        "id": 253256628,
        "sender_full_name": "adam strickland",
        "timestamp": 1631628303
    }
]