[
    {
        "content": "<p>We have started to use subscriptions and now we have two questions:<br>\n1. Why Fhir allow us to use only POST method on rest-hook channel? It seems legit to use GET if there is no payload. We have some legacy software that only supports GET requests so now we have to use extensions, is there any better way to do it?</p>\n<p>{<br>\n    \"resourceType\": \"Subscription\",<br>\n    \"criteria\": \"Patient/123\",<br>\n    \"channel\": {<br>\n        \"extension\": {<br>\n            [<br>\n                \"url\": \"<a href=\"http://example.com/fhir/subscription/channel/rest-hook/method\" target=\"_blank\" title=\"http://example.com/fhir/subscription/channel/rest-hook/method\">http://example.com/fhir/subscription/channel/rest-hook/method</a>\",<br>\n                \"valueString\": \"GET\"<br>\n            ]<br>\n        },<br>\n        \"type\": \"rest-hook\",<br>\n        \"endpoint\": \"<a href=\"https://example.com/callback\" target=\"_blank\" title=\"https://example.com/callback\">https://example.com/callback</a>\"<br>\n    }<br>\n}</p>\n<p>2. Fhir suggests us to make a query to the server after receiving rest-hook, but it would be great to get matching Resource Id in callback (maybe somewhere in Headers). Is it Fhir way?</p>",
        "id": 153928627,
        "sender_full_name": "Alexander Ivanov",
        "timestamp": 1515750772
    },
    {
        "content": "<p>I don't think that get is consistent with HTTP semantics. You'll have problems with proxies. So I'm ok with that being something you do with an extension if you have to do it</p>",
        "id": 153928637,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1515758286
    },
    {
        "content": "<p>at the moment, you can either recieve just the POST, or a POST with a whole resource. We haven't had a request for just the id. Why do you want the id?</p>",
        "id": 153928638,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1515758318
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194068\">@Alexander Ivanov</span> , for (1), I think that the reason an HTTP POST is required, is because the notification is logically an update.</p>",
        "id": 153928689,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1515797335
    },
    {
        "content": "<p>.. found it! I am in St Petersburg talking to Alexander about this</p>",
        "id": 153971458,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1529921681
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span> Alexander points out that it isn't necessarily an update... but we certainly don't want a cache to respond on this one. <span class=\"user-mention\" data-user-id=\"194068\">@Alexander Ivanov</span> you're going to get back to us about this after more research</p>",
        "id": 153971459,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1529921744
    },
    {
        "content": "<p>1. We have several internal proprietary legacy services which only supports GET callbacks, but we had already solved this problem with NGINX. So I think POST is fine as a standart default (because of possible caching of GET). <br>\n2. The idea with \"Id\" in header was about simplified search for resource after notification (only for interaction without payload). For example we can insert header:</p>\n<div class=\"codehilite\"><pre><span></span>Location: Patient/c3dc2595-6b61-4b50-8ed7-6e924388f599\n</pre></div>\n\n\n<p>and call for Resource without search, like GET &lt;base_url&gt;/Patient/c3dc2595-6b61-4b50-8ed7-6e924388f599</p>",
        "id": 153972055,
        "sender_full_name": "Alexander Ivanov",
        "timestamp": 1530099027
    },
    {
        "content": "<p>hi Alexander . The second is a little bit cryptic - what has that go to do with id in header&gt; and what's the 'without search' bit?</p>",
        "id": 153972195,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1530129066
    },
    {
        "content": "<p>2.46.6.1 part of documentation describes the following: When the subscriber receives a POST to <a href=\"https://biliwatch.com/customers/mount-auburn-miu/on-result\" target=\"_blank\" title=\"https://biliwatch.com/customers/mount-auburn-miu/on-result\">https://biliwatch.com/customers/mount-auburn-miu/on-result</a>, it re-issues the criteria as a query to the server, appending &amp;_since=:last (where :last is replaced by the time at which the client last checked). In this way it can fetch all new relevant Observations.</p>\n<p>But I’d like to have exact id (path) of updated resource, is there proper way to do it?</p>",
        "id": 153972597,
        "sender_full_name": "Alexander Ivanov",
        "timestamp": 1530286398
    },
    {
        "content": "<p>I think <span class=\"user-mention\" data-user-id=\"194068\">@Alexander Ivanov</span> offers a good idea. Fhir server already know an id of updated/created resource. It may be  more convenient for the clients to get resource directly without search</p>",
        "id": 153972639,
        "sender_full_name": "Aleksandr Sorokin",
        "timestamp": 1530297549
    },
    {
        "content": "<p>For example fhir server may not include <em>_since</em> or <em>_lastUpdated</em> search parameter and the client will receive all the resources, not only those that have been updated</p>",
        "id": 153972640,
        "sender_full_name": "Aleksandr Sorokin",
        "timestamp": 1530298595
    },
    {
        "content": "<p>you can specify the whole resource.  do you have a use case for the id and not the resource?</p>",
        "id": 153972642,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1530299301
    },
    {
        "content": "<p>In our case, Resource can be updated several times in a short period of time. It is convenient to take only the latest version.</p>\n<p>Our product is a broker (dispatcher) of diagnostic requests between clinics and laboratories. Our main subscriptions are subscriptions to ProcedureRequest (ServiceRequest), Task and DiagnosticReport. </p>\n<p>And the main problem is DiagnosticReport subscriptions. DiagnosticReport can contain \"presentedForm\" with base64 encoded resource so it can be large. And also DiagnosticReport can be updated several times in a short period of time because of laboratory uploads some new presentedForms. The clinic could not solve this issue with search criteria because all this DiagnosticReports have the same status \"partial\". So usually clinic waits for about 10 minutes and aggregates \"id\" of Resources which was updated and loads them after. </p>\n<p>We can use the Profile to restrict using base64 encoded values in Attachments and force them to use links to Binary but it will take time. Anyway, it is not permitted by the standard to use our current approach. </p>\n<p>And one more question, what was the initial purpose of using subscriptions without payload, maybe I'm missing some case?</p>",
        "id": 153972664,
        "sender_full_name": "Alexander Ivanov",
        "timestamp": 1530349963
    },
    {
        "content": "<p>Maybe <span class=\"user-mention\" data-user-id=\"196269\">@Aleksandr Sorokin</span> can tell more about the logic behind frequent updates of DiagnosticReport and receiving results by clinic.</p>",
        "id": 153972665,
        "sender_full_name": "Alexander Ivanov",
        "timestamp": 1530350236
    },
    {
        "content": "<p>initial purpose was very simple, supporting mobile apps</p>",
        "id": 153972676,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1530362302
    },
    {
        "content": "<p>you've certainly explained the use case. I'm wondering whether you want just the id, or the version id too?</p>",
        "id": 153972677,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1530362331
    },
    {
        "content": "<p>I think the version id will be redundant because clients are usually interested in the latest version or may get version history if needed, but <span class=\"user-mention\" data-user-id=\"194068\">@Alexander Ivanov</span>  may have an another opinion</p>",
        "id": 153972678,
        "sender_full_name": "Aleksandr Sorokin",
        "timestamp": 1530365693
    },
    {
        "content": "<p>None of our clients asked for version, so I think the only \"id\" field is fine.</p>",
        "id": 153972679,
        "sender_full_name": "Alexander Ivanov",
        "timestamp": 1530366036
    }
]