[
    {
        "content": "<p>I'm listening to a presentation on securing web hooks. The presenter is engineering manager for a web api intermediary. He's arguing that the only truly secure way to secure a web hook is an HMAC signature using PKI that includes some / all of the header + body, particularly including the http timestamp</p>",
        "id": 153992927,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1536036244
    },
    {
        "content": "<p>we haven't talked about this before. thoughts?</p>",
        "id": 153992928,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1536036253
    },
    {
        "content": "<p>One approach is to avoid sending any sensitive info in the hook - it's just a notification to the client &amp; then the client uses normal auth to get the data. This, of course, means potentially more traffic / latency &amp; also assumes that the notification itself doesn't leak information.</p>",
        "id": 153992930,
        "sender_full_name": "Michael Lawley",
        "timestamp": 1536036733
    },
    {
        "content": "<p>Yep we’ve done that - just call a client specified endpoint with client specified headers. No information from the server in the call</p>",
        "id": 153992932,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1536041840
    },
    {
        "content": "<p>You still want to have some kind of signature on the webhook, so that the receiver can verify the webhook came from a trusted party. A potential attack would be denial of, bring down an FHIR server by pretending to send subscription notifications from it.</p>",
        "id": 153992959,
        "sender_full_name": "Nick Hatt",
        "timestamp": 1536067104
    },
    {
        "content": "<p>Grahame - I've been imagining a signed JWT, a la <a href=\"https://cds-hooks.org/specification/1.0/#trusting-ehrs\" target=\"_blank\" title=\"https://cds-hooks.org/specification/1.0/#trusting-ehrs\">CDS Hooks</a> for the case where the FHIR server must authenticate to the subscriber.  I'd argue that there's no \"truly secure way\" to do anything, rather it's about risk tolerance.</p>",
        "id": 153992966,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1536068204
    },
    {
        "content": "<p>does a signed jwt bring anything over a simpler hash?</p>",
        "id": 153993165,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1536093759
    }
]