[
    {
        "content": "<p>Currently, FHIR Subscriptions are invoked whenever an action on a resource is performed, even if it doesn't change the resource's contents. Is it possible to configure the FHIR server to call Subscription only when the content of the resource is changed?</p>",
        "id": 182448007,
        "sender_full_name": "Sohrab Hejazi",
        "timestamp": 1575379993
    },
    {
        "content": "<p>Subscriptions are being reworked at the moment to change to event-based subscriptions.</p>",
        "id": 182451465,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1575382281
    },
    {
        "content": "<blockquote>\n<p>Subscriptions are being reworked at the moment to change to event-based subscriptions.</p>\n</blockquote>\n<p>I have to wait for a new release? if yes, how long does it take?</p>",
        "id": 182455255,
        "sender_full_name": "Sohrab Hejazi",
        "timestamp": 1575384522
    },
    {
        "content": "<p>You always have the option to pre-adopt something ;-) .. see <a href=\"http://build.fhir.org/subscription.html\" target=\"_blank\" title=\"http://build.fhir.org/subscription.html\">http://build.fhir.org/subscription.html</a> and <a href=\"http://build.fhir.org/topic.html\" target=\"_blank\" title=\"http://build.fhir.org/topic.html\">http://build.fhir.org/topic.html</a> . Both are maturity level 0, so be warned:  they are likely to change.</p>",
        "id": 182456280,
        "sender_full_name": "René Spronk",
        "timestamp": 1575385099
    },
    {
        "content": "<blockquote>\n<p>You always have the option to pre-adopt something ;-) .. see <a href=\"http://build.fhir.org/subscription.html\" target=\"_blank\" title=\"http://build.fhir.org/subscription.html\">http://build.fhir.org/subscription.html</a> and <a href=\"http://build.fhir.org/topic.html\" target=\"_blank\" title=\"http://build.fhir.org/topic.html\">http://build.fhir.org/topic.html</a> . Both are maturity level 0, so be warned:  they are likely to change.</p>\n</blockquote>\n<p><span aria-label=\"+1\" class=\"emoji emoji-1f44d\" role=\"img\" title=\"+1\">:+1:</span></p>",
        "id": 182457633,
        "sender_full_name": "Sohrab Hejazi",
        "timestamp": 1575385850
    },
    {
        "content": "<p>I'm not sure that this actually deals with this issue. <span class=\"user-mention\" data-user-id=\"222054\">@Gino Canessa</span> there's nowhere where we say 'only if it actually changes' (or let the client say that)</p>",
        "id": 182483464,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1575399813
    },
    {
        "content": "<p>If you are asking for notifications on <code>Update</code> of  a resource, right now it's the server's discretion on when that should be triggered (e.g., actual diffs vs anytime an operation occurs).  We don't have any guidance in place for it, but will add to my list to be clarified in docs (even if just describing that it is up to the server).</p>\n<p>I will also bring the concept up for discussion - if one or the other should be considered 'default', but am concerned that requiring either behavior won't get any consensus (whatever a system does internally, it would be significant to implement the other behavior).</p>\n<p>That said, a topic can be defined describing the behavior (e.g., an <code>Update</code> which results in a detectable change) so that clients and servers can be on the same page.  Depending on the outcome of the discussions, it may be easier to just define a canonical topic for each (e.g., any update to a resource, updates with changes) so that servers and clients can all be on the same page.</p>",
        "id": 182516835,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1575423655
    },
    {
        "content": "<p>My server doesn't know whether the resource has changed on update.</p>",
        "id": 182517339,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1575424503
    },
    {
        "content": "<blockquote>\n<p>My server doesn't know whether the resource has changed on update.</p>\n</blockquote>\n<p>Exactly.  For your server, that will be the behavior and it is quite unlikely you will support the other.  I imagine there are servers that operate in the opposite way.  Whichever the server supports should be clear to clients, but whether it is via topics or general guidance/conformance should be decided.</p>",
        "id": 182568868,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1575475143
    },
    {
        "content": "<p>We also most often just know something happened, not necessarily what changed. And sometimes that change may be in data that isn't exposed via the FHIR resource.</p>",
        "id": 182665108,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1575557058
    },
    {
        "content": "<p>Since servers can now advertise topics, I assume they would only advertise the topics they can meet?</p>",
        "id": 182665144,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1575557094
    },
    {
        "content": "<p>And (similar to what we've discussed before) sometimes it's the functional spirit of the Topic rather than the technical description. EG: an ADT type subscription - we may know an event occurred that should qualify, but it may not qualify to the exact diff as defined in the topic since that looks at field value changes.</p>",
        "id": 182665333,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1575557199
    }
]