[
    {
        "content": "<p>We are building a FHIR system where the data is ingested through FHIR, but then needs to be transformed by a separate service. I'm trying to find the balances between writing a custom interceptor to take that data after it's been saved and send that data to our job queue (MSK/Kafka) or whether to use Subscriptions with Kafka-rest. I think I've settled on the latter approach, but wanted to post here to see if folks had any thoughts, feedback. Are subscriptions any more or less reliable than using interceptors to kick off that job? Also - will subscriptions change signnificantly enough from an implementation standpoint in R5 that we'll have to re-do our architecture?</p>",
        "id": 214217622,
        "sender_full_name": "OS",
        "timestamp": 1603386573
    },
    {
        "content": "<p>Re: \"interceptors,\" this isn't a standardized FHIR concept; I'm guessing you're using a HAPI server + its <a href=\"https://hapifhir.io/hapi-fhir/docs/interceptors/interceptors.html\">interceptor framework</a>?</p>",
        "id": 214261028,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1603410529
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191315\">Josh Mandel</span> <a href=\"#narrow/stream/179229-subscriptions/topic/Subscription.20vs.2E.20Interceptor.2FHook/near/214261028\">said</a>:</p>\n<blockquote>\n<p>Re: \"interceptors,\" this isn't a standardized FHIR concept; I'm guessing you're using a HAPI server + its <a href=\"https://hapifhir.io/hapi-fhir/docs/interceptors/interceptors.html\">interceptor framework</a>?</p>\n</blockquote>\n<p>That's exactly right. I'll post there as well. But I'd be curious if anyone from this group has thought about this. Since (it seems to me) many requirements can be achieved by either approach. Of course Subscriptions seem to be the natural better option (no custom code that needs to be written/maintained/tested/etc, and it's part of the standard rather than interceptors being specific go HAPI), but just wanted to ask. For example, are there any inherent risks in using Subscriptions that would be overcome by interceptors and vice versa?</p>",
        "id": 214319610,
        "sender_full_name": "OS",
        "timestamp": 1603463004
    },
    {
        "content": "<p>One of the goals for r5 subscriptions has been to support this pattern -- e.g., allowing registration of subscriptions to broad topics like \"any Practitioner resource update\" or \"any Organization change\". This reflects what some of the cloud servers do with message queues, and would help provide a more standard pattern (but it's still relatively early days).</p>",
        "id": 214323306,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1603464675
    }
]