[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"222054\">@Gino Canessa</span> I've managed to get to actual connectathoning and I've been talking to <span class=\"user-mention\" data-user-id=\"191356\">@Jenni Syed</span> about the SubscriptionTopic resource, specifically the canFIlterBy bit</p>",
        "id": 187230385,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1580697536
    },
    {
        "content": "<p>I found it obtuse around canFilterBy, how the filters work. The definition specifically says that it's 'search parameters', but the definitions of the match types confuse the issure</p>",
        "id": 187230397,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1580697587
    },
    {
        "content": "<p>I'd like to be able to pass filter parameters into fhirpath expressions as well.</p>",
        "id": 187230439,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1580697616
    },
    {
        "content": "<p>with that in mind, it would be good if you could have more than one FHIRPath expression, so that you could have iff(%parameter.exists()).else()  etc without having to have on massive complicated one</p>",
        "id": 187230448,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1580697666
    },
    {
        "content": "<p>and if we could clearly say just what the expectations are here. Obviously there's 2 disparate interests: what are the filters you can use in a subscription (which we all share) and how do they actually work (which a subset of servers are interested in, including mine)</p>",
        "id": 187230456,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1580697719
    },
    {
        "content": "<p>another related question: the implementation parts of subscription topic can get complicated once you start dealing with the create/update/delete, even if their surface is similar. I'm wondering whether there's a need/space for doing something about this to have different implementation details for filter parameters depending on method?</p>",
        "id": 187230513,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1580697814
    },
    {
        "content": "<p>even if you (like Isaac) aren't sure about the merits of passing variables to FHIRPath expressions, I think that generically a server is going to have some criteria that are done well at the index level and others that are done well at the instance level</p>",
        "id": 187230568,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1580697916
    },
    {
        "content": "<p>For the method specifics - we had some discussion around that specifically about delete... I need to confirm where it landed</p>",
        "id": 187230572,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1580697947
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  What is an example of something that you would like the parameters in fhirpath vs. where it can't be done (or it's not clear it can be done) today?</p>",
        "id": 187230613,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1580697995
    },
    {
        "content": "<p>Yes, this has been a complicated area to balance: the more flexible we make the base, the more complicated it is to implement.</p>",
        "id": 187230623,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1580698071
    },
    {
        "content": "<p>For the multiple expressions, do you have any ideas on how to do multiple simply?  I was initially figuring multiple would be and/or, but in your case you're looking for an else</p>",
        "id": 187230670,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1580698139
    },
    {
        "content": "<p>multiple expressions - all must be true.</p>",
        "id": 187230722,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1580698216
    },
    {
        "content": "<p>or any must be true  - it just flips the way you write them</p>",
        "id": 187230726,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1580698232
    },
    {
        "content": "<p>Yes, we have been trying to avoid making the definitions too complicated (e.g., having another field specifying <code>and</code> vs <code>or</code>)</p>",
        "id": 187230740,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1580698296
    },
    {
        "content": "<p>Jenni - examples: anything for which there isn't a search parameter is something you can't do</p>",
        "id": 187230747,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1580698319
    },
    {
        "content": "<p>right. So just pick one - my point is, you can write the expressions to meet whatever we pick</p>",
        "id": 187230790,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1580698361
    },
    {
        "content": "<p>re: canFilterBy: is there a language that can be used to specify subsets for fhirPath easily?  We want to make sure committing to support of a topic doesn't balloon into supporting all kinds of chaining and paths</p>",
        "id": 187230846,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1580698468
    },
    {
        "content": "<p>re: multiple fhirPath: works for me.  I've added to my notes for the next pass of discussion and updates</p>",
        "id": 187230860,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1580698508
    },
    {
        "content": "<p><a href=\"http://hl7.org/fhir/fhirpath.html#simple\" target=\"_blank\" title=\"http://hl7.org/fhir/fhirpath.html#simple\">http://hl7.org/fhir/fhirpath.html#simple</a> - but also, no resolve()</p>",
        "id": 187230907,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1580698616
    },
    {
        "content": "<p>we can start with that and relax things as we need, maybe</p>",
        "id": 187230914,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1580698664
    },
    {
        "content": "<p>Looks good to work from</p>",
        "id": 187230916,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1580698682
    },
    {
        "content": "<p>well, good, but chaining and paths is something that's more seriously a problem for the search parameters, - that's also something that isn't talked about</p>",
        "id": 187231008,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1580698810
    },
    {
        "content": "<p>Yep... it's something we've discussed, but hadn't necessarily resolved yet either.</p>",
        "id": 187275388,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1580745766
    },
    {
        "content": "<p>It sounds like until there is a reasonable approach for chaining and paths for search parameters, SubscriptionTopic should avoid trying to include it for now. Or is there an argument to try to address chaining and paths in parallel for search parameters and ST?</p>",
        "id": 187276654,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1580746504
    },
    {
        "content": "<p>Not that I'm aware of.  The challenge has been how to specify and what the exact exclusions are.</p>",
        "id": 187276865,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1580746620
    }
]