[
    {
        "content": "<p>How can I determine whether a server supports subscriptions based on looking at its CapabilityStatement?</p>\n<p>Does the presence of the Subscription resource in <code>CapabilityStatement.rest.resource.type</code> imply that the server actually supports the behaviour of pushing out a notification when the criteria is matched? Or just that it can store the resource itself, for example?</p>\n<p>How would I be able to tell which channels are supported by the server?</p>",
        "id": 206774012,
        "sender_full_name": "John Grimes",
        "timestamp": 1597284403
    },
    {
        "content": "<blockquote>\n<p>Subscriptions are active resources; a server can only accept a subscription if it will execute the specified channel for any resources subsequently received. </p>\n</blockquote>\n<p>From <a href=\"http://build.fhir.org/subscription\">http://build.fhir.org/subscription</a> get that your first question in the affirmative. There is no defined behavior where a server just stores subscription records without acting on them.</p>",
        "id": 206813296,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1597324699
    },
    {
        "content": "<p>regarding channel types, I don't <em>think</em> there is an upfront automated discovery process, but a server will reject a subscription that requests a channel type it does not support. Server documentation would typically describe support a channel types for developers to interpret. We have had some discussion about providing more discovery capabilities here, but value proposition is not totally clear to me until we have more experience with the overall interaction pattern.</p>",
        "id": 206813563,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1597324886
    },
    {
        "content": "<blockquote>\n<p>a server will reject a subscription that requests a channel type it does not support</p>\n</blockquote>\n<p>if they're active</p>",
        "id": 206815420,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1597325944
    }
]