[
    {
        "content": "<p>I just got informed that the Subscription now supports a return of certain fields, for example in the web sockets a ping can also return the logical id of the resource causing the ping AND it can even be configured to send the resource itself. But the FMM level has gone from 3 to 0. When was this done? Is there a version of HAPI FHIR that supports this or is there any server out there that supports this?</p>\n<p>As an aside, I am assuming the MIME type for the logical id is <code>application/text</code> and that for the resource is <code>application/fhir+json</code></p>",
        "id": 175285488,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1568064986
    },
    {
        "content": "<p>We're in the process of a re-design targeting R5. Current released HAPI support is for FHIR R4 (including support for R4 Subscriptions).</p>",
        "id": 175285857,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1568065293
    },
    {
        "content": "<p>Right now we're relatively early in the process of that redesign; we'll be testing at the connectathon.</p>",
        "id": 175285864,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1568065310
    },
    {
        "content": "<blockquote>\n<p>Right now we're relatively early in the process of that redesign; we'll be testing at the connectathon.</p>\n</blockquote>\n<p>So I assume that  I am not able to take advantage of the 'ping' in a websockets subscription of sending the logical id of the resource that caused the ping?  It would certainly save me lots of code!</p>",
        "id": 175285980,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1568065403
    },
    {
        "content": "<p>Not <em>yet</em>, but being able to support <code>id-only</code> payloads for the various channel types, including web sockets, is definitely in scope.</p>",
        "id": 175286131,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1568065535
    },
    {
        "content": "<p>We've been focused on rest hooks so far, but will also be looking at incorporating web sockets into our reference implementation (<a href=\"https://subscriptions.argo.run\" target=\"_blank\" title=\"https://subscriptions.argo.run\">https://subscriptions.argo.run</a>).</p>",
        "id": 175286200,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1568065577
    },
    {
        "content": "<p>websockets are the way to got for simple clients (like an Android app) as they can be implemented in any wifi environment, including a hotel. There was a lot of playing around with my home router to get rest hooks to work ... an unlikely action I would ever be able to take at a hotel!</p>",
        "id": 175286387,
        "sender_full_name": "Brian Reinhold",
        "timestamp": 1568065737
    },
    {
        "content": "<p>Oh, for sure -- rest hooks are useful for systems that stay put (e.g., cloud servers). Though I should mention that a big piece of how we expect mobile apps to get notified would be through FHIR Server --[REST Hooks]--&gt; Cloud Endpoint, and from the cloud endpoint to a mobile \"edge\" device via push messaging.</p>",
        "id": 175287306,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1568066604
    },
    {
        "content": "<p>Keeping a web socket on all the time also has its challenges -- including when your device is low on battery, or turned off, etc.</p>",
        "id": 175287383,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1568066672
    },
    {
        "content": "<p>Brian, on iOS we would have pings to back through Apple Push Notification Service (APNs) to the device, I'm assuming there's something similar for Android.</p>",
        "id": 175349676,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1568130110
    }
]