[
    {
        "content": "<p>I see that thet Topic resource has not been formally proposed. I believe that the name will need some work - \"Topic\" is too board a subject, since it is only one kind of topic. \"SubscriptionTopic\" or something will be required for FMG to accept it</p>",
        "id": 181621813,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1574415022
    },
    {
        "content": "<p>Need to figure out if it will also be used to drive messaging independent of a subscription.  If so, name will need to reflect that scope.</p>",
        "id": 181622310,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1574415546
    },
    {
        "content": "<p>A name with \"Event\" in it would probably be appropriate..</p>",
        "id": 181629098,
        "sender_full_name": "René Spronk",
        "timestamp": 1574421900
    },
    {
        "content": "<p>I worry about \"Event\" as that seems to indicate that you're looking for a specific <em>action</em> rather that specific state changes/categories of things</p>",
        "id": 181645522,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1574435115
    },
    {
        "content": "<p>I'm also not sure how I feel yet about using this to drive messaging. Haven't let that sink in yet</p>",
        "id": 181645617,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1574435134
    },
    {
        "content": "<p>It definitely wasn't designed for that - it was designed for the larger pub/sub concept of a topic</p>",
        "id": 181645751,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1574435156
    },
    {
        "content": "<p>(doesn't mean it can't change)</p>",
        "id": 181645823,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1574435165
    },
    {
        "content": "<p>EventCategory or EventType or TriggerType (as a name) might do the trick. The thing is that \"specific state changes/categories of things\" may be a cause/trigger of many other actions, such as Subscriptions, Messages, or Tasks. There may be others we aren't even currently aware of.</p>",
        "id": 181709922,
        "sender_full_name": "René Spronk",
        "timestamp": 1574504432
    },
    {
        "content": "<p>From developers' perspective, <code>Topic</code> is a more common and familiar term for this concept (especially in the context of webhooks), so there is an advantage in keeping the term Topic –or something like SubscriptionTopic as grahame proposed above.</p>",
        "id": 181889394,
        "sender_full_name": "Mohammad Jafari",
        "timestamp": 1574742707
    },
    {
        "content": "<p>Hmm - likewise I could argue that the plain old \"TriggerEvent\" has been used in (HL7) messaging for decades and that it would \"therefore\" from an implementers perspective be the best name. But I'm not suggesting that in any way. <br>\nNaming things is difficult, especially if they're used for multiple purposes. You tend to end up with generic names that aren't really liked by any party involved, but still kind of indicate what we're talking about. It's called compromise..<br>\nFirst of all we'll have to determine (as Lloyds points out) if Topic (mainly aimed at a subscription scenario) is the same thing as trigger event (mainly used for messaging), and whether there are other similar use cases that could be grouped with these 2.</p>",
        "id": 181891758,
        "sender_full_name": "René Spronk",
        "timestamp": 1574746044
    },
    {
        "content": "<p>I strongly endorse Topic for continuity with existing pub/sub language. Just needs a qualifying word added</p>",
        "id": 181892306,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1574747005
    },
    {
        "content": "<p>I agree with Topic. That is the term IHE uses in DSUB (not FHIR, but XDS). Would be nice to have Subscription use similar terms. Yes these become trigger events, but that is under the Given-When-Then-SoThat pattern of action.</p>",
        "id": 181925812,
        "sender_full_name": "John Moehrke",
        "timestamp": 1574778476
    },
    {
        "content": "<p>So, <code>SubscriptionTopic</code>?</p>",
        "id": 181935586,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1574783939
    },
    {
        "content": "<p>Except that the use isn't necessarily limited to Subscription - we need to confirm the scope before we define the name</p>",
        "id": 181946048,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1574790572
    },
    {
        "content": "<p>Knowing that it's likely each name will have a singular vote... <span aria-label=\"rolling eyes\" class=\"emoji emoji-1f644\" role=\"img\" title=\"rolling eyes\">:rolling_eyes:</span></p>",
        "id": 181947266,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1574791317
    },
    {
        "content": "<p>/poll Topic Resource Name Should Be (please add proposals if you have them)<br>\nTopic<br>\nSubscriptionTopic<br>\nEventTopic<br>\nNotificationTopic<br>\nTriggerTopic<br>\nStateChangeTopic</p>",
        "id": 181947321,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1574791338
    },
    {
        "content": "<p>I could be ok with SubscriptionTopic - but only if we've confirmed that it won't be relevant elsewhere.</p>",
        "id": 181950212,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1574793355
    },
    {
        "content": "<p>I'm feeling particularly decisive today !</p>",
        "id": 181952526,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1574794783
    }
]