[
    {
        "content": "<p>Catching up on the new way of dealing with subscriptions: MessageHeader.eventURI is effectively the same concept as Topic.url, and Topic is (in the sense of messaging) a trigger event definition. If correct, we may have to go for a redesign of the MessageHeader, or at the least document the fact that MessageHeader.eventURI could be the canonical URL of a Topic resource.</p>",
        "id": 180116835,
        "sender_full_name": "René Spronk",
        "timestamp": 1573120454
    },
    {
        "content": "<p>I would say that subscription topics are a proper subset of messaging events.</p>",
        "id": 180144706,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1573141591
    },
    {
        "content": "<p>OK, so what would be an example of something that's a messaging trigger event and not a topic/event used for a subscription? You must know of some, because you use the word \"subset\"..</p>",
        "id": 180403448,
        "sender_full_name": "René Spronk",
        "timestamp": 1573457629
    },
    {
        "content": "<p>I could send in a complex query as a message.  That wouldn't make sense as a topic.  I could also request any number of things.  Topics must, by definition, be events that can be triggered on the target server.</p>",
        "id": 180426787,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1573481988
    },
    {
        "content": "<p>Agree that queries are a good example: although: why should one not be able to subscribe to some queries as sent to a server? Other than that the overlap is rather substantial, should we merge Topic and EventDefinition ?</p>",
        "id": 180430399,
        "sender_full_name": "René Spronk",
        "timestamp": 1573484636
    },
    {
        "content": "<p>It doesn't really make sense to subscribe to someone submitting an arbitrary query.  We could potentially merge the resources, but we should be able to differentiate what the topic is allowed to be used for - subscription, messages or both.</p>",
        "id": 180431878,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1573485707
    },
    {
        "content": "<p>Well, EventDefintion/Topic could be the reason for creating a Task, and the \"if your receive an query of type x (at the server) route it to me\" scenario (albeit not a classic subscription scenario) may actually have value. Adding a code of sorts to indicate the intended usage of the Topic/EventDefintion won't do any harm, although personally I don't see a lot of value in it.</p>",
        "id": 180432296,
        "sender_full_name": "René Spronk",
        "timestamp": 1573486046
    },
    {
        "content": "<p>If a topic isn't flagged as allowed for a subscription, then you can't use it for a subscription.  That'll be pretty important to servers who will likely end up hardwiring what topics they support subscriptions for.</p>",
        "id": 180432786,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1573486349
    },
    {
        "content": "<p>that's certainly true.</p>",
        "id": 180448533,
        "sender_full_name": "René Spronk",
        "timestamp": 1573497870
    }
]