[
    {
        "content": "<p>The US CMS Rule released this year (it seems like so long ago) requires that the patient name, practitioner name and organization name be part of the notification payload.  Has any thought gone into how that might be accomplished through the SusbscriptionStatus or other means?</p>",
        "id": 209833435,
        "sender_full_name": "David Pyke",
        "timestamp": 1599857388
    },
    {
        "content": "<p>Having a Patient reference on the SubscriptionStatus seems like a not-horrible idea from a patient access control/compartmentalization perspective.  If that happened, you could stick the name in Reference.display.  What practitioner and organization do they want the name of?</p>",
        "id": 209834487,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1599857931
    },
    {
        "content": "<p>The practitioner part of a condition/encounter/etc and the organization sending the notification.</p>",
        "id": 209834557,
        "sender_full_name": "David Pyke",
        "timestamp": 1599857977
    },
    {
        "content": "<p>There are a lot of practitioners on encounter and quite a few other resources</p>",
        "id": 209834658,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1599858032
    },
    {
        "content": "<p>And those individuals might not have anything to do with the event that led to the notification...</p>",
        "id": 209834700,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1599858060
    },
    {
        "content": "<p>Yes, so either the notificaiton becomes a complex bundle or the names need to be added to a SubscriptionStatus</p>",
        "id": 209834712,
        "sender_full_name": "David Pyke",
        "timestamp": 1599858069
    },
    {
        "content": "<p>It also means that \"identifier only\" or \"ping only\" becomes impossible, because the patient name (especially when combined with provider name) would be sensitive.</p>",
        "id": 209834802,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1599858121
    },
    {
        "content": "<p>Right, so under CMS, you must send PHI and then everything goes bad.  This might be needing part of USCore to profile SubscriptionStatus or the notification bundle</p>",
        "id": 209834935,
        "sender_full_name": "David Pyke",
        "timestamp": 1599858192
    },
    {
        "content": "<p>Umm, to me that sounds like a complete perversion of Subscription notification. I look at the CMS Rule as a functional requirement - the information must  get to the other side. When you you use a subscription notification, it is the responsibility of the recipient to fetch the information based on the notification, it is not a requirement to stuff everything into a ping.</p>",
        "id": 209836619,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1599859299
    },
    {
        "content": "<p>The Rule seems to clearly state this must be part of the notification.  CMS was likely thinking that we'd all use V2 msssages</p>",
        "id": 209836706,
        "sender_full_name": "David Pyke",
        "timestamp": 1599859339
    },
    {
        "content": "<p>Functional requirement vs. technical implementation.</p>",
        "id": 209836761,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1599859385
    },
    {
        "content": "<p>Yes, the requirement states that it must include these three datapoints.  How you get them there is not mentioned.  You can wrap them on a pigeon leg but they must be included in the notification</p>",
        "id": 209836829,
        "sender_full_name": "David Pyke",
        "timestamp": 1599859431
    },
    {
        "content": "<p>I don't think we would put actual resources on SubscriptionStatus:</p>",
        "id": 209841568,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1599862382
    },
    {
        "content": "<p>1). those bundle up many notifications... some that won't have a patient at all.. some that will have many patients... some that have other types of personas instead</p>",
        "id": 209841596,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1599862416
    },
    {
        "content": "<p>2) I would rather put provide that as the \"related\" in the bundle if requested by the subscriber</p>",
        "id": 209841695,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1599862479
    },
    {
        "content": "<p>similar to Lloyd's question here: <a href=\"#narrow/stream/179229-subscriptions/topic/Subscription.20notifications.20with.20'includes\">https://chat.fhir.org/#narrow/stream/179229-subscriptions/topic/Subscription.20notifications.20with.20'includes</a>'</p>",
        "id": 209841740,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1599862515
    },
    {
        "content": "<p>Also, those are very often fields that are set in the display field for a reference (vs even requiring the \"include\")</p>",
        "id": 209841953,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1599862661
    },
    {
        "content": "<p>so it may not even need the include... ?</p>",
        "id": 209841970,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1599862680
    },
    {
        "content": "<p>It is interesting that it would not allow for id only...</p>",
        "id": 209842033,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1599862715
    },
    {
        "content": "<p>I agree with Jenni that these don't belong in the <code>SubscriptionStatus</code> element.  They are not meta-information about the subscription or message, but part of the payload (e.g., some subscriptions will have them, others will not).</p>\n<p>I would guess that we need to ensure we define how to do chaining or graphs of resources (since it also includes 'diagnosis where not prevented by local law', which is not something you can add a single field for).</p>\n<p>I'd also say that we may want to revisit the channels to see if an additional channel type makes sense in the core spec - something that offers asymmetric encryption and/or some other security to make this more feasible.</p>",
        "id": 209843217,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1599863594
    },
    {
        "content": "<p>Why put in the whole resource when only the names are needed?</p>",
        "id": 209881391,
        "sender_full_name": "David Pyke",
        "timestamp": 1599916961
    },
    {
        "content": "<p>Generally, my thoughts stem from the fact that the target of subscriptions is not \"2020 ONC Rules\".  There are a lot of use cases across a lot of regions, and fixing core components to match (today's) rules of a particular country feels off.  My goal is to ensure there are mechanisms to allow for this in a way flexible enough that when next year's rule comes out we don't have to redesign the resource to make it work.  Same with requirements from other regions.</p>\n<p>Additionally, we've established that demographic information in a notification is payload data.  If we start adding payload fields to header information, we are back in the same situation (everyone will want the fields for <em>their</em> use case).</p>\n<p>Beyond those, many implementers have <strong>strongly</strong> expressed concerns over sending PHI over the current channels.  Many use cases ask for things like source, destination, etc. to be available during every hop.  Enforcing the line between header (no PHI) and payload (PHI) leaves more flexibility for things like encrypted payloads with non-encrypted headers.</p>",
        "id": 209889925,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1599929723
    },
    {
        "content": "<p>I think is not appropriate to mix FHIR Subscription Notifications with functional requirements on notifications as business objects. Functional notifications, i.e. transmitting the information that an event has occurred, and the related circumstances, can be implemented using various mechanisms.</p>\n<p>If the mechanism is FHIR Messaging, then you have <strong>one step transmission</strong> using  the FHIR Message to encompass the fact that there was an event of interest, and all the related circumstances of the event as determined by the sender.</p>\n<p>If the mechanism is FHIR Subscriptions, you have <strong>two-step transmission</strong>, where the first step is the FHIR Subscription Notification, indicating the event has occured, and the second (and potentially more) step(s) involve the retrieval of all the related circumstances as determined by the consumer, and here is where the minimal functional requirements need to be translates as requirements for the sender to provide the FHIR RESTfull API access to the resources satisfying these minimal requirements.  Yes, within FHIR subscriptions you have the options of id-only vs. other types of content in the notification, but the fundamental point here is that CMS Rule Notifications as business/functional requirements are fully met with this two-step transmission (including id-only notifications).</p>",
        "id": 209895672,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1599938150
    },
    {
        "content": "<p>How is requiring a fetch of additional information fulfilling the requirement that the notification have those three data points?a  The notification doesn't have them, you are required to fetch them as a second step?  The CMS Rule states that the notification have the data points, not that they are available through extra work.</p>",
        "id": 209895901,
        "sender_full_name": "David Pyke",
        "timestamp": 1599938443
    },
    {
        "content": "<p>Because the CMS Rules notification is a business requirement, that can be met by a variety of methods. The Implementation Guide's job is to describe the method, including the technical requirements to satisfy the business requirement. You can think of the CMS Rule notification as an IHE transaction that has two parts - POSTing the notification, and GETing the relevant information.</p>",
        "id": 209896634,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1599939552
    },
    {
        "content": "<p>The Rule states: \" sends notifications that would have to  include the minimum patient health information (which, as noted above, would be the patient’s name, treating practitioner name, sending institution name, and, if not prohibited by other applicable law, patient diagnosis);\"  Having them not include that information but it being available for retrieval is a very loose interpretation of the Rule.  I'm not sure that CMS would approve of your interpretation.</p>",
        "id": 209899339,
        "sender_full_name": "David Pyke",
        "timestamp": 1599943864
    },
    {
        "content": "<blockquote>\n<p>Having them not include that information but it being available for retrieval is a very loose interpretation of the Rule.</p>\n</blockquote>\n<p>That is only \"half interpretation\" - the IG specifies, and subsequent certification tools need to test both:</p>\n<ul>\n<li>the sender properly sends a FHIR Subscription Notification</li>\n<li>the sender has the required data available for retrieval</li>\n</ul>\n<p>and</p>\n<ul>\n<li>the receiver accepts an appropriate FHIR notification</li>\n<li>the receiver automatically retrieves the required and any additional data available.</li>\n</ul>\n<p>This is not a \"loose interpretation\" - it is the translation of a business requirement into a technical specification. The main reason for pursuing a FHIR Subscription based implementation, is to build upon the RESTful capabilities already present in the source systems (and to create/expand them where they are lacking). If it weren't for that, why not create a $adt-notification operation, define the payload, and move on?</p>",
        "id": 209905253,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1599954560
    },
    {
        "content": "<p>I agree with a lot of the analysis here, but I would note that including auxiliary data is certainly in scope for what we would like to be able to accomplish with subscriptions. This is the concept of an inclusion list or graph that we would like to make sure we leave room for, even if we don't standardize it in R5.</p>",
        "id": 209956882,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1600044112
    },
    {
        "content": "<p>I am going to hijack this thread to ask if anybody is planning to or actually going using FHIR Subscriptions (namely the R4 Backport)  vs say V2 messaging to meet this Rule.  By anybody,  I mean any Health System Vendor either as a publisher or subscriber.  The reason I am asking is that the Da Vinci Notifications project has been considering adding  this specific use case in an updated IG, but so far it we have not noticed a push for it from the community.</p>",
        "id": 228636694,
        "sender_full_name": "Eric Haas",
        "timestamp": 1614794189
    },
    {
        "content": "<p>Carequality used aspects of the backport for their Push notifications use case.  So far, there hasn't been a lot of interest from the community.</p>",
        "id": 228643276,
        "sender_full_name": "David Pyke",
        "timestamp": 1614796463
    }
]