[
    {
        "content": "<p>Hello all, wanted to post a notification here that Thursday's FHIR-I session (5:00 PM ET?) is dedicated to Subscriptions.  State of the world, questions, comments, strategies to including resources, etc.</p>\n<p>Edit: The meeting has been moving around - currently at 5:00 PM ET, will update as it changes and/or settles.  :-/</p>",
        "id": 210749978,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1600698960
    },
    {
        "content": "<p>Gino, will this include consideration for R4B?</p>",
        "id": 210793975,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1600719375
    },
    {
        "content": "<p>Sure, I'm trying to make sure I understood everything that Lloyd just said.</p>",
        "id": 210794037,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1600719419
    },
    {
        "content": "<p>For discussion (re: R4B vs. R5)... my understanding is the decision comes down to \"pain of implementing in R4 backport\" vs. \"pain of dealing with two models for Subscription in 'R4' releases\".</p>",
        "id": 210809392,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1600728165
    },
    {
        "content": "<p>For discussion (re: including resources)... right now we have <code>empty</code>, <code>id-only</code> and <code>full-resource</code> defined as options on a subscription.  There is a growing need to add the ability to return more than one resource.  The main proposal so far has been centered around GraphDefinition (either attached to Subscription or SubscriptionTopic).</p>\n<p>I've also been thinking about a syntax using <code>_include</code> / <code>_revInclude</code> (e.g., a topic on Encounter defines that you may request to include <code>patient</code>, <code>practitioner</code>, and <code>diagnosis</code>).</p>\n<p>I'll note that there is a general feeling that we shouldn't hold up publication of any 'ready' parts of the spec for this, which ties back into the R4B / R5 discussion.</p>",
        "id": 210809939,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1600728573
    },
    {
        "content": "<p>says 6pm here: <a href=\"https://confluence.hl7.org/display/FHIRI/FHIR-I+WGM+Agenda+2020-09\">https://confluence.hl7.org/display/FHIRI/FHIR-I+WGM+Agenda+2020-09</a></p>",
        "id": 210928362,
        "sender_full_name": "David Hay",
        "timestamp": 1600807161
    },
    {
        "content": "<p>It seems to be Thursday, 5 pm Central time, and 6 pm Eastern time. The Whova phone app reflects local time, and the web app asks you to chose to convert to local time...</p>",
        "id": 210930097,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1600808147
    }
]