[
    {
        "content": "<p>Hello!<br>\nI have a couple of questions about \"Pharmacy Claim\" -&gt; \"Pharmacy EOB\" mapping.</p>\n<ol>\n<li>\n<p>Do we need to process and save Pharmacy EOBs based on denied and reversal Pharmacy claims? <br>\nWhat status field in the Pharmacy EOB entity should we use to save the claim's status (Approved, Rejected, Reversal, Denied)?<br>\nShould we also save financial and medication information if a claim was rejected or reversed?</p>\n</li>\n<li>\n<p>Currently we have only one medication per one pharmacy claim. Do we need to create EOB.item elements in the Pharmacy EOBs?</p>\n</li>\n<li>In our Pharmacy claims we have information about prescribers. Do we need to put these practitioners in the EOB.enterer or the EOB.careTeam?</li>\n</ol>\n<p>Thanks for your help!</p>",
        "id": 226119343,
        "sender_full_name": "Paul Chayka",
        "timestamp": 1613125156
    },
    {
        "content": "<p>Hi. I have some thoughts on your first two numbered questions, but will confer with the CARIN team before providing a response if someone does not already do so here beforehand.<br>\nRegarding number 3: the place to put the prescriber is the EOB.careTeam. Be sure to specify the careTeam.role as prescribing where appropriate.</p>",
        "id": 226183752,
        "sender_full_name": "Corey Spears",
        "timestamp": 1613157952
    },
    {
        "content": "<p>Did you have a chance to check this info?</p>",
        "id": 226680399,
        "sender_full_name": "Paul Chayka",
        "timestamp": 1613578120
    },
    {
        "content": "<p>I have referred this to some of the CARIN BB team, but have not heard back yet. I will touch base again and bring it up in a call.</p>",
        "id": 226755373,
        "sender_full_name": "Corey Spears",
        "timestamp": 1613613157
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"370123\">@Paul Chayka</span> <br>\nDo we need to process and save Pharmacy EOBs based on denied and reversal Pharmacy claims?  As retail pharmacy claims are denied when the pharmacy contacts the PBM, the subscriber does not receive an EOB from the payer.  In the same vein, an EOB would not be provided via the Patient Access API.  <br>\nWhat status field in the Pharmacy EOB entity should we use to save the claim's status (Approved, Rejected, Reversal, Denied)?  Values are active | cancelled<br>\nShould we also save financial and medication information if a claim was rejected or reversed?  As a retail pharmacy POS transaction, reversal EOBs are rarely provided by the payer to the member; however, if the payer currently provides an EOB in this situation, a transaction should be provided via the Patient Access API </p>\n<p>Currently we have only one medication per one pharmacy claim. Do we need to create EOB.item elements in the Pharmacy EOBs?  Yes, FHIR maps some of the required data elements, such as NPI, to .item data elements. </p>\n<p>In our Pharmacy claims we have information about prescribers. Do we need to put these practitioners in the EOB.enterer or the EOB.careTeam?  EOB.careTeam.  Valid pharmacy EOB.careTeam roles are performing, PCP and prescribing.  <span class=\"user-mention\" data-user-id=\"191529\">@Corey Spears</span> <span class=\"user-mention\" data-user-id=\"192132\">@Amol Vyas</span></p>",
        "id": 226806814,
        "sender_full_name": "Pat Taylor",
        "timestamp": 1613653689
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"238353\">@Mark Roberts</span></p>",
        "id": 226806859,
        "sender_full_name": "Pat Taylor",
        "timestamp": 1613653733
    },
    {
        "content": "<p>Thank you for your awesome answers!<br>\nI have another small question.<br>\nAs I can see if we have related EOBs we should use the \"EOB.related\" field. But why this field contains a reference to a Claim entity?<br>\nIs it possible to use a reference to the related EOB entity itself in this field, if we don't create a Claim entity for each OEB?</p>",
        "id": 230053841,
        "sender_full_name": "Paul Chayka",
        "timestamp": 1615565018
    },
    {
        "content": "<p>Thanks for the question. I was imprecise in my post in the EOB related.reference thread: <a href=\"#narrow/stream/204607-CARIN-IG.20for.20Blue.20Button.C2.AE/topic/Base.20EoB.20related.20claim.20reference\">https://chat.fhir.org/#narrow/stream/204607-CARIN-IG.20for.20Blue.20Button.C2.AE/topic/Base.20EoB.20related.20claim.20reference</a><br>\n<span class=\"user-mention\" data-user-id=\"370123\">@Paul Chayka</span> , you are right, this is not a relation to a claim specifically, but rather to an EOB.</p>",
        "id": 230086277,
        "sender_full_name": "Corey Spears",
        "timestamp": 1615578197
    }
]