[
    {
        "content": "<p>Hello!<br>\nSo now that I'm completely smitten by ClinFHIR, trying to figure out how I can do the following:<br>\nI have a profile I created, is there a way to use this profile to create scenarios and add structured data? My profile has a couple of extensions that I'd like see when I'm adding structured data.<br>\nThanks!</p>",
        "id": 153972603,
        "sender_full_name": "Priya Mathew",
        "timestamp": 1530290366
    },
    {
        "content": "<p>Hi Priya - thanks for the nice comments! If it's a simple profile, then there's an option to select a profile when adding a new resource instance - theres a tab to the upper right. The profile (and the extensions it references) need to be in the current conformance server, and any ValueSets in the Terminology server.  The query is on the base type.</p>\n<p>However, the current handling of profiles is a bit flaky, so I'm currently re-writing this part of the code with a different form based interface rather than the tree. This will appear in conman (which is a CF module) to start with - I can back port to the current scenario builder if needed...</p>\n<p>Should be ready for preview in a couple of weeks</p>\n<p>So have a go with the current functionality as described above (and feel free to reach out with further questions) &amp; I'll let you know when the new version is ready...</p>",
        "id": 153972647,
        "sender_full_name": "David Hay",
        "timestamp": 1530300617
    },
    {
        "content": "<p>Thanks David! So my next dumb question, I couldn't find a way to upload my profile to one of the public servers that show up in ClinFHIR. How'd I go about doing that?</p>",
        "id": 153972650,
        "sender_full_name": "Priya Mathew",
        "timestamp": 1530304507
    },
    {
        "content": "<p>How did you make the profile? You should be able to POST/PUT it to one of the servers - try the HAPI R3 server...</p>",
        "id": 153972663,
        "sender_full_name": "David Hay",
        "timestamp": 1530344465
    },
    {
        "content": "<p>Hi David, Thanks! I created a profile for Observation using Forge and posted it to the HAPI STU2 server.(We're implementing DSTU2) I can find it at <a href=\"http://fhirtest.uhn.ca/baseDstu2/StructureDefinition/11388\" target=\"_blank\" title=\"http://fhirtest.uhn.ca/baseDstu2/StructureDefinition/11388\">http://fhirtest.uhn.ca/baseDstu2/StructureDefinition/11388</a> . In ClinFHIR, within a scenario, when I try to add new resource , it gives me the option to 'Find Profile' and I'm able to find my profile, but clicking on it doesn't really do anything. Am I missing a step somewhere?</p>",
        "id": 153972942,
        "sender_full_name": "Priya Mathew",
        "timestamp": 1530555718
    },
    {
        "content": "<p>Hi Priya - That profile only has a differential - not a snapshot element, which CF requires. There's an option in Forge (not sure where) where you can require that a snapshot is required as well - try that, and see how things go...</p>",
        "id": 153972962,
        "sender_full_name": "David Hay",
        "timestamp": 1530560603
    },
    {
        "content": "<p>OK, its all beginnning to make sense now :) Thanks for all the hand holding, I saved the profile created in Forge with a snapshot and uploaded it to the HAPI STU2 server and lo behold! ClinFhir was able to add the resource for the profile in- thank you thank you!</p>",
        "id": 153972967,
        "sender_full_name": "Priya Mathew",
        "timestamp": 1530563733
    },
    {
        "content": "<p>excellent ! Will be interested in your progress - as I said earlier, the profile support is a bit flaky right now...</p>",
        "id": 153972971,
        "sender_full_name": "David Hay",
        "timestamp": 1530565953
    }
]