[
    {
        "content": "<p>David,  Can I upload a logical model SD to ClinFHIR in order to create a graph?</p>",
        "id": 153912802,
        "sender_full_name": "Eric Haas",
        "timestamp": 1507247596
    },
    {
        "content": "<p>should work (though I've not checked recently). there's a 'logical' tab to the right when you add a new resource. it will list all logical models on the conformance server. Let me know how you get on!</p>",
        "id": 153912803,
        "sender_full_name": "David Hay",
        "timestamp": 1507249000
    },
    {
        "content": "<p>I meant upload the xml or json SD Directly into clinfhir<br>\n.  I've not uploaded a logcical model to a reference server since I didn't realize that was an option.</p>",
        "id": 153912804,
        "sender_full_name": "Eric Haas",
        "timestamp": 1507249197
    },
    {
        "content": "<p>I did this by uploading my logical models to the open HAPI server. There was a catch. ClinFHIR searched for specific author fields in the logical models. I added those fields. <span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span> is this still required?</p>",
        "id": 153912834,
        "sender_full_name": "Michael van der Zel",
        "timestamp": 1507294301
    },
    {
        "content": "<p>Thanks Michael - I had forgotten that. You need an identifier with the value http://clinfhir.com|author .  (Rationale is to limit to CF created profiles to limit what it has to support). I'm moving to use of an extension across all CF authored stuff, though that's not complete yet!</p>",
        "id": 153912861,
        "sender_full_name": "David Hay",
        "timestamp": 1507313018
    },
    {
        "content": "<p>I just did a quick check - the 'select from server' option seems to work ok (with the identifier added) but not the paste directly. Not sure why - will take a look...</p>",
        "id": 153912862,
        "sender_full_name": "David Hay",
        "timestamp": 1507313086
    },
    {
        "content": "<p>OK. It did't used to, but it does now! (And no identifier needed...) Couple of things:</p>\n<ul>\n<li>Make sure to check the 'Import as Logical Model' checkbox, or you'll get a StructureDefinition</li>\n<li>When populating the model from the structure&amp;reference tab, there's an option labelled 'toggle input mode' that shows both the tree and the Json view on the same pane. </li>\n<li>The 'form' link alongside it is an experimental form generator (based on Questionnaire) - doesn't work yet</li>\n<li>The current builder doesn't handle extensions at all well. I'm working on a replacement - will let you know when ready for testing...</li>\n</ul>\n<p>enjoy...</p>",
        "id": 153912883,
        "sender_full_name": "David Hay",
        "timestamp": 1507316587
    }
]