[
    {
        "content": "<p>I seemed to have messed up <a href=\"http://gb2.clinfhir.com/#id1616707963764\">http://gb2.clinfhir.com/#id1616707963764</a> somehow (named VCI-01 near the bottom).  Is there a way to delete it?  I would download and fix it, but it does not download, and no graph is showing in the Library.</p>",
        "id": 232340103,
        "sender_full_name": "Paul Denning",
        "timestamp": 1617053685
    },
    {
        "content": "<p>Yeah - does seem a bit munted. I haven't done a delete option yet, so will raise that as a priority! Just out of interest, when did you create the project - recently, or is it an older one updated recently?</p>",
        "id": 232345034,
        "sender_full_name": "David Hay",
        "timestamp": 1617056416
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194174\">@Paul Denning</span> - OK have provided a delete option in the library (just sets a deleted status on the server actually). Also added a checkbox to filter the view to just your projects to help find it!  Do need better filtering options in the library, but that should help for now...</p>",
        "id": 232363611,
        "sender_full_name": "David Hay",
        "timestamp": 1617070710
    },
    {
        "content": "<p>Thanks.  I think I first saved it 25 March.</p>",
        "id": 232363895,
        "sender_full_name": "Paul Denning",
        "timestamp": 1617070989
    },
    {
        "content": "<p>Hmm. I wondered if the issue was an older graph but I guess it's not that. Let me know if it happens again...</p>",
        "id": 232364417,
        "sender_full_name": "David Hay",
        "timestamp": 1617071456
    },
    {
        "content": "<p>Is \"Paste resources\" new?</p>",
        "id": 232364728,
        "sender_full_name": "Paul Denning",
        "timestamp": 1617071743
    },
    {
        "content": "<p>Oops - I should have commented that out as I don't think it's working yet.  The idea is that you will be able to paste resources (in XML or Json formats) and import them into a graph. It uses the goFsh functionally that your kind colleagues have provided to me via an API...</p>",
        "id": 232373405,
        "sender_full_name": "David Hay",
        "timestamp": 1617079482
    }
]