[
    {
        "content": "<p>Hi, I am trying to create a Questionnaire-instance, but I run into a problem editting the text of an item. There is a textarea in the editor, but if I edit the text in there I edit the text backbone-element of the resource and not of the text of the indivual item. For clarity, see screenshot: <a href=\"/user_uploads/10155/Zr-ut1IVsP3vK1iGy2WTaiFl/questionnaire.png\" target=\"_blank\" title=\"questionnaire.png\">questionnaire.png</a> Is this a bug, a feature, or am I doing something wrong?</p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/Zr-ut1IVsP3vK1iGy2WTaiFl/questionnaire.png\" target=\"_blank\" title=\"questionnaire.png\"><img src=\"/user_uploads/10155/Zr-ut1IVsP3vK1iGy2WTaiFl/questionnaire.png\"></a></div>",
        "id": 153857971,
        "sender_full_name": "Ben Schrijver",
        "timestamp": 1479729975
    },
    {
        "content": "<p>Hi Ben,  That text box is intended to be for the text element of the resource - not the currently selected element (I should make that clearer). To enter text for an element (if it has a datatype of type string) you select the datatype alongside the element (it will be the word 'string') and then another textbox to the upper right should appear that you can use...</p>",
        "id": 153858189,
        "sender_full_name": "David Hay",
        "timestamp": 1479879777
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span> Thanks David for your reply, I think I already know what the problem is: I'd like to edit Questionnaire.item.text but the text-child of an item is hidden in the Child elements list, as (not) seen in my screenshot. So, I cannot click on the word string, because it's not shown. I guess things like id, text and meta are hidden, which makes sense, but in this case forms an issue. I'll work around it.</p>",
        "id": 153858239,
        "sender_full_name": "Ben Schrijver",
        "timestamp": 1479894802
    },
    {
        "content": "<p>Oh, I see - yes I believe you are correct - I've outsmarted myself!  Will look into that...</p>",
        "id": 153858297,
        "sender_full_name": "David Hay",
        "timestamp": 1479910065
    },
    {
        "content": "<p>OK fixed the 'text' issue...</p>",
        "id": 153859964,
        "sender_full_name": "David Hay",
        "timestamp": 1480698849
    },
    {
        "content": "<p>Great!</p>",
        "id": 153860583,
        "sender_full_name": "Ben Schrijver",
        "timestamp": 1480932514
    }
]