[
    {
        "content": "<p>Hi David, we are looking at clinFHIR in the care plan track.  If I have an existing CarePlan instance on the data server, is there any way to open this resource in the scenario builder, edit it, and save back to to the server?  It appears that we can only create a new resource instance.</p>",
        "id": 153905567,
        "sender_full_name": "Dave Carlson",
        "timestamp": 1504998710
    },
    {
        "content": "<p>Hi Dave - couple of ways.<br>\nYou could either paste the current resource in to the SB then save it back, or create a scenario and select the patient from the server when starting. Then you can load the CP directly and edit/update.<br>\nTo do that, create a new scenario -then select the description tab and in teh middle of that tab is a button where you can select the patient from the server (It's not that well labelled actually - I should correct that).<br>\nOnce you've selected a patient in that way, when adding a resource to the scenario there a new tab to the right labelled 'Existing Resources' where you can pull existing resources for that patient from the server, edit and update.</p>",
        "id": 153905612,
        "sender_full_name": "David Hay",
        "timestamp": 1505001809
    },
    {
        "content": "<p>Couple of caveats:</p>",
        "id": 153905613,
        "sender_full_name": "David Hay",
        "timestamp": 1505001818
    },
    {
        "content": "<p>The data server needs to support the $everything operation to work properly</p>",
        "id": 153905614,
        "sender_full_name": "David Hay",
        "timestamp": 1505001849
    },
    {
        "content": "<p>And the careplan is a complex resource - I'm not sure that CF will edit it correctly (but keen to find out any issues of course!). Provided that the server supports versions, then you can always go back to previous version in the event of issues...</p>",
        "id": 153905616,
        "sender_full_name": "David Hay",
        "timestamp": 1505001931
    },
    {
        "content": "<p>Let me know how you get on!</p>",
        "id": 153905617,
        "sender_full_name": "David Hay",
        "timestamp": 1505001940
    },
    {
        "content": "<p>Great, thanks David!  I'll work through this tonight and (hopefully) share the process with our group in the morning.</p>",
        "id": 153905619,
        "sender_full_name": "Dave Carlson",
        "timestamp": 1505002000
    },
    {
        "content": "<p>Good oh! it's afternoon for me so available for any issues...</p>",
        "id": 153905621,
        "sender_full_name": "David Hay",
        "timestamp": 1505002111
    },
    {
        "content": "<p>I am using the HSPC server which is based on HAPI, so does have support for $everything and resource versions.  I'll report back on my experience!</p>",
        "id": 153905622,
        "sender_full_name": "Dave Carlson",
        "timestamp": 1505002122
    },
    {
        "content": "<p>Hi David, we were successful at creating a scenario using an existing patient and care plan, then creating and adding goals and activities.  Thanks so much for providing guidance!  However, we still had a challenge attempting to collaborate between two or more authors.  Person A creates a new resource and adds to the care plan in their clinFHIR scenario, saves their library, and updates the server.  I can see these changes on the HSPC Care Plan server.  Person B previously created a scenario including the same patient and care plan resources, but cannot see updates to CarePlan made by Person A.  Any ideas how to support this collaboration?  Thanks!!</p>",
        "id": 153906004,
        "sender_full_name": "Dave Carlson",
        "timestamp": 1505082144
    },
    {
        "content": "<p>Glad that it all worked out! wrt the collaborators - an interesting challenge - the next frontier! (In fact I do recall Viet asking about this as well)... Assuming that the collaborators can talk to another then I do have a couple of ideas. I'm guessing that this will be useful for the Clinician On FHIR event on friday?</p>",
        "id": 153906049,
        "sender_full_name": "David Hay",
        "timestamp": 1505103053
    },
    {
        "content": "<p>In the meantime, could you try this out.</p>\n<ul>\n<li>User 1 create a scenario, linking to an existing patient (create a scenario, then select the patient using the button in the middle of the description tab. Choose a patient without too many existing resources.</li>\n<li>create a scenario and save back to the server</li>\n<li>User 2 create a new scenario for the same patient. They select the existing resources using the 'Existing Resources' tab on the right that appears when you click the 'Add Resource button'. They should see all the resources - including the ones created by user 1. Create a scenario - selecting the existing resources where possible. Eventually save back to the server.</li>\n<li>User 1 creates a new scenario for the patient. Again they should be able to see (and select) the existing resources.</li>\n<li>rinse and repeat.</li>\n</ul>\n<p>If this works, I'll look to streamline things so if you can check it out asap that would be great. (What I'm thinking is a way to make it easier to add a lot of existing resources into the scenario rather than selecting them individually. In fact, an 'edit scenario' option that does this might be the way to go - once I figure out how to do that!)</p>",
        "id": 153906051,
        "sender_full_name": "David Hay",
        "timestamp": 1505103865
    },
    {
        "content": "<p>Actually, another possibility comes to mind. Perhaps something like a 'refresh scenario' that works on an existing scenario and pulls in the latest versions of resources in that scenario (plus any new ones references by those resources) from the server might be tidier. Does still depend on choosing existing resources during the 'Add resource' process where possible though...</p>",
        "id": 153906052,
        "sender_full_name": "David Hay",
        "timestamp": 1505104278
    },
    {
        "content": "<p>OK - have added a 'refresh scenario' (top right) to the scenario builder that will update the contents of the the current scenario from the server resources. Use it like this.</p>\n<p><strong>User 1</strong><br>\n1. Create a new scenario, and select a patient from the server<br>\n2. Add whatever resources you want (direct or select)<br>\n3. Make sure they are all valid (validate all function)<br>\n4. save to the server<br>\n5. save to the library (now in the gear icon)</p>\n<p><strong>User2</strong><br>\n1. Go to the library, locate the scenario and download<br>\n2. Make any changes, and save to the server</p>\n<p><strong>User1</strong><br>\n1. Use the 'refresh Scenario' to update the resources in the scenario from the server.</p>\n<p>At this stage, both users are 'connected' to the same scenario and should be able to share updates.</p>\n<p>Some caveats:</p>\n<ul>\n<li>There is no checking to see which is the most up to date - when you refresh a scenario the resources in your copy will be replaced by the server ones. I'm planning to create a local version before the update occurs - but should I track versions?</li>\n<li>Right now, if user2 adds a resource it won't be present when user1 refreshes - only the resources currently in the local scenario will be updated. I'm working in this...</li>\n</ul>\n<p>So have a play and let me know how it works out...</p>",
        "id": 153906624,
        "sender_full_name": "David Hay",
        "timestamp": 1505180112
    },
    {
        "content": "<p>Thanks David, as always, really appreciate your help and quick response!  Have been wrapped up in the WGM, but will try and test this scenario update with a few folks this week before the clinicians on FHIR.</p>",
        "id": 153906950,
        "sender_full_name": "Dave Carlson",
        "timestamp": 1505229398
    },
    {
        "content": "<p>Hi David, during the FHIR connectathon you removed the \"connectathon 14\" server from clinFHIR default list.  <span class=\"user-mention\" data-user-id=\"192054\">@Viet Nguyen</span> just asked me if this server can be added back, he has a test example on this server for Clinicians on FHIR.  Thanks.  URL is <a href=\"https://api3.hspconsortium.org/fhirconnect14/open\" target=\"_blank\" title=\"https://api3.hspconsortium.org/fhirconnect14/open\">https://api3.hspconsortium.org/fhirconnect14/open</a></p>",
        "id": 153907675,
        "sender_full_name": "Dave Carlson",
        "timestamp": 1505336249
    },
    {
        "content": "<p>will do. I'm right in the middle of refactoring the ExtensionDefinition editor right now so probably won't be for several hours. <span class=\"user-mention\" data-user-id=\"192054\">@Viet Nguyen</span> if you need to test before then, just add the server manually. I'll ping here when I update...</p>",
        "id": 153907711,
        "sender_full_name": "David Hay",
        "timestamp": 1505336711
    },
    {
        "content": "<p>Thanks David!  I already send the server URL to Viet.</p>",
        "id": 153907744,
        "sender_full_name": "Dave Carlson",
        "timestamp": 1505337289
    },
    {
        "content": "<p>All done! I called it HSPC-14 ...</p>",
        "id": 153907843,
        "sender_full_name": "David Hay",
        "timestamp": 1505339689
    }
]