[
    {
        "content": "<p>selecting for practitioner screen is too high - limit the number of search criteria to make the screen more useable</p>",
        "id": 153827738,
        "sender_full_name": "David Hay",
        "timestamp": 1463148048
    },
    {
        "content": "<p>when selecting a codeableconcept would be nice to have an option to select the code &amp; system instead of the text</p>",
        "id": 153827739,
        "sender_full_name": "David Hay",
        "timestamp": 1463148099
    },
    {
        "content": "<p>would be good to be able to update a resource being edited without creating a new resource each time. ie so long as you stay in the editing/building screen, 'save' will update the same resource (giving multiple versions) rather than creating a new one on each save...</p>",
        "id": 153827740,
        "sender_full_name": "David Hay",
        "timestamp": 1463148464
    },
    {
        "content": "<p>question: would 'front' page be better thought of as 'home'?</p>",
        "id": 153827741,
        "sender_full_name": "David Hay",
        "timestamp": 1463148486
    },
    {
        "content": "<p>In chrome, we're getting a scroll bar on the browser and a scroll bar on the selection screen.  That's kind of icky</p>",
        "id": 153827742,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1463148521
    },
    {
        "content": "<p>allow add time to a datetime</p>",
        "id": 153827743,
        "sender_full_name": "David Hay",
        "timestamp": 1463148963
    },
    {
        "content": "<p>when a profile references an extension definition (SD) that is not on the conformance server, then the error is not intuitive - and uses an alert box that has the option to suppress other errors. change to modaldialog</p>",
        "id": 153827744,
        "sender_full_name": "David Hay",
        "timestamp": 1463149272
    },
    {
        "content": "<p>make it explicit that clicking on the 'eye' is creating a new profile (? should there be a more explicit way to do this?)</p>",
        "id": 153827746,
        "sender_full_name": "David Hay",
        "timestamp": 1463149850
    },
    {
        "content": "<p>cannot search for a code (to populate a Coding or CodeableConcept) using the code string itself (e.g. \"2339-0\") </p>",
        "id": 153827747,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1463149916
    },
    {
        "content": "<p>that's an issue on my server.</p>",
        "id": 153827748,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1463150278
    },
    {
        "content": "<p>allow the tool to create a reference type resource without selecting a patient first</p>",
        "id": 153827751,
        "sender_full_name": "David Hay",
        "timestamp": 1463150617
    },
    {
        "content": "<p>Rename \"create resource\" to \"Create instance\" and move the button to be immediately above or below the list of active resources/profiles</p>",
        "id": 153827761,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1463151913
    },
    {
        "content": "<p>PC: why do both allergy and reaction have substance properties?</p>",
        "id": 153827764,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1463152032
    },
    {
        "content": "<p>Is terminology up to date? I thought criticality had changed.</p>",
        "id": 153827766,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1463152083
    },
    {
        "content": "<p>Billing data - if condition uses SCT, where is ICD -- encounter?</p>",
        "id": 153827767,
        "sender_full_name": "Jay Lyle",
        "timestamp": 1463152133
    },
    {
        "content": "<p>MedicationStatement.informationSource needs to beable to reference a Patient resource (so re-enable it)...</p>",
        "id": 153827769,
        "sender_full_name": "David Hay",
        "timestamp": 1463152283
    },
    {
        "content": "<p>Need a better way of looking up Goals.  And in fact, whenever we do a lookup, it'd be nice if you could display a preview of the JSON (or better yet rendered HTML) of the resource you're about to select - names won't always be unique.</p>",
        "id": 153827778,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1463154177
    },
    {
        "content": "<p>On the screen for capturing timing, need to enforce that numeric fields only allow numbers and that fields taking units have a drop-down with allowed units</p>",
        "id": 153827787,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1463155154
    },
    {
        "content": "<p>cannot enter times for dateTime elements</p>",
        "id": 153827792,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1463155437
    },
    {
        "content": "<p>when selecting a resource reference, need a preview of the selected resource (for when the 1 line description doesn't make sense - eg it is just the resource type)</p>",
        "id": 153827793,
        "sender_full_name": "David Hay",
        "timestamp": 1463155525
    },
    {
        "content": "<p>Not just for when it's just the resource type - sometimes you might have multiple \"Diabetes\" conditions, for example, with different details.  You want to make sure you pick the right one.  It would also be nice if you showed the id.  That way you could jot down the id when creating and select the right one.</p>",
        "id": 153827797,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1463155732
    },
    {
        "content": "<p>only 50 resources are being displayed for a patient. can make it look like resources aren't being saved. need to implemnt paging to make sure all resources are returned...</p>",
        "id": 153827807,
        "sender_full_name": "David Hay",
        "timestamp": 1463157317
    },
    {
        "content": "<p>When you do support updates, it would also be nice to save an instance, go create a profile with a few extensions, then edit the existing instance to use that profile.  (And for that matter, to be able to add stuff to an existing profile and then go back to an instance created against the old version of that profile and see the new extensions.)</p>",
        "id": 153827828,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1463161879
    }
]