[
    {
        "content": "<p>Hello,<br>\nI am getting this error, in the Scenario builder, whenever I click on a resource, that has a profile, which is not present on the server, which is ok and all, but it seems to cause issues selecting other resources, after that error comes up. It selects the resource, however it does not update the Structure and Reference tab, where the resources are modified. It just stays on the resource, where that error occured<br>\n<a href=\"/user_uploads/10155/carezFlbmbDXfPY2GtWYVdDP/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/carezFlbmbDXfPY2GtWYVdDP/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/10155/carezFlbmbDXfPY2GtWYVdDP/pasted_image.png\"></a></div>",
        "id": 153921606,
        "sender_full_name": "Dimitar",
        "timestamp": 1511714628
    },
    {
        "content": "<p>OK - so after getting this error you need to reload the page for things to work correctly? A bit icky indeed, I'll take a look at that...</p>",
        "id": 153921700,
        "sender_full_name": "David Hay",
        "timestamp": 1511813307
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span>  Yes, either I need to reload or click on a resource, that doesn't have a profile.</p>",
        "id": 153921791,
        "sender_full_name": "Dimitar",
        "timestamp": 1511863097
    },
    {
        "content": "<p>When you say 'Click on a resource' - are you trying to add a new resource based on a profile that doesn't exist? Can you give the steps to reproduce? thanks...</p>",
        "id": 153921912,
        "sender_full_name": "David Hay",
        "timestamp": 1511897746
    },
    {
        "content": "<p>Basically, whenever I click on a resource from the scenario builder, which was already imported with a profile, that doesn't exist on the server.</p>",
        "id": 153921931,
        "sender_full_name": "Dimitar",
        "timestamp": 1511903628
    },
    {
        "content": "<p>So you have a resource that was created from a profile. The profile pointed to an extension that isn't on the server, so you would get an error when the resource was originally created. That doesn't cause issues, but when you select the resource subsequently, you get the dialog above, and the app is subsequently confused - right? Which profile are you using? (and it's the hapi-3 server - right?)</p>",
        "id": 153921939,
        "sender_full_name": "David Hay",
        "timestamp": 1511905470
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span>  Correct it happened on the HAPI STU3 server. What I did was, I loaded a bunch of test data on the Hapi server, with the <a href=\"https://projectcrucible.org/\" target=\"_blank\" title=\"https://projectcrucible.org/\">https://projectcrucible.org/</a> tool. And after I did that I picked one of the generated patients and I found the patient in the patient viewer and copied all of the resources in the bundle for that patient. After that, I just imported all of his resources in the scenario builder, and since most of them had the <a href=\"http://standardhealthrecord.org/fhir/StructureDefinition/shr-demographics-PersonOfRecord\" target=\"_blank\" title=\"http://standardhealthrecord.org/fhir/StructureDefinition/shr-demographics-PersonOfRecord\">http://standardhealthrecord.org/fhir/StructureDefinition/shr-demographics-PersonOfRecord</a> or whatever profile, it kept on giving me that warning and whenever I would switch to see a different resource, the pane was not updating.</p>",
        "id": 153921960,
        "sender_full_name": "Dimitar",
        "timestamp": 1511910694
    },
    {
        "content": "<p>OK - so you imported the resources through the import option. Can you send me (email or attach here) one of the resources causing the problem? Then I can duplicate what you did and hopefully solve the issue...  cheers</p>",
        "id": 153921971,
        "sender_full_name": "David Hay",
        "timestamp": 1511915944
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span>  <a href=\"https://paste.ofcode.org/gMLs8qG4DfDLw4XZ2EhZhm\" target=\"_blank\" title=\"https://paste.ofcode.org/gMLs8qG4DfDLw4XZ2EhZhm\">https://paste.ofcode.org/gMLs8qG4DfDLw4XZ2EhZhm</a> This is one of the resources that brings the issues</p>",
        "id": 153922006,
        "sender_full_name": "Dimitar",
        "timestamp": 1511943939
    },
    {
        "content": "<p>OK, now I get what's happening. CF can't locate the profile, and so can't construct a tree of the structure to allow editing of the resource (do note that editing of profiled resources is a bit - quirky - at the moment anyway :) ). I've tidied it up a bit so it becomes clearer that that is what is happening - not sure what else can be done....</p>",
        "id": 153922096,
        "sender_full_name": "David Hay",
        "timestamp": 1511972912
    }
]