[
    {
        "content": "<p>When binding to a Value Set, is it possible to provide an explicit reference URL to that Value Set, as an alternative to attempting to search and find it on the nominated Terminology Server using a text string.</p>",
        "id": 153904545,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1504663775
    },
    {
        "content": "<p>Good idea - will add that feature...</p>",
        "id": 153904713,
        "sender_full_name": "David Hay",
        "timestamp": 1504728348
    },
    {
        "content": "<p>Thanks, David - I'm also not sure if/how one can amend an existing Extension definition.</p>",
        "id": 153904741,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1504733192
    },
    {
        "content": "<p>OK - added the ability to specify the url. You shoudl be able to edit an existing ED (provided that you were the author, you are logged in and created it through CF). Let me know if you have issues...</p>",
        "id": 153904742,
        "sender_full_name": "David Hay",
        "timestamp": 1504733408
    },
    {
        "content": "<p>I can find an extension that I've created in the ED Manager, but don't see an edit button. Maybe it's because I set the status to Active (which was the only change I could make after I initially saved it).</p>",
        "id": 153904743,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1504733813
    },
    {
        "content": "<p>lemme check the security aspects. And yes, after being set active you can't make changes (but there should have been an edit button after the initial save). Was this a simple or a complex extension?</p>",
        "id": 153904859,
        "sender_full_name": "David Hay",
        "timestamp": 1504808695
    },
    {
        "content": "<p>It's a test for an NZ Ethnicity Extension (Publisher HL7 New Zealand) with a coding data type, bound to the  NZ Ethnicity Level 4 Value Set on my Terminology Server (BTW have now implemented a simple - starts with - text search for VS by name).  Is that categorised as simple or complex? Actually would like to delete this and start again. At this stage, my main interest is in comparing outputs and functionality with Forge.</p>",
        "id": 153905021,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1504891964
    },
    {
        "content": "<p>since you're just testing, perhaps just create a new one with a different url? We can fix up issues around deleting &amp; access control when we have time...</p>",
        "id": 153905036,
        "sender_full_name": "David Hay",
        "timestamp": 1504899645
    }
]