[
    {
        "content": "<p>Hi David, after creating an instance, where do you go to find the instance and download?  I'm looking in the Details for the patient but don't see the Instances for Medication I created.  I believe it was saved as I got an id for it.  Thx</p>",
        "id": 153829661,
        "sender_full_name": "Melva Peters",
        "timestamp": 1464101150
    },
    {
        "content": "<p>Hi Melva - when you saved the instance did you get a message with the id of the instance? (That just indicates that it was saved correctly) . What patient and server were you  using? I'll go take a look...</p>",
        "id": 153829670,
        "sender_full_name": "David Hay",
        "timestamp": 1464111624
    },
    {
        "content": "<p>Hi David, Here's the ID 93428.  I was saving to the Public HAPI server STU3 for Brooke Jones</p>",
        "id": 153829671,
        "sender_full_name": "Melva Peters",
        "timestamp": 1464112321
    },
    {
        "content": "<p>Also, when I go to download, I just get a blank screen</p>",
        "id": 153829672,
        "sender_full_name": "Melva Peters",
        "timestamp": 1464112330
    },
    {
        "content": "<p>Hi Melva - a medication resource does not reference a patient - that's why it isn't showing in the patients resources (and thanks for getting the id - made it really easy to check!)  Right now, you would have to download it by entering the following url into a browser or REST client (like POSTMan): <a href=\"http://fhirtest.uhn.ca/baseDstu3/Medication/93428\" target=\"_blank\" title=\"http://fhirtest.uhn.ca/baseDstu3/Medication/93428\">http://fhirtest.uhn.ca/baseDstu3/Medication/93428</a>    (It does exist - I checked :) )</p>",
        "id": 153829712,
        "sender_full_name": "David Hay",
        "timestamp": 1464155672
    },
    {
        "content": "<p>You can create a MedicationOrder for that patient that references that medication and you should see the MedicationOrder in the patient history, but not - alas - the medication resource itself (only the reference to it). I'll update clinFHIR to download it when viewing the history - but may take a week or so as I'm in the middle of  some updates the the profiling that I'd like to finish off first!</p>",
        "id": 153829717,
        "sender_full_name": "David Hay",
        "timestamp": 1464156345
    },
    {
        "content": "<p><a href=\"https://fhirblog.com/2013/10/16/manipulating-a-single-fhir-patient-resource/\" target=\"_blank\" title=\"https://fhirblog.com/2013/10/16/manipulating-a-single-fhir-patient-resource/\">heres</a> a post I wrote about POSTman a little while back if that helps (let me know if you want more)</p>",
        "id": 153829718,
        "sender_full_name": "David Hay",
        "timestamp": 1464156569
    },
    {
        "content": "<p>Can you be more explicit about the download problem? Or - now that we've discussed the issue about the Medication resource, does that resolve  it?</p>",
        "id": 153829719,
        "sender_full_name": "David Hay",
        "timestamp": 1464156629
    },
    {
        "content": "<p>Thanks David.  That helps with finding the resource.  For the download, when I click on the download button for an instance, I get a blank screen in the browser with the following URL blob:<a href=\"http://107.170.196.80/9efea075-332f-4121-97bb-3a2796a7dafc\" target=\"_blank\" title=\"http://107.170.196.80/9efea075-332f-4121-97bb-3a2796a7dafc\">http://107.170.196.80/9efea075-332f-4121-97bb-3a2796a7dafc</a> but nothing is displayed or is downloaded.  I'm using Safari on a Mac - not sure if it is a browser issue.</p>",
        "id": 153829760,
        "sender_full_name": "Melva Peters",
        "timestamp": 1464183263
    },
    {
        "content": "<p>Hi Melva - yes, it does seem to be an issue with safari (I was able to duplicate on my mac as well - though using a different server as HAPI has an issue right now). I'll take a look at some stage - but Chrome definately works on the mac (it's what I use for development) so a work around would be for you to install chrome and use that. cheers...</p>",
        "id": 153829814,
        "sender_full_name": "David Hay",
        "timestamp": 1464199955
    }
]