[
    {
        "content": "<p>1.In Scenario Builder Media resource image is not loading when I click the attachment link.It showing text only .<br>\n2.when I am giving the values of Media resource width,height and frames Data Type link is not working.</p>",
        "id": 153913609,
        "sender_full_name": "Ramya Reddy",
        "timestamp": 1507810577
    },
    {
        "content": "<p>Ah - those elements are datatypes not currently supported - I'll fix. wrt attachment, yes, I need to add a few more fields there also. <br>\nprobably take a couple of days - I'll ping here when done...</p>",
        "id": 153913785,
        "sender_full_name": "David Hay",
        "timestamp": 1507886311
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span> Thanks for your reply</p>",
        "id": 153913786,
        "sender_full_name": "Ramya Reddy",
        "timestamp": 1507886531
    },
    {
        "content": "<p>OK - should be good to go. Take a try and tell me if there are any issues. (Note you can't enter in-line content at the moment. Not sure if that is desirable, and would only work for small attachments anyway..)</p>\n<p>btw - when entering data there's a new option activated by a link 'toggle input mode' to the upper right of the screen when the 'Structure &amp; Reference' pane is displayed. This shows the tree and the json of the resource side-by-side (hiding the navigator), which is more convenient when updating lots of elements.</p>\n<p>bbtw - I'm working on a new input form which removes the modal input windows and will handle profiles much better. There's a preview on the 'experimental' tab of the launcher if you're interested (but be aware that anything entered in the new builder is not saved). Ultimately I intend to link it to the scenario builder as an option - as well as leaving it as a 'stand alone' resource builder...</p>",
        "id": 153913848,
        "sender_full_name": "David Hay",
        "timestamp": 1507932606
    },
    {
        "content": "<p>is there currently a way to referencing &gt;1 resource type in the logical modeler.  Can i edit the xml/json directly?</p>",
        "id": 153914485,
        "sender_full_name": "Eric Haas",
        "timestamp": 1508267930
    },
    {
        "content": "<p>per element? Sorry, no - I haven't done the UI for that. The output is an SD of course so you could modify it directly. I'm pretty sure that it will not remove existing multiple references - though it would pay to check...</p>",
        "id": 153914541,
        "sender_full_name": "David Hay",
        "timestamp": 1508280868
    },
    {
        "content": "<p>how do I get to the SD to modify it?</p>",
        "id": 153914542,
        "sender_full_name": "Eric Haas",
        "timestamp": 1508280922
    },
    {
        "content": "<p>The url (and id on the server) is in the model tab to the right. Make sure that you don't have the model open in the tool when editing it though! Let me know how you get on - I can update the UI if needed...</p>",
        "id": 153914543,
        "sender_full_name": "David Hay",
        "timestamp": 1508281075
    },
    {
        "content": "<p>The Scenario builder graph is so slick - can I publish them in my IGs?  What attribution or cash do you need??</p>",
        "id": 153914548,
        "sender_full_name": "Eric Haas",
        "timestamp": 1508283374
    },
    {
        "content": "<p>Of course - go for it! (and let me know if there's anything I can do to make it better/easier...)  attribution is always appreciated...</p>",
        "id": 153914551,
        "sender_full_name": "David Hay",
        "timestamp": 1508285067
    },
    {
        "content": "<p>I was able to modify the SD and upload easily.  but the Scenario builder doesn't link to the  resource if Patient links to the resource:<br>\n<a href=\"/user_uploads/10155/PUZcJqWBNR6XyD9LEwUGyXQu/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/PUZcJqWBNR6XyD9LEwUGyXQu/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/10155/PUZcJqWBNR6XyD9LEwUGyXQu/pasted_image.png\"></a></div>",
        "id": 153914556,
        "sender_full_name": "Eric Haas",
        "timestamp": 1508287769
    },
    {
        "content": "<p>Is that because is a LM?</p>",
        "id": 153914557,
        "sender_full_name": "Eric Haas",
        "timestamp": 1508287804
    },
    {
        "content": "<p>sorry - don't quite follow. are you wanting to link from PHCase (? the logical model) to Condition and Observation? Whereabouts is the LM stored - I'll take a look... In theory, if the LM has an element of type reference then the SB should allow you to create the reference...</p>",
        "id": 153914560,
        "sender_full_name": "David Hay",
        "timestamp": 1508289882
    },
    {
        "content": "<p>Oh, hold on - is this a single element with multiple possible data types/references ? Again, in theory, this should work if the element is multiple in the model, but I suspect that the linking in SB won;t support that right now...</p>",
        "id": 153914563,
        "sender_full_name": "David Hay",
        "timestamp": 1508292426
    },
    {
        "content": "<p>both the Patient and Case Logical Model link to Observation and Condition and you have the option of  creating  this relationship  in the SB  menu using the \"+\" button, but the pretty graph doesn't draw the links like I did in the image above.</p>",
        "id": 153914565,
        "sender_full_name": "Eric Haas",
        "timestamp": 1508300489
    },
    {
        "content": "<p>I assume the LM is on a server somewhere? can you send me the URL &amp; I'll take a look :)</p>",
        "id": 153914570,
        "sender_full_name": "David Hay",
        "timestamp": 1508306841
    },
    {
        "content": "<p>I saved the scenario as 'blah' in the SB</p>",
        "id": 153914638,
        "sender_full_name": "Eric Haas",
        "timestamp": 1508338075
    },
    {
        "content": "<p>here is the url : <a href=\"http://fhirtest.uhn.ca/baseDstu3/StructureDefinition/PH-Case\" target=\"_blank\" title=\"http://fhirtest.uhn.ca/baseDstu3/StructureDefinition/PH-Case\">http://fhirtest.uhn.ca/baseDstu3/StructureDefinition/PH-Case</a></p>",
        "id": 153914639,
        "sender_full_name": "Eric Haas",
        "timestamp": 1508338181
    },
    {
        "content": "<p>it does produce an operation outcome error when loading but still seems to render so I ignored it....</p>",
        "id": 153914640,
        "sender_full_name": "Eric Haas",
        "timestamp": 1508338217
    },
    {
        "content": "<p>I think the issue is that the element name is 'reference' - the reference is being created, but the graph display routines get confused because 'reference' is the substring in the datatype that actually contains the reference to the resource (if that makes sense). Basically, if you change the element name to something else it ought to work. I did try to change it in the LM - but in the process mucked up your references (sorry) as it dropped the multiple ones when I tried to edit the name. However, if you edit it manually it ought to work (you may need to go back a version). Please let me know how you get on!</p>",
        "id": 153914696,
        "sender_full_name": "David Hay",
        "timestamp": 1508347240
    },
    {
        "content": "<p>I did get a couple of weird errors in the SB as well - it switched itself to readonly mode (I think as you were the author) and, as you say, there's an error loading the LM into the modeller. I'll look into those when I get a chance - but hopefully you are able to move forward with a bit of manual editing!</p>",
        "id": 153914698,
        "sender_full_name": "David Hay",
        "timestamp": 1508347366
    },
    {
        "content": "<p>great that is easy to change.</p>",
        "id": 153914724,
        "sender_full_name": "Eric Haas",
        "timestamp": 1508348294
    },
    {
        "content": "<p>good oh. Do let me know how it works out!</p>",
        "id": 153914757,
        "sender_full_name": "David Hay",
        "timestamp": 1508353856
    },
    {
        "content": "<p>Works like a charm thanks!</p>",
        "id": 153914765,
        "sender_full_name": "Eric Haas",
        "timestamp": 1508358771
    },
    {
        "content": "<p>it looks like the SB is pretty particular when your SD references a profile on a core resource it expects a profiled resource instead of a core resource.  I think it should allow for core resources too since the graph is a high level view all you may want is the box at the vertices (nodes)</p>",
        "id": 153914770,
        "sender_full_name": "Eric Haas",
        "timestamp": 1508361365
    },
    {
        "content": "<p>So if your SD references, say, argonaut patient it should also allow a reference to a Core patient as well? I thought it did TBH - I'll look into that...</p>",
        "id": 153914778,
        "sender_full_name": "David Hay",
        "timestamp": 1508371459
    },
    {
        "content": "<p>glad the other issue worked out tho!</p>",
        "id": 153914779,
        "sender_full_name": "David Hay",
        "timestamp": 1508371475
    },
    {
        "content": "<p>It may be that I reference a Location profile that is unknown  because that is where it would not all a core Location profile.  I changed the LM to Reference(Location). which is an easy enough workaround</p>",
        "id": 153914783,
        "sender_full_name": "Eric Haas",
        "timestamp": 1508373628
    },
    {
        "content": "<p>glad that there is a work around, but not quite sure what (in an ideal world) you'd like to see happen - can you expand a bit?</p>",
        "id": 153914790,
        "sender_full_name": "David Hay",
        "timestamp": 1508379561
    },
    {
        "content": "<blockquote>\n<p>So if your SD references, say, argonaut patient it should also allow a reference to a Core patient as well? I thought it did TBH - I'll look into that...</p>\n</blockquote>\n<p>that is what I'd like to happen and maybe it does and there was a problem with my sd...</p>",
        "id": 153914851,
        "sender_full_name": "Eric Haas",
        "timestamp": 1508421553
    }
]