[
    {
        "content": "<p>Is there a preferred browser for Scenario Builder?  I've tried on Safari, Chrome and FireFox and when I open Scenario Builder, the top part of the screen is not viewable so you can't get to the New Scenario.</p>",
        "id": 153903889,
        "sender_full_name": "Melva Peters",
        "timestamp": 1503952098
    },
    {
        "content": "<p>Hi Melva, have you tried increasing the screen resolution? In chrome it's &lt;command&gt;&lt;minus&gt; ...(should work in all those browsers...)</p>",
        "id": 153903906,
        "sender_full_name": "David Hay",
        "timestamp": 1503971817
    },
    {
        "content": "<p>I tried changing the resolution, but it just makes everything bigger and doesn’t change the issue that the top row (with the Scenario Builder - Hide Selector - Import resource - etc labels) is over top of the bottom part of the screen.  I only see “local scenarios” and 2 bullets below.  If I try to grab the bottom part and pull down, I can see “New Scenario” but there is no way to click on it.</p>",
        "id": 153903941,
        "sender_full_name": "Melva Peters",
        "timestamp": 1504022333
    },
    {
        "content": "<p>OK - think I've got it. Are you logged in? It appears that if you're not then the top navbar is too big!  I will fix, but can you confirm that that is the issue?</p>\n<p>cheers...</p>",
        "id": 153903955,
        "sender_full_name": "David Hay",
        "timestamp": 1504030344
    },
    {
        "content": "<p>I am logged in and still the same issue.</p>",
        "id": 153903960,
        "sender_full_name": "Melva Peters",
        "timestamp": 1504032530
    },
    {
        "content": "<p>dang.  OK. can you do a screen dump using chrome and email to me (or send via the chat)..</p>",
        "id": 153903964,
        "sender_full_name": "David Hay",
        "timestamp": 1504034719
    },
    {
        "content": "<p>what computer and screen size are you using?</p>",
        "id": 153903965,
        "sender_full_name": "David Hay",
        "timestamp": 1504034746
    },
    {
        "content": "<p>Oh - and I assume this is a new issue, as you've use CF in the past...</p>",
        "id": 153903966,
        "sender_full_name": "David Hay",
        "timestamp": 1504034770
    },
    {
        "content": "<p>OK - have modified the navbar a bit, moving some less used functions to a menu rather than a link (the cog icon to the right). Does that help?</p>",
        "id": 153903968,
        "sender_full_name": "David Hay",
        "timestamp": 1504037634
    },
    {
        "content": "<p>What ever you did worked David!  Thanks!</p>",
        "id": 153903999,
        "sender_full_name": "Melva Peters",
        "timestamp": 1504065826
    },
    {
        "content": "<p>Good-oh! Let me know if you have any further issues...</p>",
        "id": 153904114,
        "sender_full_name": "David Hay",
        "timestamp": 1504127213
    }
]