[
    {
        "content": "<p>One of the things that openEHR has that FHIR doesn't is a way to help collect clinical requirements, and to provide comments against profiles as they are being developed. I made a start <a href=\"http://fhirblog.com/2015/10/30/a-tool-for-commenting-on-profiles/\" target=\"_blank\" title=\"http://fhirblog.com/2015/10/30/a-tool-for-commenting-on-profiles/\">here</a>, but it's pretty basic (and not really exercised at all. I wondered if it was worth starting a stream to collect requirements for such a tool. If there's sufficient interest, then we could see if we can put together an Open Source project to build one.</p>",
        "id": 153815332,
        "sender_full_name": "David Hay",
        "timestamp": 1457816393
    },
    {
        "content": "<p>So you'd probably want some way to collect profiles in some form of 'project' - to bring together all the artifacts you need - could include ValueSets for example - possibly based the whole thing around an Implementation Guide??</p>",
        "id": 153815333,
        "sender_full_name": "David Hay",
        "timestamp": 1457816501
    },
    {
        "content": "<p>You'd want to be able to view the profiles in some user friendly way - perhaps the tree based logical views that people have developed.</p>",
        "id": 153815334,
        "sender_full_name": "David Hay",
        "timestamp": 1457816565
    },
    {
        "content": "<p>being able to generate an example from the profile might be helpful</p>",
        "id": 153815335,
        "sender_full_name": "David Hay",
        "timestamp": 1457816599
    },
    {
        "content": "<p>You'd obviously want some way of threaded comments (and maybe this could be zulip??)</p>",
        "id": 153815336,
        "sender_full_name": "David Hay",
        "timestamp": 1457816634
    },
    {
        "content": "<p>Specific projects might require moderation - and might even need to be developed privately (though I think that goes against the ethos of FHIR myself)...</p>",
        "id": 153815337,
        "sender_full_name": "David Hay",
        "timestamp": 1457816699
    },
    {
        "content": "<p>Instead of creating a parallel toolset and community to help collect clinical requirements, don’t you think it would be a good idea to integrate that work for FHIR and openEHR archetypes? It would be better if we can have one big global clinical community that discusses and collects requirements, rather than having two.</p>\n<p>There is new open source tooling underway for openEHR archetype/template editing, see  <a href=\"https://goo.gl/7Cd52R\" target=\"_blank\" title=\"https://goo.gl/7Cd52R\">https://goo.gl/7Cd52R</a> </p>\n<p>Do you think we could somehow align or join this with the  clinFHIR effort? </p>",
        "id": 153817594,
        "sender_full_name": "Erik Sundvall",
        "timestamp": 1458722485
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-email=\"david@dbooth.org\">@David Booth</span> Hay I can see how a notion of a conformance project would be useful. Forge tries to leverage the current ImplementationGuide resource to provide some sort of package concept. We've also been thinking about introducing application-specific project files, but I think it's beneficial to try and use standardized FHIR concepts.</p>",
        "id": 153817606,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1458725893
    },
    {
        "content": "<p>BTW Currently the \"Session Explorer\" in Forge resembles the mentioned \"logical view\", as the explorer shows references to (external) package resources as child nodes of the package. However this approach also has some limitations/complications, e.g. dealing with unresolved entries and resources referenced by multiple packages. So we've been thinking about improving that part of the UI design.</p>",
        "id": 153817608,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1458726315
    },
    {
        "content": "<p>Erik, sure, we think that would be a good idea in principle, but there's not been a lot of progress in practice. It's hard to get priorities and processes aligned, and politics and personalities and past history doesn't help either</p>",
        "id": 153817619,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458728315
    },
    {
        "content": "<p>did you read Thomas Beales post late last year? It didn't offer us hope that the effort you are talking would help us out</p>",
        "id": 153817620,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458728483
    },
    {
        "content": "<p>Which of Tom's posts were you thinking of?</p>",
        "id": 153817635,
        "sender_full_name": "Erik Sundvall",
        "timestamp": 1458733168
    },
    {
        "content": "<p><a href=\"http://wolandscat.net/2015/12/20/making-fhir-work-for-everybody/\" target=\"_blank\" title=\"http://wolandscat.net/2015/12/20/making-fhir-work-for-everybody/\">http://wolandscat.net/2015/12/20/making-fhir-work-for-everybody/</a></p>",
        "id": 153817636,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458733388
    },
    {
        "content": "<p>I'd consider Tom's post to partly be a (possibly somewhat impolite) probe to see if it would be an option to use FHIR as some kind of \"transport layer\" for things modelled in openEHR and other formalisms. I reckon from the discussion under that post and in <a href=\"http://www.healthintersections.com.au/?p=2415\" target=\"_blank\" title=\"http://www.healthintersections.com.au/?p=2415\">http://www.healthintersections.com.au/?p=2415</a> the answer was a clear NO and I think I understand the logic reasons. After a NO other approaches will need to be looked at.</p>\n<p>Am I correct in believing that FHIRs main purpose is _not_ to be an RM in a generic multi-level model where much of the clinical complexity is moved (<a href=\"http://www.healthintersections.com.au/?p=47\" target=\"_blank\" title=\"http://www.healthintersections.com.au/?p=47\">http://www.healthintersections.com.au/?p=47</a>) to an upper archetype level or similar? Rather FHIR takes care of and models some of the complexity as resource attributes etc and externalizes the rest to extensions/profiles. Is that a correct view?</p>\n<p>So if we want to create a shared clinical requirements-gathering community/space/tooling, then a more interesting thing to do is to figure out ways to keep the clinical reqirement discussions in one place and then form archetypes, FHIR-Resources and profiles from the same disciussions using somewhat integrated tools. If that is done while being aware of and talking to each other, then mappings+extensions will be somewhat easier, and maybe in some cases mappings/profiles could be created and released together. </p>\n<p>It might, or might not, be in the interst of Ocean Informatics (the company behind CKM-tool) to extend their tool to accomodate FHIR-artifact discussion/generation, I don't know, but I'd expect them to at least want to get paid for such extension work. I have long been arguing for moving the CKM-discussions to an open source environment to encourage extensions/modifications etc, but since openEHR gets the service free of charge this has naturally not been a priority for the openEHR Foundation since there are more urgent things to focus on.</p>\n<p>Since it is in the interest of many of us in both openEHR, HL7 and ISO 13606communities to strive for one clinical reqirements-gathering community rather than many, I think we can figure out ways to align some tooling no matter what, if there is a will from all sides. That is the kind of probe I am sending out here...</p>\n<p>(The new online archetype/template-tools are not controlled by Ocean Informatics by the way, and neither is the openEHR foundation.)</p>",
        "id": 153817651,
        "sender_full_name": "Erik Sundvall",
        "timestamp": 1458738634
    },
    {
        "content": "<p>several comments:<br>\n- the answer is not a clear no. We don't like some of hte consequences of the idea, that's for sure. But that doesn't mean we won't help if that's the kind of use people want. It's on our list<br>\n- FHIR is not a RM in a generic multi-level model, no. We agree that multi-level modeling is a useful tool, but the starting proposition of FHIR is that there is (or can be) enough agreement to a generic base to be a useful thing, And that you can build additional levels of models on top of that<br>\n- the fundamental battle is over this; methodologically, openEHR rejects that, and certain openEHR people reject that out of hand. Tom's post reflects this rejection, but sort of more from pragmatic reasons than theoretical ones. <br>\n- but it doesn't matter whether it's for theoretical or practical, as long as you assume that you can go ahead and design whatever models you want without having to account for the base level agreements in FHIR, then there's not going to be alignment there, and sharing tools isn't going to do anything for us <br>\n- I agree that we should have an open environment. We're working on an implementation guide for using resources to do the review process that CKM does; commodising the bits will enable people to mix open and free and paid in the way they want</p>",
        "id": 153817704,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458759851
    },
    {
        "content": "<p>The main distinction in my post was between model-based systems / environments and non-model based systems. Any system based on a reference model + semantic models approach (which I believe is the future of EHR) isn't going to be easy to access via native FHIR profiles - we are just back to the clashing models problem (talking technically here).</p>\n<p>For non-model-based systems (the majority today), something like FHIR makes sense, because it just standardises the information contained within. I do think it's a pity that the FHIR models for doing that are not aligned (other than adverse reaction) with semantics models of the same content (CIMI, Intermountain, openEHR, 13606, even some CDA templates) because the latter are likely to be preferred models of semantic querying.</p>\n<p>But there is another issue as well: there are a lot of useful semantics in the reference models of those multi-level modelling approaches. I am working at Intermountain on next generation workflow based architecture - and that reference model will be very powerful. On top of it will sit Intermountain and CIMI archetypes. But obviously Intermountain is using FHIR. So it would be genuinely useful to be able to expose that RM and the models on top of it in the FHIR environment.</p>",
        "id": 153818218,
        "sender_full_name": "Thomas Beale",
        "timestamp": 1458986681
    },
    {
        "content": "<p>I really have to take issue with this, there's two falsehoods in this.  </p>",
        "id": 153818219,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458986813
    },
    {
        "content": "<p>The first is that there's aa binary distinction between model and non-model systems. All systems have some degree of formalism, and some community around them. You're arbitrarily drawing a line in the sand and pretending it's a clean division,</p>",
        "id": 153818220,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458986910
    },
    {
        "content": "<p>i think you're trying to draw openehr as somehow special,,as opposed to yet another community with their own models (or, in the case of openehr, their on swarm of models). </p>",
        "id": 153818221,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458986976
    },
    {
        "content": "<p>Using FHIR for interchange really isn't different between the different communities either - they have to map to the common form.. I think that it's intraoperability where you see a difference</p>",
        "id": 153818222,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458987057
    },
    {
        "content": "<p>the second issue is that there's a single target for archetypes - as you know, it's just a technique; all the models are different. We consult all of them and often have large spreadsheets comparing them. I wonder why Cimi etc don't change course and join with FHIR. I think openehr is a harder problem because it has production system impetus</p>",
        "id": 153818223,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458987221
    },
    {
        "content": "<p>On the question of model-based - most commercial systems don't make their models available. Yes, you can obtain some kind of view table structure, often local in nature. The models of the clinical semantics certainly are not published, they are partly baked in, partly (mostly) built as form definitions. The real situation with working with data from current major vendor systems is that you don't have any standard semantic definitions to work with, you may have local form definitions, that's about it.</p>",
        "id": 153818224,
        "sender_full_name": "Thomas Beale",
        "timestamp": 1458987269
    },
    {
        "content": "<p>That doesn't mean that the vendor doesn't have them to some degree</p>",
        "id": 153818225,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458987319
    },
    {
        "content": "<p>On the question of 'being different', it's not about openEHR, it's about model-based architecture. openEHR is just one architecture that does the same thing: based (very carefully designed) Reference Model + layers of semantics models that obey the RM. That's a style of architecture. openEHR is just one example.</p>",
        "id": 153818226,
        "sender_full_name": "Thomas Beale",
        "timestamp": 1458987352
    },
    {
        "content": "<p>The really key thing here that I think people are interested in is clinical people/domain experts being able to define semantic models independently  and upstream of any particular implementation technology. There's a lot of power in being able to generate from a semantic model (a template for example) a) a code skeleton b) an XSD c) a JSON screen protoform d) a FHIR (or FHIR-like) profile e) an HTML5 display format f) a PDF g) .... etc</p>",
        "id": 153818227,
        "sender_full_name": "Thomas Beale",
        "timestamp": 1458987596
    },
    {
        "content": "<p>I don't argue with whether the vendor has them or not - if they don't internally, they're not even doing the basics. The point is whether those models are a) even expressed in a logical way (they aren't for the big vendors) or b) published or available for users (they aren't).</p>",
        "id": 153818228,
        "sender_full_name": "Thomas Beale",
        "timestamp": 1458987678
    },
    {
        "content": "<p>One thing to remember is that clinical semantics take a long time to get right, and involve expensive people time. It's surely worth providing a way to express them that is not specific to a particular downstream technology, but instead is re-usable over time?</p>",
        "id": 153818229,
        "sender_full_name": "Thomas Beale",
        "timestamp": 1458987806
    },
    {
        "content": "<p>BTW, in terms of orgs with major RMs... VA - FHIM.</p>",
        "id": 153818230,
        "sender_full_name": "Thomas Beale",
        "timestamp": 1458988266
    },
    {
        "content": "<p>But, by your definition, FHIR *is* a multi-level model-based design.  First, all of the clinical models are based on HL7's reference model - the RIM.  Second, the FHIR models themselves are technology-independent - you can serialize them in XML, in JSON or in RDF.   And you can render them in HTML too.</p>",
        "id": 153818235,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1459001976
    },
    {
        "content": "<p>The difference between FHIR and OpenEHR is not whether we're model-based or not.  I see two main differences:<br>\n1. In OpenEHR, different communities are free to define their own archetypes covering the same space.  That limits interoperability to within the bounds of each community.  In FHIR, to be conformant, everyone must use the same resource (roughly the same as archetype) when they're sending a particular type of information.  (Though there are edge cases where, for legacy reasons, there may be confusion about what resource a particular piece of legacy data corresponds to.)<br>\n2. In OpenEHR, the modeling process is biased towards \"clinical idealism\" - at least as perceived to be ideal by a particular community of clinicians.  In FHIR, the bias is towards \"what do implementers do?\".</p>",
        "id": 153818236,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1459001976
    },
    {
        "content": "<p>I think there's benefit to adding more clinical rigor to FHIR, but not at the expense of reflecting the reality of what real systems (used by \"real\" clinicians) currently do.</p>",
        "id": 153818237,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1459001976
    },
    {
        "content": "<p>I don't think FHIR is willing to give up on #1 - which is the real sticking point of allowing OpenEHR models to be transmitted over the FHIR infrastructure.  Doing that breaks interoperability.  As things stand now, if someone sends an allergy or prescription or encounter in FHIR from any system anywhere in the world, I'll be able to parse it and able to understand most of the content, though there may be challenges with a few code systems.  And I don't need to consult with the sender in order to have that understanding.  That's very powerful and is something we're loath to give up - certainly not without drawing a very clear deliniation between interfaces where you can expect that degree of interoperability and those where you can't.</p>",
        "id": 153818238,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1459001976
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> The question of (semantic) 'interoperability' as you put it isn't controllable by technical means in either openEHR or FHIR. In openEHR, the RM is fixed, noone gets a choice on that. But it's easy for local groups to invent their own blood pressure measurement archetype. It just happens that they don't, by choice - there's only one such archetype, at <a href=\"http://openEHR.org\" target=\"_blank\" title=\"http://openEHR.org\">openEHR.org</a>. They do invent competing versions of less obvious things though (e.g. medication order), and sometimes it takes time for those to bubble up from the national level to international level. It's messy, but commonality does emerge, and there are many archetypes to show that. How well this process works is completely to do with organisational agreements, communication, cooperation, and only slightly to do with tools and technical aspects.</p>\n<p>The same will be true in FHIR: it will be just as easy for 10 groups to create 10 profiles based on a core FHIR resource, each intended to model the same thing (say part of a pregnancy record), and they will come up with 10 different non-interoperable profiles. Since FHIR is more developer/IT oriented, it's also more likely that these models will reflect IT pre-occupations rather than clinical knowledge. See this post (<a href=\"http://wolandscat.net/2015/11/29/why-it-people-cant-build-information-systems/\" target=\"_blank\" title=\"http://wolandscat.net/2015/11/29/why-it-people-cant-build-information-systems/\">http://wolandscat.net/2015/11/29/why-it-people-cant-build-information-systems/</a>) for the reality of IT people  trying to design clinical artefacts. This problem in FHIR will probably be greater even than in openEHR, because now we are talking thousands of developer companies, not just a small number of clinical modelling programmes. This isn't a criticism - it's just how anything that is like 'profiling' ends up working in practice.</p>\n<p>openEHR, and other model-based architectures already have interoperability (including over REST), but we don't have it over FHIR. THere are customers who want a) semantic interoperability, b) clinical models that can be re-used in more places than just FHIR, c) but they want FHIR today (they've been told it solves everything...). It seems pretty clear how to achieve it, except that the obvious path is not currently open.</p>\n<p>BTW, most 'real clinical systems' only approximately represent what clinicians do. Most are terribly badly designed and the clinical semantics are buried in the UI forms, not the database. Most lack formal models of business level process or content, and the most common schemas are just huge ER models that try to capture every known data point on every major logical 'type' they can think of.</p>",
        "id": 153818276,
        "sender_full_name": "Thomas Beale",
        "timestamp": 1459020961
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191388\">@Thomas Beale</span> The difference is the granularity of the base model.  The RM for OpenEHR is extremely abstract (sort of like the RIM, though with a different approach) with numerous ways of conveying the same thing.  The semantics live in the archetype definitions, not the RM.  In FHIR, the base model is semantic-rich and extremely concrete.  The base model for MedicationOrder in FHIR has specific slots for prescriber, patient, medication, various aspects of dosage instruction such as start date, dose quantity, maximum dose/period, etc.  So there's a significant degree of consistency enforced by the base model - the key semantics are defined in the base model and only more esoteric semantics (e.g. sophisticated components needed for chemotherapy protocols) are left to the profiling/archetypes level as extensions.  The result is that, while there may be disagreement over what code system to use for medications, there's still a standard way to convey that medication and that dosage.  If we bring in the OpenEHR models, then there becomes 11+ ways that same information might show up in an instance - and that's a problem.  Right now, I know how to find the dose quantity of any FHIR prescription written anywhere in the world (if they capture dose as a discrete value).  If we introduce the OpenEHR archetypes or other models, that won't be true anymore.</p>\n<p>There are certainly advantages to having OpenEHR leverage the FHIR infrastructure, but for it to not disrupt the existing FHIR community, we'd have to compartmentalize the use of the specification so it's clear what degree of interoperability implementers can expect with a given system.  Right now, we're working to convey the advantages of having OpenEHR at least partially within the tent and also how to properly delineate implementations.</p>",
        "id": 153818280,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1459024190
    },
    {
        "content": "<p>This is a great discussion and it really helps in understanding each other's perspectives. I think we'll be able to agre on what to agree and disagree on at least from a technical perspective.</p>\n<p>Interesting to see how FHIR openly dictates a larger part of  the clinical semantics than the openEHR RM (or previous HL7 initiatives) have done. (Are national FHIR-endorsing programmes aware of this?)</p>\n<p>OpenEHR could probably also use a set of (more or less) dictating core parts of some important core archetypes (perhaps expressing the mandatory parts as templates) that you need  to abide to in order to certify your system (or national program) as an \"internationally compliant\" implementation. Those cores of core archetypes could probably in most cases have internationally maintained and shared FHIR-mappings too.  Mappings do not need to be 1:1 in source models but should be algorithmically transformable (Is that what CIMI calls iso-semantic?). Any thoughts on that? Would that encourage increased openEHR+FHIR collaboration on clinical modelling?</p>",
        "id": 153818309,
        "sender_full_name": "Erik Sundvall",
        "timestamp": 1459067443
    },
    {
        "content": "<p>Perhaps my comment above would fit better in the openEHR-stream instead. I'll copy relevant parts there and encouage you to do followup discussion there instead of here.</p>",
        "id": 153818310,
        "sender_full_name": "Erik Sundvall",
        "timestamp": 1459067597
    },
    {
        "content": "<p>I agree I've learned a lot from these discussions than any other reading or training. I really appreciate your determinedness to get base model shared and mandated. I think we as openEHR community should also agree on some core clinical semantics you're right that RM is all too abstract.</p>",
        "id": 153818313,
        "sender_full_name": "Koray Atalag",
        "timestamp": 1459069603
    },
    {
        "content": "<p>Koray, I partly agree - Lets continue this in the openEHR stream - I'll copy your reply to that stream and answer there</p>",
        "id": 153818314,
        "sender_full_name": "Erik Sundvall",
        "timestamp": 1459071421
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> the models are of course different. FHIR clinical resources are designed as a single level model to which adjustments can be made; the opeEHR reference model is a model of generic structure plus context attributes (only the varying clinical semantics have to be added). One could think of the FHIR resource Condition for example as being similar to the compiled version of the openEHR Problem archetype, where compilation causes inheritance flattening of any lineage of archetypes onto the RM. Similarly, Fhir:MedicationOrder has similar attributes to be openEHR RM - Instruction (contains the generic attributes of orders) coupled with archetypes of various kinds of order, including Medication Order.</p>\n<p>It appears that the resulting deployable models in each case somehow suit the various communities who create them.  But the result in openEHR isn't 11 ways to describe Medication Order, there is just one (<a href=\"http://www.openehr.org/ckm/#showArchetype_1013.1.123_mindmap\" target=\"_blank\" title=\"http://www.openehr.org/ckm/#showArchetype_1013.1.123_mindmap\">http://www.openehr.org/ckm/#showArchetype_1013.1.123_mindmap</a>), but if national programmes want something different, they can define it. It's not up to a standards organisation to prevent that. </p>\n<p>It's only a problem if the actual data sharers discover it is, e.g. across European borders. Then they become very interested in using the same model, and indeed that's what happens over time. This level of standardisation is driven by real-world mutual interest. Does it matter if the Australian Medcation order model is different from the international one? Not really. If it starts mattering, then relevant agencies will no doubt act.</p>\n<p>So it's not really true to say that the technical possibility of there being more than one archetype for Medication Order poses a problem to FHIR. There will only be multiple versions of such a model when cross-border interoperability doesn't matter and no efforts are made to standardise. On the other hand, a great majority of detailed clinical data never go beyond their original systems - what is widely shared is in fact only about 5-10% of the total data in an EMR - i.e. the managed lists (Rx, Dx, allergies etc), basic demographics, family history, etc. So there's actually no sense in imposing a standard 'pregnancy record' model on the whole world when such a thing doesn't exist in reality; each country has its own and that's the way they want it.</p>\n<p>I'm not bringing any of this up to be difficult (despite possible opinions to the contrary) - what I'm pointing out is that neither FHIR, nor openEHR, nor any other clinical standards like effort can impose the one model to rule them all on the world; it can only create tools and formalisms that provide capabilities. The rest is up to human institutional agreements.</p>\n<p>I think the benefits of model-driven clinical data standards are pretty clear: single-source modelling, with multiple downstream deployments. At the moment, we can't easily connect that kind of framework to FHIR, but I am arguing that it would be a good idea. How else could 20,000 - 50,000 clinical content (and soon - workflow) data point models (= ~4,000 openEHR style archetypes) be deployed over FHIR? It's not going to happen by old-style custom mapping approach.</p>\n<p>Obviously it would need to be done as a serious conversation between organisations (openEHR is just one of many),  so that the various levels of tooling and models were properly managed and described, enabling developers. If we did this, the benefits could include:</p>\n<ul>\n<li>directly connecting large numbers of clinical model authors to the FHIR framework</li>\n<li>enabling a path for CIMI models to be natively deployed over FHIR</li>\n<li>enabling re-use of content models used in FHIR in other downstream technologies</li>\n<li>standardising the approach to using terminology from content models to the FHIR approach</li>\n<li>making FHIR 'profiling' and the archetype formalism (which appear to do the same thing) into one formalism</li>\n</ul>\n<p>Most of this is aimed at reducing wheel invention and obtaining significant added value by connected currently disconnected large pieces of work in health informatics together.</p>",
        "id": 153818318,
        "sender_full_name": "Thomas Beale",
        "timestamp": 1459078059
    }
]