[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span> - would it be possible for ClinFHIR to have a \"Record History\" option that the user could turn on/off. It may be useful for trouble shooting problems, but more importantly, it could help us write verbal scripts to instruct future users. As the user community's sophistication increases, they'll want more and more examples of how to create FHIR resources and other artifacts. Just a idea, in case your backlog is getting shorter. :grin:</p>",
        "id": 153895970,
        "sender_full_name": "Viet Nguyen",
        "timestamp": 1499103780
    },
    {
        "content": "<p>How would that work? ie, what is in the history?  btw - working on a way of 'scoring' a scenario against a 'reference' scenario (same number of resources, matching references etc) - would that help?</p>",
        "id": 153895990,
        "sender_full_name": "David Hay",
        "timestamp": 1499142730
    },
    {
        "content": "<p>I'm guessing that you could just hold a list for the logged in user of the resources that they've saved/loaded (AuditEvent records?)</p>",
        "id": 153895994,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1499145409
    },
    {
        "content": "<p>I'm imaging a kind of breadcrumb list that records each event in which the user enters and input (e.g. create new scenario, add a element to a resource, etc.) and ClinFHIR responds. I think you had something like that in a past version that you used from trouble shooting. Maybe the system saves only the most recent 100 or more actions and allows the user to save the list to a file that would allow you or another user to repeat the actions to recreate a scenario. </p>",
        "id": 153896026,
        "sender_full_name": "Viet Nguyen",
        "timestamp": 1499182731
    },
    {
        "content": "<p>I can certainly save the history of actions - though a 'replay' may be a bit more tricky! Though it sounds like that you are more interested in being able to generate a list of instructions (?recipe) for performing a specific task - doesn't sound too hard (= famous last words <img alt=\":relaxed:\" class=\"emoji\" src=\"/static/generated/emoji/images/emoji/relaxed.png\" title=\":relaxed:\"> )</p>",
        "id": 153896271,
        "sender_full_name": "David Hay",
        "timestamp": 1499382385
    },
    {
        "content": "<p>I recall functionality in other apps where you could turn a 'record' on - which created a list of the actions performed. Sounds like a worthy addition!  I assume you are talking about the scenario builder...</p>",
        "id": 153896272,
        "sender_full_name": "David Hay",
        "timestamp": 1499382538
    },
    {
        "content": "<p>and yes, looking for things to do <img alt=\":smile:\" class=\"emoji\" src=\"/static/generated/emoji/images/emoji/smile.png\" title=\":smile:\"> ...</p>",
        "id": 153896273,
        "sender_full_name": "David Hay",
        "timestamp": 1499382626
    },
    {
        "content": "<p>So have started this. If you select a resource in the Scenario Builder you'll see a new tab labelled 'changes' to the right side. As you do things to a resource (like adding the value to an element, or creating a reference) it is recorded and the changes will appear in the list. There's also a new option in the nav bar that shows all changes for all resources in a scenario (I moved the library functions to a menu to make space).<br>\nIt doesn't cover all changes yet, and there is no 'replay' ability - other than manually copying the steps, but would be interested in your comments. Thinking that it could form the basis of a 'recipe' for how to complete a scenario (as you mentioned) so will add annotations, edits  &amp; export functions at some point...</p>",
        "id": 153896431,
        "sender_full_name": "David Hay",
        "timestamp": 1499627072
    },
    {
        "content": "<p>btw - the changes are associated with a single scenario, and only recorded in the local browser at the moment.</p>",
        "id": 153896432,
        "sender_full_name": "David Hay",
        "timestamp": 1499627115
    },
    {
        "content": "<p>Thanks David!</p>",
        "id": 153897125,
        "sender_full_name": "Viet Nguyen",
        "timestamp": 1500321879
    }
]