[
    {
        "content": "<p>What is the best way to share scenarios across users ?  I created a scenario and i am able to upate the fhir server but sharing the scenario itself , was not sure the approach for that - thanks</p>",
        "id": 248864363,
        "sender_full_name": "Sean Muir",
        "timestamp": 1628523354
    },
    {
        "content": "<p>Using which module?</p>",
        "id": 249023455,
        "sender_full_name": "David Hay",
        "timestamp": 1628623175
    },
    {
        "content": "<p>If Graph builder, then publish to the Library - and you'll get a link you can send to others. (You do have to copy from the dialog - I'll stick the link somewhere easier to find). For example, here's a lab example I'm working on: gb2.clinfhir.com#id1621630619512</p>",
        "id": 249023866,
        "sender_full_name": "David Hay",
        "timestamp": 1628623325
    },
    {
        "content": "<p>What I'm doing here is to create the scenario, save to the server, then use the Query module to query it. Helps with defining the API...</p>",
        "id": 249023971,
        "sender_full_name": "David Hay",
        "timestamp": 1628623380
    },
    {
        "content": "<p>i have been using Scenario Builder perhaps i should swich to Graph Builder 2 ?</p>",
        "id": 249035100,
        "sender_full_name": "Sean Muir",
        "timestamp": 1628628290
    },
    {
        "content": "<p>That would be preferable! I'm not really developing scenario builder these days...</p>",
        "id": 249179764,
        "sender_full_name": "David Hay",
        "timestamp": 1628722255
    },
    {
        "content": "<p>will do thanks</p>",
        "id": 249179783,
        "sender_full_name": "Sean Muir",
        "timestamp": 1628722279
    },
    {
        "content": "<p>Look into the library - if you save to the library then you will get a url that you can share which will link to your project. (Note that there's an issue with sharing multiple view projects at the moment - if you stick to a single view you're fine...</p>",
        "id": 249189325,
        "sender_full_name": "David Hay",
        "timestamp": 1628731819
    },
    {
        "content": "<p>Actually - ignore that comment - multi view works just fine in the library...</p>",
        "id": 249278832,
        "sender_full_name": "David Hay",
        "timestamp": 1628795269
    }
]