[
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span> Happy New Year!<br>\n<span class=\"user-mention\" data-user-id=\"192418\">@Sean Muir</span> and I are planning  on using ClinFHIR for the Care Planning Connacthathon Track this week. I'm noticing  that some of the resources are not showing up in ClinFHIR when I Update Server in the Scenario Builder. It almost seem as if the resources that get updated are Condition, Observation, Patient, and Encounter. No other resouces - specifically Goal are showing up. They don't show up in Patient Viewer either. Can you please help? </p>\n<p>Thanks, Emma</p>",
        "id": 267486392,
        "sender_full_name": "Emma Jones",
        "timestamp": 1641842307
    },
    {
        "content": "<p>Hi Emma - and happy new year to you as well!  Can you save the graph to the library and send me the link?  All resources certainly SHOULD be updated (assuming they pass validation of course) so may well be a bug or something similar...</p>",
        "id": 267492662,
        "sender_full_name": "David Hay",
        "timestamp": 1641845225
    },
    {
        "content": "<p>BTW - You do mean Graph Builder - right? Scenario Builder has been deprecated...</p>",
        "id": 267494372,
        "sender_full_name": "David Hay",
        "timestamp": 1641846103
    },
    {
        "content": "<p>Hi David we started with scenario builder i will look into moving to graph builder but scenario builder is not show goals   which i assume is expected behavior  we were not starting from scratch so thought scenario fit better we also wanted to update the server</p>",
        "id": 267505893,
        "sender_full_name": "Sean Muir",
        "timestamp": 1641851407
    },
    {
        "content": "<p>Hi Sean - I should really remove scenario builder - or at least put a big notice in the front! Please try in graph builder &amp; let me know how you get on...</p>",
        "id": 267514161,
        "sender_full_name": "David Hay",
        "timestamp": 1641855678
    }
]