[
    {
        "content": "<p>Have just converted clinFHIR to use SSL (long overdue :) ).  You shouldn't notice any changes as HTTP calls will be re-directed, but reach out here if you do have any issues...</p>",
        "id": 246141515,
        "sender_full_name": "David Hay",
        "timestamp": 1626376313
    },
    {
        "content": "<p>Alas - I had to roll this back (for now). Because is an SPA it calls FHIR servers from the web page - and many of them are insecure, so lots of stuff broke.</p>\n<p>Not sure the best approach - I could allow both http &amp; https (but an ordinary user wouldn't know which to choose). The other approach could be to proxy calls through the node server - but that could be a fair bit to update.</p>\n<p>If anyone knows how to safely allow a page served over ssl to access an http site I would be very interested!</p>",
        "id": 246168461,
        "sender_full_name": "David Hay",
        "timestamp": 1626391449
    },
    {
        "content": "<p>That would need a proxy for sure. CORS prevents that in the browsers.</p>",
        "id": 246357192,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1626578807
    },
    {
        "content": "<p>Yeah - that was my thought. It's not a difficult thing to do - just need to go through all the places where I'm calling external servers and proxy the call through the CF server...</p>",
        "id": 246363587,
        "sender_full_name": "David Hay",
        "timestamp": 1626591150
    },
    {
        "content": "<p>Seriously though all FHIR servers ought to support tls. Which are the servers you need to integrate with that don't?</p>",
        "id": 246403300,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1626648858
    },
    {
        "content": "<p>The hapi test server was the main one (and, I must admit my own instances of hapi are not yet ssl compliant)...</p>\n<p>Looking at the servers for the last <a href=\"http://conman.clinfhir.com/connectathon.html?event=con27\">connectathon</a> 10/57 were http...</p>",
        "id": 246533058,
        "sender_full_name": "David Hay",
        "timestamp": 1626742674
    },
    {
        "content": "<p>You have 57 servers being used with clinfhir? Or you're just saying these are connectathon servers across all tracks? I'd suggest moving to TLS and encouraging folks to ue TLS-protected servers. You can <em>also</em> host a copy at \"http\" to account for the use case where people really want that (but it's good to have some kind of explicit opt-in, so they don't get there by accident / by default).</p>",
        "id": 246534830,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1626744107
    },
    {
        "content": "<p>That were the number of servers registered with conMan for the May connectathon - 57 in total, 10 were not SSL....</p>\n<p>I did think of the explicit HTTP - but it requires the user to know in advance whether the server they wish is using SSL - which is not really a go-er I think. I will go down the proxy route I think - just need to find the time to do it!</p>",
        "id": 246536974,
        "sender_full_name": "David Hay",
        "timestamp": 1626746373
    },
    {
        "content": "<p>Wait,why is explicit http a no-go? You can always suggest it and send people to the non tls endpoint the first time they try to configure a connection to a non TLS server.  (I mean, proxying stuff is okay too, but it's a whole different ball of wax and there's something nice about developers being able to see the direct interactions in their network tab.)</p>",
        "id": 246537231,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1626746617
    },
    {
        "content": "<p>It just requires users (many of who are not technical) to choose which 'version' of CF to use. Doesn't sound user friendly to me...</p>\n<p>The advantage of the proxy (I'll just route it through the CF server) is that it will work with any FHIR server - and users will still be able to look at the requests in the network tab.</p>\n<p>Lesser of 2 evils really...</p>",
        "id": 246538155,
        "sender_full_name": "David Hay",
        "timestamp": 1626747624
    },
    {
        "content": "<p>Fair enough ;-)</p>",
        "id": 246538551,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1626748153
    }
]