[
    {
        "content": "<p>FSH editor rendered as if it was a string and not an annotation.  Put note = \"blah blah\" instead of note.text = \"Blah Blah\"</p>",
        "id": 220666200,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1608623748
    },
    {
        "content": "<p>I'd like to try out the support mechanism. Can you save your project to the Library, then tell me what the name of your project was? That way I can download it and see what's happening (I've been doing a lot of updates recently so may have fixed it, but being able to view your project should make debugging straightforward)...</p>\n<p>I'm going to make the sharing of projects in this way a bit easier - but will be good to try it out!</p>",
        "id": 220843240,
        "sender_full_name": "David Hay",
        "timestamp": 1608775175
    },
    {
        "content": "<p>Basic Patient Request for Correction - Requested</p>",
        "id": 220972912,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1609005160
    },
    {
        "content": "<p>Should all be working now <span class=\"user-mention\" data-user-id=\"191531\">@Virginia Lorenzi</span> . I was able to download your project, add a note, and then update the library. If you download it again, then you should see my note in the FSH for the task.  (I'm working on collaboration - see <a href=\"http://gb2.clinfhir.com/mkdocs/site/multipleEditors/\">docs</a> though very much a WIP right now... (comments welcome as always).</p>\n<p>Some other things in the update:</p>\n<ul>\n<li>You need to log in to be able to save a project to the library</li>\n<li>The FSH editor now 'understands' backbone elements - you select the BBE then get a list of all the elements in the BBE - you no longer select the child elements. I haven't checked for nested BBE like in carePlan yet - I suspect it will need tweaking to get the paths right</li>\n<li>You can create a reference in the FSH editor now - in fact you can even create a resource instance from the editor (doesn't work in BBE yet)</li>\n<li>You can manually enter a system/code if there is no binding...</li>\n</ul>\n<p>And remember that the FSH is the source of truth for structured data - when the editor goes a bit wonky you can always update the text directly...</p>",
        "id": 220979797,
        "sender_full_name": "David Hay",
        "timestamp": 1609018042
    }
]