[
    {
        "content": "<p>David and all,<br>\nI have spent several cliniciansonfhir working with wonderfully developed spreadsheets showing clinical data scenarios and loaded them using the clinfhir tool by using scenario builder.  Certainly, the act of doing this has brought out interesting nuances of value, but sometimes, its a data entry exercise.   Spreadsheets are a normal way for clinicians and analysts to lay out data for import into EHRs - this is typical for our clinical analysts to do in the workplace.  If we have a spreadsheet/csv table where the name of the sheet is the resource and the columns exactly match the fields in the resources, could clinfhir have an import tool which generates resources from that and then flags any issues?  I am not sure how others feel about the utility of this.  We might be able to get alot more rich clinical resources in that way.</p>\n<p>Also, I did not feel the new tool to capture workflow documentation was all that useful.  It seems that being able to just write up word files seemed easier.  Also, there is alot of clinical workflow already captured in outside resources and in the tremendous body of work in V3 and DAMs.</p>",
        "id": 153941084,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1519773460
    },
    {
        "content": "<p>there are already tools to do this. Doesn't need to be in clinfhir</p>",
        "id": 153941087,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1519773522
    },
    {
        "content": "<p>Thanks Grahame.  CliniciansonFHIR seems to sometimes about using the tool and I don't think that was ever the intent.  Can we use those at clinicians on fhir?  Huge beautiful spreadsheets were don<br>\ne for the Care Planning Track.  Can we learn how to use them and where they are?  I would like info on it sooner rather than later.  Maybe David should just throw in a link. :)</p>",
        "id": 153941091,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1519773736
    },
    {
        "content": "<p>I'll see what it would take to expose mine. The trick is that the repeating columns business. Also, a related question: do you think in columns or rows?</p>",
        "id": 153941093,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1519774076
    },
    {
        "content": "<p>Well its Tuesday evening here so tonight I think a spreadsheet row is a database row.  But on another day I might go the other way.  Either will work and I learned how to do a special paste in excel that rotates to solve that problem.  Would David's graphical viewer still work?</p>",
        "id": 153941095,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1519775238
    },
    {
        "content": "<p>Hi Virginia. I'm sure it would be feasible to write an import routine - though repeating values would be fun, and the layout would need to be precise to be able to construct real resources from them...</p>\n<p>but, regardless, I suspect we need a quicker way of creating a resource instance than the current way...</p>\n<p>What is the link you would like? from the tool to the spreadsheet? where would the link be?</p>\n<p>wrt the workflow (I assume you mean the scenario in conman?) - yes, right now it's quite simple. My thinking was that it would eventually be like an index into a set of scenarios where each step in the workflow would link to a version of a scenario that changes over time reflecting the changes that occur at each step. Will take a bit of work to get there though, so may not be worth in. We'll see how it goes.</p>\n<p>And, of course, the COF is not about clinFHIR - thats a tool for a purpose. if there are existing/better tools then we should be using them!</p>",
        "id": 153941103,
        "sender_full_name": "David Hay",
        "timestamp": 1519781276
    },
    {
        "content": "<p>It seems that the spreadsheets should be an artifact of the process, but once we translate them into JSON/XML we shouldn’t need to go back to the spreadsheet.  Do we have the JSON/XML results of the New Orleans or Koln CliniciansOnFHIR sessions available for download anywhere?  Because....  interoperability, right?</p>",
        "id": 153970252,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1529324324
    },
    {
        "content": "<p>Also, Symptomatic has some functionality for importing/exporting CVS into CCD-on-FHIR and vice versa.  We don’t have dynamIc column parsing and are currently hardcoding column order, but we may ha be some tooling that could help.</p>",
        "id": 153970253,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1529324463
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196228\">@Priya Mathew</span> Just subscribing you here. Welcome</p>",
        "id": 153971583,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1529939457
    },
    {
        "content": "<p>Thank you!</p>",
        "id": 153971608,
        "sender_full_name": "Priya Mathew",
        "timestamp": 1529942675
    }
]