[
    {
        "content": "<p>Hi Guys - thanks for coming to the Clinicians challenge yesterday and giving me all that great feedback on clinFHIR - I really appreciate it! I'll work through the issues as I have time - and will notify through this channel as they get uploaded. I did have some time travelling back to New Zealand so I was able to do a couple of things:</p>\n<ul>\n<li>You can view a patients existing resources as XML - and download them to the local machine also (This is to support using clinFHIR to generate samples - especially for  Melva and John :) )</li>\n<li>When creating a resource instance and wanting to create a reference to an existing one, there's now a link (just under the dropdown) that will display the resources of that type in a dialog with a complete json representation of the resource than you can use to better select the resource</li>\n</ul>",
        "id": 153827873,
        "sender_full_name": "David Hay",
        "timestamp": 1463261095
    },
    {
        "content": "<p>I think this channel is probably the best way to send feedback - so keep it coming!</p>\n<p>cheers...</p>",
        "id": 153827874,
        "sender_full_name": "David Hay",
        "timestamp": 1463261130
    },
    {
        "content": "<p>Much appreciated David!  Any further thought on what needs to be done so that we can be referencing the most current build for the resource to enable us to create instance examples for the upcoming STU3 Release?</p>",
        "id": 153827988,
        "sender_full_name": "Melva Peters",
        "timestamp": 1463414794
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191916\">@ Bob Milius</span> The latest version now has the ability for you to enter 'ad-hoc' codes for a codeable concept. There's no validation performed (other than the usual server based stuff) so you can enter what you want! It would be feasible to add  simple validation - eg using the 'ValueSet/$validate-code' to see if it is in some other ValueSet, or maybe CodeSystem/$lookup might be a better choice. thoughts?</p>",
        "id": 153828006,
        "sender_full_name": "David Hay",
        "timestamp": 1463420873
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> - it occurs to me that the CodeSystem/$lookup may meet your requirements as well...</p>",
        "id": 153828007,
        "sender_full_name": "David Hay",
        "timestamp": 1463420995
    },
    {
        "content": "<p>Thanks, David! I see it includes entries for system, code, and display. The only thing I'd add right now is the version element.</p>",
        "id": 153828042,
        "sender_full_name": " Bob Milius",
        "timestamp": 1463427143
    },
    {
        "content": "<p>David,  I think that CodeSystem/$lookup probably makes the most sense in this context - that should be useful</p>",
        "id": 153828089,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1463447226
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> funny you should say that...<br>\nIf you take a look at the latest version, you now have the ability to do a lookup based on CodeSet/$lookup. Having found a code you can navigate up and down the hierarchy (assuming it has one - like SNOMED) from links supplied by the service. You can also first find the concept you want by searching within the binding (ValueSet/$expand), and then select the 'navigate' tab to traverse the hierarchy as well.<br>\nThis stuff is just too easy...</p>",
        "id": 153828090,
        "sender_full_name": "David Hay",
        "timestamp": 1463452426
    },
    {
        "content": "<p>(though the UI does require a bit more love and attention...)</p>",
        "id": 153828091,
        "sender_full_name": "David Hay",
        "timestamp": 1463452458
    }
]