[
    {
        "content": "<p>I wrote this in answer to a question on another stream:</p>\n<p>wrt clinFHIR - as others have said it's primarily designed to help people understand what fhir is by letting them create instances of resources, and link them together via references to show how clinical scenarios can be represented using fhir. It also allows you to create simple profiles (and the supporting resources) - but primarily with an educational focus, so is quite limited compared to Forge which is much more comprehensive...<br>\nYou can build 'logical' models and view them in the 'scenario builder' so it's also useful to capture requirements and to the workgroups developing the fhir resources. I'm working on being able to generate the profiles from the logical models, but it is a work in progress...</p>\n<p>It does have some limitations with the more complex resources (like questionnaire) which I hope to address in time, but it will never be a fully comprehensive application (unless the resourcing available changes considerably :) ).</p>\n<p>Having said all of that I do welcome input and endeavour to meet peoples requirements - there's a separate stream (<a href=\"https://chat.fhir.org/#narrow/stream/clinFHIR\" target=\"_blank\" title=\"https://chat.fhir.org/#narrow/stream/clinFHIR\">https://chat.fhir.org/#narrow/stream/clinFHIR</a>) for that.</p>\n<p>Disclaimer: I am the author...</p>",
        "id": 153886740,
        "sender_full_name": "David Hay",
        "timestamp": 1493777923
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191321\">@David Hay</span> ,</p>\n<p>Thanks for explanation. I have two questions about clinFHIR:<br>\n1) Is this webclient open-source, where is the source code ? Is it possible to collaborate ?<br>\n2) the online webclient is able to connect to remote servers. Is it possible to keep them private ? I mean, I don't want people to delete/modify the profiles, and stuff I would put there</p>\n<blockquote>\n<p>BTW, this is a dawn good soft</p>\n</blockquote>",
        "id": 153890114,
        "sender_full_name": "natus",
        "timestamp": 1494965635
    },
    {
        "content": "<p>Thanks Natus - yes it is OS (Apache2 license) - at <a href=\"https://github.com/davidhay25/clinFHIR\" target=\"_blank\" title=\"https://github.com/davidhay25/clinFHIR\">https://github.com/davidhay25/clinFHIR</a>.  So far, I've really been the only author - happy for others to get involved, though it has grown organically rather than with a clear purpose so may be rather difficult for others to contribute...<br>\nI don't really intend to put robust security with the on-line version (beyond linking CRUD actions to email accounts) as the effort involved will take away from the main educational purpose of the tool. And the servers (which are versioned) are all provided free by the authors anyway with no SLA...</p>",
        "id": 153890422,
        "sender_full_name": "David Hay",
        "timestamp": 1495131891
    }
]