[
    {
        "content": "<p>Hello Everyone,</p>\n<p>We are looking for help with setting up FHIR Proof of Concepts in Africa to improve the patient experience. For example, on our side we have created interest to use FHIR to integrate Community Health Worker data in RapidSMS with Health Center data in OpenMRS, and also make the data available through FHIR on the patient’s mobile phone so that the data can be available anytime, anywhere.</p>\n<p>While there are many challenges in African healthcare, one of the great advantages we have is that we have few legacy health IT systems, so that we can actually do more innovative things without so much red tape and large vendor lockout, as is common in developed health ecosystems.</p>\n<p>It would be great to have others share what they are doing with FHIR in Africa, what you would like to do with FHIR in Africa, and generally how we can all collaborate to move FHIR to be a de facto standard throughout the continent.</p>",
        "id": 216065620,
        "sender_full_name": "Olivier Karasira",
        "timestamp": 1604917718
    },
    {
        "content": "<p>Great to see you starting this <span class=\"user-mention\" data-user-id=\"308467\">@olivierkarasira</span> . I am looking forward to contributing and seeing others here. I know how hard you are working to get FHIR spread throughout Africa. Hopefully this can become a hub for collaboration, news and information. <span class=\"user-mention\" data-user-id=\"197704\">@Roheeni Bhana</span></p>",
        "id": 216066224,
        "sender_full_name": "Hamish MacDonald",
        "timestamp": 1604918058
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"308467\">@olivierkarasira</span> ! Nice to meet you! The goal is great, ready to help you.</p>",
        "id": 216069808,
        "sender_full_name": "Ilya Beda",
        "timestamp": 1604920259
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  <span class=\"user-mention\" data-user-id=\"191354\">@Rien Wertheim</span>   There are very few healthcare providers in Africa using FHIR technology. However, many are open to find out the benefits. So I have 3 questions/requests for the FHIR community to help us spread FHIR through Africa:</p>\n<p>Can the FHIR community help provide presentations and visuals that can help Africa to better understand the advantages of FHIR and how this technology will help patients, practitioners and healthcare providers?</p>\n<p>Is there any existing promotional material we can use to introduce FHIR to healthcare providers in Africa?  </p>\n<p>Finally, where we find interested providers in Africa can the FHIR community share technicians and expertise to support efforts on the ground, in case we lack the knowledge or resources to implement FHIR?</p>",
        "id": 216146204,
        "sender_full_name": "Olivier Karasira",
        "timestamp": 1604957941
    },
    {
        "content": "<p>do you think that there's some special about Africa, such that the general presentations and visuals we provide could be made more relevant?</p>",
        "id": 216163982,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1604971904
    },
    {
        "content": "<p>Hi Olivier,</p>\n<ul>\n<li>The DevDays event releases all videos  and recordings of sessions right after the next event. See <a href=\"http://www.devdays.com\">www.devdays.com</a> and click Previous Events. We encourage participants from Africa to join DevDays. This is exactly the reason why we lowered the entrance fee.</li>\n<li>See first bullet.</li>\n<li>The <a href=\"http://chat.fhir.org\">chat.fhir.org</a> is a nice place to start the search. Linkedin also has some fhir related groups.</li>\n</ul>",
        "id": 216229234,
        "sender_full_name": "Rien Wertheim",
        "timestamp": 1605022982
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>     Mobile phone use amongst the population and a lack of legacy electronic health records, only paper.  FHIR can join together both patients and providers directly, with little to no barriers to do so. And doctors themselves are very open to doing this when they hear about it; some of them are even joyous at the thought. I understand this attitude is a very different situation compared to Europe,Asia and the Americas.   </p>\n<p>So, everyone, do you know   FHIR educational  pieces out there that specifically address allowing patients and providers to work together more closely?</p>",
        "id": 216254850,
        "sender_full_name": "Olivier Karasira",
        "timestamp": 1605033701
    },
    {
        "content": "<p>I am really happy to join the FHIR community and share everything I will learn from you with Africa,starting with Burundi.</p>",
        "id": 216507349,
        "sender_full_name": "Pamela IZERE",
        "timestamp": 1605205219
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"308467\">@olivierkarasira</span> it's probably worth asking that question on <a class=\"stream\" data-stream-id=\"179262\" href=\"/#narrow/stream/179262-patient-empowerment\">#patient empowerment</a></p>",
        "id": 216594611,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1605264498
    },
    {
        "content": "<p>Hello Everyone , As per  <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  suggestion , please find the same question   on <a class=\"stream\" data-stream-id=\"179262\" href=\"/#narrow/stream/179262-patient-empowerment\">#patient empowerment</a> </p>\n<p><a href=\"#narrow/stream/179262-patient-empowerment/topic/Educational.20material.20for.20AFRICA.20.20%28.20Video.20%29/near/216608898\">https://chat.fhir.org/#narrow/stream/179262-patient-empowerment/topic/Educational.20material.20for.20AFRICA.20.20%28.20Video.20%29/near/216608898</a></p>",
        "id": 216611058,
        "sender_full_name": "Olivier Karasira",
        "timestamp": 1605274748
    },
    {
        "content": "<p>Thanks.</p>",
        "id": 216672976,
        "sender_full_name": "Pamela IZERE",
        "timestamp": 1605301567
    },
    {
        "content": "<p>Reposting from <a class=\"stream\" data-stream-id=\"179262\" href=\"/#narrow/stream/179262-patient-empowerment\">#patient empowerment</a>  <br>\nHigh level, simple introductions, that teach patients why they should ask \"Is your clinic/hospital on FHIR?\" will not only get the attention of the clinician or administrator if you are literally speaking that sentence out loud ( <span aria-label=\"grinning face with smiling eyes\" class=\"emoji emoji-1f601\" role=\"img\" title=\"grinning face with smiling eyes\">:grinning_face_with_smiling_eyes:</span> ), but also it can exert positive pressure on said institution to get on FHIR. And in Africa, the majority of clinicians I have spoken to welcome the thought of their patients carrying around clear, machine-readable healthcare data on their phone. It makes their job much simpler. </p>\n<p>This of course is a vastly different environment to the Americas, Asia or Europe where patient data access is often considered a tiresome chore that pulls a clinician away from one's centralized medical records system and away from their \"clinical / business flow\". In Africa it is different, adequate data about most patients is severely lacking. Patient Education on FHIR  is an opportunity in Africa.</p>",
        "id": 216715082,
        "sender_full_name": "Hamish MacDonald",
        "timestamp": 1605341532
    },
    {
        "content": "<p>Hi Olivier and All, apologies for the late posting. Regarding the building of local capacity and FHIR implementations in Africa, there are some really good lessons from the Asian eHealth Information Network (AeHIN) during the presentation yesterday by Philip Zuniga (Building HL7 FHIR Capability on a Regional Level). He describes development of the SIL, regional capacity and adoption of standards in Asian countries that would be a useful model to consider in Africa. The Africa CDC and African Union has started an initiative to develop a continental HIE and interoperability policy that includes standards, such as FHIR which is a good first step in this direction to build upon and could drive local capacity building initiative in-country along with local country adoption of the policy.</p>",
        "id": 217407266,
        "sender_full_name": "Chris Seebregts",
        "timestamp": 1605882552
    },
    {
        "content": "<p>Hi guys! Im Ola from Nigeria. Im new to this whole FHIR concept, however based on my little research I understand that it is a really great technology for healthcare providers. Im looking to implement this FHIR into an EHR system which I'm working on with my team and was hoping I could get directions on where to look at in order to implement this FHIR. Our goal essentially is to leverage on FHIR with SNOMED CT for search and storage of clinical terms easy accessible and retrievable. <a class=\"stream\" data-stream-id=\"264576\" href=\"/#narrow/stream/264576-FHIR--AFRICA\">#FHIR  AFRICA</a> <a class=\"stream\" data-stream-id=\"179244\" href=\"/#narrow/stream/179244-snomed\">#snomed</a></p>",
        "id": 225521209,
        "sender_full_name": "Olamide Adebayo",
        "timestamp": 1612777654
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"387902\">Olamide Adebayo</span> <a href=\"#narrow/stream/264576-FHIR-.20AFRICA/topic/Activities/near/225521209\">said</a>:</p>\n<blockquote>\n<p>Hi guys! Im Ola from Nigeria. Im new to this whole FHIR concept, however based on my little research I understand that it is a really great technology for healthcare providers. Im looking to implement this FHIR into an EHR system which I'm working on with my team and was hoping I could get directions on where to look at in order to implement this FHIR. Our goal essentially is to leverage on FHIR with SNOMED CT for search and storage of clinical terms easy accessible and retrievable. <a class=\"stream\" data-stream-id=\"264576\" href=\"/#narrow/stream/264576-FHIR--AFRICA\">#FHIR  AFRICA</a> <a class=\"stream\" data-stream-id=\"179244\" href=\"/#narrow/stream/179244-snomed\">#snomed</a></p>\n</blockquote>\n<p>Hello Olamide , great to see you  pushing FHIR  in Nigeria,  let me find  the best link i can  recommend..... <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span></p>",
        "id": 225610370,
        "sender_full_name": "Olivier Karasira",
        "timestamp": 1612819407
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"387902\">@Olamide Adebayo</span>  Welcome! You ask a perfectly reasonable question for someone looking to start FHIR implementations - and Zulip FHIR chat is a huge space to navigate.  <span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> has asked this question broadly not long ago...  <a href=\"#narrow/stream/179166-implementers/topic/checklist.20for.20implementers\">https://chat.fhir.org/#narrow/stream/179166-implementers/topic/checklist.20for.20implementers</a>   and in the very next comment <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> followed up by referring to the \"implementation approach decision tree\". You might want to check this out as a start.</p>",
        "id": 225610383,
        "sender_full_name": "Hamish MacDonald",
        "timestamp": 1612819413
    },
    {
        "content": "<p>The decision tree takes you pretty deep pretty fast.  My actual recommendation for someone brand new is to do a search for \"FHIR DevDays Videos\" and watch the recordings of some of the introduction presentations, then wander around the FHIR specification home page to explore and get a sense of what's there, then try some more videos and try playing with a few of the reference implementations.</p>",
        "id": 225623186,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1612825713
    },
    {
        "content": "<p>For starters, I'd view Introduction to FHIR (general IT audience) <a href=\"https://vimeo.com/191770214\">https://vimeo.com/191770214</a>  (June 2016) and/or FHIR for Clinicians, <a href=\"https://www.youtube.com/watch?v=IYMWRLEwJws\">https://www.youtube.com/watch?v=IYMWRLEwJws</a> (June 2019), then study <a href=\"http://build.fhir.org/patient.html\">http://build.fhir.org/patient.html</a> and look at the examples on that page, then look at <a href=\"http://build.fhir.org/http.html\">http://build.fhir.org/http.html</a>, start playing/testing with FHIR using a HTTP debugger such as the Postman toolkit. Evvrything else follows from that basis. <br>\nLooking at <span class=\"user-mention\" data-user-id=\"387902\">@Olamide Adebayo</span> 's comment - he may be just interested in the terminology server API: <a href=\"http://build.fhir.org/terminology-service.html\">http://build.fhir.org/terminology-service.html</a> , videos Terminology on FHIR, <a href=\"https://www.youtube.com/watch?v=cXC7aGvynck\">https://www.youtube.com/watch?v=cXC7aGvynck</a>  (Nov. 2019),    SNOMED CT with FHIR, <a href=\"https://www.youtube.com/watch?v=Dgexhq4DD7A\">https://www.youtube.com/watch?v=Dgexhq4DD7A</a>   (June 2020), FHIR Terminology Services, <a href=\"https://www.youtube.com/watch?v=zkV5j74SVzE\">https://www.youtube.com/watch?v=zkV5j74SVzE</a> (June 2020)</p>",
        "id": 225654208,
        "sender_full_name": "René Spronk",
        "timestamp": 1612856962
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191372\">@René Spronk</span> Thanks a lot for this. Im not just interested in the terminology server API. I want to know the nitty gritty of FHIR so that I can leverage on its full advantage.</p>",
        "id": 225654532,
        "sender_full_name": "Olamide Adebayo",
        "timestamp": 1612857291
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"387902\">@Olamide Adebayo</span> , good to have you here. I live in Nigeria also but I happen to have experience building apps on FHIR for my client in US. Currently, I'm trying to integrate my app with OpenEMR(open-source electronic medical record) which looks like the problem you are trying to solve. I think I will be able to answer some of your questions.<br>\nI may be able to help you with resources from previous connecthaton as well.</p>",
        "id": 226111289,
        "sender_full_name": "Oduola Olumide",
        "timestamp": 1613120261
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"260817\">@Oduola Olumide</span> . I have been looking at FHIR resources and I must say, it really is a broad scope. I look forward to talking to you.</p>",
        "id": 226123658,
        "sender_full_name": "Olamide Adebayo",
        "timestamp": 1613128176
    }
]