[
    {
        "content": "<p>I like using the cql-runner to view and validate cql. But the newer version of cql-runner uses the cqf-ruler api interface. I'm still using cql-execution-service as my api gateway, so new versions of cql-runner don't interface correctly with my versions anymore. It seems like the switch over happened on this commit here. <a href=\"https://github.com/DBCG/cql_runner/commit/a415be03fb9deb1190a7d5e89f6839bd795d93ba#diff-adcef716909ccd330d12436c83d961c8a078ba321261792ddabe866cc407a07b\">https://github.com/DBCG/cql_runner/commit/a415be03fb9deb1190a7d5e89f6839bd795d93ba#diff-adcef716909ccd330d12436c83d961c8a078ba321261792ddabe866cc407a07b</a>.</p>\n<p>Can I have a tag of the cql-runner with this version as the \"cql-execution-service\" version? This caused a breaking change in my personal stack.</p>",
        "id": 237376884,
        "sender_full_name": "Michael Riley",
        "timestamp": 1620153350
    },
    {
        "content": "<p>Hi Michael!</p>\n<p>We're trying to standardize on the operations defined in the CPG IG and the  FHIR Clinical Reasoning Module. Specifically:</p>\n<p><a href=\"https://build.fhir.org/ig/HL7/cqf-recommendations/OperationDefinition-cpg-cql.html\">https://build.fhir.org/ig/HL7/cqf-recommendations/OperationDefinition-cpg-cql.html</a></p>\n<p>So it's not exactly the case that the cql-runner is cqf-ruler dependent although I don't know of any other implementations at the moment. Previously there had not been an official operation definition for executing CQL. As far as checking out that, you can use:</p>\n<p><code>git checkout a415be</code></p>\n<p>to specify that commit.</p>",
        "id": 237378300,
        "sender_full_name": "JP",
        "timestamp": 1620153915
    },
    {
        "content": "<p>ty for the link of cqf. I think we're just not mature enough alone to have cqf-ruler as a workflow yet. We're still experimenting with what we can do with cql, and I dont' want to deploy a standalone hapi fhir server to just evaluate cql just yet. Having the service as a barebones api is convenient for testing and debugging right now. So that's why the original service is still useful, at least for me. It would be helpful if the specific commit was tagged for convenience and reference too.</p>\n<p>Am I going to be left behind if I stay with cql-execution-service though? So long as I'm following on the cql-engine-fhir side of things I think I'll be ok with keeping up with changes ow.</p>",
        "id": 237383961,
        "sender_full_name": "Michael Riley",
        "timestamp": 1620156270
    },
    {
        "content": "<p>The cql-execution-service hasn't had an update in a couple of years mainly due to not being widely used. I'm not saying it's never getting an update, simply that we tend to spend our bandwidth on the projects with the most traction. If you're looking for a quick and easy execution service the cqf-ruler is available as a docker container that can be run with <code>docker run -p 8080:8080 contentgroup/cqf-ruler</code>. That stands up the <code>$cql</code> operation. Additionally, we're doing work in the Atom plugin to add the ability to run the operations specified in the standard (e.g. something like right-click on a Measure and pick \"Evaluate\" to get a MeasureReport).</p>",
        "id": 237551708,
        "sender_full_name": "JP",
        "timestamp": 1620242639
    }
]