[
    {
        "content": "<p>Hello, is there a way to restrict all conditions/observation retrieved in queries with a specific time frame? I would like to be able to do so without adding that filter in each query/clause. More generally, is there a feature that lets you add filters for specific resources such that all queries done on these resources use the filter ?</p>",
        "id": 245145475,
        "sender_full_name": "Adrien Prost",
        "timestamp": 1625646351
    },
    {
        "content": "<p>Is this using the FhirDataProvider? I don't believe there is one here, unfortunately.</p>",
        "id": 245216757,
        "sender_full_name": "Michael Riley",
        "timestamp": 1625679798
    },
    {
        "content": "<p>The only implicit restriction is the context that's set:</p>\n<p><code>context Patient</code></p>\n<p>That automatically applies a restriction to the specific Patient. There aren't any implicit restrictions for time-based queries.</p>",
        "id": 245254521,
        "sender_full_name": "JP",
        "timestamp": 1625699844
    },
    {
        "content": "<p>Okay so in this case this would mean I would have to add as a parameter a time period filter to all functions?</p>",
        "id": 245288692,
        "sender_full_name": "Adrien Prost",
        "timestamp": 1625735214
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"194612\">Michael Riley</span> <a href=\"#narrow/stream/179220-cql/topic/Add.20filter.20for.20all.20queries/near/245216757\">said</a>:</p>\n<blockquote>\n<p>Is this using the FhirDataProvider? I don't believe there is one here, unfortunately.</p>\n</blockquote>\n<p>yes</p>",
        "id": 245288710,
        "sender_full_name": "Adrien Prost",
        "timestamp": 1625735233
    },
    {
        "content": "<p>Yes, that's typically the way that it is done. For example measures all specify a Measurement Period parameter to specify the reporting period. This is really common though (contextualizing to a timeframe) and so I'm introducing an \"AsOf\" parameter into some data elements I'm building now. For your use case, would a single timepoint work, or would you need an interval?</p>",
        "id": 245335767,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1625760785
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> 90 percent of my usecases are on a single index datetime. Sometimes there's a range though.</p>",
        "id": 245369045,
        "sender_full_name": "Michael Riley",
        "timestamp": 1625776755
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span>  My main use case would be a single time period in order to retrieve all recent Encounters for examples</p>",
        "id": 245409824,
        "sender_full_name": "Adrien Prost",
        "timestamp": 1625815736
    },
    {
        "content": "<p>So perhaps an \"Relevant Period\" parameter. In the case of decision support, that would be Interval[Now() - 1 year, Now()], and for quality measurement it would be the reporting period.</p>",
        "id": 246006109,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1626290139
    }
]