[
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span>, I'm using the AHRQ CQL Services and would like to know if there's a way to reference a ValueSet that's not on VSAC in an imported CQL Library or any tools available to support this case?</p>",
        "id": 254430243,
        "sender_full_name": "Raghavan Chandrabalan",
        "timestamp": 1632341125
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"432571\">@Raghavan Chandrabalan</span>.  The AHRQ CQL Services currently works only with VSAC \"out of the box\".  I was thinking you might be able to get it working for other value sets by editing the <code>.vsca_cache/valueset-db.json</code> file -- but on second thought, I'm not sure that would work either -- as I think the CodeService expects to extract an OID from the value set URL before doing the lookup in that file.  So... I think the only approach that would work right now would be to replace the <code>code-service-loader.js</code> with another implementation that defines a new <code>CodeService</code> that works with other value sets (which, as far as I know, does not exist).</p>\n<p>This is something I'd like to add support for in the future, but I'm not sure exactly when (or even if) we'll be able to get to it.  Support for VSAC is currently our primary use case.</p>",
        "id": 254433778,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1632342548
    },
    {
        "content": "<p><a href=\"https://github.com/cqframework/cqf-tooling/pull/298\">https://github.com/cqframework/cqf-tooling/pull/298</a> may be of interest</p>",
        "id": 254441971,
        "sender_full_name": "Paul Denning",
        "timestamp": 1632345937
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194174\">@Paul Denning</span> - that is for the Java based CQL tools, so it won't help with the Node-based CQL Services; except to provide some insight into approaches one might take to implement something like this in JavaScript.</p>",
        "id": 254526954,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1632400518
    },
    {
        "content": "<p>Thanks for the info, defining a new <code>CodeService</code> sounds like a good way to go about it. It looks like the method of editing <code>valueset-db.json</code> would technically work though since any non-URL OID found is returned as-is to <code>CodeService</code>.</p>",
        "id": 254566351,
        "sender_full_name": "Raghavan Chandrabalan",
        "timestamp": 1632415451
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"432571\">@Raghavan Chandrabalan</span>, note that there is tooling to go from FHIR ValueSet resources to the valueset-db.json format expected by the CodeService: <a href=\"https://github.com/cqframework/cqf-tooling/blob/master/src/main/java/org/opencds/cqf/tooling/terminology/ToJsonValueSetDbOperation.java#L18\">https://github.com/cqframework/cqf-tooling/blob/master/src/main/java/org/opencds/cqf/tooling/terminology/ToJsonValueSetDbOperation.java#L18</a></p>",
        "id": 254775166,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1632518804
    },
    {
        "content": "<p>Thanks, <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span>!  I forgot about that.  I need to bookmark it or something.  And add it to the docs.  Thanks!</p>",
        "id": 254791276,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1632529060
    }
]