[
    {
        "content": "<p>Hi All,<br>\nCan anyone please provide a demo for creating a CQL. How to use all the tabs in CDS Authoring Tool??<br>\nThanks in Advance.</p>",
        "id": 159484086,
        "sender_full_name": "Lakshmi Thrivarna",
        "timestamp": 1551245087
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span></p>",
        "id": 159531761,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551286435
    },
    {
        "content": "<p>@Chris Moesel is out this week, so he may have much more to add here, but there is a user guide for the authoring tool here: <a href=\"https://cds.ahrq.gov/authoring/userguide\" target=\"_blank\" title=\"https://cds.ahrq.gov/authoring/userguide\">https://cds.ahrq.gov/authoring/userguide</a></p>",
        "id": 159542602,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1551294217
    },
    {
        "content": "<p>I know they also gave a webinar recently, but I wasn't able to attend and don't know whether a recording is available.</p>",
        "id": 159542623,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1551294241
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span>.  Yes, the user guide is a good place to start (for now).  The Webinar was recorded and will be posted shortly.  When it is, I'll try to come back around and post the link here.</p>",
        "id": 160005661,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1551795185
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> : I recently came across this thread -- was wondering if you could post the webinar for that AHRQ authoring tool?</p>\n<p>To everyone: Are there other authoring tools out there that I should be aware of? In my organization I am thinking I would need some type of CQL input tool where people can log in, input CQL statements, save CQL statements, and even have an area where we can store and organize company-wide CQL statemetns used for quality metrics. Have you seen anything created so far that might match my needs?</p>",
        "id": 257778236,
        "sender_full_name": "Daniel Tam",
        "timestamp": 1634338899
    },
    {
        "content": "<p>If your organization is developer-centric, we've found that a GitHub repo and an IDE (Atom or VS Code) with some CQL/FHIR-related plugins is the quickest way to develop and test artifacts, since it aligns well with their existing experience and workflows. The Measures in the <a href=\"https://github.com/DBCG/connectathon\">connectathon</a>, <a href=\"https://github.com/cqframework/ecqm-content-r4\">ecqm-content-r4</a>, and <a href=\"https://github.com/cqframework/ecqm-content-r4-2021\">ecqm-content-r4-2021</a> repos were developed that way, as well as the cds artifacts in the <a href=\"https://github.com/cqframework/opioid-cds-r4\">opioid-cds-r4</a> repo.</p>\n<p>You'll notice there's an index of shared CQL libraries in the root of the ecqm repos.</p>\n<p>Additionally, there are tools available to create an online, browser-based IDE preconfigured with the CQL/FHIR tooling and backed by a git repository. I think Bryn is planning on demoing such a setup in an upcoming seminar.</p>\n<p>Here's  a list of some CQL/FHIR-related VS Code plugins:<br>\n<a href=\"https://marketplace.visualstudio.com/search?term=fhir&amp;target=VSCode&amp;category=All%20categories&amp;sortBy=Relevance\">https://marketplace.visualstudio.com/search?term=fhir&amp;target=VSCode&amp;category=All%20categories&amp;sortBy=Relevance</a></p>\n<p>Admittedly, it not necessarily an ideal setup for clinicians or for those without source control experience in general. The CDS Authoring tool helps abstract away a lot of that complexity.</p>",
        "id": 257787048,
        "sender_full_name": "JP",
        "timestamp": 1634345704
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"408229\">@Daniel Tam</span> - the webinar video can be found here: <a href=\"https://digital.ahrq.gov/events/national-web-conference-clinical-decision-support-authoring-tool\">https://digital.ahrq.gov/events/national-web-conference-clinical-decision-support-authoring-tool</a>.  It is also linked in the introduction to the <a href=\"https://cds.ahrq.gov/authoring/documentation\">CDS Authoring Tool User Guide</a>.  As for your requirements, here are a few notes to consider:</p>\n<ul>\n<li>The CDS Authoring Tool allows users to create CQL logic by clicking buttons, selecting values, and filling out forms; it does <em>not</em> currently allow direct entry of CQL.</li>\n<li>While it does not allow direct entry of CQL, it <em>does</em> allow upload of existing CQL files (if you authored them elsewhere). Expressions in these files cannot be edited, but they can be referenced and used from the rest of the tool.</li>\n<li>The CDS Authoring Tool does not have any collaborative features built in, nor does it have an area for shared logic, but authors <em>could</em> upload company-wide CQL libraries to their own artifacts in order to leverage common company-wide CQL statements.</li>\n<li>The CDS Authoring Tool does not support all aspects of CQL; it is a limited subset.  While we continue to evolve it so it supports more CQL constructs, it will never reach 100% coverage of the CQL spec.  This is why we also allow uploading and referencing externally authored CQL libraries.</li>\n</ul>\n<p>As <span class=\"user-mention\" data-user-id=\"194178\">@JP</span> mentioned, if you have CQL-savvy authors (or authors willing to learn CQL), then using a shared source code repository (e.g., GitHub) and IDEs w/ CQL plugins will likely work better for you.  If you need a more user-friendly solution for non-developers, and are able to work within some limitations, then you should take a look at the CDS Authoring Tool.  I believe that all of these solutions (CDS Authoring Tool, CQL IDE plugins, etc.) are open source -- so you also have the option to extend them to meet your needs (if you have the resources and skills to do so).</p>",
        "id": 258023631,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1634561569
    },
    {
        "content": "<p>Chris and JP, thank you very much for the info. This is really helpful. I'll take a look at these options and figure out what will work best for my organization. Will let you know if we end up building something or coming across some ideas that the community might find helpful.</p>",
        "id": 258289616,
        "sender_full_name": "Daniel Tam",
        "timestamp": 1634686410
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194178\">@JP</span>That CQL plugin for VS Code makes it much easier when reviewing CQL statements. Thank you for that.</p>",
        "id": 258289734,
        "sender_full_name": "Daniel Tam",
        "timestamp": 1634686491
    }
]