[
    {
        "content": "<p>Hi, folks!<br>\nI'm on a starting point of authoring an cql measure. Haven't used CDS Authoring tool before as well as MAT.<br>\nI can't try MAT as it requires HARP User ID (I'm not a resident of the US)<br>\nI was wondering what's the core different between the tools?<br>\nThanks!</p>",
        "id": 231982558,
        "sender_full_name": "Vasyl Herman",
        "timestamp": 1616771995
    },
    {
        "content": "<p>They are quite different.</p>\n<p>The MAT is specifically designed for developing measures, so it has many measure types and concepts built in.  It will export a measure package that contains measure specifications.  It also assumes that authors know CQL, as it requires authors to type CQL into the tool.</p>\n<p>The CDS Authoring Tool is designed for developing Clinical Decision Support.  While it shares some ideas w/ measure (e.g., Inclusions and Exclusions), it doesn't support any official measure types and does not export CQL as measures. In addition, it assumes users do <em>not</em> know CQL, so it provides simpler web-based interfaces where logic can be defined by filling out forms -- but does not allow authors to directly type in CQL (although it does allow CQL uploads).</p>\n<p>If you need to author measures, the MAT really is a better choice for you.  If you're not able to get an account then perhaps you can install a local version?  Last time I checked, the MAT was open source software.</p>",
        "id": 232260277,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1617021270
    },
    {
        "content": "<p>Hi, <span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> !!! <br>\nThanks for responding! Definitely I'd like to try MAT as well, I didn't know it was open source.<br>\nThat is amazing idea. We are going to try it<br>\n<a href=\"https://github.com/MeasureAuthoringTool/MeasureAuthoringTool\">https://github.com/MeasureAuthoringTool/MeasureAuthoringTool</a></p>",
        "id": 232438925,
        "sender_full_name": "Vasyl Herman",
        "timestamp": 1617115941
    }
]