[
    {
        "content": "<p>I have been looking for instructions on how to import a synthetic patients as well as how to generate the request to my CDS Service from the <strong>sandbox.cds-hooks.org</strong> web site but could not locate any of them.  Can you please point me to the document?  Many thanks for your help.</p>\n<p>Best,<br>\nTien Thai</p>",
        "id": 211011575,
        "sender_full_name": "Tien Thai",
        "timestamp": 1600871490
    },
    {
        "content": "<p>I'm not an expert in the CDS Hooks sandbox, but you can find additional documentation on it here: <a href=\"https://github.com/cds-hooks/sandbox\">https://github.com/cds-hooks/sandbox</a></p>\n<p>If you want to use your own patients, and you have your own FHIR server, you should click the configuration icon (a \"cog wheel\") in the upper right corner and switch the FHIR server to your own FHIR server.  (NOTE: It must be an <em>open</em> endpoint).  Then you can change the patient and specify the id of a patient in your FHIR server.</p>\n<p>If you do not have your own FHIR server, you can use an application like Postman to post your patient data to one of the open SMART FHIR servers (for example <a href=\"https://r4.smarthealthit.org/\">https://r4.smarthealthit.org/</a>).  Then change the FHIR server in the CDS Hooks sandbox to use that one and change to the patient ID you want (for whatever you just posted to the open FHIR server).  Note that these FHIR servers sometimes have their database reset, so you may come back later and find that your patient is missing.</p>",
        "id": 211016519,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1600873600
    },
    {
        "content": "<p>You'll likely have to post the patient data as a <code>batch</code> or <code>transaction</code>.  I don't recall how Synthea outputs its patients.  Maybe they are already set for this type of workflow, but you might have to modify the bundle some (if they are not <code>batch</code> or <code>transaction</code>).  You'll have to look at FHIR API documentation for more details on that.</p>",
        "id": 211016784,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1600873714
    }
]