[
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span>, I'm trying to create an inclusion criteria for the existence of some Encounter within a relative time frame, like one that ended in the last week at the time of execution. Do you know if such a criteria is possible to implement using the Authoring Tool? </p>\n<p>I noticed Observations and Procedures have the \"Look back\" modifier that would work for this, but that modifier isn't available for Encounters. Building a new modifier using the Period property seems close, but the operators only accept absolute datetimes.</p>\n<p>Thank you</p>",
        "id": 264066804,
        "sender_full_name": "Raghavan Chandrabalan",
        "timestamp": 1638908855
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"432571\">@Raghavan Chandrabalan</span>. You're right.  Encounters lack a \"lookback\" modifier and the operators for Encounter period don't support a lookback either.  This is a good area for the Authoring Tool to improve.</p>\n<p>If you're familiar enough w/ CQL to write a small library by hand, you could create a library that has a function called \"EncounterLookback\" that takes a List&lt;Encounter&gt; as the first argument and a quantity or integer as the second argument -- then upload it and use it as an <a href=\"https://cds.ahrq.gov/authoring/documentation#Using_External_CQL_Expression_Modifiers\">External CQL Modifier</a>.</p>",
        "id": 264074103,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1638912241
    },
    {
        "content": "<p>Ah I see, I'll try making an external library. Thanks!</p>",
        "id": 264076618,
        "sender_full_name": "Raghavan Chandrabalan",
        "timestamp": 1638913251
    },
    {
        "content": "<p>Sorry for the current limitation.  Let me know if you run into any issues!</p>",
        "id": 264081735,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1638915441
    }
]