[
    {
        "content": "<p>As a follow-on to my last question, one way to represent the \"flowsheet\" that should be displayed might be via a CommunicationRequest.  The description of CommunicationRequest makes it clear that it is intended to be used for CDS -- and it has a nice \"payload\" property for sending text, an attachment, or a reference&lt;Any&gt;.</p>\n<p>That said, I don't see how I can make a PlanDefinition or ActivityDefinition produce a CommunicationRequest with a \"payload\".  The most relevant fields of a MedicationRequest or ProcedureRequest seem to be well-covered, but perhaps not CommunicationRequest.  Am I missing something or is this a shortcoming of Clinical Reasoning?</p>",
        "id": 153937754,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1518704552
    },
    {
        "content": "<p>Well, a CommunicationRequest would be a good way to represent that you want to communicate a flow sheet, but it doesn't seem like a good representation of the flow sheet itself, and especially not the definition of a flowsheet. An instance of a flow sheet is probably actually a Composition, really.</p>",
        "id": 153937971,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1518733458
    },
    {
        "content": "<p>So are you wanting to represent the flow sheet itself, or the definition of how to produce the flow sheet?</p>",
        "id": 153937972,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1518733492
    },
    {
        "content": "<p>I'm not sure I grasp the difference between representing the flow sheet or the definition of how to produce the flow sheet... but I think I see your point about CommunicationRequest.  At the time I think I was imagining that maybe the payload could be text (formatted as markdown) -- and use dynamicValue to actually specify that the text comes from the CQL.  But... I don't really want to build markdown in CQL, do I?  So maybe it is a moot point.</p>\n<p>It seems like trying to do this via the current standards will not be very standard after all, as I'll have to introduce new extensions or be really creative about my interpretation of existing things in the standard -- and no vendor will likely support it.  That said, it's something to consider for future versions of Clinical Reasoning, I guess.</p>\n<p>I'm starting to think that perhaps a card from CDS Hooks or a specialized SMART-on-FHIR app is the way to go.  It's a step away from a standard representation, but it offers the control I need/want.  I'd still have the CQL drive the data collation, but the app/hook would drive the presentation format.</p>",
        "id": 153938041,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1518744340
    },
    {
        "content": "<p>Yeah, I tend to agree it's a use case we don't quite cover (it wasn't one of the original types of artifacts we designed knowledge document for in HeD). But would you be willing to work through how to represent it as part of building this out? I'm happy to coordinate the necessary extensions/changes. At the very least, would you be willing to submit a tracker to capture a flowsheet?</p>",
        "id": 153938254,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1518805263
    },
    {
        "content": "<p>What I mean by the difference between representing a flow sheet and it's definition is the same difference between a PlanDefinition and a RequestGroup. One says how you construct the thing for any patient, the other is an instance of the thing applied to a specific patient.</p>",
        "id": 153938255,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1518805326
    },
    {
        "content": "<p>So I can imagine a \"Flowsheet Definition\" expressed as a PlanDefinition where each \"action\" had a reference to the expression that retrieved the data for that section of the Flowsheet. Then \"realizing\" that would create the Flowsheet as a Composition, say, with the resources that were the results of each expression in the sections of the composition.</p>",
        "id": 153938256,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1518805393
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> and <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> : The HeD doc template was designed to cover flow sheet representation. Let me know if I can help clarify that.  Sorry for the late reply. Behind on zulip.</p>",
        "id": 153942535,
        "sender_full_name": "Aziz Boxwala",
        "timestamp": 1520285779
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"195129\">@Aziz Boxwala</span>, the CollectInformationAction aspect of HeD maps to Questionnaire in FHIR, do you see Questionnaire as the natural representation of a FlowSheet in FHIR then?</p>",
        "id": 153942601,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1520348090
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> I had  not noted that mapping. In HeD, CollectInformationAction was about asking a single question  so it somewhat mapped to Questionnaire.question. I can see why in FHIR it maps to Questionnaire though - since you aren't trying to represent a doc template with PlanDef as we did with HeD Knowledge Artifacts. I'll have to reread the HeD spec to refresh my memory about how we represented flowsheets, but we may have used behaviors among other features. My suspicion is that Questionnaire will at least need extensions to support flowsheets.</p>",
        "id": 153942620,
        "sender_full_name": "Aziz Boxwala",
        "timestamp": 1520353083
    }
]