[
    {
        "content": "<p>I've noticed that all of the CMS eCQMs are defined with <code>context Patient</code>, and never use the <code>Unfiltered</code> context, even though they are intended to be evaluated on a population of patients. Is this simply because none of the CQL implementations fully support unfiltered context evaluation yet? Or is there some other reason they're defined this way?</p>",
        "id": 189063401,
        "sender_full_name": "Zach Smith",
        "timestamp": 1582666321
    },
    {
        "content": "<p>It's been a while since I thought much about this, but IIRC, the CQL-Based HQMF IG <em>requires</em> measures to be written in the Patient context only and indicates that they should be processed one patient at a time.  This same IG indicates how the results of Patient-based CQL should be aggregated into population metrics; and the exact aggregate operations to use are actually defined in the HQMF (again, IIRC).  As for <em>why</em> it is this way, it's hard to say, but I expect it may be partially for legacy reasons (i.e., this is how QDM worked).  It <em>may</em> also have something to do with reporting requirements and patient-specific reporting via QRDA Cat I.  But again, it's been a while since I've been in this space, so...</p>",
        "id": 189067076,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1582669053
    },
    {
        "content": "<p>Yes, the CQL-Based HQMF IG (and the new Quality Measure IG) both require the use of Patient context. It's a simplification to allow the measure to be expressed from the perspective of a single patient. That doesn't mean that implementations are required to process them a patient at a time though, implementations can (and many do) run the measures as population-level queries. And yes, it does also help support patient-level reporting, it's easier to aggregate patient-level results than it is to disaggregate population level results. In FHIR, it's roughly analogous to the Patient compartment definition.</p>",
        "id": 189069817,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1582671358
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 189262265,
        "sender_full_name": "Mohammad Afaq Khan",
        "timestamp": 1582841051
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 189268005,
        "sender_full_name": "Mohammad Afaq Khan",
        "timestamp": 1582845417
    }
]