[
    {
        "content": "<p>Currently with the CQF-Ruler whenever I import a ValueSet the service is able to properly execute CQL rules, however when I try to utilize <a href=\"https://cts.nlm.nih.gov/fhir/\">https://cts.nlm.nih.gov/fhir/</a> the request fails: Could not resolve value set <a href=\"https://cts.nlm.nih.gov/fhir/ValueSet/2.16.840.1.113762.1.4.1213.3\">https://cts.nlm.nih.gov/fhir/ValueSet/2.16.840.1.113762.1.4.1213.3</a>. Is there currently or are there plans to support VSAC?</p>",
        "id": 234225663,
        "sender_full_name": "Rich Boyce",
        "timestamp": 1618259636
    },
    {
        "content": "<p>Hi Rich,</p>\n<p>Could you elaborate on what you mean when you say utilize the  <code>https://cts.nlm.nih.gov/fhir/</code> url? You're specifying CQL that looks like:</p>\n<div class=\"codehilite\" data-code-language=\"cql\"><pre><span></span><code>valueset \"Test\": 'https://cts.nlm.nih.gov/fhir/ValueSet/2.16.840.1.113762.1.4.1213.3'\n</code></pre></div>\n<p>And it works when you post the ValueSet to the cqf-ruler and it doesn't when you don't?</p>",
        "id": 234229167,
        "sender_full_name": "JP",
        "timestamp": 1618261138
    },
    {
        "content": "<p>Yes I believe that is exactly what is happening</p>",
        "id": 234352145,
        "sender_full_name": "Rich Boyce",
        "timestamp": 1618329091
    },
    {
        "content": "<p>The URL portion of the ValueSet is actually \"just\" an identifier, and not necessarily a resolvable url. Here's the relevant portion of the spec:</p>\n<blockquote>\n<p>CQL does not interpret the external id, it only specifies that the external identifier be a string that can be used to uniquely identify the valueset within the implementation environment.</p>\n</blockquote>\n<p>For example, <code>urn:oid:2.3.4.5.6</code> is a valid identifier, but there's no way to determine where on the internet to look for that ValueSet from only that uri. This is further complicated when you have a mix of oid and uris for ValueSet identifiers, or a set of VSAC and non-VSAC ValueSets being referenced in the same CQL file:</p>\n<div class=\"codehilite\" data-code-language=\"cql\"><pre><span></span><code>valueset \"Test\": 'https://cts.nlm.nih.gov/fhir/ValueSet/2.16.840.1.113762.1.4.1213.3'\nvalueset \"Test2\": 'urn:oid:2.3.4.5.6'\nvalueset \"Test3\" : 'http://hl7.org/fhir/ValueSet/allergy-intolerance-category'\n</code></pre></div>\n<p>The cqf-ruler doesn't know how to resolve some of those locally, some remotely, some remotely on secondary FHIR server, or which ones of those would require some authentication mechanism. Instead, it relies on all the ValueSets being pre-loaded onto a single server.</p>\n<p>That's all a round-about explanation to say that there are no current plans to directly integrate with the VSAC server. <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 234369863,
        "sender_full_name": "JP",
        "timestamp": 1618335520
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194178\">@JP</span> We do have two valueset extensions that we could perhaps incorporate in the (currently rare) situation that we have known sources for the FHIR representation. <a href=\"http://build.fhir.org/extension-valueset-authoritativesource.html\">authoritativeSource</a> is close but does not guarantee a FHIR endpoint, and <a href=\"http://build.fhir.org/extension-valueset-trusted-expansion.html\">trusted-expansion</a> that <strong>is expected to be a FHIR endpoint</strong> that can provide the expansion. I'd like to explore how we can use these.</p>",
        "id": 235431363,
        "sender_full_name": "Robert McClure",
        "timestamp": 1618961086
    },
    {
        "content": "<p>Those extensions appear to be on the ValueSet resource itself to describe where the authoritative source is or where a trusted expansion could be obtained from. IOW, you'd already need an instance of the ValueSet in question pre-loaded in order to read those extensions (and then if the ValueSet were not expanded you could use the extension to get the expansion). They don't directly address the issue Rich is facing, which is where do you get the instance of the ValueSet in the first place.</p>\n<p>The CPG IG addresses this by specifying a <code>terminologyEndpoint</code> for the LIbrary $evaluate operation. Such a parameter could potentially be introduced to Measure $evaluate-measure as well.</p>\n<p><a href=\"http://build.fhir.org/ig/HL7/cqf-recommendations/OperationDefinition-cpg-library-evaluate.html\">http://build.fhir.org/ig/HL7/cqf-recommendations/OperationDefinition-cpg-library-evaluate.html</a></p>",
        "id": 235446710,
        "sender_full_name": "JP",
        "timestamp": 1618973931
    }
]