[
    {
        "content": "<p>In working with CQL-ELM translator and FHIR what level of model validation is done? More broadly speaking is it possible to constrain the extensions to a specific set of profiles? I am guessing that at this point the answer is no.  I am thinking that to get this I will need to walk the AST and analyze those elements that are extensions and identify what extension they actually are. Validation of more of a profile would likely be even more complicated.</p>",
        "id": 182973478,
        "sender_full_name": "Jerry Goodnough",
        "timestamp": 1575909242
    },
    {
        "content": "<p>The translator validates based on whatever is in the model info. The FHIR model info currently doesn't include any profile information. I am working on a version of the model info that does consider profiles. In that version, any extensions defined in a profile will be exposed as first class elements.</p>",
        "id": 182984880,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1575916299
    },
    {
        "content": "<p>It still wouldn't validate extensions that are accessed directly (i.e. with <code>.extension('extension-url').value</code>), but the intent is that measure and decision support authors wouldn't need to use that pattern to access extensions, they will be accessed directly through first class elements for any extensions defined in the profiles.</p>",
        "id": 182985005,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1575916381
    },
    {
        "content": "<p>So I wouldn't suggest validating profiles in the translator in that way, I've always considered it something that would be surfaced in the model info and validated that way.</p>",
        "id": 182985061,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1575916423
    },
    {
        "content": "<p>So just curious it appears that the modelinfo file used is that same format for qdm and FHIR, how is the FHIR version generated.</p>",
        "id": 182990014,
        "sender_full_name": "Jerry Goodnough",
        "timestamp": 1575919466
    },
    {
        "content": "<p>The current versions are generated by <a href=\"https://github.com/cqframework/clinical_quality_language/tree/master/Src/java/tools/xsd-to-modelinfo\" target=\"_blank\" title=\"https://github.com/cqframework/clinical_quality_language/tree/master/Src/java/tools/xsd-to-modelinfo\">xsd-to-modelinfo</a> from the <a href=\"http://hl7.org/fhir/downloads.html\" target=\"_blank\" title=\"http://hl7.org/fhir/downloads.html\">XSDs</a> published as part of the FHIR specification.</p>",
        "id": 183021411,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1575943791
    },
    {
        "content": "<p>The next versions will be generated by <a href=\"https://github.com/cqframework/cqf-tooling/tree/master/src/main/java/org/opencds/cqf/modelinfo\" target=\"_blank\" title=\"https://github.com/cqframework/cqf-tooling/tree/master/src/main/java/org/opencds/cqf/modelinfo\">this tooling</a> based on the actual StructureDefinitions published in the FHIR specification.</p>",
        "id": 183021507,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1575943866
    }
]