[
    {
        "content": "<p>Hi Team,<br>\nCould you please let me know ,<br>\nhow can we create data model or customize schema like FHIR or QDM.<br>\nSo we can using customize schema instead of FHIR or QDM for CQL.<br>\nPlease provide me any example which will help me to create customise schema. Need your help. I am new in CQL.<br>\nAlso let me know the data format of FHIR and QDM. <br>\nHow  does any customize data model like  PHIR can read from CQL-ENGINE or CQL-Language-Server?</p>",
        "id": 274092014,
        "sender_full_name": "Sukanta Barai",
        "timestamp": 1646380255
    },
    {
        "content": "<p>Data models are described for the CQL translator in a file called a ModelInfo. You can see examples of the FHIR model info files <a href=\"https://github.com/cqframework/clinical_quality_language/tree/master/Src/java/quick/src/main/resources/org/hl7/fhir\">here</a> and the QDM model info files <a href=\"https://github.com/cqframework/clinical_quality_language/tree/master/Src/java/qdm/src/main/resources/gov/healthit/qdm\">here</a>. The documentation in this area is pretty light, but it is possible to write your own ModelInfo for a custom data model. You will need to register your model info file with the CQL translator prior to calling translation. To the best of my knowledge that is only available currently via the Java API or while using the command line interface to the CQL translator. You wouldn't be able to use the <a href=\"https://atom.io/packages/language-cql\">IDE</a> <a href=\"https://marketplace.visualstudio.com/items?itemName=cqframework.cql\">plugins</a> or the <a href=\"https://github.com/cqframework/cql-translation-service\">cql-translation-service</a> REST API without modifications. It does work though. My team successfully completed an internal project that uses the Java CQL engine to query a custom data model.</p>",
        "id": 274135853,
        "sender_full_name": "Corey Sanders",
        "timestamp": 1646404056
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"483075\">@Sukanta Barai</span> I've deleted your duplicate posts.  Please only raise questions once in a given stream (under an appropriate topic, creating a new one if necessary).  Anyone monitoring a stream will see all topics, so posting more than once doesn't get you an answer faster.</p>",
        "id": 274140257,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1646405943
    },
    {
        "content": "<p>@Corey Sanders, Thank you for your update.<br>\nCould you please provide me any example(code) which will help me to create custom data model?</p>",
        "id": 274368913,
        "sender_full_name": "Sukanta Barai",
        "timestamp": 1646646660
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"483075\">@Sukanta Barai</span> - do you have an XSD for your custom data model?  If so, I think <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> might be able to point you to some tools that can help convert an XSD to a ModelInfo.</p>",
        "id": 274396240,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1646662223
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"483075\">Sukanta Barai</span> <a href=\"#narrow/stream/179220-cql/topic/cql/near/274368913\">said</a>:</p>\n<blockquote>\n<p>Could you please provide me any example(code) which will help me to create custom data model?</p>\n</blockquote>\n<p>The code that my team wrote to generate a custom model is part of an internal project and not available to share. The xsd-to-modelinfo tool that <span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> mentioned is available <a href=\"https://github.com/cqframework/clinical_quality_language/tree/master/Src/java/tools/xsd-to-modelinfo\">here</a>. It should be enough to get you going in the right direction. Also, if you haven't already done so, I would highly recommend you read the <a href=\"https://cql.hl7.org/\">Author's Guide</a> for CQL because that will help you understand the reasons why different parts of the model info exist.</p>",
        "id": 274398375,
        "sender_full_name": "Corey Sanders",
        "timestamp": 1646663251
    },
    {
        "content": "<p>Thank you for your updated <span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span>   and <span class=\"user-mention\" data-user-id=\"341334\">@Corey Sanders</span> . I will check the links and details.</p>",
        "id": 274410372,
        "sender_full_name": "Sukanta Barai",
        "timestamp": 1646668253
    }
]