[
    {
        "content": "<p>Hello, I am working on translating a CDS  to CQL format: </p>\n<ul>\n<li>The CDS is structured as a flowchart with nodes that ask specific observations from the patients (see attached image <a href=\"/user_uploads/10155/bKMaeyJRYOI47O5js0wJK6V1/Screenshot-from-2021-06-08-16-41-25.png\">Screenshot-from-2021-06-08-16-41-25.png</a> )<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/bKMaeyJRYOI47O5js0wJK6V1/Screenshot-from-2021-06-08-16-41-25.png\" title=\"Screenshot-from-2021-06-08-16-41-25.png\"><img src=\"/user_uploads/10155/bKMaeyJRYOI47O5js0wJK6V1/Screenshot-from-2021-06-08-16-41-25.png\"></a></div></li>\n</ul>\n<p>Intuitively, having explored a bit CQL, the straightforward way would be to represent the nodes as retrieve statements of observations and conditions and then creating a function  which defines the logic of the flowchart and returns the results of the diagnostic. Before implementing this, I was wondering if there was some existing standard (that I overlooked) on representing these algorithms in CQL ?</p>",
        "id": 241937531,
        "sender_full_name": "Adrien Prost",
        "timestamp": 1623165939
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"418818\">@Adrien Prost</span> , you could express that as a decision tree in a PlanDefinition where the conditions on each node reference expressions in CQL. There are groups doing that, and there is even some basic tooling to convert simple decision tables to PlanDefinitions with corresponding CQL libraries. There's some manual work to do after the generation step, but it saves a lot of scaffolding. Here's a project that's using that tooling: <a href=\"https://github.com/who-int/anc-cds/blob/feature_updated_dataelements_with_decision_tables/input/l2/WHO-SRH-21.2-eng.xlsx\">https://github.com/who-int/anc-cds/blob/feature_updated_dataelements_with_decision_tables/input/l2/WHO-SRH-21.2-eng.xlsx</a></p>",
        "id": 242269551,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1623358508
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span>  ! I am not aware of what are PlanDefinitions, googling around I landed on this:  <a href=\"http://www.hl7.org/fhir/clinicalreasoning-module.html\">http://www.hl7.org/fhir/clinicalreasoning-module.html</a>, if you have any links on more docs related to this it would be great :)</p>",
        "id": 242756215,
        "sender_full_name": "Adrien Prost",
        "timestamp": 1623772804
    },
    {
        "content": "<p>I have looked at some PlanDefinition examples from <a href=\"http://hl7.org/fhir/R4/plandefinition.html\">http://hl7.org/fhir/R4/plandefinition.html</a>. In these examples I can clearly see the CQL references however I do not see the decision tree logic encoded in the resource, is there any example of a PlanDefinition resource in which a decision tree logic is encoded ?</p>",
        "id": 242864131,
        "sender_full_name": "Adrien Prost",
        "timestamp": 1623841086
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"418818\">@Adrien Prost</span> , here's an example of one of those decision tables represented in a PlanDefinition:</p>",
        "id": 242948561,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1623880672
    },
    {
        "content": "<p><a href=\"https://github.com/who-int/anc-cds/blob/master/input/resources/plandefinition/plandefinition-ANCDT03.json\">https://github.com/who-int/anc-cds/blob/master/input/resources/plandefinition/plandefinition-ANCDT03.json</a></p>",
        "id": 242948563,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1623880672
    },
    {
        "content": "<p>And the associated CQL for it: <a href=\"https://github.com/who-int/anc-cds/blob/master/input/cql/ANCDT03.cql\">https://github.com/who-int/anc-cds/blob/master/input/cql/ANCDT03.cql</a></p>",
        "id": 242948620,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1623880690
    },
    {
        "content": "<p>Most of the structure there is generated from the data dictionary and the decision tables. Only the final CQL is \"engineered\", and even that has pseudo-code coming from the decision tables (see the comments on the expressions in the CQL).</p>",
        "id": 242948728,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1623880777
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span>  thanks for the pointers, my guess is that in my case the algorithms are more complex than decision tables and therefore I think it is best to encode them using CQL, then have a PlanDefinition Resource with a single action refering to the CQL algorithm</p>",
        "id": 242993208,
        "sender_full_name": "Adrien Prost",
        "timestamp": 1623922383
    },
    {
        "content": "<p>Yes, that makes sense, and here's an example of that type of usage: <a href=\"https://github.com/cqframework/opioid-cds-r4/blob/master/input/resources/plandefinition/plandefinition-opioidcds-05.xml\">https://github.com/cqframework/opioid-cds-r4/blob/master/input/resources/plandefinition/plandefinition-opioidcds-05.xml</a>, and the CQL that it references: <a href=\"https://github.com/cqframework/opioid-cds-r4/blob/master/input/pagecontent/cql/OpioidCDSREC05.cql\">https://github.com/cqframework/opioid-cds-r4/blob/master/input/pagecontent/cql/OpioidCDSREC05.cql</a></p>",
        "id": 243063431,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1623954907
    },
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span>  I am coming back on this again after continuing my research on how to convert our medical algorithms to CQL code. In our case, we are working with complex consultation medical algorithms for patient consultations for which the order in which the questions and observations on patients is done is of great importance. To be more specific, our CDS algorithms are complex decision trees where nodes may have multiple outgoing edges / descendant nodes and we wish to use CQL to guide patient consultation. My initial guess was to proceed in the following way:</p>\n<ul>\n<li>We represent the algorithm using a CQL function <code>define algorithm()</code> which returns a List of strings where each string is either a possible diagnose, or a string indicating that a specific measurement/questions should be asked (example \"question X\") to the patient as the algorithm cannot output more possible diagnoses as there are missing measurements on the patient. </li>\n<li>We then create clauses for each questions that <em>could</em> be asked to a patient: for example: </li>\n</ul>\n<div class=\"codehilite\" data-code-language=\"JavaScript\"><pre><span></span><code><span class=\"nx\">define</span> <span class=\"s2\">\"should ask question X\"</span> <span class=\"o\">:</span>\n    <span class=\"nx\">algorithm</span><span class=\"p\">()</span> <span class=\"nx\">contains</span> <span class=\"s2\">\"question X\"</span>\n</code></pre></div>\n<ul>\n<li>For each possible question, a <em>PlanDefinition</em> Resource is created which activates under the condition that the \"should ask question X\" clause evaluates to true.</li>\n<li>The consultation would work as follows: the patient would answer basic mandatory questions and Observation/Condition resources will be uploaded to the FHIR server. Depending, on the observations, the clinical reasoning module will activate and return PlanDefinition resources to the consultation that indicate what are the next questions to be asked to the patient. </li>\n</ul>\n<p>I was wondering if this workflow makes sense or if I am overlooking at some FHIR resources that could be more useful in this context. The problem with this approach is that the <code>algorithm()</code> CQL function (which will be pretty complex) would be evaluated many times for each possible question at each iteration.</p>",
        "id": 245329500,
        "sender_full_name": "Adrien Prost",
        "timestamp": 1625757881
    },
    {
        "content": "<p>Would it make sense to collapse the questions into a single PlanDefinition with multiple actions? Each action can have an applicability condition, so you could potentially model the whole process in a single PlanDefinition (or potentially a set of PlanDefinitions appropriately modularized).</p>",
        "id": 245337236,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1625761559
    },
    {
        "content": "<p>As far as evaluation, the simplest case would evaluate all the expressions on every iteration, but it would be potentially straightforward to implement some optimization there so that the evaluation only asked for evaluation of expressions relevant in the decision tree.</p>",
        "id": 245337394,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1625761637
    },
    {
        "content": "<p>In addition, the Java-engine at least can do caching of expression evaluation, but it only does it on Expressions currently. Is there a reason to define <code>algorithms()</code> as a function without parameters, as opposed to an expression definition?</p>",
        "id": 245337616,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1625761737
    },
    {
        "content": "<p>No, indeed I have wrongly assumed that expressions only returned boolean values, but apparently this is not the case. I would then ask what is the difference between both ?</p>",
        "id": 245409558,
        "sender_full_name": "Adrien Prost",
        "timestamp": 1625815547
    },
    {
        "content": "<p>The difference is syntactic from an invocation perspective, but from a definition perspective, a function is allowed to be external.</p>",
        "id": 246005726,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1626289950
    }
]