[
    {
        "content": "<p>I have a use case where there's a main Patient resource, and links in it (link.other.reference) pointing to other Patient resources that are all the same person but come from different EHRs. To properly evaluate with CQL, I need to traverse multiple Patient resources. Can CQL evaluate more than one Patient in a run, or is this a job for unfiltered context, or some other approach or simple not possible?</p>",
        "id": 247754000,
        "sender_full_name": "Richard Stanley",
        "timestamp": 1627674843
    },
    {
        "content": "<p>The <code>context</code> value defines the Patient, Encounter, etc. that the CQL is written with respect to. For example:</p>\n<div class=\"codehilite\" data-code-language=\"cql\"><pre><span></span><code>context Patient\ndefine \"Encounters\":\n   [Encounter]\n</code></pre></div>\n<p>returns the Encounters for a single patient. If you run <code>Patient</code> context CQL for a single patient, you get one result with values for one Patient.</p>\n<p>On the other hand,</p>\n<div class=\"codehilite\" data-code-language=\"cql\"><pre><span></span><code>context Unfiltered\ndefine \"Encounters\":\n   [Encounter]\n</code></pre></div>\n<p>returns all the Encounters that are available. If you run <code>Unfiltered</code> for multiple patients you get one result with values for multiple Patients.</p>\n<p>You can both run <code>Patient</code> context CQL for multiple patients (in which case you get multiple per-patient results) and run <code>Unfiltered</code> context CQL for a single patient (in which case you get one result with values for one patient)</p>",
        "id": 247755377,
        "sender_full_name": "JP",
        "timestamp": 1627675581
    },
    {
        "content": "<p>Whoops. Posted before I was ready. Editing...</p>",
        "id": 247755443,
        "sender_full_name": "JP",
        "timestamp": 1627675626
    },
    {
        "content": "<p>To run <code>Patient</code> context CQL in a Measure against multiple patients with the cqf-ruler, for example, you do this:</p>\n<p><code>{server base}/Measure/{Id}/$evaluate-measure?periodStart=2019-01&amp;periodEnd=2019-12</code></p>\n<p>Note the lack of <code>subject</code> parameter. That basically means run the Measure against all the Patients on this server.</p>",
        "id": 247755885,
        "sender_full_name": "JP",
        "timestamp": 1627675860
    },
    {
        "content": "<p>All of that said, neither of those handles the case where a logically identical Patient from a separate EHR should be considered as the same Patient. I think there would  typically be some record-linking process prior to CQL evaluation that would consolidate those resources.</p>\n<p>You could, in principle, write some CQL that would look up the related Patient from the EHR. I think that'd be something like:</p>\n<div class=\"codehilite\" data-code-language=\"cql\"><pre><span></span><code>include FHIRHelpers version '4.0.1'\nusing FHIR version '4.0.1'\n\ncontext Patient\ndefine \"Related Patients\":\n     \"Get Related Patients\"(Patient.id)\n\ncontext Unfiltered\ndefine function \"Get Related Patients\"(id String):\n          [Patient] P where P.whatever = id\n</code></pre></div>",
        "id": 247756364,
        "sender_full_name": "JP",
        "timestamp": 1627676159
    },
    {
        "content": "<p>Obviously you'd have to substitute the logic appropriate for your specific use case to do the look-up of additional patients.</p>",
        "id": 247756796,
        "sender_full_name": "JP",
        "timestamp": 1627676392
    },
    {
        "content": "<p>Ok, great thanks. The main Patient resource is actually from a service that already did record linkage. That 'golden record' has the links to the Patients from the EHRs in the same datastore. I'll try the last bit to see how far I get.</p>",
        "id": 247770031,
        "sender_full_name": "Richard Stanley",
        "timestamp": 1627684686
    }
]