[
    {
        "content": "<p>Is it possible to use the FHIR search syntax from within CQL?  I am thinking of something like:</p>\n<div class=\"codehilite\"><pre><span></span><code>define LatestObservation:\n  query(&#39;Observation?_sort=-date&amp;subject=&#39; + patientRef)\n</code></pre></div>",
        "id": 237574445,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1620251871
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"195344\">Paul Lynch</span> <a href=\"#narrow/stream/179220-cql/topic/FHIR.20search.20syntax.20in.20CQL.3F/near/237574445\">said</a>:</p>\n<blockquote>\n<p>Is it possible to use the FHIR search syntax from within CQL?  I am thinking of something like:</p>\n<p><div class=\"codehilite\"><pre><span></span><code>define LatestObservation:\n  query(&#39;Observation?_sort=-date&amp;subject=&#39; + patientRef)\n</code></pre></div><br>\n</p>\n</blockquote>\n<p>CQL is data model agnostic. You won't find anything in the language that directly exposes FHIR features. You can, however, construct the same type of query as above using the CQL language.</p>\n<p>1) CQL has the notion of a context that scopes all the queries. Most likely, you are going to want to set \"context Patient\" for your queries. You can read about context in the author's guide <a href=\"https://cql.hl7.org/02-authorsguide.html#retrieve-context\">here</a>. Once you've set the context, your Observation query will automatically have subject appended to it.</p>\n<div class=\"codehilite\"><pre><span></span><code>context Patient\n</code></pre></div>\n<p>2) You can order the query results of your Observation query as described in the <a href=\"https://cql.hl7.org/02-authorsguide.html#sorting\">sorting</a> section of the CQL author's guide. Note the First and Last operators which are probably going to be useful if you are using sorting.</p>\n<div class=\"codehilite\"><pre><span></span><code>define DateLimitedObservation:\n   [Observation] o sort by o.effective\n</code></pre></div>",
        "id": 237681250,
        "sender_full_name": "Corey Sanders",
        "timestamp": 1620315899
    },
    {
        "content": "<p>Thanks, that is pretty much the answer I expected, but gives me more information than I had before.</p>\n<p>The link to the author's guide is giving me a 403 error at the moment, though I have seen that work before, so hopefully that is temporary.</p>\n<p>If you use CQL syntax to write that query, does it actually query a FHIR server?  The JavaScript CQL engine I was looking at (<a href=\"https://github.com/cqframework/cql-execution\">https://github.com/cqframework/cql-execution</a>), says it \"does not currently rely on any backend database for storing patient records\" and I gather you are supposed to pass in the needed data when you run the CQL.   I don't know how that would work for Observations, but maybe that is just a limitation of that particular engine?</p>",
        "id": 237694113,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1620320671
    },
    {
        "content": "<p>I have a limited understanding of the Javascript engine. I believe it uses FHIR Bundle resources as input and can execute ELM against those bundles as if they were retrieved from a FHIR server. <span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> would be a good person to check with for more details on that. </p>\n<p>The <a href=\"https://github.com/DBCG/cql_engine/\">Java engine</a>  does actually query a FHIR server. The data providers are a pluggable mechanism, but the provided RestFhirRetrieveProvider will use the FHIR search interface to retrieve data. You might also consider looking at the <a href=\"https://github.com/DBCG/cqf-ruler\">cqf-ruler</a> project which is Java-based, rides on top of a HAPI FHIR server, and uses the HAPI JPA interface to retrieve data.</p>",
        "id": 237696181,
        "sender_full_name": "Corey Sanders",
        "timestamp": 1620321545
    },
    {
        "content": "<p>There's also a Bundle provider for the Java engine that allows the use of data that has been fetched ahead of time, in a similar fashion to the JS engine:</p>\n<p><a href=\"https://github.com/DBCG/cql-evaluator/blob/master/evaluator.engine/src/main/java/org/opencds/cqf/cql/evaluator/engine/retrieve/BundleRetrieveProvider.java\">https://github.com/DBCG/cql-evaluator/blob/master/evaluator.engine/src/main/java/org/opencds/cqf/cql/evaluator/engine/retrieve/BundleRetrieveProvider.java</a></p>",
        "id": 237696545,
        "sender_full_name": "JP",
        "timestamp": 1620321681
    },
    {
        "content": "<p>Just popping in to confirm that the JavaScript engine only works w/ FHIR bundles passed into it -- but as Corey and JP mentioned above, that's a limitation of the JavaScript engine; not a limitation of CQL (although, truly, <em>how</em> data is physically accessed is outside the scope of CQL).</p>\n<p>We've used the JavaScript engine in SMART apps where code in the app does the FHIR queries and then assembles them into a bundle to pass on to the JavaScript engine.</p>\n<p>I'd like to build querying capability into the <code>cql-exec-fhir</code> module that the JavaScript engine uses, but have not yet had the time or opportunity.</p>",
        "id": 237697353,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1620322015
    }
]