[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span>  / <span class=\"user-mention\" data-user-id=\"194178\">@JP</span> Have you guys started to think about FHIR R4B support in the Java Engine? There are a number of model changes that will necessitate a new model info file for the translator and I think a new FHIRHelpers library maybe. Having those would be useful in preparation for updating my IBM FHIR CQL backend to R4B.</p>",
        "id": 266867991,
        "sender_full_name": "Corey Sanders",
        "timestamp": 1641332612
    },
    {
        "content": "<p>Yes. We need a couple upstream changes from HAPI due to the way our ModelInfo generation works. Those should be landing in the next few weeks based on the chatter I see in the hapi stream. Also upcoming: R5.</p>",
        "id": 266868578,
        "sender_full_name": "JP",
        "timestamp": 1641332961
    },
    {
        "content": "<p>I expect it'll take another while after that before we're able to do the actual implementation. So, maybe a month or two out before we get it done. You have any specific timeframe in mind?</p>",
        "id": 266868827,
        "sender_full_name": "JP",
        "timestamp": 1641333111
    },
    {
        "content": "<p>I wasn't given a specific timeframe for this work. It will probably depend a lot on when the spec becomes GA, but I will check with the server team and see what they think and get back to you. Right now, my stuff is failing during model resolution because there are quite a few code class differences between 4.0.1 and 4.3.0. We've got some stuff in the ModelResolver that smooths out the differences between 4.0.0 and 4.0.1, but this seems like a much larger hack to patch from 4.0.1 to 4.3.0.</p>",
        "id": 266870112,
        "sender_full_name": "Corey Sanders",
        "timestamp": 1641333764
    },
    {
        "content": "<p><a href=\"https://github.com/cqframework/clinical_quality_language/issues/711\">https://github.com/cqframework/clinical_quality_language/issues/711</a></p>",
        "id": 266874456,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1641336113
    },
    {
        "content": "<p>I talked with the server team. They expect R4B will be published late January or early February <a href=\"#narrow/stream/179166-implementers/topic/R4B\">see</a> and the plan is to release a new server version that supports R4B at that time. The IBM FHIR server is inherently single version right now, so I need to have something working around then. That said, I spent some more time debugging why the engine was failing in our R4B branch and I was able to get over the immediate hurdle by patching the ModelResolver. I can run with the 4.0.1 definitions now, so it isn't urgent to have the 4.3.0 models until someone comes wanting to write CQL against the new resources.</p>",
        "id": 266975547,
        "sender_full_name": "Corey Sanders",
        "timestamp": 1641409081
    }
]