[
    {
        "content": "<p>Hi!<br>\nI have a question on how to export all FHIR Bundles from an FHIR API for performing healthcare quality measures using cql-execution and cql-exec-fhir. The FHIR Data Source (for cql-exec-fhir) expects each patient to be represented as a single FHIR Bundle containing all of the patient's relevant data.<br>\nI have read the article <a href=\"https://hl7.org/fhir/uv/bulkdata/\">https://hl7.org/fhir/uv/bulkdata/</a> that says we should use FHIR based approach for exporting bulk data from a FHIR server. The fhir-downloader (another JS library) exports bulk data from a FHIR Server and store it localy as .ndjson files. however, FHIR Bundle is required. <br>\nI would approtialte any help to get an idea on how to glue all tools together to perform healthcare quality measures agaist all FHIR Bundles available on specific FHIR API source.</p>\n<p>PS: is there a way to extract FHIR Bundles from .ndjson files? Is it correct approach?</p>",
        "id": 223497760,
        "sender_full_name": "Vasyl Herman",
        "timestamp": 1611229918
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"376706\">@Vasyl Herman</span> -- I don't know enough about bulk FHIR to answer your questions about that, but I expect it would not be terribly difficult to write some code that could build a bundle from the .ndjson results.  It may already exist, I don't know.  Another approach, if your server supports it, would be to use the <a href=\"http://hl7.org/fhir/R4/patient-operation-everything.html\">Patient $everything</a> operator -- although it is admittedly not <em>optimized</em> for massive amounts of data.</p>\n<p>Since you're talking about FHIR-based measures and cql-execution / cql-exec-fhir, I also wanted to be sure you know about the open source <a href=\"https://github.com/projecttacoma/fqm-execution\">fqm-execution</a> project.  It uses cql-execution and cql-exec-fhir, but also provides some of the CQM-specific logic you would want when processing measures.  If JavaScript is not a requirement, and Java is OK, you may also want to check out <a href=\"https://github.com/DBCG/cqf-ruler\">cqf-ruler</a>.  I <em>think</em> it can do FHIR measures (<span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span>, correct me if I am wrong) and it dynamically queries the FHIR server for you (so you don't need to get all the data in bulk up front).  But... it is Java, not JavaScript.</p>",
        "id": 223507876,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1611236031
    },
    {
        "content": "<p>Also see the Connectathon 26 clinical reasoning track, <a href=\"https://confluence.hl7.org/display/FHIR/2021-01+Clinical+Reasoning#id-202101ClinicalReasoning-TrackDetails\">data element submission (data exchange scenarios) </a>. It was noted that \"Consider bulk data\" does not necessarily mean using the Bulk Data IG, but could also mean using <a href=\"http://hl7.org/fhir/async.html\">Asynchronous Request Pattern</a>.  IBM supports bulk operations <a href=\"https://ibm.github.io/FHIR/guides/FHIRBulkOperations/\">https://ibm.github.io/FHIR/guides/FHIRBulkOperations/</a> but not sure they support Measure operations.</p>",
        "id": 223518598,
        "sender_full_name": "Paul Denning",
        "timestamp": 1611240962
    },
    {
        "content": "<p>Yes, confirming that cqf-ruler does support Measure evaluation, but it does so with the local server's data.</p>",
        "id": 223519716,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1611241384
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191359\">Bryn Rhodes</span> <a href=\"#narrow/stream/179220-cql/topic/how.20to.20export.20all.20fhir.20data/near/223519716\">said</a>:</p>\n<blockquote>\n<p>Yes, confirming that cqf-ruler does support Measure evaluation, but it does so with the local server's data.</p>\n</blockquote>\n<p>Quick follow-up question, <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> -- is this the case for CQF Ruler's CDS Hooks support as well?  Or can the CDS Hooks implementation query the <code>fhirServer</code> from the CDS Hooks request?</p>",
        "id": 224761262,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1612200425
    },
    {
        "content": "<p>It can query the <code>fhirServer</code>.</p>",
        "id": 224765827,
        "sender_full_name": "JP",
        "timestamp": 1612202294
    },
    {
        "content": "<p>There are lots of options for how that happens, and we're working to standardize the parameters for those options. Take a look at the Library/$evaluate operation here: <a href=\"http://build.fhir.org/ig/HL7/cqf-recommendations/OperationDefinition-cpg-library-evaluate.html\">http://build.fhir.org/ig/HL7/cqf-recommendations/OperationDefinition-cpg-library-evaluate.html</a></p>",
        "id": 224772567,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1612205296
    }
]