[
    {
        "content": "<p>I realize much of this work is still in development; but I'm curious how I could use the FHIR3 example data and measures (such as CMS124v7) in the January connectathon using the CQL Execution engine.  I was able to convert the age.cql example to age.coffee; but I'm not sure how to go about using the pre-converted ELM or how to convert the bundles into coffee-styled elm.</p>",
        "id": 206305200,
        "sender_full_name": "Clark C. Evans",
        "timestamp": 1596831900
    },
    {
        "content": "<p>What would be great is if there were more detailed instructions on how to use one of the eCQMs with the cql-execution engine; in particular, how to use them against data created by Synthea.</p>",
        "id": 206399137,
        "sender_full_name": "Clark C. Evans",
        "timestamp": 1596986272
    },
    {
        "content": "<p>Have you looked at the connectathon <a href=\"https://github.com/DBCG/connectathon/wiki/Quickstart\">quick start</a>? Those specifically illustrate how to load Synthea data sets into test servers and then evaluate measures using that data.</p>",
        "id": 206548855,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1597132450
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span>  Super, thanks (I'm not sure why I didn't see that).   Does this have a command line interface or any regression tests?</p>",
        "id": 206578953,
        "sender_full_name": "Clark C. Evans",
        "timestamp": 1597154763
    },
    {
        "content": "<p>The regression tests are the connectathon packages, we are working on getting that into an automated suite.</p>",
        "id": 206590859,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1597160351
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> So, I've updated both connectathon and cqf-ruler to the latest, and I'd note that the Wiki references an out-of-date blob for <code>measure-EXM130-8.0.000</code>; the one in the master repository is <code>measure-EXM130-7.3.000</code>.  I'd also note that the R4 measure version, <code>EXM130-7.2.000</code> fails with \"Could not resolve membership operator\" and \"Could not resolve identifier timezone\".   </p>\n<p>Other R4.01 measures also seem to fail when performed against their sample patient, <code>measure-EXM124-9.0.000</code> errors out with <code> Unable to resolve library reference: http://fhir.org/guides/dbcg/connectathon/Library/library-FHIRHelpers|4.0.1</code>.    Perhaps I've forgot another bundle I should be uploading?</p>\n<p>It'd be great to have a way to run though these measure tests via command line.</p>",
        "id": 206596817,
        "sender_full_name": "Clark C. Evans",
        "timestamp": 1597163321
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span>   So, I was trying to run a very quick <a href=\"https://github.com/clarkevans/cqf-ruler/commit/c5686bec9553a2208b1fd1739f28ac0c4f0c4526\">benchmark</a> with a fairly old <code>i7-4770 CPU @ 3.40GHz</code>.  I started the webserver after loading the EXM130 bundle, and then refreshed <code>http://localhost:8080/cqf-ruler-r4/fhir/Measure/measure-EXM130-7.3.000/$evaluate-measure?patient=denom-EXM130&amp;periodStart=2019-01-01&amp;periodEnd=2019-12-31</code> twenty-five times for <code>denom-EXM130</code> and twenty-five for <code>numer-EXM130</code>, discarding the first few warm up ones.  What I got was an average computation time of  <em>607.9ms</em>.  Is this in-line with your expectations, or is there something dramatically wrong with my setup?</p>",
        "id": 206605370,
        "sender_full_name": "Clark C. Evans",
        "timestamp": 1597167325
    },
    {
        "content": "<p>We have a chunk of performance optimizations that we're working on getting in to the pipeline, I'll check where those are right now.</p>",
        "id": 206606675,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1597167874
    },
    {
        "content": "<p>We're also actively working on connectathon prep, so there's a bit of flux in the connectathon repo right now.</p>",
        "id": 206606713,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1597167895
    },
    {
        "content": "<p>When is the next connectathon.  I'm not an HL7 member though (currently unaffiliated).</p>",
        "id": 206606796,
        "sender_full_name": "Clark C. Evans",
        "timestamp": 1597167938
    },
    {
        "content": "<p>The connectathon is September 9th through the 11th, and the price difference for members/non-members is very small. We would certainly welcome the participation.</p>",
        "id": 206608203,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1597168585
    }
]