[
    {
        "content": "<p>Hi, I have a question about a number of files I've looked at a few different examples on Libraries on the AHRQ site and the files seem to be missing the element names. I'm trying to build PlanDefinitions from them. However the IG tooling says the files do not seem to be FHIR since they are missing all of the element names. Example files:  <a href=\"https://cds.ahrq.gov/cdsconnect/artifact/factors-consider-managing-chronic-pain-pain-management-summary\">https://cds.ahrq.gov/cdsconnect/artifact/factors-consider-managing-chronic-pain-pain-management-summary</a></p>\n<div class=\"codehilite\"><pre><span></span><code>{\n   &quot;library&quot; : {\n      &quot;identifier&quot; : {\n         &quot;id&quot; : &quot;FHIRHelpers&quot;,\n         &quot;version&quot; : &quot;4.0.1&quot;\n      },\n      &quot;schemaIdentifier&quot; : {\n         &quot;id&quot; : &quot;urn:hl7-org:elm&quot;,\n         &quot;version&quot; : &quot;r1&quot;\n      },\n      &quot;usings&quot; : {\n         &quot;def&quot; : [ {\n            &quot;localIdentifier&quot; : &quot;System&quot;,\n            &quot;uri&quot; : &quot;urn:hl7-org:elm-types:r1&quot;\n         }, {\n            &quot;localIdentifier&quot; : &quot;FHIR&quot;,\n            &quot;uri&quot; : &quot;http://hl7.org/fhir&quot;,\n</code></pre></div>\n<p>E.g. in this example it should be   \"resourceType\": \"Library\",</p>\n<p>Is there some kind of header file or something that adds the element names?<br>\n<span class=\"user-mention\" data-user-id=\"416084\">@Paul Puscas</span> <span class=\"user-mention\" data-user-id=\"400829\">@Christa Wan</span></p>",
        "id": 245359454,
        "sender_full_name": "Alex Goel",
        "timestamp": 1625772319
    },
    {
        "content": "<p>Those are ELM libraries (i.e. executable files like a Java library or a C++ library) and not FHIR Resources. ELM libraries and typically embedded inside of FHIR Libraries when deployed to a FHIR server.</p>",
        "id": 245364939,
        "sender_full_name": "JP",
        "timestamp": 1625774875
    },
    {
        "content": "<p>Oh I see! So I'd have to generate the FHIR libraries separately</p>",
        "id": 245365309,
        "sender_full_name": "Alex Goel",
        "timestamp": 1625775038
    },
    {
        "content": "<p>Right. Many of the artifacts on CDS Connect publish only the CQL libraries (and not the FHIR Clinical Reasoning / CPG resources).  There are a few that also publish the PlanDefinition and such, but many do not.</p>",
        "id": 245727998,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1626114932
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> Are these PlanDefinitions automatically generated from the CQL? I see that the AUDIT Logic files include a PlanDefinition <a href=\"https://cds.ahrq.gov/cdsconnect/artifact/alcohol-screening-using-usaudit-alcohol-use-disorders-identification-test\">https://cds.ahrq.gov/cdsconnect/artifact/alcohol-screening-using-usaudit-alcohol-use-disorders-identification-test</a> This makes it difficult to consistently implement these files if there is a different set of files that come down and we can't generate  the PlanDefinitions from the CQL ourselves</p>",
        "id": 245836499,
        "sender_full_name": "Alex Goel",
        "timestamp": 1626188029
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192545\">@Alex Goel</span> - I believe that particular artifact was developed by <span class=\"user-mention\" data-user-id=\"195840\">@David Winters</span> and his team on behalf of CDC. As CDS Connect is a repository containing artifacts from a variety of sources and authors, there <em>will</em> be variation in the content and structure of download packages.  Some may contain PlanDefinitions, others may not.  How those PlanDefinitions came to be (hand-authored, generated, some hybrid of those) may also vary.  I think the particular ones you are referring to were hand-authored, but <span class=\"user-mention\" data-user-id=\"195840\">@David Winters</span> should be able to confirm.</p>",
        "id": 245842008,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1626190002
    },
    {
        "content": "<p>Are there any efforts to standardize  what is uploaded or at least flag what has what kinds of resources? Everything just says \"Logic File\"</p>",
        "id": 245843938,
        "sender_full_name": "Alex Goel",
        "timestamp": 1626190861
    },
    {
        "content": "<p>Yep, <span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> is correct that those PlanDefinitions are hand-crafted.  There really isn't much to them, aside from the metadata.  Basically a top-level action with include/exclusion criteria, with an action to present the Questionnaire.  Happy to answer questions you might have about those files.  Would also be interested to hear more about how you're using them.</p>",
        "id": 245844755,
        "sender_full_name": "David Winters",
        "timestamp": 1626191175
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192545\">@Alex Goel</span> -- CDS Connect is pretty open regarding what types of artifacts it allows (not just CQL), so we felt it was best to have a pretty light-handed approach to logic files and what could be uploaded. That said, we are open to ideas about how this can be improved, especially for consumers of the repository.  Perhaps if we understood your use case better we could consider additional approaches to better suit you.  Are you aiming to programatically consume resources from the repository?</p>",
        "id": 245852187,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1626194467
    },
    {
        "content": "<p>I think if there was at least a list of what Logic files were included in the zip that would be very helpful, as well as a search and sort features so that we could find the ones that contain PlanDefinitions for example or the ones which are just CQL </p>\n<p>Ideally we'd like to programmatically consume the resources, but right now it's very manual</p>",
        "id": 245858981,
        "sender_full_name": "Alex Goel",
        "timestamp": 1626197394
    },
    {
        "content": "<p>OK.  Understood.  Being able to search for artifacts by the standards they use makes sense.  <span class=\"user-mention\" data-user-id=\"224765\">@Matt Coarr</span> / <span class=\"user-mention\" data-user-id=\"194155\">@Dylan Mahalingam</span> -- we should put this in the backlog (if it isn't already there).</p>",
        "id": 245873277,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1626203657
    },
    {
        "content": "<p>Amazing! Thank you!</p>",
        "id": 245874515,
        "sender_full_name": "Alex Goel",
        "timestamp": 1626204231
    }
]