[
    {
        "content": "<p>I am looking at the Library resource and trying to see how one might use it for FHIRPath expressions.  Is that an intended use?  As I understand, the Library is supposed to define a collection of named things via the Attachments that can be used in Expressions, but I don't a place in the Library resource where a name could be assigned to a FHIRPath expression.</p>",
        "id": 231092565,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1616189410
    },
    {
        "content": "<p>I think there's a tracker item for us to define a syntax</p>",
        "id": 231093507,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1616190019
    },
    {
        "content": "<p>Found it: <a href=\"http://jira.hl7.org/browse/FHIR-29562\">FHIR-29562</a>.  It is \"Waiting for Input\"-- from whom, it doesn't say.  I see <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> asked on 2/15, \"Where/how are we expecting to use these references?\"  I think the answer is that we could potentially use them anyplace an Expression is used in a Questionnaire.  I have left at comment with that answer.</p>",
        "id": 231311160,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1616420430
    },
    {
        "content": "<p>If one had a series of FHIRPath expressions stored in a Library which depended on each other (like Questionnaire variables can be used be each other or a calculatedExpression-- but am I not thinking of a Questionnaire context here) one would like to be say, \"Run the expressions in this library in order and return the result\".  Is there a way of doing that?  I suppose that could just be something an app knows to do with a particular library.  Also, note that by \"depending on each other\" am implying that values from one expression can be feed in as a context variable to a subsequent expression.  I am not sure if <a href=\"http://jira.hl7.org/browse/FHIR-29562\">FHIR-29562</a> covers that or not.</p>",
        "id": 232813784,
        "sender_full_name": "Paul Lynch",
        "timestamp": 1617306199
    },
    {
        "content": "<p>Hi Paul, that gets in to what CQL is already doing (expression dependencies, evaluation order, all that sort of thing). Given that CQL is a superset of FHIRPath, it is possible to define a CQL library of FHIRPath expressions.</p>",
        "id": 232956158,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1617400037
    },
    {
        "content": "<p>That would give you dependency tracing and evaluation order.</p>",
        "id": 232956165,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1617400048
    }
]