[
    {
        "content": "<p>Hello - Looking for proper method to enter content that could potentially be used for a CDS Hooks notification card.  For example, I may want to store a title, body text, URL, etc. that would be based on the result of my CQL retrieves.</p>\n<p>In the author's guide (<a href=\"https://cql.hl7.org/02-authorsguide.html\" target=\"_blank\" title=\"https://cql.hl7.org/02-authorsguide.html\">https://cql.hl7.org/02-authorsguide.html</a>), it looks like I could possibly define a structured value (see section 4.3) to accomplish this, but unsure if this is the most appropriate strategy.</p>\n<p>Any guidance would be appreciated.</p>",
        "id": 154019758,
        "sender_full_name": "Adam Rodriguez",
        "timestamp": 1542694560
    },
    {
        "content": "<p>There are several potential approaches to integrating CQL with CDS Hooks.  In regard to how to supply information that goes into the card, I'll call out three potential approaches that I'm aware of:</p>\n<p>1) As you noted, you could put card information into a CQL Tuple -- allowing the CQL logic to define the title, body, text, etc.  While the proximity to the logic is nice, one downside is that it could get unwieldy when you need large sections of text or markup.  In addition, the code actually invoking the CQL (as part of a CDS Hooks API) would obviously need to know what expression contains the custom Tuple and how the custom Tuple maps to the components of a card.</p>\n<p>2) You could store some (or potentially all) of the card-based text information in FHIR Clinical Reasoning resources that are linked to the CQL.  In this case, the text might be hard-coded into the Clinical Reasoning resources or it might refer to specific expressions in the CQL.  Then the code that implements the CDS Hooks API would need to be aware of how the FHIR Clinical Reasoning resources map to the CDS Hooks cards.  This is the approach that <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span>, <span class=\"user-mention\" data-user-id=\"191986\">@Kensaku Kawamoto</span>, and their team used for the CDC Opioid Prescribing IG.  You can find more details (and examples) of this approach in the IG here: <a href=\"http://build.fhir.org/ig/cqframework/opioid-cds/documentation.html\" target=\"_blank\" title=\"http://build.fhir.org/ig/cqframework/opioid-cds/documentation.html\">http://build.fhir.org/ig/cqframework/opioid-cds/documentation.html</a></p>\n<p>3) Similar to #2 above, the CDS Connect team (of which I am apart), built a simple prototype framework for exposing CQL via CDS Hooks.  In this framework, we defined a very simple configuration file format to map CQL to components in a card -- allowing for a mix of hard coded strings, values from CQL expressions, and string interpolation.  This is described in the README for the project on GitHub: <a href=\"https://github.com/AHRQ-CDS/AHRQ-CDS-Connect-CQL-SERVICES#adding-cql-hooks\" target=\"_blank\" title=\"https://github.com/AHRQ-CDS/AHRQ-CDS-Connect-CQL-SERVICES#adding-cql-hooks\">https://github.com/AHRQ-CDS/AHRQ-CDS-Connect-CQL-SERVICES#adding-cql-hooks</a></p>\n<p>I'm not sure if any of these have emerged as <em>the</em> way to do it.  The approach you choose will likely depend on your own requirements and the capabilities of your system.  I expect that as both CDS Hooks and CQL gain adoption (and maturity) we may see some best practices emerge.  I look forward to that.</p>",
        "id": 154020301,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1542829874
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> that's fantastic! In the Opioid IG, we used specific names for each expression within a library to allow the same infrastructure to evaluate different plan definitions. We're currently working on profiles to make those patterns explicit.</p>",
        "id": 154020343,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1542842148
    }
]