[
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span>,<br>\nI am trying to parse all queries that appear in the CQL documentation on <a href=\"http://cql.hl7.org/index.html\" target=\"_blank\" title=\"http://cql.hl7.org/index.html\">http://cql.hl7.org/index.html</a>. I managed to parse some examples using the QUICK model, but some have a different model. Does there exist a publicly available model file that can be used to parse all statements from the documentation ? That would make experiments with the language much easier.<br>\nGreetings<br>\nGeorg</p>",
        "id": 154012095,
        "sender_full_name": "Georg Fette",
        "timestamp": 1540456441
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"196537\">@Georg Fette</span>, the examples should all parse with the current translator. Are there specific examples you are having trouble with?</p>",
        "id": 154012692,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1540578178
    },
    {
        "content": "<p>Hi, <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span><br>\nThe query <br>\n[CommunicationRequest] C  where C.mode = 'ordered' and C.sender.role = 'nurse' and C.recipient.role = 'doctor' and C.indication in \"Fever\"<br>\nfor example uses a \"CommunicationRequest\" definition that does not seem to correspond to the definition in <a href=\"https://www.hl7.org/fhir/communicationrequest.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/communicationrequest.html\">https://www.hl7.org/fhir/communicationrequest.html</a>.<br>\nC.mode and C.indication appear to be missing. Furthermore do the sender and the recipient be implicitely typed to Practitioner. Wher does this type inference come from, because in the QUICK model sender and recipient are defined as one of a list of types (Practitioner | Patient | Device | RelatedPerson | Organization). In the QUICK model file I am currently using these elements are defined as \"System.Any\". How does such a selection from a list of possible types look like in a proper model file ?<br>\nGreetings<br>\nGeorg</p>",
        "id": 154015111,
        "sender_full_name": "Georg Fette",
        "timestamp": 1541162228
    },
    {
        "content": "<p>The QUICK model that is included with the CQL-to-ELM translator is based on an interim release of FHIR, 1.6 IIRC. The QUICK model is derived from the QI-Core profiles, and the tooling to do that automatically is still in flight, what's there in QUICK currently was built manually and it hasn't been updated for subsequent releases of the QI-Core profiles.</p>",
        "id": 154015684,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1541436826
    },
    {
        "content": "<p>Further, when that manual model was produced, the model info didn't support Choice Types, so choices were modeled as Any. Newer model infos use Choice Types to model those. If it's modeled as an Any, then you would have to use a type cast to get the value to be treated as the appropriate type. With Choice Types, the translator will attempt to resolve based on any of the types in the choice type.</p>",
        "id": 154015685,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1541436922
    },
    {
        "content": "<p>So if you look at the later FHIR model infos, they use choice types to model choices in FHIR.</p>",
        "id": 154015686,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1541436942
    }
]