[
    {
        "content": "<p>According to the <a href=\"http://hl7.org/fhir/us/cqfmeasures/STU1/measure-conformance.html\" target=\"_blank\" title=\"http://hl7.org/fhir/us/cqfmeasures/STU1/measure-conformance.html\">Quality Measure STU1 for FHIR STU3 IG</a> non-patient based populations are possible. That is done by returning the, in their case, encounters from the, then called <code>InitialPolulation</code> expression. Normally one would have an <code>InInitialPopulation</code> expression just returning true/false for inclusion of each patient.</p>\n<p>The following paragraph in section 3.4.1 makes that clear:</p>\n<blockquote>\n<p>In addition to the measure type, measures generally fall into two categories, patient-based, and non-patient-based (e.g. encounter-based). In general, patient-based measures count the number of patients in each population, while non-patient-based measures count the number of items (such as encounters) in each population.</p>\n</blockquote>\n<p>My question is simply whether this is considered possible in a common case or whether this is special to the mentioned IG. I also have the question how it is specified in the Measure resource of which type the populations are. I also ask because this non-patient based populations are not mentioned in <a href=\"https://www.hl7.org/fhir/clinicalreasoning-quality-reporting.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/clinicalreasoning-quality-reporting.html\">Quality Reporting</a>.</p>",
        "id": 182680056,
        "sender_full_name": "Alexander Kiel",
        "timestamp": 1575565382
    },
    {
        "content": "<p>I have cross posted this in <a href=\"#narrow/stream/179166-implementers/topic/Non-Patient.20based.20Populations.20in.20eCQMs\" title=\"#narrow/stream/179166-implementers/topic/Non-Patient.20based.20Populations.20in.20eCQMs\">Implementers</a> because not all of the important people are in #cql.</p>",
        "id": 182688136,
        "sender_full_name": "Alexander Kiel",
        "timestamp": 1575570546
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"197470\">@Alexander Kiel</span> , this is supported by the base Measure and MeasureReport resources (it's actually the root of the reason we don't allow the Group resource to be used to specify or report populations). It's definitely not made as clear as it could be, but the measures structures are all designed to support it, and for example, <a href=\"http://hl7.org/fhir/measure.html#14.14.2\" target=\"_blank\" title=\"http://hl7.org/fhir/measure.html#14.14.2\">this section</a> discusses that individual members of a population may be encounters or procedures, not necessarily patients.</p>",
        "id": 182715136,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1575588036
    },
    {
        "content": "<p>One of the tasks we are working on is to promote appropriately general guidance and implementation experience from the Quality Measure and Data Exchange for Quality Measures IGs back to the base Measure and MeasureReport resources and the Quality Reporting topic. There are several trackers related to this that are in the process of being applied for the R5 specification.</p>",
        "id": 182715246,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1575588170
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> Thanks for your answer. Is the Quality Measure IG currently the best source for additional documentation regarding Quality Reporting?</p>\n<p>If the population I use in a Measure would be encounters, should I set the subject of the Measure to Encounter or is that still Patient, because I still use the Patient context in CQL? In the Measure documentation subject is linked to the CQL context. If on the other hand subject should be still Patient, how can I specify, that the actual populations are encounters? To extends this: if the subject is still Patient, would it be possible to have different population types in different groups of the same Measure?</p>",
        "id": 182737678,
        "sender_full_name": "Alexander Kiel",
        "timestamp": 1575619333
    },
    {
        "content": "<p>Yes, the Quality Measure IG contains the most current guidance regarding authoring quality measures, and the Data Exchange for Quality Measures contains the most current guidance for reporting quality measures.</p>",
        "id": 182778030,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1575650044
    },
    {
        "content": "<p>Subject is still patient though on both cases because the context in CQL gives the evaluation context for the population criteria. The result type of the criteria expression would be boolean for patient based measures, and would be a list of the relevat resource type for non-patient-based measures.</p>",
        "id": 182778337,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1575650240
    },
    {
        "content": "<p>The quality measure if defines a populationBasis extension that allows you to specify what that type is.</p>",
        "id": 182778370,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1575650273
    },
    {
        "content": "<p>*IG</p>",
        "id": 182778409,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1575650282
    },
    {
        "content": "<p><a href=\"http://hl7.org/fhir/us/cqfmeasures/StructureDefinition-cqfm-populationBasis.html\" target=\"_blank\" title=\"http://hl7.org/fhir/us/cqfmeasures/StructureDefinition-cqfm-populationBasis.html\">http://hl7.org/fhir/us/cqfmeasures/StructureDefinition-cqfm-populationBasis.html</a></p>",
        "id": 182779773,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1575651087
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> Ok thanks. I have to evaluate this further but I think using non-patient based populations would negate my need for the special Specimen context, you might remember. I can just use the Patient context and count the Specimens of interest.</p>",
        "id": 182781990,
        "sender_full_name": "Alexander Kiel",
        "timestamp": 1575652339
    }
]