[
    {
        "content": "<p>Hi, I'm trying to translate to ELM the CQL for recommendation 5 from the Opioid Prescribing Support IG: <a href=\"http://build.fhir.org/ig/cqframework/opioid-cds/recommendation-05.html\">http://build.fhir.org/ig/cqframework/opioid-cds/recommendation-05.html</a><br>\nI'm using the cql-to-elm utility that is part of the cql-execution repository on GitHub: <a href=\"https://github.com/cqframework/cql-execution/blob/master/README.md#to-execute-your-cql\">https://github.com/cqframework/cql-execution/blob/master/README.md#to-execute-your-cql</a><br>\nI'm able to translate OMTKData2019, OpioidCDSCommon, and OMTKLogicCQL without issue. However I'm getting errors for OpioidCDSREC05:<br>\n================================================================================<br>\nTRANSLATE C:\\Users\\garza\\Desktop\\opioid-prescribing-support-ig\\cql\\OpioidCDSREC05.cql<br>\nTranslation failed due to errors:<br>\nError:[7:1, 7:57] Could not load source for library OpioidCDSRoutines, version 1.2.2.<br>\nError:[46:11, 46:18] Could not resolve identifier Routines in the current library.<br>\nError:[57:9, 57:16] Could not resolve identifier Routines in the current library.<br>\nError:[69:13, 69:20] Could not resolve identifier Routines in the current library.<br>\nError:[52:3, 52:22] Could not validate reference to expression Inclusion Criteria because its definition contains errors.<br>\nError:[77:6, 77:36] Could not validate reference to expression Is Recommendation Applicable? because its definition contains errors.<br>\nError:[82:6, 82:36] Could not validate reference to expression Is Recommendation Applicable? because its definition contains errors.<br>\nError:[92:6, 92:36] Could not validate reference to expression Is Recommendation Applicable? because its definition contains errors.</p>\n<p>So it seems there is a missing library, and I can't find it anywhere on the Opioid Prescribing Support IG site.  Anyone know where I can get that library?</p>\n<p>In trying to find it, I noticed that there is an \"R4\" version of the IG, that is based on FHIR R4: <a href=\"http://build.fhir.org/ig/cqframework/opioid-cds-r4/index.html\">http://build.fhir.org/ig/cqframework/opioid-cds-r4/index.html</a><br>\nThe first IG is based on STU3.  I had originally been looking at the STU3 version because that's what was linked to on the Confluence page for the Clinical Reasoning track: <a href=\"https://confluence.hl7.org/display/FHIR/2021-09+Clinical+Reasoning\">https://confluence.hl7.org/display/FHIR/2021-09+Clinical+Reasoning</a><br>\nShould the Confluence page be linking to the R4 version of the IG?</p>",
        "id": 252697643,
        "sender_full_name": "Jorge de la Garza",
        "timestamp": 1631222264
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"192535\">@Jorge de la Garza</span> , I notice in the path on the translate call that it's <code>opioid-prescribing-support-ig\\cql\\OpioidCDSRec05.cql</code>, but assuming <code>opioid-prescribing-support-ig</code> is the root of your clone, the path should be <code>opioid-prescribing-support-ig\\input\\pagecontent\\cql\\OpioidCDSRec05.cql</code>. Did you make a complete clone of the repository?</p>",
        "id": 252698819,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1631222806
    },
    {
        "content": "<p>The library it's referencing is called <code>OpioidCDSRoutines</code>, the <code>Routines</code> identifier is a local alias for that library within the <code>OpioidCDSRec05</code> library.</p>",
        "id": 252698881,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1631222842
    },
    {
        "content": "<p>I just got latest on master and verified that I can translate OpioidCDSRec05, so I'm wondering if maybe you have an incomplete local copy?</p>",
        "id": 252698926,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1631222868
    },
    {
        "content": "<p>And yes, we should probably point to both the opioid-cds (STU3) and opioid-cds-r4 (R4) versions of the repository, we support both versions since we are working with both STU3 and R4 FHIR servers.</p>",
        "id": 252699068,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1631222918
    },
    {
        "content": "<p>Updated the confluence page.</p>",
        "id": 252699404,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1631223096
    },
    {
        "content": "<p>Ah. I didn't realize there was a repository.  I was just trying to transform the CQLs  on the recommendation 5 page.  So when I try to transform the whole cql folder from the repository, then everything transforms without issue. Thanks <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span></p>",
        "id": 252724133,
        "sender_full_name": "Jorge de la Garza",
        "timestamp": 1631241375
    },
    {
        "content": "<p>Hi, I'm still working on supporting this IG. To evaluate the CQL, I'm using the <code>cql-execution</code>, <code>cql-exec-fhir</code>, and <code>cql-exec-vsac</code> repos from GitHub. One thing that I'm finding is that the valuesets defined in OpioidCDSCommon.cql do not seem to exist in VSAC. It seems like they only exist as ValueSet resources in the IG.  I suppose I could write something that takes a ValueSet resource and adds the codes to the <code>cql-execution</code> <code>CodeService</code>. Does that sound right, or is there some other way I should be making these valuesets available to the evaluation?</p>",
        "id": 253261052,
        "sender_full_name": "Jorge de la Garza",
        "timestamp": 1631629835
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"192535\">@Jorge de la Garza</span> -- as you noted, <code>cql-exec-vsac</code> only supports value sets in VSAC.  We don't currently have an implementation that supports arbitrary FHIR-defined value sets -- although it's possible that <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> has implemented something like this to support some other projects he's worked on.  Bryn?</p>\n<p>Assuming there is nothing out there yet, then yes, I think the way forward would be to implement something that can push the FHIR value sets into the <code>CodeService</code>.  Or a script that just adds your value sets to the VS cache file that the service loads on startup.  If you don't use <em>any</em> value sets from VSAC, then you could also just write your own <code>CodeService</code> implementation.</p>",
        "id": 253265905,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1631631489
    },
    {
        "content": "<p>So, we did write something that will take FHIR ValueSet resources (fully expanded) and output them as a valueset_db.json file suitable for use in the JavaScript engine:</p>",
        "id": 253328444,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1631655618
    },
    {
        "content": "<p><a href=\"https://github.com/cqframework/cqf-tooling/blob/master/src/main/java/org/opencds/cqf/tooling/terminology/ToJsonValueSetDbOperation.java\">https://github.com/cqframework/cqf-tooling/blob/master/src/main/java/org/opencds/cqf/tooling/terminology/ToJsonValueSetDbOperation.java</a></p>",
        "id": 253328659,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1631655726
    },
    {
        "content": "<p>The docs are pretty horrid, I thought I had doc'ed it when I built it, but... apparently not. It's pretty simple, just in and out directories.</p>",
        "id": 253328702,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1631655756
    },
    {
        "content": "<p>There's also an EnsureExecutableValueSet that will expand FHIR ValueSets (so long as the definition is trivial)</p>",
        "id": 253328753,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1631655785
    },
    {
        "content": "<p>Longer term, one of the things we're working on this connectathon is a FederatingTerminologyClient:</p>",
        "id": 253328807,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1631655820
    },
    {
        "content": "<p><a href=\"https://github.com/cqframework/cqf-tooling/pull/298\">https://github.com/cqframework/cqf-tooling/pull/298</a></p>",
        "id": 253328861,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1631655842
    }
]