[
    {
        "content": "<p>Supposed I have defined an expression that returns a single tuple containing a decimal number such as one below:</p>\n<p>define \"Active Prescriptions In The Opioid Episode with Average MME\":<br>\n  \"Opioid Prescriptions With Total MME\" ActiveMedication<br>\n    return {<br>\n      averageMME: Round(ActiveMedication.totalMME / \"Length Of The Opioid Episode\", 2)<br>\n    }</p>\n<p>Assuming my measure is a patient-based measure, how would I identify a patient with averageMME &gt; 50 in the numerator?  I have added the above expression in the Numerator and it compiles OK (see below) but failed when saving grouping with the following error:<br>\nNumerator 1 : For Patient-based Measures, all definitions directly added to populations must return a Boolean.</p>\n<p>define \"Numerator\":<br>\n  \"Active Prescriptions In The Opioid Episode with Average MME\" A<br>\n    where A.averageMME &gt; 50.0</p>\n<p>Can you please let me know how to get around this issue? Your help is appreciated.</p>\n<p>TT</p>",
        "id": 182593689,
        "sender_full_name": "Tien Thai",
        "timestamp": 1575490151
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"249396\">@Tien Thai</span>.  Your Numerator is a query -- so it will actually return a list of \"Active Prescriptions In The Opioid Episode with Average MME\" that have the averageMME &gt; 50.0.  A list is not a boolean, so it doesn't work as a numerator.  I think what you really want to know is if the patient has any episodes that met that criteria.  If I correctly understand what you're trying to do, it's as simple as wrapping that query with <code>exists</code> :</p>\n<div class=\"codehilite\"><pre><span></span>define &quot;Numerator&quot;:\n  exists (&quot;Active Prescriptions In The Opioid Episode with Average MME&quot; A\nwhere A.averageMME &gt; 50.0)\n</pre></div>",
        "id": 182601718,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1575494997
    },
    {
        "content": "<p>Chris, <br>\nThank you very much for your quick response.  Yes, that is exactly what I am trying to do.  I have tried your approach before and it gave me a validation error because the \"Active Prescriptions In The Opioid Episode with Average MME\" expression returns a single tuple (i.e. averageMME) and so exists will not work in this case.   I have been trying several approaches so far none is working.  Many thanks.</p>\n<p>TT</p>",
        "id": 182602525,
        "sender_full_name": "Tien Thai",
        "timestamp": 1575495444
    },
    {
        "content": "<p>Oh.  OK -- without the full source, it was hard to tell that it returned a singleton.  If that's the case, have you tried:</p>\n<div class=\"codehilite\"><pre><span></span>define &quot;Numerator&quot;:\n &quot;Active Prescriptions In The Opioid Episode with Average MME&quot;.averageMME &gt; 50.0\n</pre></div>",
        "id": 182603794,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1575496262
    },
    {
        "content": "<p>Yes, it works.  Thank you very much for your help, Chris!<br>\nTT</p>",
        "id": 182664336,
        "sender_full_name": "Tien Thai",
        "timestamp": 1575556596
    }
]