[
    {
        "content": "<p>We are wanting to put the results of the eCQM measures into the FHIR MeasureReport resource. I want to be able to report on which QDM elements were relevant in the calculation of each measure population (numerator, ipp, etc...). I am looking at putting these elements into the contained array of the MeasureReport, and using an extension on the population items to reference those contained elements. One issue is how do we put QDM elements into a FHIR resource? Has anyone done this before, or seen an approach for this?</p>",
        "id": 153991654,
        "sender_full_name": "Patrick Sexton",
        "timestamp": 1535563582
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"196085\">@Patrick Sexton</span> , is this for a population or individual report?</p>",
        "id": 153991730,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1535579871
    },
    {
        "content": "<p>For an individual report, though I imagine there would be a similar question if it was a population.</p>",
        "id": 153991745,
        "sender_full_name": "Patrick Sexton",
        "timestamp": 1535583218
    },
    {
        "content": "<p>So are you looking to include the actual data, or just an indication that there is data for a particular data criteria in the HQMF?</p>",
        "id": 153991973,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1535648517
    },
    {
        "content": "<p>For the former, tricky because the data elements would be in a QDM-like format. For the latter, there would need to be a transformation from the QDM to the FHIR resources. There is a skeletal mapping for this: <a href=\"http://hl7.org/fhir/us/qicore/qdm-to-qicore.html\" target=\"_blank\" title=\"http://hl7.org/fhir/us/qicore/qdm-to-qicore.html\">http://hl7.org/fhir/us/qicore/qdm-to-qicore.html</a> and it is the focus of a scenario in the Clinical Reasoning connectathon track: <a href=\"http://wiki.hl7.org/index.php?title=201809_Clinical_Reasoning#QDM_Mapping\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=201809_Clinical_Reasoning#QDM_Mapping\">http://wiki.hl7.org/index.php?title=201809_Clinical_Reasoning#QDM_Mapping</a></p>",
        "id": 153991974,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1535648940
    }
]