[
    {
        "content": "<p>Are Quantities a valid point type for intervals? The spec says:</p>\n<blockquote>\n<p>An interval must be defined using a point type that supports comparison, as well as Successor and Predecessor operations, and Minimum and Maximum Value operations.</p>\n</blockquote>\n<p>However neither Successor, Predecessor, Minimum or Maximum Value operations are defined for Quantity. </p>\n<p>On the other hand there are tests with Quantity Intervals like <code>QuantityIntervalUnion1To15</code>.</p>",
        "id": 267459479,
        "sender_full_name": "Alexander Kiel",
        "timestamp": 1641830969
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197470\">@Alexander Kiel</span> - I think the intent is that quantity <em>is</em> supported in an interval.  Successor and Predecessor are actually defined for <code>Quantity</code> (see the <a href=\"https://cql.hl7.org/09-b-cqlreference.html#successor\">CQL Reference</a>).  You're right that MinimumValue and MaximumValue are not explicitly defined for <code>Quantity</code>; probably because it's unclear what unit should be used for min/max Quantity type.  But for the purposes of something like an interval, it's really the min/max of the <code>Quantity.value</code> (which is min/max of <code>Decimal</code>) that matters.  So... sounds like a clarification is needed in the spec.  <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span>?</p>",
        "id": 267470254,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1641835280
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span>  Thanks. You are right. Successor and Predecessor are defined for Quantity in the CQL Reference. But Quantity is not defined in the <a href=\"https://cql.hl7.org/04-logicalspecification.html#predecessor\">ELM Reference</a>. Because I implement my CQL evaluator on top of ELM, I actually don't look in the CQL Reference very often. So I guess that the ELM Reference needs to be extended.</p>\n<p>As for minimum- / maximum value. In an interval context the unit should just be the unit of the explicit boundary. But standalone the unit is not clear. Also it is not clear if the quantity is an integer or a decimal one.</p>",
        "id": 267471427,
        "sender_full_name": "Alexander Kiel",
        "timestamp": 1641835821
    },
    {
        "content": "<p>I agree that the unit should be the unit of the boundary, but... the minimum/maximum functions take in a type declaration, and I don't think it's possible to put the quantity unit into a type declaration. So if Minimum/Maximum were to explicitly support <code>Quantity</code> then the unit in the return value I guess would have to just be null.</p>\n<p>Things also get ambiguous for intervals w/ mixed units (e.g., <code>Interval[1 'mg', 1000 'g']</code>).  If you just apply minimum/maximum to quantity values (w/out paying attention to unit at all), then you can get different max width intervals depending on if the interval quantity units are normalized or not.  So that's fun.</p>\n<p>As for a quantity being an integer or decimal, by definition, <a href=\"https://cql.hl7.org/09-b-cqlreference.html#quantity\">CQL Quantity</a> value is always a <code>Decimal</code>.</p>",
        "id": 267476765,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1641837867
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> </p>\n<blockquote>\n<p>As for a quantity being an integer or decimal, by definition, CQL Quantity value is always a Decimal.</p>\n</blockquote>\n<p>If this is true than that sentence from the <a href=\"https://cql.hl7.org/09-b-cqlreference.html#successor\">Successor - CQL Reference</a> has redundant information. So the integer part should be removed.</p>\n<blockquote>\n<p>For Quantity values, the successor is equivalent to adding 1 if the quantity is an integer, and the minimum precision value for the Decimal type if the quantity is a decimal. The units are unchanged.</p>\n</blockquote>",
        "id": 267482023,
        "sender_full_name": "Alexander Kiel",
        "timestamp": 1641840359
    },
    {
        "content": "<p>Oh.  I read right past that part.  Ugh.  It may be that although the datatype is a <code>Decimal</code>, successor should treat it like datatype <code>Integer</code> if it does not have a fractional component (i.e., a pseudo-Integer).  This is probably another bit that should be clarified, as I agree that it is confusing.  Good catch, <span class=\"user-mention\" data-user-id=\"197470\">@Alexander Kiel</span>.</p>",
        "id": 267485233,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1641841789
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> <span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> What's next? Can I help to fix the spec? Should I issue PR's on the HL7/cql repo? I've currently two other PR's open on that repo.</p>",
        "id": 267582310,
        "sender_full_name": "Alexander Kiel",
        "timestamp": 1641908680
    },
    {
        "content": "<p>Since these are proposed changes to the spec (even if just fixing errors / clarifying), I think you need to submit a change request on Jira so they can be voted on in a WG.  Then they can be applied to the spec after that.</p>",
        "id": 267582939,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1641908991
    },
    {
        "content": "<p>Apologies for the delays here <span class=\"user-mention\" data-user-id=\"197470\">@Alexander Kiel</span> and <span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> , I've submitted trackers to clarify these and we'll get these included in the upcoming Errata.</p>",
        "id": 270416823,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1643820545
    },
    {
        "content": "<p><a href=\"https://jira.hl7.org/browse/FHIR-35926\">https://jira.hl7.org/browse/FHIR-35926</a></p>",
        "id": 270416825,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1643820546
    },
    {
        "content": "<p><a href=\"https://jira.hl7.org/browse/FHIR-35925\">https://jira.hl7.org/browse/FHIR-35925</a></p>",
        "id": 270416882,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1643820560
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 270420000,
        "sender_full_name": "Alexander Kiel",
        "timestamp": 1643821547
    }
]