[
    {
        "content": "<p><a href=\"http://jira.hl7.org/browse/FHIR-27514\">J#27514</a> asks for more clarity around the grammar, so I've done a bit of fiddling with a railroad diagram generator. What do folks think of including this type of diagram: <a href=\"/user_uploads/10155/cuWr5ybbehxQ2uLBCTamMEku/index.pdf\">index.pdf</a></p>",
        "id": 203201306,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1594155130
    },
    {
        "content": "<p>Note that in this PDF the image sizing is messed up, it actually looks really good in the HTML.</p>",
        "id": 203201359,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1594155154
    },
    {
        "content": "<p>I think it's kind of cool.  Where were you thinking it would go in the spec?  Would it just be a page full or RR diagrams or would you integrate them into the narrative content somehow?</p>",
        "id": 203225747,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1594176472
    },
    {
        "content": "<p>I think to really be useful they'd have to be part of the narrative. And to _really_ be useful, they'd have to be hyperlinked. Which seems possible with this tool, but looks like it would take some effort. So before committing to doing that I'd really want to make sure people would find them helpful.</p>",
        "id": 203228583,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1594179990
    },
    {
        "content": "<p>The scale of the railroad diagram elements should be properly normalized, too. The difference in size between the elements in (for example) library vs. localIdentifier is very jarring and  the small size on large productions makes them difficult to read.</p>",
        "id": 206271369,
        "sender_full_name": "Frank Adrian",
        "timestamp": 1596814243
    },
    {
        "content": "<p>Yes, the scaling is happening because of the rendering to a PDF. When rendered in a website, the images are all the same size.</p>",
        "id": 206548447,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1597132053
    }
]