[
    {
        "content": "<p>Does anyone know if there's information about the time complexity of CQL functions? I haven't been able to find anything.</p>\n<p>Specifically, our application runs several functions that loop through long lists of valuesets to try to find a match, and we have a theory that this may be impacting our app's initial load time since it waits for CQL to finish running.</p>",
        "id": 246270993,
        "sender_full_name": "Marisa Hoenig",
        "timestamp": 1626465454
    },
    {
        "content": "<p>CQL only rarely prescribes the specific algorithm for implementing operations or functions. That means that the time-complexity of a given function is frequently implementation specific. The Java engine doesn't have that information published anywhere, nor do I think we've actually done the analysis except in cases where we have seen performance hotspots.</p>\n<p>If you're using the Java engine and can give me a repro  I'd be happy to take a look at it for you. I have less familiarity with the JS engine.</p>",
        "id": 246281856,
        "sender_full_name": "JP",
        "timestamp": 1626470508
    },
    {
        "content": "<p>Thanks JP. We will likely try to do some analysis ourselves since we think it might have to do with the number of codes we're looping through. We're using the JS engine and specifically talking about functions like these if you'd like to take a look: <a href=\"https://github.com/chronic-care/covid-ed-ig/blob/4af9853775a4241b1e267e7b10cdcf9f9b674a5d/input/cql/COVID19EmergencyDeptAssessment.cql#L638-L644\">https://github.com/chronic-care/covid-ed-ig/blob/4af9853775a4241b1e267e7b10cdcf9f9b674a5d/input/cql/COVID19EmergencyDeptAssessment.cql#L638-L644</a></p>",
        "id": 246284437,
        "sender_full_name": "Marisa Hoenig",
        "timestamp": 1626471979
    },
    {
        "content": "<p>A simple implementation of that would be ~ O(N * M) where N is the number of active conditions and M is the number of code in the set you're checking against, so it'd be pretty expensive.  I _think_ that's what the JS engine is doing here:</p>\n<p><a href=\"https://github.com/cqframework/cql-execution/blob/96b472a3633f4389a4745b1b88e768c2b74cc50a/src/datatypes/clinical.js#L51\">https://github.com/cqframework/cql-execution/blob/96b472a3633f4389a4745b1b88e768c2b74cc50a/src/datatypes/clinical.js#L51</a></p>\n<p><span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> ?</p>",
        "id": 246285900,
        "sender_full_name": "JP",
        "timestamp": 1626472885
    }
]