[
    {
        "content": "<p>I'm curious which contexts are supported beyond Patient. The use case is processing using the Location context and Questionnaire Response resources that are linked, such as from facility readiness surveys.</p>",
        "id": 246094202,
        "sender_full_name": "Richard Stanley",
        "timestamp": 1626356208
    },
    {
        "content": "<p>The ModelInfo currently creates contexts for each CompartmentDefinition in the base specification, so that results in Patient, Encounter, RelatedPerson, Practitioner, and Device. Some implementations have added custom support for contexts beyond that, and of course it would be straightforward to add context declarations for anything we wanted, we just have to define for each context how it relates to the resources in the model.</p>",
        "id": 246103412,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1626359835
    },
    {
        "content": "<p>I've added <a href=\"https://github.com/cqframework/cqf-tooling/issues/264\">https://github.com/cqframework/cqf-tooling/issues/264</a> to add Location</p>",
        "id": 246103703,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1626359961
    },
    {
        "content": "<p>It would help to identify all the relationships that need to be supported there.</p>",
        "id": 246103747,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1626359981
    },
    {
        "content": "<p>Does this apply to the Questionnaire Response as a context as well?</p>",
        "id": 246149113,
        "sender_full_name": "Richard Stanley",
        "timestamp": 1626379976
    },
    {
        "content": "<p>Though, I suppose it would make more sense to approach a QR resource with SDC...</p>",
        "id": 246149327,
        "sender_full_name": "Richard Stanley",
        "timestamp": 1626380083
    },
    {
        "content": "<p>Note that support in the model is different than support in the translator is different than support in an execution environment.  The JavaScript cql-execution library only supports <code>Patient</code> and <code>Unfiltered</code> contexts (and even support for <code>Unfiltered</code> is limited).  I'm not sure about the Java execution library (but <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> would know).</p>",
        "id": 246619038,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1626800260
    },
    {
        "content": "<p>The translator drives off the model info, so should support any contexts that are defined by a particular model, so should be okay there (might hit edge cases, it's not well-used functionality there yet). And yes, definitely the engines will need to support contexts, and right now the Patient context is the only one that is supported in the Java engine.</p>",
        "id": 246621830,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1626801537
    }
]