[
    {
        "content": "<p><a href=\"http://build.fhir.org/ig/HL7/cqf-measures/profiles.html\">http://build.fhir.org/ig/HL7/cqf-measures/profiles.html</a> has N/A for Executable Measure, why?</p>\n<p>Would we want Executable measure so it can reference Executable Library?<br>\nAlso, why doesn't Computable Measure reference Computable Library?</p>",
        "id": 268440094,
        "sender_full_name": "Paul Denning",
        "timestamp": 1642532682
    },
    {
        "content": "<p>The executable content of the Measure is actually the ELM that's stored in the Library that's referenced for CQL-based measures. The Measure Resource itself doesn't change. But I can see the case for making the reference to an CPGExecutableLibrary explicit.</p>",
        "id": 268441028,
        "sender_full_name": "JP",
        "timestamp": 1642533108
    },
    {
        "content": "<p>I'm thinking of $evaluate-measure with a \"program\" parameter, which effectively looks up Measure resources with a certain useContext, but useContext is only 1..1 in the Publishable Measure. useContext is 0..1 MS in other Measure profiles, so it can be set in Computable Measure, you just need to remember to set it.</p>",
        "id": 268443331,
        "sender_full_name": "Paul Denning",
        "timestamp": 1642534149
    },
    {
        "content": "<p>Yes, in general we have only defined the Computable/Executable profiles when there is a clear structural need to do so. In the case of CQL libraries, we can structurally distinguish computable from executable based on the type of content available, and it's useful to do so because it allows us to package things up differently for different target environments.</p>",
        "id": 268628717,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1642641951
    },
    {
        "content": "<p>In the case of ValueSet, we have the logical definition in the \"compose\" versus the \"expansion\", and again, clear utility in being able to package and distribute for environments with different capabilities.</p>",
        "id": 268628794,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1642641992
    },
    {
        "content": "<p>We don't have that distinction with Measure. It's not that it isn't Computable, it is, it's just that there are no structural differences between a Shareable, Computable, and Executable measure.</p>",
        "id": 268628826,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1642642027
    },
    {
        "content": "<p>That's why the knowledge capabilities (in R5) are specified on the Shareable profiles.</p>",
        "id": 268628840,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1642642049
    }
]