[
    {
        "content": "<p><strong>ig-template-base change: </strong>Change the artifacts rendering to be a table with 3 columns with the heading \"Title, Artifact Id, Description\" where title and description correspond to what's there now and Artifact Id will be the extension id (or profile id or value set id, etc.) I.e. we'll do this for all artifact types.<br>\n<a href=\"https://jira.hl7.org/browse/FHIR-20776\">https://jira.hl7.org/browse/FHIR-20776</a><br>\n<a href=\"https://github.com/HL7/ig-template-base/issues/175\">https://github.com/HL7/ig-template-base/issues/175</a><br>\n<a href=\"/user_uploads/10155/Yd5gwowWfx2lm7-0IpkPFayF/OldView.png\">OldView.png</a> <br>\n<a href=\"/user_uploads/10155/TLhyQqH0_UufDDsppfTfC_uO/NewView.png\">NewView.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/Yd5gwowWfx2lm7-0IpkPFayF/OldView.png\" title=\"OldView.png\"><img src=\"/user_uploads/10155/Yd5gwowWfx2lm7-0IpkPFayF/OldView.png\"></a></div><div class=\"message_inline_image\"><a href=\"/user_uploads/10155/TLhyQqH0_UufDDsppfTfC_uO/NewView.png\" title=\"NewView.png\"><img src=\"/user_uploads/10155/TLhyQqH0_UufDDsppfTfC_uO/NewView.png\"></a></div>",
        "id": 252820034,
        "sender_full_name": "Ramandeep Dhanoa",
        "timestamp": 1631294390
    },
    {
        "content": "<p>why would we want artifact id?</p>",
        "id": 253077842,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1631534705
    },
    {
        "content": "<p>For the same reason we want it in core - so you know what you can refer to.</p>",
        "id": 253094765,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631541877
    },
    {
        "content": "<p>it occupies a lot of space, and you probably need the whole canonical, which you can get. Why do you need it to occupy space in the table? It seems like a bad waste of space to me</p>",
        "id": 253127080,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1631553625
    },
    {
        "content": "<p>Not all of the resources will have canonicals.  It's a ballot issue for one of the IGs asking for it.  We could possibly use a copy button and a flyover if real estate is that big an issue.</p>",
        "id": 253140038,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631558960
    },
    {
        "content": "<p>well, IGs should be able to rule ballot issues like that out of scope. I do think that it's a low value use of reading space, but I'm interested to hear why it's important</p>",
        "id": 253142356,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1631559851
    },
    {
        "content": "<p>The specific issue is that title names of value sets, code systems, etc. can differ (sometimes quite a bit) from their formal ids.  So if you know what you're looking for in an IG, the title names aren't that helpful.</p>",
        "id": 253162805,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631568205
    },
    {
        "content": "<p>If the IG isn't yet published, the canonical URLs won't resolve</p>",
        "id": 253163174,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631568361
    },
    {
        "content": "<p>I'm not understanding... the canonical will be presented. How are you going to access them?</p>",
        "id": 253183958,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1631581806
    },
    {
        "content": "<p>Right now, we show title and description on the artifacts page.  So if you go to the artifacts page looking to see information about a particular extension (or any other artifact) you have a canonical for, you have to guess what link to click on.  If we expose the id of the resource, then it's super clear.</p>",
        "id": 253195546,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631592885
    },
    {
        "content": "<p>I am not a fan of this exposure of a highly technical artifact this way.  It degrades the readers experience.  IMO, if you want the id click on the resources.   (BTW <span class=\"user-mention\" data-user-id=\"214174\">@Ramandeep Dhanoa</span>  you hijacked this thread, next time create a new topic)</p>\n<p><a href=\"/user_uploads/10155/43RTLvpP7ERAe5_sFMrQAt0B/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/43RTLvpP7ERAe5_sFMrQAt0B/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/43RTLvpP7ERAe5_sFMrQAt0B/image.png\"></a></div>",
        "id": 253199321,
        "sender_full_name": "Eric Haas",
        "timestamp": 1631596491
    },
    {
        "content": "<p>Maybe the problem being being solved is, \"I know the canonical, how do I find the resource\"?</p>",
        "id": 253199536,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1631596699
    },
    {
        "content": "<p>well, how do you find it? where? In the package? Find it by the canonical...</p>",
        "id": 253202902,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1631599899
    },
    {
        "content": "<p>I meant, \"I know the canonical, now where do I find that profile, etc. in the IG\" This could be useful if I want to read the narrative around it, see examples, etc.</p>",
        "id": 253203891,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1631600749
    },
    {
        "content": "<p>well, I kind of follow, but this way you need to find the link to it, so that you know where to find the link to it.</p>",
        "id": 253209054,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1631604489
    },
    {
        "content": "<p>Thanks everyone for your input. From IG Authors/Editors perspective it is relatively easier with the 'Artifact Id'  - to find the profile (or extension, etc.) in the IG folder (sometimes 'Title' is quite different from their artifact id, and you have to click on different items to see which one you are looking for) . But, I also agree that this may affect end users' readability experience. <br>\n<span class=\"user-mention\" data-user-id=\"191401\">@Eric Haas</span>  My apologies, I will ensure that in the future (sort of newbie here in terms of IG template change process)</p>",
        "id": 253285783,
        "sender_full_name": "Ramandeep Dhanoa",
        "timestamp": 1631639001
    },
    {
        "content": "<p>so this is an authoring concern?</p>",
        "id": 253286431,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1631639234
    },
    {
        "content": "<p>I think we assumed that authors can just look at the links to see, and then can choose how to do file naming</p>",
        "id": 253286486,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1631639259
    },
    {
        "content": "<p>Originally, it's an SDC IG ballot issue (reported here <a href=\"https://jira.hl7.org/browse/FHIR-20776\">https://jira.hl7.org/browse/FHIR-20776</a><br>\n \" <em>It would be really helpful if the names of extensions in 12.0.3 were included in the list (perhaps in the description). The user-friendly titles (\"Context resources\") are nice, but it if you are searching based on the extension name (\"sdc-questionnaire-launchContext\") it can be difficult to find.</em>)</p>",
        "id": 253289829,
        "sender_full_name": "Ramandeep Dhanoa",
        "timestamp": 1631640475
    },
    {
        "content": "<p>so it's actually about canonical URL then?</p>",
        "id": 253290311,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1631640642
    },
    {
        "content": "<p>I moved the thread to its own topic.  If you see an artifact being referenced (by canonical or by id) and you want to check it out, it's not necessarily the case that the canonical will resolve or that there'll be a way to navigate directly to the artifact.  What you want to be able to do is go to the artifacts page, hit \"Ctrl-S\", type part of the id and get there.  Given that this is a \"table of artifacts\", I don't think that the formal id of the artifact is 'noisy'.  We expose it in the core spec, for example in our lists of examples.  If it's not a waste of space/noisy there, why would it be considered so in an IG?</p>",
        "id": 253310045,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631647977
    },
    {
        "content": "<p>Right.  You're searching by the tail of the canonical.  You could also have the id of an example (perhaps referenced by a different example) and be looking for that.</p>",
        "id": 253310210,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631648039
    },
    {
        "content": "<p>the id? or the canonical?</p>",
        "id": 253314834,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1631649771
    },
    {
        "content": "<p>Strictly, all that's needed is the tail of the canonical.  The base is the same for everything in the IG, so displaying the full canonical all the time is indeed a waste of space (and ugly).  Though perhaps having a 'copy' button that grabs the full URL or even a versioned canonical would be a nice addition - this in cases where you're scanning the artifact list for an extension you know is there and then find it and want to save from clicking through to grab the canonical.  That's not as critical a use-case though.</p>",
        "id": 253322534,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631652926
    },
    {
        "content": "<blockquote>\n<p>The base is the same for everything in the IG</p>\n</blockquote>\n<p>except when it's not</p>",
        "id": 253323814,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1631653427
    },
    {
        "content": "<p>but if it's really hard to find an  artifact, we should have an index-by-canonical page</p>",
        "id": 253323915,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1631653465
    },
    {
        "content": "<p>Creating \"yet another index page\" to me seems a log uglier and less convenient than just sticking the id in the table.  I guess if your canonical root <em>isn't</em> your IG root, we could have the code display the full URL, but that should be a super-rare exception.</p>\n<p>You haven't yet answered the question why is it ok to display the ids in the core spec if it's not ok to do it in IGs?</p>",
        "id": 253324644,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631653820
    },
    {
        "content": "<p>where we do it? the examples? because people refer to the examples by their id</p>",
        "id": 253353409,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1631672705
    },
    {
        "content": "<p>And people refer to extensions and profiles by their ids too - at least those who work with them in other profiles or instances.</p>",
        "id": 253360557,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631679940
    }
]