[
    {
        "content": "<p>I'd like to make the template changes around rendering of 'contained' resources so that SDC has a clean build.  Right now, there's a list of the contained resources as children of the owning resource resources.json, but that doesn't help too much.  The information in the resources page needs to all be at the same level and based on the page name - otherwise we can't use the same template for 'contained' resources as we do for regular resources.  Second, I need the information about the contained resources exposed the ImplementationGuide resource so I can add the relevant pages to the IG.  Finally, I need the artifact pages added to artifacts.json too.  <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span></p>",
        "id": 264939724,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1639523080
    },
    {
        "content": "<blockquote>\n<p>Right now, there's a list of the contained resources as children of the owning resource resources.json, but that doesn't help too much. The information in the resources page needs to all be at the same level and based on the page name - otherwise we can't use the same template for 'contained' resources as we do for regular resources</p>\n</blockquote>\n<p>I don't understand that - the contained resources are not the same as the non-contained resources</p>",
        "id": 265766429,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1640149144
    },
    {
        "content": "<blockquote>\n<p>Second, I need the information about the contained resources exposed the ImplementationGuide resource so I can add the relevant pages to the IG</p>\n</blockquote>\n<p>there's no way to put them in there as it is, and I don't think we should</p>",
        "id": 265766439,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1640149186
    },
    {
        "content": "<blockquote>\n<p>Finally, I need the artifact pages added to artifacts.json too</p>\n</blockquote>\n<p>what's artifacts.json?</p>",
        "id": 265766662,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1640149328
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191316\">Grahame Grieve</span> <a href=\"#narrow/stream/196008-ig-publishing.20requirements/topic/Changes.20for.20rendering.20'contained'.20resources/near/265766662\">said</a>:</p>\n<blockquote>\n<blockquote>\n<p>Finally, I need the artifact pages added to artifacts.json too</p>\n</blockquote>\n<p>what's artifacts.json?</p>\n</blockquote>\n<p>a generated _data file in temp/pages/_data   folder</p>",
        "id": 265834678,
        "sender_full_name": "Eric Haas",
        "timestamp": 1640196397
    },
    {
        "content": "<p>I don't believe that the IG publisher generates it</p>",
        "id": 265844303,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1640202198
    },
    {
        "content": "<p>Artifacts.json is indeed created by the templates.  It's generated from the ImplementationGuide XML, so it's hard for it to work if the information about the contained resources isn't in the IG.  Essentially, the template needs to do the following:</p>\n<ul>\n<li>create page entries for each artifact in the IG (now including contained artifacts)</li>\n<li>create a file that uses the filenames for those pages as a key for metadata information about the resource being rendered.<br>\nThe resources.json file is keyed by using the artifact id.  (e.g. site.data.resources[resource_]...)  The 'resource_' is set using the include.type and <a href=\"http://include.id\">include.id</a> that are passed in.  What is the 'id' going to be when we're processing an extension?  \"foo#bar\"?  That seems to make the most sense - and if so, that's what the entry in resources.json needs to be.</li>\n</ul>",
        "id": 265865044,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1640214816
    }
]