[
    {
        "content": "<p>Welcome to <a class=\"stream\" data-stream-id=\"196008\" href=\"/#narrow/stream/196008-ig-publishing-requirements\">#ig publishing requirements</a>.</p>\n<p><strong>Description</strong>: For discussion of page <a href=\"http://wiki.hl7.org/index.php?title=FHIR_Implementation_Guide_Publishing_Requirements\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=FHIR_Implementation_Guide_Publishing_Requirements\">http://wiki.hl7.org/index.php?title=FHIR_Implementation_Guide_Publishing_Requirements</a></p>",
        "id": 163602800,
        "sender_full_name": "Welcome Bot",
        "timestamp": 1555536914
    },
    {
        "content": "<p>so creating this after vigorous dicussion on FMG about this subject</p>",
        "id": 163602819,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1555536947
    },
    {
        "content": "<p>outcomes:<br>\n- we will create a Zulip stream for this specific discussion (and here we are)<br>\n- FMG happy to consider and approve an example IG once it exists <br>\n- vigorous discussion about what the basic requirements are. TO be discussed for a week in this thread</p>",
        "id": 163602937,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1555537026
    },
    {
        "content": "<p>no issues around the technical publication requirements - they stand (header, footer, npm stuff), and html requirements</p>",
        "id": 163603067,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1555537091
    },
    {
        "content": "<p>Most discussion was around how for to go in terms of requirements for <br>\n- presentation of particular resource types<br>\n- presentation of indexes / navigation<br>\n- common look and feel</p>",
        "id": 163603192,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1555537146
    },
    {
        "content": "<p>in particular, some of this section will be turned into SHALL and fleshed out:</p>\n<p>Profiles should at least have the following elements presented:<br>\n ** full metadata<br>\n ** differential view<br>\n ** snapshot view<br>\n ** full description of contents with details<br>\nValue Sets should have the following elements presented:<br>\n ** full metadata<br>\n ** logical definition<br>\n ** at least one expansion (default)</p>",
        "id": 163603219,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1555537184
    },
    {
        "content": "<p>a page like this one (<a href=\"http://hl7.org/fhir/us/bser/2019May/BSeRArthritisFeedbackObservation-duplicate-2.html\" target=\"_blank\" title=\"http://hl7.org/fhir/us/bser/2019May/BSeRArthritisFeedbackObservation-duplicate-2.html\">http://hl7.org/fhir/us/bser/2019May/BSeRArthritisFeedbackObservation-duplicate-2.html</a>) is a problem</p>",
        "id": 163603354,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1555537266
    },
    {
        "content": "<p>I think it's optimistic to believe we'll have landed the discussion on what should be in an IG in only a week.  It's going to take several weeks minimum to figure out what the hl7 template should look like and possibly more time to agree on what subset of that is mandatory for ballots published without the template.</p>",
        "id": 163607859,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1555541809
    },
    {
        "content": "<blockquote>\n<p>a page like this one (<a href=\"http://hl7.org/fhir/us/bser/2019May/BSeRArthritisFeedbackObservation-duplicate-2.html\" target=\"_blank\" title=\"http://hl7.org/fhir/us/bser/2019May/BSeRArthritisFeedbackObservation-duplicate-2.html\">http://hl7.org/fhir/us/bser/2019May/BSeRArthritisFeedbackObservation-duplicate-2.html</a>) is a problem</p>\n</blockquote>\n<p>Why is this page a problem?</p>",
        "id": 163628804,
        "sender_full_name": "Rien Wertheim",
        "timestamp": 1555572084
    },
    {
        "content": "<p>so here's my comments about that page:<br>\n- it does not state the URL of the profile, or it's version, or other key metadata<br>\n- it does not identify whether it is showing a differential or a snapshot - both are needed<br>\n- there is no presentation of field level documentation<br>\n- the UML view is not useful (though not objectionable)<br>\n- it's not a printable view<br>\n- the element binding information is not linked to anything<br>\n- the table view doesn't add anything<br>\n- there's no link to examples (I don't know if that is infrastructure or editors fault)<br>\n- there's no links to other formats <br>\n- there's no mapping information (again, might be the editor)</p>",
        "id": 163630302,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1555574168
    },
    {
        "content": "<p>Lloyd wishes for the tree view to be highly aligned so that balloters only need to deal with one presentation. I think that's pretty a reasonable requirement</p>",
        "id": 163630333,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1555574246
    },
    {
        "content": "<p>For this particular IG, the editor was struggling and pressed for time, so that might explain some of the omissions or lack of detail.</p>",
        "id": 163632172,
        "sender_full_name": "Michel Rutten",
        "timestamp": 1555576321
    },
    {
        "content": "<p>Okay thanks Grahame. We will look into this.</p>",
        "id": 163632235,
        "sender_full_name": "Rien Wertheim",
        "timestamp": 1555576347
    },
    {
        "content": "<p>yes. if I was commenting to the editor I would have given a different long list of issues. that profile is very poor quality work, and would not pass the IG publisher quality criteria, but because it came from elsewhere, I didn't apply all the quality criteria.  FMG are not happy about that</p>",
        "id": 163636843,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1555581373
    },
    {
        "content": "<p>I think we can define some of these 'functionally', but am very worried if we start to define them too tightly. That is to say it is clear we could today require a 'differential view', and that 'differential view' can be described in terms of what it is showing and not showing. I think that it is too early in our maturity at what a IG layout should be for us to be too specific on the human readable format. For example it is fragile if we call for specific color of the lines in the differential view, or even that there are lines between elements ; or even that the rendering must be done with a specific tool. What I am worried about is that we are too new to this IG layout, and that we will find that creativity is needed to come up with specifics we can then universally apply.  There are far too few people defining this 'perfect layout', and there is a huge audience of readers. Many of our readers have never been exposed to standards, especially HL7 or FHIR.</p>",
        "id": 163653236,
        "sender_full_name": "John Moehrke",
        "timestamp": 1555595678
    },
    {
        "content": "<p>I'm happy for creativity in the design of IGs, I'm less comfortable with diversity in the presentation of IGs.  I'm happy to have people experiment with alternate templates and when they have something they think is useful to share it and allow the HL7 community to adopt it as part of the standard template.  (And of course other organizations can experiment to their heart's content.)  But I also think that it's important that an implementer looking at three different (but potentially related) HL7 balloted IGs should find that they work mostly the same way.  There should not be a learning curve to understand how to interpret profiles or how to navigate when moving from one HL7 published IG to another.  That doesn't necessarily mean they must be absolutely identical, but they should be pretty close and the differences should require minimal incremental learning.</p>",
        "id": 163663897,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1555602717
    },
    {
        "content": "<p>Can we rename this specification to \"HL7 Ballotable FHIR Implementation Guide publishing requirements\" or something like it. Calling this \"FHIR IG publishing requirements\" suggests that an IG that does not meet these requirements does not meet the FHIR standards requirements, which is not the case.</p>",
        "id": 163725524,
        "sender_full_name": "Martijn Harthoorn",
        "timestamp": 1555667979
    },
    {
        "content": "<p>well, it's complicated. the page defines standards that should apply to all IGs. and some additional ones for HL7 publishing</p>",
        "id": 163735855,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1555681210
    },
    {
        "content": "<p>Is there / will there be an explicit distinction between the two: generic and HL7 ballotable specific?</p>",
        "id": 163927380,
        "sender_full_name": "Rien Wertheim",
        "timestamp": 1555959175
    },
    {
        "content": "<p>yes</p>",
        "id": 163933660,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1555963839
    },
    {
        "content": "<p>From an ISO ballot perspective what does it mean for an Implementation Guide to conform to the FHIR standard?</p>",
        "id": 163970999,
        "sender_full_name": "Martijn Harthoorn",
        "timestamp": 1556007577
    },
    {
        "content": "<p>Are we going to propose to forbid people to call their documentation an \"FHIR Implementation Guide\" if their home page is not called  index.html?</p>",
        "id": 163971000,
        "sender_full_name": "Martijn Harthoorn",
        "timestamp": 1556007580
    },
    {
        "content": "<p>Is someone planning to ballot their IG through ISO?</p>",
        "id": 163996455,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1556030928
    },
    {
        "content": "<p>I don't think we want to forbid people to do that. the specific index.html requirement is for hl7 and fhir. But there is a general requirement there somewhere. we have to figure out what it is</p>",
        "id": 164024746,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1556049704
    },
    {
        "content": "<p>If the requirements for the HL7 ballotable IGs are different from the requirements for a FHIR IG in general, does that also imply we will have different processes for maintaining these requirements? The former lies with the FMG, the latter could be something like the FHIR ballot process itself, right?</p>",
        "id": 164156920,
        "sender_full_name": "Rien Wertheim",
        "timestamp": 1556185963
    },
    {
        "content": "<p>I'm not sure where the authority would lie. Certainly we would have wider inputs into the process</p>",
        "id": 164156961,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1556186016
    },
    {
        "content": "<p>there's actually going to be 3 levels:<br>\n- miminum for recognition as a FHIR IG<br>\n- requirements for the FHIR Community Process<br>\n- requirements for HL7 (/FHIR) publishing</p>",
        "id": 164157042,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1556186065
    },
    {
        "content": "<p>I don't know how different the first 2 are - the requirements will mainly be around the computable representation (packages, resources etc)</p>",
        "id": 164157066,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1556186104
    },
    {
        "content": "<p>I will try and restructure that page to make the 3 levels clearer (it's not clear enough now)</p>",
        "id": 164157090,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1556186132
    },
    {
        "content": "<p>I didn't realize before the start of this conversation that anyone wanted to place requirements on FHIR Implementation Guides in general.<br>\nBut if we do want to pursue this, then it should be part of the FHIR standard - and not an internal HL7 specification.</p>",
        "id": 164157397,
        "sender_full_name": "Martijn Harthoorn",
        "timestamp": 1556186451
    },
    {
        "content": "<p>Yes you're probably right.</p>",
        "id": 164158237,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1556187472
    },
    {
        "content": "<p>Or just provide some guidelines and best practices for FHIR IGs in general, not having the illusion that we can ever control what people are doing with IGs when FHIR expands outside the HL7 community. With the additional advantage that we don't need a (heavy) governance model for the guidelines.</p>",
        "id": 164247046,
        "sender_full_name": "Rien Wertheim",
        "timestamp": 1556271561
    },
    {
        "content": "<p>I think we do a bit of both.  We mandate those things that are genuinely necessary for the community to function and we define \"best practices\" where we think we've identified those or want to nudge towards consistency.  The trick will be differentiating between those two things.  It's always possible that implementers won't align with what we mandate - just as implementers choose to be non-conformant with other parts of the specification.  But most will do their best to align with the SHALLs - especially if we define them sensibly.</p>",
        "id": 164264672,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1556287757
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196561\">@Nick George</span> I think you may want to follow this stream</p>",
        "id": 242652945,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1623701481
    },
    {
        "content": "<p>cool thanks!</p>",
        "id": 242652980,
        "sender_full_name": "Nick George",
        "timestamp": 1623701504
    }
]