[
    {
        "content": "<p>(continued from a very short comment <a href=\"#narrow/stream/215610-shorthand/topic/.5BEnhancement.5D.20Make.20ignoreWarnings.2Etxt.20optional/near/264218683\">here</a>)</p>\n<p>There seems to be two viewpoints on the IG resource. On the one hand, it is used to drive the IG publisher. The IG publisher process manipulates my IG resource, and litters it with all sorts of extensions and parameters that are of no use (as far as I can tell) beyond the build. This point of view is also supported by the fact that Simplifier doesn't require an IG resource in order to create a package, and the optional one they can create only lists the narrative pages, not the resources. On the other hand, there is a point of view that the IG resource can be loaded onto a FHIR server, and used by a system at runtime, perhaps allowing you to track down all the resources that are part of an IG, etc. (Why you'd want to do that, and the value of the IG as a runtime resource isn't entirely clear to me.) Actually I suppose there is a third role, which is the IG resource as part of the package management and discovery process.</p>\n<p>It feels to me that we should clarify and separate those uses. I can't think of any other resources that we've defined that (if we subscribe only to the first viewpoint) don't have a runtime value. If we subscribe to the second viewpoint and we expect the IG resource that I've authored to be used beyond the build process, then we shouldn't put temporary build parameters, etc. in the resource that I'm going to distribute; those should go into a separate publisher-controlled control file that only exists in the project temp directory, or similar.</p>\n<p>Perhaps this conflation of uses was a conscious decision and I am unaware of previous discussion, but I'm more tempted to think that it is accidental.</p>",
        "id": 264231170,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1639003000
    },
    {
        "content": "<p>the use cases are separated by definition and manifest in the IG resource, and parameters seems to follow that</p>",
        "id": 264233907,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1639004627
    },
    {
        "content": "<p>So, definition is used only for build, and manifest is for runtime information?</p>",
        "id": 264234004,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1639004686
    },
    {
        "content": "<p>broadly speaking, yes. The definition is preserved in the case that some consumer wants to know how it was built, but it could be deleted</p>",
        "id": 264234210,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1639004805
    },
    {
        "content": "<p>Why do we have any of the build information in the resource, why not a separate resource/config file? Or if definition is used only for the build process, does it make sense for the publisher to remove it?</p>",
        "id": 264234253,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1639004837
    },
    {
        "content": "<p>That seems like an edge case, and more likely to leak info about my internal processes than be useful.</p>",
        "id": 264234344,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1639004885
    },
    {
        "content": "<p>oooh, a parameter to preserve the parameters :-D</p>",
        "id": 264234376,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1639004908
    },
    {
        "content": "<p>we wanted all the inputs to be able to be resources. And some pre-IG publisher systems depend on that. So that was a deliberate decision</p>",
        "id": 264234583,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1639005029
    },
    {
        "content": "<p>I wouldn't ever remove something unless I needed to for security/privacy reasons.</p>",
        "id": 264234606,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1639005048
    },
    {
        "content": "<p>Do we expect anything other than the IG publisher to use the definition elements?</p>",
        "id": 264234684,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1639005112
    },
    {
        "content": "<p>I don't think I have anywhere.</p>",
        "id": 264235314,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1639005489
    }
]