[
    {
        "content": "<p>A couple of weeks ago, on the IG publisher/templates call, there was a discussion about migrating IGs between tools. Overall, the feeling was that, aside from the actual conformance resource content, there was no expectation to be able to move an IG from one toolset to another. However, <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> pointed out that there is a requirement to be able to run the output of whatever tool through the IG publisher if you want the IG published by HL7 in order to perform various validation checks.</p>\n<p>If I've captured the discussion correctly, is it currently possible to export a \"rendered\" IG from Simplifier and feed it into IG publisher? I can see ways to download various a project zips, but none correspond to a \"build\" IG suitable for running though the publisher for validation checks, nor do they correspond to something that can be fed into IG publisher to build an IG. Did I miss a download option? (I am logged into Simplifier, and an admin on the project I'm looking at.)</p>\n<p><span class=\"user-mention\" data-user-id=\"259036\">@Matthijs van der Wielen</span></p>",
        "id": 258743977,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1634923331
    },
    {
        "content": "<p>I believe that this was work to be done on the simplifier side yet</p>",
        "id": 258749704,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634925819
    },
    {
        "content": "<p>there was two things they needed to do:</p>\n<ul>\n<li>generate output that would run through the IG publisher (would mostly be prebuilt html)</li>\n<li>generate output that meets HL7 publishing requirements</li>\n</ul>",
        "id": 258749856,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634925873
    },
    {
        "content": "<p>Ah, ok. Then I'll stop looking for the right download/export option. <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 258749992,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1634925939
    },
    {
        "content": "<p>Yup, that's the gap I'm seeing too.</p>",
        "id": 258750147,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1634925986
    }
]