[
    {
        "content": "<p><a href=\"/user_uploads/10155/Bc4j6nTLTypIYSYxvvmnDpOY/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/Bc4j6nTLTypIYSYxvvmnDpOY/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/Bc4j6nTLTypIYSYxvvmnDpOY/image.png\"></a></div>",
        "id": 278132763,
        "sender_full_name": "Eric Haas",
        "timestamp": 1649320663
    },
    {
        "content": "<p>I don't recall discussing or  approving these changes. Can we electively suppress? These are only going to lead to more trackers that we (US Core) will be burden with.</p>",
        "id": 278132964,
        "sender_full_name": "Eric Haas",
        "timestamp": 1649320780
    },
    {
        "content": "<p>The examples tab has been part of the templates for a <em>very</em> long time.  There was a bug in the publisher recently corrected that, for a time, was causing the linkage between examples and their profiles to not be exposed properly.  That's been fixed.</p>\n<p>You absolutely shouldn't suppress.  Examples being in tabs is consistent with how things are rendered in core.  We <em>don't</em> want to depend on IG authors remembering to explicitly list the examples in their hand-authored documentation for a given profile.</p>",
        "id": 278174206,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1649342622
    },
    {
        "content": "<p>OK I removed our example content the transition is not that bad. .. but why the redundancy with a tab AND the comma separated list ,  why not one or the other  ( I prefer inline ).  Also what the heck does </p>\n<blockquote>\n<p>Refer to this Resource Profile:</p>\n</blockquote>\n<p>mean?   </p>\n<p>We are likely to get commenters questioning this?</p>",
        "id": 278189348,
        "sender_full_name": "Eric Haas",
        "timestamp": 1649348268
    },
    {
        "content": "<p>The new \"cross references\" piece is new.  It was discussed on the calls over a course of several weeks.  You are correct that the fact it includes examples is somewhat problematic - and the fact that the example lists differ is also problematic.  We should discuss next Tuesday.</p>",
        "id": 278191098,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1649349058
    },
    {
        "content": "<p>I think the \"Refer to\" phrasing is a little terse and confusing (and I seem to recall discussing that). Is it other artefacts that this profile refers to, or other artefacts referring to this profile?</p>",
        "id": 278200537,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1649353281
    }
]