[
    {
        "content": "<p>/poll Use of MAY in capability statements in  IGs<br>\nI use MAY and expect it to be rendered to convey valuable nuance in implementation decisions<br>\nI use MAY,  and expect it to be rendered, but find no useful difference between MAY and omitted capabilities<br>\nI use MAY only as a structural help for other rendering purposes, and do not expect it to be rendered.</p>",
        "id": 264204486,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1638990451
    },
    {
        "content": "<p>I rendered may and implementers got confused and we got trackers so I removed them..</p>",
        "id": 264235183,
        "sender_full_name": "Eric Haas",
        "timestamp": 1639005412
    },
    {
        "content": "<p>You could simply have defined your intent...  I feel it's essential to be able to call attention to interactions, operations, etc. that <em>could</em> be useful for the use-case that should at least be considered for implementation without marking them as \"SHOULD\" to disambiguate from the large set of resources and operations that have no utility at all for the use-case.</p>",
        "id": 264253913,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1639022332
    },
    {
        "content": "<p>Can we come up with language that explains clearly what the intent of MAY is, and makes it clear that things that are not mentioned are still optional to be implemented? As far as I understand, the main issue is that if you have SHALL, SHOULD, and MAY, a lot of people assume that everything else is prohibited.</p>",
        "id": 264255616,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1639024004
    },
    {
        "content": "<p>Sure.  \"Any FHIR capability is presumed to be 'allowed' by the system unless explicitly marked as \"SHALL NOT\".  A few items are explicitly marked as MAY.  This is done to highlight their potential relevance to the use-case and distinguish them from un-mentioned optional capabilities that have been deemed not likely relevant.\"</p>",
        "id": 264262212,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1639031643
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> expressed my interpretation of MAY and how it is often used.</p>",
        "id": 264347835,
        "sender_full_name": "Corey Spears",
        "timestamp": 1639075498
    }
]