[
    {
        "content": "<p>I think it would be swell to be able to tag an artifact as new or updated so that they could be  highlighted in the artifact page or a liquid generated list. via the  site .data files .   I prefer it  live on the source files rather than the config files.  but then would need to be scrubbed from the output.</p>",
        "id": 272363718,
        "sender_full_name": "Eric Haas",
        "timestamp": 1645164381
    },
    {
        "content": "<p>It would also need to be scubbed on the next release.</p>",
        "id": 272412108,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1645196578
    },
    {
        "content": "<p>isn't that the role of the history analysis?</p>",
        "id": 272432044,
        "sender_full_name": "John Moehrke",
        "timestamp": 1645205873
    },
    {
        "content": "<p>History analysis isn't \"in your face\".</p>",
        "id": 272434942,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1645207174
    },
    {
        "content": "<p>but, doing it twice and with different mechanism seems really counter</p>",
        "id": 272455058,
        "sender_full_name": "John Moehrke",
        "timestamp": 1645217128
    },
    {
        "content": "<p>agree</p>",
        "id": 272458814,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1645219136
    },
    {
        "content": "<p>We can have discrete or screaming ways to show what has changed, but Iif the metadata is \"this has changed\", the mechanisms should be the same</p>",
        "id": 272458896,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1645219198
    },
    {
        "content": "<p>If there is a difference - i.e. one thing is \"This has changed\" and the other one is \"Look at  this!\", this might be two different mechanims</p>",
        "id": 272458981,
        "sender_full_name": "Jose Costa Teixeira",
        "timestamp": 1645219241
    },
    {
        "content": "<p>History analysis also isn't smart enough to understand \"this is new\" vs. \"this is a renamed version of that old thing\" or \"that old thing was split or merged into this\".  My initial instinct had been the same - to generate the value.  But I don't think it will work well.  Also, the 'starting point' will be different depending on the release.  For a ballot, what matters is the prior release or ballot.  For an official release, it'd need to be the last official release - ignoring any interim ballots.</p>",
        "id": 272464728,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1645222250
    },
    {
        "content": "<p>right, but that is why we all have a narrative section we write about the signficant enhancements. So I am not ignorant that there will be something hand crafted.. I just am not understanding why we would want TWO automated methods, and to have both methods based on totally different things.</p>",
        "id": 272468224,
        "sender_full_name": "John Moehrke",
        "timestamp": 1645224091
    },
    {
        "content": "<p>I didn't think Eric was asking for an automated method, merely something he could insert in a resource that would result in it being tagged.</p>",
        "id": 272469490,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1645224882
    },
    {
        "content": "<p>Yes. I did not consider the history feature and have not looked into it.   But my motivation is to alert the reader to the nee red content.    If can do that with history that would be fine</p>",
        "id": 272490384,
        "sender_full_name": "Eric Haas",
        "timestamp": 1645242785
    }
]