[
    {
        "content": "<p>Question: will the CG IG back patch all changes that are made to Resources being used that are in the main spec. I'm trying to understand if the CG will keep pace with the main FHIR spec updates over time?</p>",
        "id": 165122650,
        "sender_full_name": "Larry Babb",
        "timestamp": 1557274097
    },
    {
        "content": "<p>Most of our profiles are based on Observation which is already normative. So there won't be breaking changes to be expected.For other resources like Device/DiagnosticReport  with less maturity there can be breaking changes. I expect that the IG will always be based on the latest FHIR release available. Do we have an official position on that? <span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span> <span class=\"user-mention\" data-user-id=\"192198\">@Bob Freimuth</span> <span class=\"user-mention\" data-user-id=\"191916\">@ Bob Milius</span> <span class=\"user-mention\" data-user-id=\"191719\">@Gil Alterovitz</span></p>",
        "id": 165163418,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1557322648
    },
    {
        "content": "<p>I don't think we have an official position, so this is just my opinion.  I think it is reasonable to base our IG on major releases of FHIR at least until all of the core resources we profile become normative.  Since you mention back patching, I suppose it is possible for us to just adopt a subset of features in a core resource by adding them to our profiles instead of basing on future release.</p>",
        "id": 165164540,
        "sender_full_name": "Kevin Power",
        "timestamp": 1557323454
    },
    {
        "content": "<p>The published guide should be versioned with releases of core FHIR resources - that being said the only guaranteed to be supported resources are the normative ones. However, I think the community has a right to expect that the CG IG will be kept up to date. PS see Patrick's response on Observation.</p>",
        "id": 173761335,
        "sender_full_name": "Bret H",
        "timestamp": 1566357793
    }
]