[
    {
        "content": "<p>In the diagnostic report profile the 2 elements (dr-relatedArtifact and dr-supportingInfo) both reference the idea of containing \"supporting info\".<br>\ndr-relatedArtifact has the description \"Citations and supporting info\".  Is the supporting info in that description meant to be only supporting info for the citations and thus the dr-relatedArtifact element is really about \"literature references and citations\"? Or is it supposed to mean that the element can reference both citations and supporting info as separate concepts?</p>\n<p>In the longer description of dr-relatedArtifact it reads as follows</p>\n<div class=\"codehilite\"><pre><span></span>References to literature that supports the assertions made within the report, describes the methodology used in testing or other information relevant to the interpretation of the report.\n</pre></div>\n\n\n<p>1. From this longer description it would seem that we can use citations that reference the assertions (can we use citations that reference the testing practices themselves - these are typically put in separate report sections?). <br>\n2. It also says that we can describe the methodology used in testing. So if we have complex steps in a genetic testing assay broken down into the technical methodology versus the several analytic methodologies, then should we group them all here together? If so, then it seems it will be impossible to group the technical vs analytic methods with the results for each. If not, then can someone please indicate how to perform the groupings so the methodologies can be associated with the results for the various services performed?<br>\n3. Finally it would be extremely helpful to have one or two examples of how \"other information relevant to the interpretation of the report\" related artifacts would be used. <br>\nAgain, dr-relatedArtifacts seems like it can contain a number of different useful items or groups of items. The challenge for us is understanding 1) is it correct to use this for everything that doesn't fit somewhere else and 2) how can it be used to organize sets of related artifacts so they can be linked or associated to particular results elsewhere in the report.</p>\n<p>Regardless of whether the dr-relatedArtifact is meant to be primarily (only?) citations and citation supporting info their is also the open question as to the precise usage of dr-supportingInfo.  It currently is described as \"Other resources that support report\". Again, this seem fairly broad and open to interpretation. By \"other\" are we left to determine if there is no other \"better\" spot in the report element list then it can go here?  And does the type \"Reference()\" indicate that we can put any resource in that element?  I've seen \"Canonical(any)\" in other \"type\" values for elements that can presumably take on any resource or data type defined in FHIR.</p>",
        "id": 162904746,
        "sender_full_name": "Larry Babb",
        "timestamp": 1554812550
    },
    {
        "content": "<p>I will have to admit, I don't know that I considered using dr-relatedArtifact for things like methodology.  But I don't know that we have a better answer today other than coded values we can support today in <a href=\"http://build.fhir.org/observation-definitions.html#Observation.method\" target=\"_blank\" title=\"http://build.fhir.org/observation-definitions.html#Observation.method\">Observation.method</a>.  If you have just a textual description, I suppose you could use <a href=\"http://build.fhir.org/datatypes-definitions.html#CodeableConcept.text\" target=\"_blank\" title=\"http://build.fhir.org/datatypes-definitions.html#CodeableConcept.text\">Observation.method.text</a>?  Do others have comments?</p>",
        "id": 162969458,
        "sender_full_name": "Kevin Power",
        "timestamp": 1554864969
    },
    {
        "content": "<p>I'm not certain why dr-relatedArtifact is 0..1, it seems you could only include 1 citation? Regardless, I would envision using Observation.method wherever possible (believe that's what Bob M has been doing). The Implication profiles have their own 0..* relatedArtifact extension as well.</p>\n<p>For dr-supportingInfo, it seems the References are meant to be just the listed options of (FamilyMemberHistory | RiskAssessment | Observation | DocumentReference). It looks like it was mainly included for linking FamilyMemberHistory.</p>",
        "id": 163018984,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1554912640
    },
    {
        "content": "<p>I didn't focus on the comparison to supporting info, but Jamie's points are correct.  Supporting Info are typically other results or clinical data like Family History that the lab might want to reference.  So I don't think it is a fit for 'methodology'.</p>\n<p><span class=\"user-mention\" data-user-id=\"209510\">@Larry Babb</span> - Can you post an example or two of what you consider methodology?  I typically see it as a paragraph or two on the example reports I have seen.</p>\n<p>I think the things I have seen from Bob M have been much more straight forward - using a LOINC code or two.</p>",
        "id": 163020229,
        "sender_full_name": "Kevin Power",
        "timestamp": 1554913597
    },
    {
        "content": "<p>From the Baylor eMERGE reports this is the Methodology section (one as equally descriptive for the LMM counterpart)...</p>\n<p>Methodology:<br>\n1. eMERGE-Seq Version 2 NGS Panel: for the paired-end pre-capture library procedure, genome DNA is<br>\nfragmented by sonicating genome DNA and ligating to the Illumina multiplexing PE adapters (reference 1). The<br>\nadapter-ligated DNA is then PCR amplified using primers with sequencing barcodes (indexes). For target<br>\nenrichment capture procedure, the pre-capture library is enriched by hybridizing to biotin labeled in-solution<br>\nprobes (reference 2) at 56°C for 16 - 19 hours. For massively parallel sequencing, the post-capture library DNA<br>\nis subjected to sequence analysis on Illumina HiSeq platform for 100 bp paired-end reads. The following quality<br>\ncontrol metrics of the sequencing data are generally achieved: &gt;70% of reads aligned to target, &gt;99% target<br>\nbase covered at &gt;20X, &gt;98% target base covered at &gt;40X, average coverage of target bases &gt;200X. SNP<br>\nconcordance to SNPTrace genotype array: &gt;99%. This test may not provide detection of certain genes or portions<br>\nof certain genes due to local sequence characteristics or the presence of closely related pseudogenes. Gross<br>\ndeletions or duplications, changes from repetitive sequences may not be accurately identified by this<br>\nmethodology. Genomic rearrangements cannot be detected by this assay.<br>\n2. As a quality control measure, the individual's DNA is also analyzed by a SNP-array (Fluidigm SNPTrace panel<br>\n(reference 3) ). The SNP data are compared with the NGS panel data to ensure correct sample identification and<br>\nto assess sequencing quality.<br>\n3. Data are analyzed by the Mercury 3.4 (reference 4) pipeline. The output data from Illumina HiSeq are converted from<br>\nbcl file to FastQ file by Illumina bcl2fastq 1.8.3 software, and mapped to the hg19 human genome reference by the BWA<br>\nprogram (reference 5). The variant calls are performed using Atlas-SNP and Atlas-indel developed in-house by BCM<br>\nHGSC. Copy number variants were detected using Atlas-pcnv v0, developed in-house by the BCM HGSC. Variant<br>\nannotations are performed using the Cassandra tool, developed in-house. Neptune version v1.3 was used to match<br>\nvariants against curated variants in the VIP database version [2018-09-27-17-38-32.vip] and generate this report.**<br>\n4. The variants were interpreted according to ACMG guidelines (reference 6) and patient phenotypes. Synonymous<br>\nvariants, intronic variants not affecting splicing site, and common benign variants are excluded from interpretation<br>\nunless they were previously reported as pathogenic variants. Reviewed variants are added to the VIP database for<br>\ninclusion on future reports. It should be noted that the interpretation of the data is based on our current understanding of<br>\ngenes and variants at the time of reporting.<br>\nClinical interpretation and reporting are provided for pathogenic and likely pathogenic variants as requested by the<br>\nChildren's Hospital of Philadelphia for the following 68 medically actionable genes: ACTA2, ACTC1, APC, APOB, BMPR1A,<br>\nBRCA1, BRCA2, CACNA1A, CACNA1S, COL3A1, COL5A1, DSC2, DSG2, DSP, FBN1, GLA, HNF1A, HNF1B, KCNE1, KCNH2,<br>\nKCNJ2, KCNQ1, LDLR, LMNA, MEN1, MLH1, MSH2, MSH6, MUTYH, MYBPC3, MYH11, MYH7, MYL2, MYL3, MYLK, NF2, OTC,<br>\nPALB2, PCSK9, PKP2, PMS2, POLD1, POLE, PRKAG2, PTEN, RB1, RET, RYR1, RYR2, SCN5A, SDHAF2, SDHB, SDHC, SDHD,<br>\nSMAD3, SMAD4, STK11, TGFBR1, TGFBR2, TMEM43, TNNI3, TNNT2, TP53, TPM1, TSC1, TSC2, VHL, WT1, the following<br>\nmedically actionable SNPs: rs77931234, rs387906225, rs79761867, rs386834233, rs113993962, rs397509431, rs6467,<br>\nrs6025, rs80338898, rs1801175, rs1800562, rs28940579, rs61752717, rs193922376. For autosomal recessive disorders,<br>\nonly homozygous or biallelic variants will be returned. Variants in exon 3 of the FLG gene are not reported.<br>\n5. Variants related to patient phenotypes are confirmed by Sanger sequencing if the variant has been observed and<br>\nconfirmed fewer than 5 times by our laboratory or the Baylor Genetics Laboratory. Sanger confirmation is noted in the<br>\n'Notes' section of the tables if performed.<br>\n6. For the pharmogenomic variants, the star alleles are determined based on the variants detected by this assay. Alleles<br>\nreported for TPMT are limited to *1, *2, *3A, *3B, *3C and *4. Alleles reported for CYP2C19 are limited to *1, *2, *4A, *4B,<br>\n*5, *6, *7, *8, *17. If reported, alleles for DPD are limited to *1, *2A , *13 and rs67376798. Alleles reported for CYP2C9<br>\nare limited to *1, *2 and *3; and rs9923231 for VKORC1. Additional rare star alleles have been reported with reduced or<br>\nno function for TPMT, CYP2C19 and DPD; however, the variants defining these additional star alleles are not detected with this assay. For SLCO1B1, this assay only detects rs4149056. The minor C allele at rs4149056 defines the SLCO1B1*5<br>\n(rs4149056 alone) but also tags the *15 and *17 alleles. Thus a *5 allele may represent a *15 or *17 allele. However, the<br>\nmagnitude of the phenotypic effect is similar for *5, *15, and *17 alleles.<br>\n** The VIP variant database was developed in conjunction with Baylor Genetics and the Partners Healthcare Laboratory<br>\nfor Molecular Medicine.</p>",
        "id": 163061611,
        "sender_full_name": "Larry Babb",
        "timestamp": 1554946273
    },
    {
        "content": "<p>There is some useful data in their about region studied, which could be used for queries on what areas of the patient's genome have been interrogated. Would be a shame to send it as narrative. But the method is much more complex than a single code. Perhaps, if the static information were placed at the Genetic Test Registry one could provide a link to it. <br>\nBut that would still make it hard for the receiving system to access... Do we have a structure for genetic test methodologies that could capture all the elements in the post by Larry? Something like a knowledge resource about the test.</p>",
        "id": 163099115,
        "sender_full_name": "Bret H",
        "timestamp": 1554989458
    },
    {
        "content": "<p>Facilitating links to the GTR or other comparable resources seems very valuable here</p>",
        "id": 163118499,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1555002473
    },
    {
        "content": "<p>I would recommend to <span class=\"user-mention\" data-user-id=\"209510\">@Larry Babb</span> to review the (Region Studied](<a href=\"http://build.fhir.org/ig/HL7/genomics-reporting/obs-region-studied.html\" target=\"_blank\" title=\"http://build.fhir.org/ig/HL7/genomics-reporting/obs-region-studied.html\">http://build.fhir.org/ig/HL7/genomics-reporting/obs-region-studied.html</a>) profile - I do agree with <span class=\"user-mention\" data-user-id=\"192123\">@Bret H</span> that some of the above could be expressed there.  And we recognize we need to improve the Region Studied profile.</p>\n<p>Linking to a GTR or other online resource is great to support, but I think we should find a simple solution for the textual representation of the methodology.  Still not sure if that should be the related artifact or something like Observation.method.text .</p>",
        "id": 163123615,
        "sender_full_name": "Kevin Power",
        "timestamp": 1555006147
    },
    {
        "content": "<p>With what we have right now, i favor related artifact. Observation.method<br>\nis ment to be coded. That's my 2 cents</p>",
        "id": 163124501,
        "sender_full_name": "Bret H",
        "timestamp": 1555006750
    },
    {
        "content": "<p>We will look more into the region-studied, as that is some of what the methodology is about. But we definitely need a place to store the narrative text in a way that downstream consumers can reliably identify it and display it in other formats.<br>\nSo is that the relatedArtifact.Observation.method? Since that is a \"code\" I think we may need another place to put the method text.  And, what would the Observation concept represent in this use?</p>",
        "id": 163127818,
        "sender_full_name": "Larry Babb",
        "timestamp": 1555009178
    },
    {
        "content": "<p>To clarify the options as I see them now: </p>\n<p>1. <code>Observation.method.text</code> on the relevant Observation results;<br>\n2. <code>Observation.method.text</code> on Region-Studied, covering the relevant regions where the methodology was applied;<br>\n3. <code>Observation.method.text</code> on a Panel (soon to be called \"Grouper\") that holds all the relevant Observations through <code>hasMember</code>;<br>\n4. a (Base64Binary) Attachment on <code>DocumentReference.content</code>, referenced through (one or more) <code>dr-supportingInfo.valueReference</code>;<br>\n5. a (Base64Binary) Attachment on <code>RelatedArtifact.document</code>, referenced through <code>dr-relatedArtifact</code>.<br>\nBret has a good point that that the method fields should ideally be coded. There shouldn't be any trouble parsing and displaying the Attachment text files in whatever format is required, but that's not something I've played around with myself yet.</p>",
        "id": 163137664,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1555017128
    },
    {
        "content": "<p>Given the description \"A CodeableConcept represents a value that is usually supplied by providing a reference to one or more terminologies or ontologies but may also be defined by the provision of text,\" I am inclined to push for using the <code>method.text</code> fields wherever it makes the most sense within the report, as that seems the simplest (but also looking into a way to codify this information in the future).</p>",
        "id": 163138601,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1555017951
    },
    {
        "content": "<p>I also believe the codification of genetic testing methodologies is a goal. But we have bigger items to tackle and it seems it will be some time before there will be any significant standardization on the testing and methodology front. There's definitely work being done in this area (GTR is an example). But there is still the question of registration authorities, centralized lookup, international consensus and standardization of how to standardize the representation and structure the testing/methodology components themselves.</p>\n<p>So, method.text sounds like the pragmatic choice for the emerge folks. I'll explore it more and come back with any questions or issues I have when applying it.</p>",
        "id": 163323699,
        "sender_full_name": "Larry Babb",
        "timestamp": 1555259084
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196271\">@Andrea Pitkus, PhD, MLS(ASCP)CM, CSM</span>  have you seen any examples in OandO that use observation.method in this way? I'm just curious how common using obeservation.method.text without a code might be.</p>",
        "id": 163373309,
        "sender_full_name": "Bret H",
        "timestamp": 1555329620
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192123\">@Bret H</span>  Thanks for looping me in. Short answer, is I haven't seen Observation.method implementations yet.</p>\n<p>That said,  the item allows for indication of the method used to obtain the test result.  Ideally, all laboratories using the same method should be documenting in this field the same way.  Most laboratories would structure their test results with a precoordinated approach mapping to a pre coordinated LOINC that includes the method.  However, a number of entities, such as CIMI and Intermountain prefer a post coordinated approach, indicating the method aspect in OBX-17, in current v2 format (we haven't gotten to OBRs/OBXs in the vs to FHIR calls yet).  It is vital that different methods that have different clinical decision making impacts be distinguished so results are not comingled downstream.  (Also why the laboratory community recommends the pre coordinated approach.)  Another aspect discussed at LOINC meetings impacting interoperability and loss of essential clinical information such as method, occurs when a sending system produces a post coordinated message say with method in OBX-17, but a downstream system can't handle said field and drops the info, which can result in a patient safety risk.</p>\n<p>Often methodology is listed in the manufacturer's insert for FDA 510(k) approved methods.  (i.e. automated  vs manual, FISH vs SISH vs ISH).  For laboratory developed tests (LDTs) as indicated in some examples above,  they may be indicated here or another field in the resource such as supporting info or a  comment to meet regulatory requirements.  See <a href=\"https://www.accessdata.fda.gov/scripts/cdrh/cfdocs/cfCFR/CFRSearch.cfm?fr=809.30\" target=\"_blank\" title=\"https://www.accessdata.fda.gov/scripts/cdrh/cfdocs/cfCFR/CFRSearch.cfm?fr=809.30\">https://www.accessdata.fda.gov/scripts/cdrh/cfdocs/cfCFR/CFRSearch.cfm?fr=809.30</a></p>\n<p>That said, genetics is similar and different. On one hand there are some tests using more traditional methods, reporting, etc., while on the other hand, there are more LDTs and methods that may not be as common or standardized.  Highly recommend where common methods occur in genetics/molecular that standard method list be included to reflect those methods if they aren't already included for v2, CDA, and FHIR reporting of the same content.</p>\n<p>Regarding the use of code, there are some SCT codes that folks are also using to encode the method field in V2 that I'd expect to be used in FHIR as well.  (Haven't reviewed how comprehensive the SCT methods are for encoding, but suspect some significant gaps exist especially for newer/less common  methods.) Even if folks are reporting a precoordinated approach in v2/FHIR, it doesn't hurt to include method in OBX-17, but I don't know how many folks are currently sending in messages, as there are other similar fields like procedure/specimen collection method that folks aren't encoding/using according to v2 guides required for MU, MIPS/MACRA reporting too.  Expect some of these aspects may be more fully realized as folks model existing results in FHIR.  Likely need an implementation guide with specific guidance especially on this field so folks implement it the same way for the same content, so we don't get the Wild Wild West.</p>\n<p>Does that help address the question <span class=\"user-mention\" data-user-id=\"192123\">@Bret H</span> ?  <span class=\"user-mention\" data-user-id=\"209510\">@Larry Babb</span>  has included several good comments/questions/points on this aspect too (#4 ACMG, #2 supporting info)</p>",
        "id": 163376966,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1555333240
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192123\">@Bret H</span> <span class=\"user-mention\" data-user-id=\"196271\">@Andrea Pitkus, PhD, MLS(ASCP)CM, CSM</span> thank you for the feedback. For eMERGE and most of the labs i've worked with they have LDTs and they are so focused on trying to get the actual variant findings and interpretations structured that there is not a concerted effort to structure and standardize on the portions of sequence testing that compose parts of the LDTs that they we would even know where to start and how to organize around the set of codes that would support and supplement the LDTs specialized methodology descriptions. <br>\nThat said, I think <span class=\"user-mention\" data-user-id=\"196271\">@Andrea Pitkus, PhD, MLS(ASCP)CM, CSM</span> is correct in that this is an important future development that should have guidance in an IG. <br>\nFor our near term plan and hopefully for the short-term guidance that the IG will provide we will use the method.text approach as it seems like the best (possibly only reasonable) option.</p>",
        "id": 163377763,
        "sender_full_name": "Larry Babb",
        "timestamp": 1555333879
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"209510\">@Larry Babb</span> ,  <span class=\"user-mention\" data-user-id=\"196626\">@Mullai Murugan</span>   thanks for your wonderful presentation today.  Seeing the examples helps provide additional context to your questions here to understand them better.</p>\n<p>Short term in a walk, crawl, run approach, using Method with text may be the approach as it supports the current text blobs folks are reporting today with report sections, but starts to standardize it further so folks can use the same section/resource.  In the future, it can be further refined, such as if specific methods or sub methods are needed to support the variety of methods used in CG/molecular reporting.  Also agree that Methods should be in each report section.  For example PgX methods would be in that section as they may not apply to other \"module/section based\" CG testing added on to the original order.  Alternatively, it may be that Method is it's own report subsection if same approach/method used for everything in entire DR below it (similar to performing org, specimen collection info, patient demographics, etc.).  I can see it modeled both ways.</p>",
        "id": 163392581,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1555344484
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196271\">@Andrea Pitkus, PhD, MLS(ASCP)CM, CSM</span> I am encouraged by your response. Here's my understanding of what you are saying and some questions on taking the \"crawl\" path. <br>\n1. Are you using the term \"report sections\" and \"module section\" to align with the Genomics Panel profile? <br>\n2. If we are talking about using the Genomics Panel profile then it would start to take on more than a simple navigation and grouping concept and more of a concept that has data and attributes specific to it. I'm fine with that I just want to clarify that we'd be starting down that road.<br>\n3. The \"Method\" attribute on Genomics Panel is a 0..1 cardinality and it is a CodeableConcept.<br>\n4. The methodology text we want to put into a report section \"called\" methodology would be more like paragraphs describing the LDT (lab-defined test) SOP. While these are reusable across all instances of a given LDT, it is not likely these truly represent codeable concepts. <br>\n5. If you are still suggesting that we use the CodeableConcept Observation.method.text attribute to share our methodology, would you suggest we stick all paragraph blocks in one big method element for the group? or should we try to break them up (which is harder than we'd prefer).  <br>\n6. We'd really like to simply relay human-readable background and SOP for the LDT on the report itself and have the downstream systems be able to capture the complete block of text that represents the methodology for either the entire report or for the 2 distinct panels we are planning on delivering.<br>\nSorry for the questions. But it very tedious and time consuming to try to gain confidence on decisions this way. It is clear that folks like yourself have opinions and expertise that would be helpful in making short term decisions. However, we cannot sustain the effort and time that this approach has with the aims of trying to deliver an implementation/pilot spec process that needs to be completed in the next 6 months.</p>\n<p>Anything you can do to directly call out a decision would be greatly helpful. we do take you feedback into serious consideration and try to understand how to apply it.</p>",
        "id": 163500040,
        "sender_full_name": "Larry Babb",
        "timestamp": 1555443515
    },
    {
        "content": "<p>The most FHIR approach would be to have the methodology split (and likely redundantly copied, which is why codes are suggested) into the <code>Observation.method</code> for each individual Observation so they can stand on their own and to easily see the relevant Methodology for how each particular Finding was obtained. <br>\nLooking at all the options discussed, I would suggest attaching the text in however many blocks you need to the overall report through <code>RelatedArtifact.document</code> contents, and since <code>Observation.method</code> is not bound to a code system, coming up with a system for referencing individual bullet points/items in those methodologies and putting that information into the relevant Observation.methods fields (either as text or a very simple code system you could describe in your spec).<br>\nThis approach alleviates needing an extra <code>grouper</code> to group 0 Observations, which is semantically awkward, and seems to address most of your concerns.</p>",
        "id": 163591729,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1555527842
    }
]