[
    {
        "content": "<p>We are currently utilizing Genetic Analysis Overall Coded Interpretation profile to house overall summary result of the test. Our assumption is this will encompass all types of variants i.e. SNPs, indels, CNVs, Structural variants etc. But the [IG documentation , Section 1.2] (<a href=\"http://build.fhir.org/ig/HL7/genomics-reporting/general.html\" target=\"_blank\" title=\"http://build.fhir.org/ig/HL7/genomics-reporting/general.html\">http://build.fhir.org/ig/HL7/genomics-reporting/general.html</a>) includes both Genetic Analysis Overall Coded Interpretation and Deletion Duplication Overall Interpretation at the same level. Our structure is somewhat like DR -&gt; Genomics Panel -&gt; GA Overall Coded Interpretation -&gt; Inherited Disease Pathogencity (0..<em>) -&gt;  Described/Complex Variants (0..</em>), with the intention of combining SNPs, CNVs etc results into the GA Interpretation. Can you advice on how Deletion Duplication Overall Interpretation was intended to be utilized? I am not sure  where it will fit in for the eMERGE model.</p>\n<p>Tracker <a href=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=20551\" target=\"_blank\" title=\"https://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=20551\">#20551</a></p>",
        "id": 161022891,
        "sender_full_name": "Mullai Murugan",
        "timestamp": 1552870376
    },
    {
        "content": "<p>We will be removing the del/dup profile, so you won't have to worry about it much longer.  The original intention was to allow methodologies that include testing for deletions or duplications to indicate if any were found.  If needed, we would likely integrate the del/dup answer list into the Genetic Analysis Overall Interpretation answer list by creating a new value set.  Or something like that.</p>",
        "id": 161057894,
        "sender_full_name": "Kevin Power",
        "timestamp": 1552916509
    }
]