[
    {
        "content": "<p>following up the great discussion in todays call i wanted to comment on the methodology issue:<br>\nWe are currently doing mappings from PDF reports to the CG format in Germany. For the methodology our current working hypothesis is to use a very  coarse coding on it to represent the method used by a lab at a given point in time. For the free text part we won't put it in method.CodeableConcept.text, we will add it as a section text in the FHIR Document(Composition Bundle) transporting the Report.</p>",
        "id": 163391914,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1555343990
    },
    {
        "content": "<p>section text? Can you remind me of where this is (the url for the containing profile). thanks!</p>",
        "id": 163392148,
        "sender_full_name": "Bret H",
        "timestamp": 1555344156
    },
    {
        "content": "<p>Thanks for sharing your experience <span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span>   Any way we can work through on future calls structuring the same types of data using the same FHIR resources instead of different ones to promote interoperability?</p>",
        "id": 163413986,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1555360530
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> ,  thank you for sharing. Can you upload an example or link to the profile? Also, how did you handle references and general test info?</p>",
        "id": 163744807,
        "sender_full_name": "Mullai Murugan",
        "timestamp": 1555689840
    },
    {
        "content": "<p>We didn't get to it today but the approach Patrick is mentioning is able to be found here: <a href=\"http://build.fhir.org/documents.html\" target=\"_blank\" title=\"http://build.fhir.org/documents.html\">http://build.fhir.org/documents.html</a><br>\nIt's not mentioned specifically in the IG, but absolutely is a core part of FHIR that should be considered</p>",
        "id": 163914301,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1555949061
    },
    {
        "content": "<p>In particular, it suggests using a Composition bundle to send your report (and any provenance details). You could use Composition.section.text to send the large text for later use.</p>",
        "id": 163914470,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1555949214
    },
    {
        "content": "<p>In regards to the use of Panel vs nested DiagnosticReports, the group has already voted to add textual guidance to support BOTH methods, so either approach you prefer is aligned with us at this time. See <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=19937\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=19937\">GF#19937</a></p>",
        "id": 163914725,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1555949427
    },
    {
        "content": "<p>At this point we are very grateful for the feedback of using one approach vs the other :)</p>",
        "id": 163914764,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1555949489
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196553\">@James Jones</span>  - While I agree 1000% with your comment and reference to 19937, you may want to make that comment on another thread on that topic <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span></p>",
        "id": 163914831,
        "sender_full_name": "Kevin Power",
        "timestamp": 1555949525
    },
    {
        "content": "<p>While the approach described by <span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> is valid, it is not very well aligned with our current IG - at least it doesn't feel that way to me?  Perhaps I will feel differently when I see an example, or if everyone tells me I am crazy.</p>",
        "id": 163915110,
        "sender_full_name": "Kevin Power",
        "timestamp": 1555949768
    },
    {
        "content": "<p>We have very little, if any, guidance I can find in the IG on where/how to attach methodology information apart from what is in the field names for the base resources for Observation and DiagnosticReport. Perhaps this discussion merits adding some text on the matter pointing to those fields? Also perhaps guidance on sending supporting info/attachments in general...</p>",
        "id": 163916241,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1555950766
    },
    {
        "content": "<p>I asked this question in the joint meeting with O&amp;O:<br>\nIn the existing  structures they are recommending to use Observation.method.text / or if you have 1+ Codes: Observation.method.Code.text<br>\nThis isn't ideal and Observation.note would be the better place to capture this. But the underlying data type Annotation doesn't has a type to express \"this is a note on method\".<br>\n<span class=\"user-mention\" data-user-id=\"196626\">@Mullai Murugan</span></p>",
        "id": 165177062,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1557332168
    },
    {
        "content": "<p>filed: <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=22102\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=22102\">GF#22102</a></p>",
        "id": 165177628,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1557332579
    },
    {
        "content": "<p>We could also add an must-support Extension to Observation.method to capture the narrative method description.</p>",
        "id": 165177856,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1557332738
    },
    {
        "content": "<p>While the \"methodology\" solution seems to be bouncing around a bit. I would like to point out that we not only need to deal with passing the methodology text (and codes if folks have these) but we also need to pass text describing the background of the test, any disclaimers based on the test, recommendations and/or comments provided in narrative form on the test. The labs design these reports in somewhat standard forms but often find the need to carve out new types of information to share in narrative form. While I understand that this is not so useful for computational and coding uses, it is important clinical information that should be identifiable as the section of narrative text that the authoring lab is providing. We should create a solution to handle this.  Composition is a dramatic departure from Diagnostic Report (as I understand it now). So the DR should have the ability to structure coded data that is possible to structure and code as well as structure narrative categories of clinical information that is not currently available in codeable form.</p>",
        "id": 165244913,
        "sender_full_name": "Larry Babb",
        "timestamp": 1557402594
    }
]