[
    {
        "content": "<p>We are planning on providing a single overall-overall interpretation for the panel of PGx results returned on a given report. In the PGx section of the report, there are 6 unique PGX results returned. Each of which has a diploytpe-phenotype finding that will map with the subclasses of the Medication Impact profiles. Each of these results will also have it's own overall interpretation (pos, neg, inconclusive - we think that's a fine value set for now).  </p>\n<p>The concern...<br>\nWe'd also like to provide an overall-overall interpretation that indicates if any of the 6 indivdual results were positive.  <br>\nIn trying to associate these nested overall interps from the individual results with this overall-overall I am planning on using the \"derivedFrom\" association.  </p>\n<p>This may be something that comes up in other Genetic testing results as these reports are more-and-more including multiple sections which behave like sub-reports, simply using a common set of findings from a single wet lab assay to provide different \"overall interpretations\".  </p>\n<p>It might also be worth working through whether or not labs would want a top-level overall interp that spanned these different sections (combination of molecular diagnostic pathogenicity, pgx overall interp, polygenic risk score overall interp).  It seems like the \"overall interp\" is a pretty critical trigger for consuming systems (EHRs) in which case we should be thoughtful about how we handle this with the complex reporting structures.</p>\n<p>So, my baseline question is...<br>\nQuestion: Can we either modify ObsOverall or create an Overall-Overall Interp Profile that allows a single overall interp to derive from other overall interps?  Currently, the ObsOverall profile does not allow you to deriveFrom other ObsOverall profiles.</p>\n<p><span class=\"user-mention\" data-user-id=\"196626\">@Mullai Murugan</span> can you verify with the Baylor geneticists that we truly want a summary overall interp for the PGx section of results? If so, can they clarify how we would handle the various use cases.<br>\n1. All of the nested results are negative...presumably the summary would be negative<br>\n2. One or more of the nested results are positive and the others are negative... presumably the summary would be postiive.<br>\n3. One or more of the nested results is inconclusive (or indeterminate) and at least one of the others is positive... ?<br>\n4. One or more of the nested results is inconclusive (or indeterminate) and all the others are negative... ?</p>\n<p>If the use cases should be different, please modify and clarify the rules for the summary interp.</p>",
        "id": 160093730,
        "sender_full_name": "Larry Babb",
        "timestamp": 1551877979
    },
    {
        "content": "<p>At that level you really have to have a lot of logic to determine the overall-overall interpretation. Firstly, define what 'positive' means to you. Are you talking about a medication impact that has been annotated? Or are you talking about a variant having been found? (Is this stream related to 'FHIR Representation of a genetic...?')</p>",
        "id": 160103418,
        "sender_full_name": "Bret H",
        "timestamp": 1551884900
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192123\">@Bret H</span> makes good points.  I'm not sure what \"positive\" means in this context.  Any variant found?  Only variants that result in a non-normal phenotype?</p>\n<p>I think the list of possible cases (1..4, potentially plus others) is complex enough that understanding how to interpret overall-overall would be more difficult than it is worth - since there are only 6 gene-level results reported it might be easier to just look them over.  Is there a need to call the overall-overall thing an Overall-Overall Interp, or might it be sufficient to provide that data as a separate observation (without the hierarchical structure)?</p>",
        "id": 160113469,
        "sender_full_name": "Bob Freimuth",
        "timestamp": 1551891654
    },
    {
        "content": "<p>I understand the need to dig in and identify the requirements and application of the requests. I am not the SME for most of the decisions various labs make when reporting results. I suppose the question I'm more interested in answering with respect to most of the requests made under this topic is \"Is it the CG Implementation Guides job to constrain what labs choose to do or is it to provide the opportunity to build reports and results in a manner of their choosing with some fundamental structure to the results and interpretation concepts?\"  </p>\n<p>In other words, if a lab wants to calculate an overall interp that is a composite of several nested results then why would we work to refute the need to do that?  I understand asking the basic question to verify that it is truly a need that exists, but once we understand the need for a group to do such a thing, isn't it our job to provide a reasonable mechanism to allow for it to occur.</p>\n<p>Providing a nested gene panel to \"organize\" the structure of how a genetics test result is to be reported seems to be something we all \"get\". Is it unreasonable to think that labs may want to report out an overarching \"interpretation\" or \"result\" that summarizes the results nested below it?  </p>\n<p>This goes back to the general concept of whether our nested gene panels or nested diagnostic reports approaches are distinctly that different.  </p>\n<p>eMERGE needs the ability to structure their reports in a certain way. Currently, the only option I can find available is the ObsGenePanel approach to enable me to represent the hierarchical nature of the results on their composite reports. At each level of the nesting there is a definite need to summarize both in text and code the interpretation of the ObsGenePanel.  Currently the only place to put an interpretation text and overall code is on the Diagnostic Report itself. </p>\n<p>So if we can pull back from the specific issue of whether or not an overall interp code + text narrative is needed or useful or logical for the set of PGx results that may all be linked to the indication for testing and instead focus on how to enable labs to report interpretation narratives and codes at various ObsGenePanel points in the hiearchy of results, that would be super helpful to getting us past this gating issue.</p>\n<p>I don't mean to be difficult or to put off your concerns, I'd simply like to see if we can solve the \"general\" idea behind nested overall interps.</p>",
        "id": 161854799,
        "sender_full_name": "Larry Babb",
        "timestamp": 1553690473
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"209510\">@Larry Babb</span>  did you consider Bob's suggestion? An instance of observation could be used to provide the overall-overall interpretation. But when you say positive, negative are you interested in the presence/absence of a variant or the phenotype?  and you've got another feed where about nesting Diagnostic Reports. does this not work?</p>",
        "id": 161867390,
        "sender_full_name": "Bret H",
        "timestamp": 1553698716
    },
    {
        "content": "<p>If you guys are saying that nested reporting is not available or not appropriate, then I will craft the set of Observation profiles I need to deliver all the bits of structured information on the report.  I think some of these \"observations\" that will be fairly standard will resemble if not precisely reflect the attributes of conclusion and conclusionText in the Diagnostic Report. I will of course have to nest all of these accordingly in separate sets of Gene Panel observations.  Either that or I will need to define a different profile of configurations for the components of a single Observation profile. It would be easier if we could go through the types/sets of structured data and the nesting that is needed to achieve the varying kinds of results labs might want to report by.</p>",
        "id": 161889312,
        "sender_full_name": "Larry Babb",
        "timestamp": 1553712663
    },
    {
        "content": "<p>They're not available in the current profile.  They could theoretically be added.  However, I'm not sure about the 'appropriate' bit.</p>",
        "id": 161892628,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1553714828
    },
    {
        "content": "<blockquote>\n<p>If you guys are saying that nested reporting is not available or not appropriate, ...</p>\n</blockquote>\n<p>\"not available\" : True - We don't yet have official guidance I'm afraid<br>\n\"not appropriate\" : False (for me anyway) - I think this is needed, we just haven't drafted the guidance you are looking for yet.</p>\n<p>My current thinking for your example is something like this:</p>\n<p>One ServiceRequest - Represents the order<br>\nFour DiagnosticReport - Represents the 3 \"sections\" you have, plus one summary report grouping the other 3 together<br>\nX Observations - However many you need, grouped under the appropriate DiagnosticReport, and this allows the usage of the \"Overall Interp\" to be associated to each DR as the IG is designed today.</p>\n<p>Does that make sense?</p>",
        "id": 161892729,
        "sender_full_name": "Kevin Power",
        "timestamp": 1553714916
    }
]