[
    {
        "content": "<p>The genomics report profile appears to limit the \"performer\" to Organization only. We will need the responsible party to be the authorizing practitioner, typically a geneticist acting on behalf on the performing laboratory, so we may need PractionerRole.  In any case the v4.1 of DiagnosticReport allows the same set of Reference types Practitioner, PractitionerRole, Organization and Careteam, whereas the genomics report profile does not. <br>\nThe performer is the party responsible for the contents of the report (the authorizing party that signs of on the clinical report) and the resultsInterpreter it an additional player in that activity as well, these could be and will likely be one in the same for the emerge case.</p>",
        "id": 163328225,
        "sender_full_name": "Larry Babb",
        "timestamp": 1555266676
    },
    {
        "content": "<p>I also noted that performer is the primary party responsible for the results of the test. ResultsIntepreter is described as \"might not be the same as the party that takes responsibility for the test\".  </p>\n<p>I do think the way the DiagnosticReport resource in v4.1 current build has it specified is much more appropriate. In that model you can have 0..* performers which can be Practitioners, PractitionerRoles, Organizations or CareTakers in combo. And you can still call out the primary result interpreter to make sure it is clear who did the interpretation.  This way you can both assign responsibility to the lab+practitioner for the clinical results and still identify the practitioner that takes responsibility for the results.</p>",
        "id": 163328636,
        "sender_full_name": "Larry Babb",
        "timestamp": 1555267360
    },
    {
        "content": "<p>May be worth filing a GForge ticket to discuss DiagnosticReport performer and resultsInterpreter.</p>",
        "id": 163356016,
        "sender_full_name": "Joel Schneider",
        "timestamp": 1555309939
    },
    {
        "content": "<p>+1   <span class=\"user-mention\" data-user-id=\"209510\">@Larry Babb</span>  within the GForge please refer to the zulip chat so folks can find it.</p>",
        "id": 163374189,
        "sender_full_name": "Bret H",
        "timestamp": 1555330673
    },
    {
        "content": "<p>I think this is a better question for <a class=\"stream\" data-stream-id=\"179256\" href=\"/#narrow/stream/179256-Orders-and-Observation-WG\">#Orders and Observation WG</a> ?</p>",
        "id": 163384765,
        "sender_full_name": "Kevin Power",
        "timestamp": 1555338997
    },
    {
        "content": "<p>i can see your point <span class=\"user-mention\" data-user-id=\"209510\">@Larry Babb</span> and i also think that R5 handles this better than R4.<br>\nFrom the IG side we could:<br>\n- loosen the restriction of performer to allow: Practicioner, PraciticionerRole and Organization<br>\n- add a Extension (backPort of  ResultsInterpreter) should be part of the core spec at some point as new data fields normally are getting core extension in older FHIR versions for backwards compatibility.</p>",
        "id": 163386232,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1555340097
    },
    {
        "content": "<blockquote>\n<p>From the IG side we could:<br>\n- loosen the restriction of performer to allow: Practicioner, PraciticionerRole and Organization</p>\n</blockquote>\n<p>Good point Patrick, we can just \"back patch\" the R5 change into our IG.  We can undo it in the future when we build against R5.</p>",
        "id": 163389038,
        "sender_full_name": "Kevin Power",
        "timestamp": 1555341970
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"209510\">@Larry Babb</span> do you want to open a gforge tracker item on this?</p>",
        "id": 163390874,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1555343274
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196626\">@Mullai Murugan</span> and I are working on assessing this further with compliance officers. We will raise it in our upcoming \"emerge mapping decision\" meetings for those that can attend and inform the final decision for us.</p>",
        "id": 163498551,
        "sender_full_name": "Larry Babb",
        "timestamp": 1555442430
    },
    {
        "content": "<p>a quick update on this issue: i just got back on this topic and realised that there were no changes from R4 -&gt; R5 and we already have everything we need. The performer is just to restricted in our profile.</p>",
        "id": 164887425,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1557004752
    },
    {
        "content": "<p>After some discussion with our  internal compliance group, we  have reached the conclusion that the performer should be Organization for our use cases. At this point, the current draft spec will work for us. Thank you all for the feedback and discussion.</p>",
        "id": 165175051,
        "sender_full_name": "Mullai Murugan",
        "timestamp": 1557330729
    },
    {
        "content": "<p>While I agree that the current constraint that CG is putting on \"performer\" works for our needs. I still do not understand why CG reports would limit the ability to have the same options for \"performers\" as the default Resource. I would recommend that the CG group re-address this or clarify in their documentation the reasoning behind preventing other Diagnostic.perform types other than Organization.</p>",
        "id": 165245077,
        "sender_full_name": "Larry Babb",
        "timestamp": 1557402752
    },
    {
        "content": "<p>Check out the US CORE observation profile. It has a good example of how to get performer in as a slice.</p>",
        "id": 173761402,
        "sender_full_name": "Bret H",
        "timestamp": 1566357888
    },
    {
        "content": "<p>I can double check but I think this has been resolved. We removed the constraints we had on performer.</p>",
        "id": 173761699,
        "sender_full_name": "Kevin Power",
        "timestamp": 1566358323
    }
]