[
    {
        "content": "<p>There are 3 Medication Impact profiles</p>\n<ul>\n<li><strong>Medication Metabolism Impact</strong>  Assertion of the expected impact of a particular genotype on the ability of the subject to metabolize medications</li>\n<li><strong>Medication Transporter Impact</strong> Assertion of the expected impact of a particular genotype on the ability of the subject to actively transport medications</li>\n<li><strong>Medication Efficacy Impact</strong>    Assertion of the expected impact of a particular genotype on the efficacy of medications for the subject</li>\n</ul>\n<p>The CPIC guidelines show various alternative value sets for some of these, for example</p>\n<p><a href=\"https://api.pharmgkb.org/v1/download/file/attachment/CYP2C19_Diplotype_Phenotype_Table.xlsx\" target=\"_blank\" title=\"https://api.pharmgkb.org/v1/download/file/attachment/CYP2C19_Diplotype_Phenotype_Table.xlsx\">CYP2C19 metabolizer values</a></p>\n<ul>\n<li>Intermediate Metabolizer</li>\n<li>Likely Intermediate Metabolizer</li>\n<li>Likely Poor Metabolizer</li>\n<li>Poor Metabolizer</li>\n<li>Rapid Metabolizer</li>\n<li>Ultrarapid Metabolizer</li>\n<li>Normal Metabolizer</li>\n<li>Indeterminate</li>\n</ul>\n<p><a href=\"https://cpicpgx.org/content/guideline/publication/pegintron/2013/24096968.pdf\" target=\"_blank\" title=\"https://cpicpgx.org/content/guideline/publication/pegintron/2013/24096968.pdf\">IFNL3 values</a></p>\n<ul>\n<li>Favorable response genotype</li>\n<li>Unfavorable response genotype</li>\n</ul>\n<p><a href=\"https://api.pharmgkb.org/v1/download/file/attachment/SLCO1B1_Diplotype_Phenotype_Table.xlsx\" target=\"_blank\" title=\"https://api.pharmgkb.org/v1/download/file/attachment/SLCO1B1_Diplotype_Phenotype_Table.xlsx\">SLCO1B1 Function</a></p>\n<ul>\n<li>Decreased Function</li>\n<li>Normal Function</li>\n<li>Poor Function</li>\n<li>Possible Decreased Function</li>\n<li>Possible Increased Function</li>\n<li>Possible Poor Function</li>\n<li>Indeterminate</li>\n</ul>\n<p>and the list may go on. these are just a few of the ones I have to work with.</p>\n<p>Question:<br>\nHow does the IG support the fact that folks will need to deal with value set bindings that cannot be restricted to the 3 sets provided so far?</p>",
        "id": 160041881,
        "sender_full_name": "Larry Babb",
        "timestamp": 1551821377
    },
    {
        "content": "<p>I have some ideas (and some possible pending changes) - but where did you get those values from?  I have this link that we have used to help inform us to date?</p>\n<p><a href=\"https://www.nature.com/articles/gim201687/tables/2\" target=\"_blank\" title=\"https://www.nature.com/articles/gim201687/tables/2\">https://www.nature.com/articles/gim201687/tables/2</a><br>\n<a href=\"https://www.nature.com/articles/gim201687/\" target=\"_blank\" title=\"https://www.nature.com/articles/gim201687/\">https://www.nature.com/articles/gim201687/</a></p>",
        "id": 160053912,
        "sender_full_name": "Kevin Power",
        "timestamp": 1551830926
    },
    {
        "content": "<p>The headers of each value set section in my original post is a link to the source where I got them. These all came from CPIC's website for the specific Diplotype-Phenotype tables in the supplemental tables for each gene's drug guidelines.  There's dozens of these at least, I only took a small sampling.  The one oddball is the IFNL3 guideline (Favorable/Unvaforable Response) which comes directly from the guidelines primary publication - no standardized table was available, so labs presumably use the literature's table to annotate their interpreted findings when reporting.</p>\n<p>At least from Baylor's standpoint they seem to use the terminology that is straight out of the guideline literature - not so much the more formalized values that CPIC presumably standardized in the tables used to map the diplotype-phenotype info.</p>",
        "id": 160090732,
        "sender_full_name": "Larry Babb",
        "timestamp": 1551875231
    },
    {
        "content": "<p>I think the guidance would be for data producers to send a code from the standardized list, but also allow for additional values to be sent.  Those additional values should be real codes where possible, but if no codes exist, send what you can.  And if we have profiles that are overly restrictive and don't allow that, then we should look at loosening them a bit.</p>",
        "id": 160102910,
        "sender_full_name": "Kevin Power",
        "timestamp": 1551884523
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"209510\">@Larry Babb</span>  can you note which element you are talking about the value set for? (for general audience it can be helpful).<br>\nA problem with all those value sets is that they are not related to an actual quantifiable level of activity. Tell me the difference between Poor function and Poor Metabolizer? Why not use activity: poor for the code with an additional text display of 'Poor Function' or 'Poor Metabolizer?' The code is more restrictive but you can add a display meant for human consumption.</p>\n<p><span class=\"user-mention\" data-user-id=\"209510\">@Larry Babb</span> are there actual groups using the codes above for calculating or are they only used for display?</p>",
        "id": 160104090,
        "sender_full_name": "Bret H",
        "timestamp": 1551885374
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192123\">@Bret H</span> these are qualified codes, not quantifiable results as are many of the interpreted results returned in genomic analysis reports (e.g. Path, LPath, VUS, etc..).  The CPIC organization is defining these terms and I am not a domain expert by any measure, so I would defer to them.</p>\n<p>I reached out to CPIC with the following email this morning ...background...</p>\n<div class=\"codehilite\"><pre><span></span>On Wed, Mar 6, 2019 at 8:21 AM Larry Babb &lt;lbabb@broadinstitute.org&gt; wrote:\nI am working with HL7 FHIR and GA4GH GKS (genomic knowledge standards) to help progress the standards behind reporting clinical genetic test results which include PGx test results. I was indirectly involved in the Delphi process some time ago referenced by this page https://cpicpgx.org/resources/term-standardization/.\n\nWhen I look at the diplotype-phenotype tables for the various CPIC genes, I see terms that are outside the scope of the Delphi results.\n\nSo I was wondering if there is any commitment, plan or strong expectation of formalizing all CPIC diplotype-phenotype terminology with these Delphi results?\n\nEssentially, I&#39;m looking for a statement of certainty or uncertainty as to whether the standards organizations like HL7 and GA4GH should realistically work with the phenotype terms found throughout the diplotype-phenotype tables or should we presume these will all map to a future standard that is in the works and soon to appear?\n\nThank you for any information and guidance you can provide.\n\n--\nLarry Babb\n</pre></div>\n\n\n<p>... and received a reply back from Mary Relling, which I am now waiting on follow up...</p>\n<div class=\"codehilite\"><pre><span></span>On Wed, Mar 6, 2019 at 9:13 AM Relling, Mary &lt;Mary.Relling@stjude.org&gt; wrote:\nHi, Larry, thanks for reaching out.\n\nYes, we are aware that for some genes, the terms are outside of the agreed upon standardized terms. (We did acknowledge in our paper that some genes we had not yet addressed, such as VKORC1; since then a few others like RYR1 have come up).\n\nAlso, we are aware that “possible” has been added as a modifier.\n\nAs part of the CPIC database build, we do plan to try to harmonize as many terms as possible for these “outlier” genes. We were hoping to do this without a formal Delphi process but I don’t’ think we are positive about that. I don’t think we yet know for sure, but if I had to guess, we may have to allow for gene-specific phenotype terms (e.g aminoglycoside otoxicity susceptible vs aminoglycoside otoxicity normal risk for mtRNR1; malignant hyperthermia susceptible vs malignant hyperthermia normal risk for RYR1).\n\nWe can provide you a gene-by-gene list at this point with our best guesses, if that would be helpful.\n\nWhat is your timetable for needing to know?\n\nThanks and sorry for the hassle.\n\nMary V. Relling, Pharm.D.\nChair, Pharmaceutical Dept.\nSt. Jude Children&#39;s Research Hospital\n</pre></div>\n\n\n<p>I replied to request the gene-by-gene list of their best guesses as I presume it would be better than anything else available.</p>",
        "id": 160108727,
        "sender_full_name": "Larry Babb",
        "timestamp": 1551888410
    },
    {
        "content": "<p>Thanks Larry. That's helpful. I've not looked at CPIC closely in a while. Can you shoot me a link to see where they define which lists are from the delphi process and which ones are still being debated or brought into alignment?</p>",
        "id": 160109075,
        "sender_full_name": "Bret H",
        "timestamp": 1551888613
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"209510\">@Larry Babb</span> Sorry I did not see this thread in time. Mary's response is the authoritative word, of course, but it also is consistent with what I've heard lately.  We can use the CPIC consensus terms when possible, knowing that the genes that weren't considered as part of the delphi standardization process will be done at a future date. </p>\n<p>I think the important thing to take away from this is that the field is still a work in progress.  We won't have a stable terminology for some time.</p>",
        "id": 160126060,
        "sender_full_name": "Bob Freimuth",
        "timestamp": 1551900208
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192123\">@Bret H</span> There isn't a link that points to which lists are using the delphi terms and which ones are being debated or brought into alignment? There are only the lists they published and that you need to lookup gene by gene.  If you go to any of the specific genes guidelines and look for a link to the diplotype-phenotype table (assuming one exists) then you can sort on the phenotype column to see the unique set of terms.  If there is not diplotype-phenotype table available then you generally have to read the main guideline doc to extract what terms to use from the literature, which may not be clear and consistent from each person that does this.</p>",
        "id": 160128541,
        "sender_full_name": "Larry Babb",
        "timestamp": 1551901959
    },
    {
        "content": "<p>in this case. You could do a specific profile for each Gene in a set of CPIC profiles. Each profile would specify the value set (i.e. write a value set resource) to use and have the HGNC ID for the gene as required. It would be of work to maintain the profiles. </p>\n<p>I would not try to have a single inclusive value set with all values from all the lists. With a long list of values an implementer would still need to run logic based on the gene sent, by doing the profiles you save them the effort of looking up the value sets.</p>\n<p>A receiving system would be able to receive the profiles, even if they did not implement CPIC IG profiles, as long as the CG IG does not specify which values to use in the value set.</p>",
        "id": 160290609,
        "sender_full_name": "Bret H",
        "timestamp": 1552053240
    },
    {
        "content": "<blockquote>\n<p>in this case. You could do a specific profile for each Gene in a set of CPIC profiles. Each profile would specify the value set (i.e. write a value set resource) to use and have the HGNC ID for the gene as required. It would be of work to maintain the profiles. </p>\n</blockquote>\n<p>That sounds like a significant profile proliferation?  How many would it take to support such a model?</p>",
        "id": 160299606,
        "sender_full_name": "Kevin Power",
        "timestamp": 1552059616
    },
    {
        "content": "<p>Yep. It takes as many as CPIC produces guidelines on Genes. But recall, the profiles are to help by providing guidance to appropriate value sets. Instance data will always conform to the base FHIR spec. It is a question about implementation. But if EMERGE wants to standardize PER gene what the value set can be...what other options do they have? I know they are trying to reduce the number of value sets (and thus provide an option to group genes together - possibly by function - but currently they need a lot of guidance to implementers). An option is NOT to specify specific profiles per gene but then you leave it up to impelementers to implement the CPIC work correctly.</p>",
        "id": 161160228,
        "sender_full_name": "Bret H",
        "timestamp": 1553009051
    },
    {
        "content": "<p>additionally, what happens as the value sets change! There are mechanisms to update servers, but won't servers need to be able to understand the historical values too. Normalizing those value sets is critical and for a computer non-ordinal indicators (e.g. positive, found, detected) are essentially the same thing. The work to be done is with the ordinal lists. There is a way in FHIR to communicate a codded ordinal with its ordinal value. One means to allow for evolution of language (i.e. changes in the displays in the value sets that do not alter the ordinal scale) while remaining backwards compatible is to assign an ordinal value to concepts in an ordinal list...now, we still have a problem if you insert into the list....more food for thought than a suggestion. <span class=\"user-mention\" data-user-id=\"209510\">@Larry Babb</span>  how were you thinking of representing the value sets as Value Set Resources? Will the value sets be deposited in VSAC as well?</p>",
        "id": 161868898,
        "sender_full_name": "Bret H",
        "timestamp": 1553699490
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"209510\">@Larry Babb</span> Where did you end up on this topic?  Should we discuss further?</p>",
        "id": 165110155,
        "sender_full_name": "Bob Freimuth",
        "timestamp": 1557262429
    },
    {
        "content": "<p>I'm not planning on building Value Sets for different PGx Genes.  I will likely use the CodeableConcept.text approach and go with whatever the labs decide to extract from the literature to convey the phenotype. In time as CPIC standardizes the phenotype terms for the different PGx genes or gene combos (i.e. CYP2C9/VKORC1 for warfarrin metabolism) then someone can register these and the community can get some kind of standard computable terminology that is more useful in a broad sense.</p>",
        "id": 165122030,
        "sender_full_name": "Larry Babb",
        "timestamp": 1557273455
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192123\">@Bret H</span> <br>\nIn your 3/8 reply above </p>\n<blockquote>\n<p>in this case. You could do a specific profile for each Gene in a set of CPIC profiles. Each profile would specify the value set (i.e. write a value set resource) to use and have the HGNC ID for the gene as required. It would be of work to maintain the profiles.</p>\n</blockquote>\n<p>I'm not sure how to create these profiles and I would need some expert guidance to help collect these specialized terms in any case. I also want to clarify that each of these value sets might be associated to more than one PGx gene as in the case of CYP2C9/VKORC1 for Warfarrin Metabolism.</p>\n<p>It sounds like a reasonable idea for the CPIC group to do, but I do not think and individual lab or two will take the initiative to decide on the set of terms and profile it when it really needs to be standardized and shared with EHR vendor systems in a more meaningful way.</p>\n<p>If we start by passing the terms as the text attribute of the codeableconcept it would be a good start I think.</p>",
        "id": 165122331,
        "sender_full_name": "Larry Babb",
        "timestamp": 1557273759
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192198\">@Bob Freimuth</span> I don't think any further discussion will help. I think CPIC is aware and will address the standardization at a pace that they are able to accomplish. But the CG group should keep an eye on it and make sure to standardize those terms that are finalized so they are available to the masses. I'm not sure how to make that happen.</p>",
        "id": 165122467,
        "sender_full_name": "Larry Babb",
        "timestamp": 1557273934
    }
]