[
    {
        "content": "<p>Currently there are 2 overall interpretation profiles in the CG IG</p>\n<ul>\n<li><strong>Genomic analysis overall interpretation</strong> - Provides a coarse overall interpretation of the genetic results reported.</li>\n<li><strong>Deletion-duplication overall interpretation</strong> - Provides an overall interpretation of whether any deletions or duplications were found as part of the genetic analysis</li>\n</ul>\n<p>In our PGx panel we have several sub PGX interpretation results (metabolism, efficacy, etc) that we would like to provide an overall interpretation for (i.e. positive, negative, inconclusive) to describe whether or not the PGx phenotype is normal or abnormal or indeterminate.</p>\n<p>I was thinking of using the <strong>Genomic analysis overall interpretation</strong> above but that seems like it might not be the right fit. We may want to consider using the standard terms from CPIC for the <strong>EHR Priority Result Notation</strong> which has the following values:</p>\n<ul>\n<li>Abnormal/Priority/High Risk</li>\n<li>Normal/Routine/Low Risk</li>\n<li>None</li>\n</ul>\n<p>The question is <br>\nShould we create a separate \"PGx Analysis Overall Interp\" profile and if so, should it have the same or different terms than the \"Genomic Analysis overall Interp profile\"?</p>\n<p>Also, since PGx testing can often report multiple PGX results, can we use the same (or different) PGx Analysis Overall Interp to summarize the nested individual overall interpretations for each individual PGx result reported?  This is the model we envision for the eMERGE PGx model.</p>",
        "id": 160040956,
        "sender_full_name": "Larry Babb",
        "timestamp": 1551820645
    },
    {
        "content": "<p>Well, first the <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=16935\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=16935\">GF#16935</a> will trigger the removal of the Del-Dup overall interp profile.  Doesn't help you much, but FYI.</p>\n<p>Regarding the CPIC 'EHR Priority Result Notation' - Do you know if this happens to a LOINC code that CPIC requested?  I don't remember seeing it before, but we should check that first.</p>\n<p>To the question of 'override Genomic Analysis Overall Interp' or 'new PGx Analysis Overall Interp profile' - I am leaning towards something more like the first - allow the current Overall Interp profile to use different answer lists.  Right now, it would require <a href=\"https://r.details.loinc.org/AnswerList/LL541-4.html\" target=\"_blank\" title=\"https://r.details.loinc.org/AnswerList/LL541-4.html\">LL541-4</a> - but perhaps we should change this to Preferred or even Example?  Then if other answer lists exist that make more sense, they could be used.</p>\n<p>Do others have thoughts? <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> <span class=\"user-mention\" data-user-id=\"194730\">@Liz Amos</span> (for Clem who doesn't seem to be on Zulip)</p>",
        "id": 160053202,
        "sender_full_name": "Kevin Power",
        "timestamp": 1551830190
    },
    {
        "content": "<p>The notion was that both Del-dup and overall interpretation would be single values at the report level essentially identifying \"did you find anything interesting?\".  However, I guess in theory we could do that at the package/grouping/panel/whatever we call it level too.  I don't know if we can use the same LOINC codes or not though</p>",
        "id": 160056113,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551833458
    },
    {
        "content": "<p>Before we go to deep into alternative value set bindings for a single Genomic Analysis Overall Interp, we should determine if we even need alternative value sets for PGx overall interp (or the Del-Dup one that is being removed). </p>\n<p>If we do decide there are different use cases that warrant alternative overall interp value sets then...<br>\nI think we'd be fine with genericizing the <strong>Genomic Analysis Overall Interp</strong> profile to support multiple answer lists as this would then be able to support new lists going forward, but my concern is that would create a flexibility that goes counter to the idea of standardization (I think). </p>\n<p>I'm assuming that consumers will look for specifically coded observations using matching on LOINC Codes like the one for Genomic Analysis Overall Interp and if there are \"variable\" value lists with different LOINC answers with a variety of codes then it may be difficult for the consumer to handle that situation. </p>\n<p>I could be wrong - but I think the folks that want to consume and act on the incoming HL7 data prefer a more controlled situation that doesn't require unpredictable data.  </p>\n<p>If the answer is to make this a single Profile with interchangeable value sets (answer lists) then how do we share/register the value sets for a given case?  Would this be done in the IG? And can we discuss how a consumer would be able to distinguish which value set was used in a given record - because that might be needed to trigger any type of CDS mechanism downstream?</p>",
        "id": 160090512,
        "sender_full_name": "Larry Babb",
        "timestamp": 1551874943
    },
    {
        "content": "<p><code>but my concern is that would create a flexibility that goes counter to the idea of standardization (I think).</code><br>\nThat is a valid concern, but we have to balance the usage of standardized codes AND meeting the labs where they are today.  Where we are comfortable relying on a single, standardized list, we can and should.  However, I don't know how often that will be the case.</p>\n<p><code>I could be wrong - but I think the folks that want to consume and act on the incoming HL7 data prefer a more controlled situation that doesn't require unpredictable data.</code><br>\nYou are certainly not wrong, but we don't always get what we want. <span aria-label=\"slight smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"slight smile\">:slight_smile:</span> As I mentioned in another thread - we do have the option of requesting the labs to send the best matching item from the standard list, but still allowing other 'codes' to be sent.</p>\n<p><code>If the answer is to make this a single Profile with interchangeable value sets (answer lists) then how do we share/register the value sets for a given case?</code><br>\nI am actually not sure of the best way to do this.  Perhaps <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> or <span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> can weigh in?</p>",
        "id": 160103691,
        "sender_full_name": "Kevin Power",
        "timestamp": 1551885107
    },
    {
        "content": "<p>There is an interpretation field in observation resource which accounts for a labs need to report critical values. <span class=\"user-mention\" data-user-id=\"209510\">@Larry Babb</span>  have you looked at this filed? the list : <br>\nAbnormal/Priority/High Risk<br>\nNormal/Routine/Low Risk<br>\nNone<br>\nfits in there</p>",
        "id": 160104335,
        "sender_full_name": "Bret H",
        "timestamp": 1551885553
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192123\">@Bret H</span> I've noticed this field before and often thought it would be the right place for things like \"overall interp values\". But I see that in the ObsBase profile for the IG that it is explicitly eliminated, so I figured it wasn't something that played nice with the CG IGs approach to returning overall interps.</p>\n<p>If the observation.interprtation is a good approach, then I would suggest using this for all \"overall\" results as it incorporates POS, NEG, or inconclusive (indeterminate).</p>\n<p>I'm guessing the reason this is removed from the ObsBase profiles and an Overall Interp profile was created is because it is presumed that multiple sub-observations need to be aggregated to a single overall interp, which is not how the observation.interpretation field works.</p>\n<p><strong>observation.interpretation</strong> <em>A categorical assessment of an observation value. For example, high, low, normal.</em></p>\n<p>I could use this for the EHR priority values specified by CPIC for each PGx result, but I'm not sure what I'd do for the cases where there are combo diplotypes to arrive at a single result (e.g. CPY2C9 &amp; VCKORC1 for Warfarin Metabolism)</p>",
        "id": 160107270,
        "sender_full_name": "Larry Babb",
        "timestamp": 1551887482
    },
    {
        "content": "<p>that's right, we removed it on purpose. I need to go back and think about it. Sorry not to have a quick return.</p>",
        "id": 160107498,
        "sender_full_name": "Bret H",
        "timestamp": 1551887612
    },
    {
        "content": "<p>Perhaps Observation.interpretation should be applicable to some of our profiles, and removing it in ObsBase was too broad.  Perhaps it should be allowed on the impact profiles?</p>\n<div class=\"codehilite\"><pre><span></span>I could use this for the EHR priority values specified by CPIC for each PGx result, but I&#39;m not sure what I&#39;d do for the cases where there are combo diplotypes to arrive at a single result (e.g. CPY2C9 &amp; VCKORC1 for Warfarin Metabolism)\n</pre></div>\n\n\n<p>If I understand, I think you could have two Genotype findings (CYP2C9 and VCKORC1) and a single PGx impact observation that .derivesFrom() both Genotypes?</p>",
        "id": 160107952,
        "sender_full_name": "Kevin Power",
        "timestamp": 1551887942
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span> Standardizing terminologies becomes easier when they're:<br>\na) small<br>\nb) the concepts being represented are well known and standardized<br>\nThese two things together mean that even if systems aren't using the 'preferred' terminology internally, it's not an insurmountable task for them to create mappings to a standardized set of codes.  (Not that they might not grumble and complain enormously at the imposition :)).</p>\n<p>In this case, I'm pretty comfortable that we have (a).  I'm not so sure that we have (b).</p>\n<p>In any event, if we were to define a broad, relatively all-encompassing value set and then wanted to refine it for particular situations, you can certainly do that with profiles.</p>",
        "id": 160107982,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551887957
    },
    {
        "content": "<p>adding onto LLyod's comments. The danger in adopting all the various terms into a single code system is ambiguity. I think it is worthwhile to look more deeply at what the 'job' to be done is with the element and reporting of the phenotype. Is this purely for display? Or do can we see a use case for computation? If it is meant to be computed upon refer to Llyod's comments on terminologies. The same can be said for using terminologies computationally, they are easier to writing programming code to deal with when a) small, b) the concepts being represented are well known and standardized</p>",
        "id": 160108718,
        "sender_full_name": "Bret H",
        "timestamp": 1551888402
    },
    {
        "content": "<p><code>In any event, if we were to define a broad, relatively all-encompassing value set and then wanted to refine it for particular situations, you can certainly do that with profiles.</code><br>\nCan you easily summarize the mechanics of that?  I have some vague notion, but I sure could not do it today.</p>",
        "id": 160108954,
        "sender_full_name": "Kevin Power",
        "timestamp": 1551888564
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span>  use a ValueSet resource is one option</p>",
        "id": 160109115,
        "sender_full_name": "Bret H",
        "timestamp": 1551888653
    },
    {
        "content": "<p>When you define a derived profile, you can change the binding.  Specifically, you can tighten the binding strength and/or specify a different value set that reduces the set of codes in the value set.  (Actually, if the original binding was example or preferred, you can do whatever you like in the binding for a derived profile.  Also, if the original binding was 'extensible' you can add to the codes in the value set, though there are rules about what's legitimate to add and what's not.)</p>",
        "id": 160110195,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551889235
    },
    {
        "content": "<p>So, it seems we need to document all the possible values in the \"overall interp\" space into one place (might make a nice Google Doc) and then see how we might define 1..* value sets and then consider how we might derive 1..* profiles?  For each of the values, we should indicate the source and if we can use existing code systems (LOINC, SNOMED, ..)?  Does that seem like the right next step?</p>",
        "id": 160111449,
        "sender_full_name": "Kevin Power",
        "timestamp": 1551890118
    },
    {
        "content": "<p>That's a possibility.  Note that we don't necessarily need to define 1..* value sets or profiles.  Having implementers pick randomly from a semi-narrow pool of concepts will still drive more consistency than no guidance at all.  We also need to consider how much standardization the industry is willing to tolerate/can manage.</p>",
        "id": 160112601,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551890998
    },
    {
        "content": "<p>Late to the party here...  Keep in mind in the US and other countries adhering to accreditation requirements, the performing laboratory will validate the test system including how results are reported.  If a FDA 510(k) vendor system is used to generate results, responses/test result values must be in accord with the manufacturer's package insert per CLIA law in US.  Expect genomics and PgX testing to have fewer IVD vendor systems and more of a mix of Laboratory Developed Testing (LDTs), but those have to be clinically validated as well.  Ideally, these labs would use standard responses as indicated, but if they don't, their results shouldn't be changed downstream.  Concur they should be mapped to standard code systems so they can be computable and integrated into CDS, actionable, etc.</p>",
        "id": 160201918,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1551969010
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span> </p>\n<div class=\"codehilite\"><pre><span></span>If I understand, I think you could have two Genotype findings (CYP2C9 and VCKORC1) and a single PGx\nimpact observation that .derivesFrom() both Genotypes?\n</pre></div>\n\n\n<p>That's correct</p>",
        "id": 160235452,
        "sender_full_name": "Larry Babb",
        "timestamp": 1551991167
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196271\">@Andrea Pitkus, PhD, MLS(ASCP)CM, CSM</span>  When reporting with coded values the product insert does not specify which coded value to use. The lab simply needs to choose an appropriate coded value. Right?</p>",
        "id": 160290125,
        "sender_full_name": "Bret H",
        "timestamp": 1552052840
    },
    {
        "content": "<p>Correct.</p>",
        "id": 160290211,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1552052907
    },
    {
        "content": "<p>Package inserts indicate what/how results are to reported, but an IVD vendor isn't going to go through re-approval with FDA just to ass LOINCs, or other codes.  Further, their lawyers have concerns about such an approach.  This is why the LIVD standard was created to provide LOINCs corresponding to vendor results to assist lab professionals for finding what's needed for mapping in their LIS/APLIS.  It'll help standardize mappings and reduce variety of mapped LOINCs for the same result performed in labs across the world.</p>",
        "id": 160290556,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1552053178
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192123\">@Bret H</span> <br>\nhere's a random insert for a test that identifies CYP2C9 and VCKORC1  <a href=\"http://www.autogenomics.com/pdf/INFINITIWarfarinAssayPackageInsertUSA.pdf\" target=\"_blank\" title=\"http://www.autogenomics.com/pdf/INFINITIWarfarinAssayPackageInsertUSA.pdf\">http://www.autogenomics.com/pdf/INFINITIWarfarinAssayPackageInsertUSA.pdf</a></p>\n<p>See page 8 Interpretation of Results Section for the allowed responses from this particular vendor.  <br>\nOne example of how the results might look:<br>\n2C9<em>2, 2C9</em>3 and VKORC1 3673 (-1639) variants interpretation (test result field:  .................................. (test result value field) Wild Type, Homozygous, Heterozygous, or Indeterminate</p>\n<p>One would want to LOINC encode the test result field:  79716-7 CYP2C9 gene product metabolic activity interpretation in Blood or Tissue Qualitative by CPIC  <br>\nThe Test Result Values would be encoded with SCT as in the v2.51 guide for reporting results.</p>\n<p>In FHIR the interpretation would be a simple qualitative observation with the result values and the Observation Resource could be used.  It would be aligned with v2 reporting but not as much with the current CG guide.  It just dawned on me this might be an interoperability issue when folks start widescale modeling/reporting with FHIR if done differently.  Then there are those in the V2 to FHIR calls that want to \"translate\" v2 messages to FHIR.  That won't work very well with CG.  fyi  <span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span>  (may need to discuss with implementers/future call).</p>",
        "id": 160325752,
        "sender_full_name": "Andrea Pitkus, PhD, MLS(ASCP)CM, CSM",
        "timestamp": 1552079265
    },
    {
        "content": "<p>Yup, your concern is the whole reason it made sense to have CG rep's on the V2-TO-FHIR projects.  It hasn't come up yet in any of the calls, as they are still working at a really low level.  I don't think they have gotten even close to discussing lab results yet.</p>",
        "id": 160330850,
        "sender_full_name": "Kevin Power",
        "timestamp": 1552083269
    },
    {
        "content": "<p>the narrative text can be a place for the specific product insert wording - whereas the fields in the instance data have the appropriate codes.</p>",
        "id": 161160475,
        "sender_full_name": "Bret H",
        "timestamp": 1553009238
    },
    {
        "content": "<p>andrea said: \"See page 8 Interpretation of Results Section for the allowed responses from this particular vendor. <br>\nOne example of how the results might look:<br>\n2C92, 2C93 and VKORC1 3673 (-1639) variants interpretation (test result field: .................................. (test result value field) Wild Type, Homozygous, Heterozygous, or Indeterminate</p>\n<p>One would want to LOINC encode the test result field: 79716-7 CYP2C9 gene product metabolic activity interpretation in Blood or Tissue Qualitative by CPIC <br>\nThe Test Result Values would be encoded with SCT as in the v2.51 guide for reporting results.\"</p>\n<p>Not sure what the problem is. A reporter could also fill in the correct sections of the CG WG profiles and use the generic LONC code as in the IG. The question is for labs to value filling in the CG IG profile. The same issues have kept the HL7v2 genomics work from being adopted. We can give guidance and then recipients of messages need to value receiving the message in a specific format. Also, there is nothing in the base FHIR spec from a system receiving the data in a precoordinated  model (basic observation) and sending data to other systems with the more post-coordinated model ( CG IG).</p>\n<p>HL7v2 is not law but a precedence...if it were perfect then why are we moving away from it?</p>",
        "id": 161160827,
        "sender_full_name": "Bret H",
        "timestamp": 1553009473
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span> <span class=\"user-mention\" data-user-id=\"192329\">@Larry Babb</span> </p>\n<blockquote>\n<p>Regarding the CPIC 'EHR Priority Result Notation' - Do you know if this happens to a LOINC code that CPIC requested?  I don't remember seeing it before, but we should check that first.</p>\n</blockquote>\n<p>For the record, the EHR priority result flag was included in the CPIC guidelines for two reasons: 1) as a way for the lab to flag \"abnormal\" results, and 2) to provide a trigger criterion for CDS logic.  (I happen to think the latter is a bad idea.)</p>",
        "id": 165110372,
        "sender_full_name": "Bob Freimuth",
        "timestamp": 1557262604
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"192198\">@Bob Freimuth</span>  - Is it worth having as it's own component value in our PGx related Observation?</p>",
        "id": 165113025,
        "sender_full_name": "Kevin Power",
        "timestamp": 1557264514
    }
]