[
    {
        "content": "<p>eMERGE and other clinical genetic test results have a comments or additional notes section with case specific information. These comments are not really recommendations, conclusions or observations. They are additional information that the reporting lab wants to provide the ordering physician and patient related to the outcomes related overall or to some grouped set of results.</p>\n<p>We would like to have the flexibility of identifying these zero to many (0..*) comment blurbs at the DiagnosticReport, Observation and/or Observation Grouper levels.  </p>\n<p>We see the availability of the Observation.note:Annotation and feel it may be a good candidate, but are not sure how we might distinguish notes that are \"comments\" from notes that might be for other purposes (maybe this should not be a worry if we dedicate \"note\" for only comments?).  There doesn't seem to be a good answer for DiagnosticReport.  </p>\n<p>Our other thought was an \"extension\" for \"comments\" similar to supporting-info (which we don't think is the right fit). </p>\n<p>Finally, we thought that maybe we should create a \"special\" Observation profile for \"comments\".</p>\n<p>In any case, we'd love to hear how CG WG would address this requirement.  Any help would be greatly appreciated.</p>",
        "id": 168446843,
        "sender_full_name": "Larry Babb",
        "timestamp": 1560885775
    },
    {
        "content": "<blockquote>\n<p>We would like to have the flexibility of identifying these zero to many (0..*) comment blurbs at the DiagnosticReport, Observation and/or Observation Grouper levels.  </p>\n</blockquote>\n<p>Usually the question that is asked:  If a query was done, and the only thing returned was this \"blurb\" - would it be useful by itself?  Or, to be useful, does this blurb need to be delivered along with the thing the blurb is related too (a Variant or an Implication let's say)?  That will first help us answer if it should be its own instance of some resource first.</p>\n<p>Given your comments, I think the answer is that the context is important.</p>",
        "id": 168450369,
        "sender_full_name": "Kevin Power",
        "timestamp": 1560888252
    },
    {
        "content": "<p>I believe Lloyd said Observation.note is intended to be notes \"about\" the Observation and shouldn't really contain content. I think the most natural place for this would be a component (with valueString) on OverallInterpretation or on Grouper.</p>",
        "id": 168458640,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1560894659
    },
    {
        "content": "<p>I do concur on the note - that doesn't seem quite right.</p>\n<p>If the blurp is always related to one and only one of our Observations, then a component on almost every profile would make sense.  The component just on Overall Interp and/or Grouper would also make sense if the blurps are related to multiple other observations.</p>",
        "id": 168460055,
        "sender_full_name": "Kevin Power",
        "timestamp": 1560895894
    },
    {
        "content": "<p>Thanks guys. Very helpful. We will avoid using note as we were unsure about it use until now.<br>\nThese \"comments\" or \"additional notes\" are important to convey, but have not evolved to the point of being able to structure or codify by the labs and providers yet. (seems like there's bigger fish to fry at this point).  However, it does seem like the downstream systems would want to query the diagnostic report or observation grouper (and possibly any observation) and ask whether there are any additional comments or notes provided by the service provider. Granted this wouldn't be very useful in a computational algorithm but it would enable the downstream applications to send it to a UI or report for human consumption. I think that's all we are asking for at this point.</p>\n<p>I'll look into the component option, and likely add this to our emerge solution. Since component is not an option on the Diagnostic Report, we will presume that all \"comments\" will need to be expressed at an observational level. This may force our hand at always providing a \"grouper\" just for the mere fact that we may want \"comments\" on the overall report.  This continues to surface the need for more flexibility at the DiagnosticReport level for things like this (I think). Either that or treating this \"comment\" like a separate observation that could be tied to the DR or a group and not limited to the component option that is always dependent on another type of observation.  (I do wish there was some more straight forward way to handle this kind of thing).</p>",
        "id": 168593308,
        "sender_full_name": "Larry Babb",
        "timestamp": 1561036076
    },
    {
        "content": "<p>This would make a fine question to <a class=\"stream\" data-stream-id=\"179256\" href=\"/#narrow/stream/179256-Orders-and-Observation-WG\">#Orders and Observation WG</a> if you want some other perspectives?</p>",
        "id": 168624178,
        "sender_full_name": "Kevin Power",
        "timestamp": 1561057223
    },
    {
        "content": "<p>Hi,<br>\nduring todays call we discussed <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=20978\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=20978\">GF#20978</a> and <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=19827\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=19827\">GF#19827</a> both submitted by <span class=\"user-mention\" data-user-id=\"196626\">@Mullai Murugan</span></p>",
        "id": 172055158,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1564505615
    },
    {
        "content": "<p>*wanted to discuss. We skipped our discussion as these two issues were originating from the emerge project.</p>",
        "id": 172055301,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1564505707
    },
    {
        "content": "<p>I personally see a pattern with comments, additional methodology or additional textual interpretations  information. These all should be able to be attached/pointing to an Observation, group of Observations  or the Report.<br>\nThey have a textual part, maybe an author, maybe a timestamp and a Coding expressing if this is additional method text, textual interpretation and so on.<br>\nSo this could be done by a FHIR document with a composition pointing to the Observations and Diagnostic reports but i think this would be a wrong usage of a document, as the section.text is meant as an human-readable narrative and not as a container for extra text parts.</p>",
        "id": 172056554,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1564506501
    },
    {
        "content": "<p>At first i was looking at the related artifact Extension, but it is focused on citations to support your findings.</p>",
        "id": 172056619,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1564506553
    },
    {
        "content": "<p>To also face the problem that if you use a component or Observation.note you can't use it on DR i would lean towards an Extension like dr-relatedArtifact.<br>\nBut with the datatype Annotation, and a coded type expressing: method|comment|interpretion.....</p>",
        "id": 172057186,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1564506974
    },
    {
        "content": "<p>This then can be attached to Observation, the Grouper or the Diagnostic Report</p>",
        "id": 172057207,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1564506997
    },
    {
        "content": "<p>long story short: CG also needs this and it would be ideal to come up with a compatible solution for emerge as well.</p>",
        "id": 172057265,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1564507066
    },
    {
        "content": "<p>Also tagging <span class=\"user-mention\" data-user-id=\"209510\">@Larry Babb</span> -- would be helpful for Larry or <span class=\"user-mention\" data-user-id=\"196626\">@Mullai Murugan</span> to comment on what they landed on in the short term for eMERGE.</p>",
        "id": 172058126,
        "sender_full_name": "Kevin Power",
        "timestamp": 1564507706
    },
    {
        "content": "<p>about the comment extension<br>\nemerge is defining its own extension for comments which can be applied to observations and diagnosticreports. I originally thought of using Narrative but decided to keep it simple and stick with datatype \"string\".  We can use your extension if you provide one in the near future.</p>\n<p>regarding the textual interpretations - we are creating a separate extension for that as well - again as \"string\".  </p>\n<p>regarding methodology we are using the PlanDefinition and its action[] array to describe the genetic test panels and their methodology steps in a way that will be consistent across multiple instances of DRs &amp; ServiceRequests for the same test definition.</p>",
        "id": 172070717,
        "sender_full_name": "Larry Babb",
        "timestamp": 1564516579
    },
    {
        "content": "<blockquote>\n<p>We can use your extension if you provide one in the near future.</p>\n</blockquote>\n<p>I made a quick scratch:<br>\n<a href=\"https://simplifier.net/patrickssandbox/comment\" target=\"_blank\" title=\"https://simplifier.net/patrickssandbox/comment\">https://simplifier.net/patrickssandbox/comment</a></p>\n<p><a href=\"/user_uploads/10155/YjR1DRR9HkGYGGqOvqmRwA2F/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/YjR1DRR9HkGYGGqOvqmRwA2F/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/10155/YjR1DRR9HkGYGGqOvqmRwA2F/pasted_image.png\"></a></div>",
        "id": 172113240,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1564566492
    },
    {
        "content": "<p>so this is a complex extension containing the type to express what kind of comment it is (needs a binding), and a Annotation datatype.<br>\nSo this is basically Observation.note, but with a type and applicable for Observations and DiagnosticReports</p>",
        "id": 172113365,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1564566655
    },
    {
        "content": "<p>This alligns with my tracker: <a href=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=22102\" target=\"_blank\" title=\"http://gforge.hl7.org/gf/project/fhir/tracker/?action=TrackerItemEdit&amp;tracker_item_id=22102\">GF#22102</a> asking for a type inside of Annotation. Will ask O&amp;O once more on a opinion on this.</p>",
        "id": 172113577,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1564566888
    },
    {
        "content": "<p>also asked O&amp;O on their opinion: <a href=\"#narrow/stream/179256-Orders-and.20Observation.20WG/topic/Notes.20on.20Observations.20and.20DR/near/172114099\" title=\"#narrow/stream/179256-Orders-and.20Observation.20WG/topic/Notes.20on.20Observations.20and.20DR/near/172114099\">https://chat.fhir.org/#narrow/stream/179256-Orders-and.20Observation.20WG/topic/Notes.20on.20Observations.20and.20DR/near/172114099</a></p>",
        "id": 172114160,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1564567443
    },
    {
        "content": "<p>rob replied and asked for examples. As our examples are german could the eMerge project provide an example of an report and the textual parts which are added as comments?</p>",
        "id": 172120610,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1564574631
    },
    {
        "content": "<p>One of the 2 sequencing centers uses the caption \"Additional Notes\" which we discussed are similar to \"Comments\" and we are considering the same. So your \"type\" and bindings should provide the nice option to discern when the comments are general or additional or whatever...</p>\n<p>I'm not sure we (emerge) needs the Annotation type since it is not necessarily important to track the author making the comments, but I don't think it will hurt if we don't use it.</p>\n<p>Here's some example blurbs from an actual reports along with the report heading they are shown within by each sequencing lab...</p>\n<p>Addtional Note 1<br>\nDisease penetrance and severity can vary due to modifier genes and/or environmental factors. The significance of a variant should therefore be interpreted in the context of the individual's clinical manifestations.</p>\n<p>Additional Note 2<br>\nVariants of unlikely clinical significance are not included on eMERGE reports but can be shared separately. Please note that variant classifications may change over time if more information becomes available. Please contact us at xxx-xxx-xxxx or <a href=\"mailto:xxx@xxx.xxx\" title=\"mailto:xxx@xxx.xxx\">xxx@xxx.xxx</a>.</p>\n<p>Additional Note 3<br>\nWe cannot exclude the presence of a variant in the following gene(s) due to &lt;95% coverage at 20x*: KCNQ1 (94.7%), ....</p>\n<ul>\n<li>Additional information (gene and variant lists as well as reference sequence) available at <a href=\"http://lab.hostname.org/xxx/\" target=\"_blank\" title=\"http://lab.hostname.org/xxx/\">http://lab.hostname.org/xxx/</a>.</li>\n</ul>\n<p>Comments <br>\nIt is recommended that correlation of these findings with the clinical phenotype be performed. Genetic counseling for the<br>\npatient and at-risk family members is recommended.</p>\n<p>Let me know if you need more examples.</p>",
        "id": 172136688,
        "sender_full_name": "Larry Babb",
        "timestamp": 1564586380
    },
    {
        "content": "<p>thanks Larry, we will talk about this topic in todays CG call</p>",
        "id": 172593879,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1565101931
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> how is this coming along?  I spoke with Clem McDonald and we discussed whether I was supportive of this approach for the \"Summary Interpretation\" and \"Comments\" extensions we have developed for our eMERGE project. Clem and I have seen a very consistent need for \"interpretation text\" at an observation level in most (if not all) clinical test results we've reviewed over the years.  Clem thinks that it may be cleaner to have precisely named extension element for this field on the Observation class. We also see \"Comments\" and \"Notes\" on the report with information that may or may not be case specific (usually has some context to the case). While these comments and notes are not \"results\" they are pretty common and would be helpful to structure in a discrete way in the returned DR message. </p>\n<p>I'm a bit on the fence as I do not want to presume we can cleanly define all the various types of annotations that labs will make or want to make on reports and at various levels within the reports.  I'm thinking it may be more prudent to take the approach you are advocating with the designed type/annotation extension above.  This will allow implementers to begin devising \"type\" codes that fit their needs and over time we may see patterns that warrant more of a \"first class\" named element change.</p>\n<p>This is tricky stuff as it is nearly impossible to predict the use. But it is very clear to me that there is a need for labs to create annotations and discriminate between the types so that the consuming systems can identify and use them appropriately.</p>\n<p>Please share any advances you are making with this extension. I will try to model it for pilot use in our work if it helps us avoid having to manage 2 or 3 new extensions that have similar patterns.</p>\n<p>Let Clem and the group know that I'm happy to come and discuss this at one of the meetings. Or even present the current state of the emerge implementation guide.<br>\nThanks.</p>",
        "id": 173659966,
        "sender_full_name": "Larry Babb",
        "timestamp": 1566309405
    },
    {
        "content": "<p>Are these all disclaimer types of information? Or are they vital to clinically interpret the result? <span class=\"user-mention\" data-user-id=\"209510\">@Larry Babb</span>  How does emerge indicate the difference?</p>",
        "id": 173762517,
        "sender_full_name": "Bret H",
        "timestamp": 1566359620
    },
    {
        "content": "<p>thanks <span class=\"user-mention\" data-user-id=\"209510\">@Larry Babb</span> for the examples. I copied them to the O&amp;O discussion of this topic:</p>",
        "id": 173777172,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1566379064
    },
    {
        "content": "<p><a href=\"#narrow/stream/179256-Orders-and.20Observation.20WG/topic/Notes.20on.20Observations.20and.20DR/near/173777260\" title=\"#narrow/stream/179256-Orders-and.20Observation.20WG/topic/Notes.20on.20Observations.20and.20DR/near/173777260\">https://chat.fhir.org/#narrow/stream/179256-Orders-and.20Observation.20WG/topic/Notes.20on.20Observations.20and.20DR/near/173777260</a></p>",
        "id": 173777268,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1566379146
    },
    {
        "content": "<p>The labs that include these \"comments/notes\" and \"disclaimers\" have different motivations for each, and they don't necessarily all treat them the same way. So, it is not something that is easily put into a neat model.</p>\n<p>Regarding Comments and Additional Notes...<br>\nThe labs, often and frequently want to add comments or notes that are case specific and don't have the weight of an observed result that can be codified and formalized. It can range from additional information about the testing process, the sample,  the assessment data, etc.. It may be informative for one of several identified and assessed variants or a general statement about a subset or all of them together. <br>\nHowever, the lab may provide general information, suggestions or guidance to the patient and physician as well.</p>\n<p>Regarding Disclaimers...<br>\nThere is really only one that I am familiar with that most labs put on their reports (it is likely a CLIA requirement - but I am not certain). The disclaimer is not case specific. The particular disclaimer I need to call out is about a class of test types (lab-defined genetic tests). I believe each lab can write it in their own words but it must contain similar meaning and there may be some required phrasing (again, not sure).  So the disclaimer is really on the report or the test definition - possibly. I ended up placing it on the report, as there is no good place within the PlanDefinition (which i am using to describe the test performed) to add a \"disclaimer\".</p>",
        "id": 173791331,
        "sender_full_name": "Larry Babb",
        "timestamp": 1566392561
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191451\">@Patrick Werner</span> as I'm thinking more and more about your Annotation extension, I'm wondering how it will be more formally defined.  Is it meant to be treated as an \"annotation\" on the DR or Observation from which it will extend?  If so, I'm not sure these comments/notes/disclaimers are really \"annotations\". I could be confused about what an annotation truly means and the way it will be described herein. If the annotation behaves like an element of the Observation and DR then I'm okay with it. If it behaves more like a secondary or external statement or assertion about the DR or Observation then it will not work for my purposes. </p>\n<p>If this Annotation extension is seen as a useful extension for the purposes described herein, then why wouldn't it be used for things like supporting info and recommendations, etc..?  In a way, these are very similar to the pattern I am looking for for comment/notes, disclaimer and also interpretation summaries.  </p>\n<p>Sorry if I'm getting way off track. I could use some help figuring out if I should be investing more energy into finding a common solution with this approach. I only have so much time to devote to these things and I must make progress.</p>",
        "id": 173792062,
        "sender_full_name": "Larry Babb",
        "timestamp": 1566393118
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"209510\">@Larry Babb</span> - You may want to comment on the thread Patrick referenced in the O&amp;O Stream:<br>\n<a href=\"#narrow/stream/179256-Orders-and.20Observation.20WG/topic/Notes.20on.20Observations.20and.20DR\" title=\"#narrow/stream/179256-Orders-and.20Observation.20WG/topic/Notes.20on.20Observations.20and.20DR\">https://chat.fhir.org/#narrow/stream/179256-Orders-and.20Observation.20WG/topic/Notes.20on.20Observations.20and.20DR</a></p>\n<p>I think the general consensus of the CG group right now is that this should be a more general solution, and not something specific to CG.  So it will likely come up through O&amp;O, but hopefully with our input and guidance.  So any feedback we can give will help develop a solution that will work for us.</p>",
        "id": 173796350,
        "sender_full_name": "Kevin Power",
        "timestamp": 1566395964
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191913\">@Kevin Power</span> I read the OO thread. And it seems to be forming and shaping into something that will partially solve my needs. I think for now emerge will continue with our own extensions. I just seems like it provides us the control we need to get to a final and complete solution even though most it will need to change later based on how these developments go. I do agree with Lloyd's clarification on Annotation - it didn't really sit right with me as well and he helped clarify why.  Somehow \"Disclaimer\" got lost along the way (I think) - this is not a note or interpretationNote or Annotation either I suspect. </p>\n<p>And I'm still not sure how this new solution (using Observation.component) will work for the ObsGrouper profile. We do have the need to put summary interpretation text/notes on the collection of observations that fall under a group.  If Lloyd is suggesting that we can do an interpretationNote extension on the DR, then could we also do it on the ObsGrouper (since it acts much like an sub-report for organizational purposes)?</p>\n<p>I wish I had the time and energy to get more involved in all the various threads and groups to assure that the needs I'm seeing in the real world will be handled well.</p>",
        "id": 173798284,
        "sender_full_name": "Larry Babb",
        "timestamp": 1566397316
    },
    {
        "content": "<p>I think <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> suggests the notes at the DR level because they are meaningful to have there, but was also implying that if you want consumers to reliably find those notes when viewing any particular result Observations, the information also has to be on (or referenced on) the Observations themselves. It can't be assumed a system will go back up to the report and then find the disclaimer from there. The situation should be the same as with Grouper Observations, unless there's a caveat I'm missing.</p>",
        "id": 173801570,
        "sender_full_name": "Jamie Jones",
        "timestamp": 1566399314
    },
    {
        "content": "<p>That's correct.  Information on the DiagnosticReport cannot be inferred to apply to the Observations pointed to by the DiagnosticReport (and downstream systems might have access to the Observations (e.g. a particular variant assertion), but not the DiagnosticReport that Observation was originally a part of.</p>",
        "id": 173801967,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1566399575
    },
    {
        "content": "<p>that makes sense and is fine for this use case. these summary notes on groups of observations (or for the entire set of observations) should not live with the individual observations since the context would be lost in relation to the set of observations the note is intended to cover. I plan on applying this extension to both DR and Observation Grouper (obsGrouper) and Observations in general so that labs can place notes where ever they see fit.</p>",
        "id": 173834992,
        "sender_full_name": "Larry Babb",
        "timestamp": 1566424155
    }
]