[
    {
        "content": "<p>Why is subject not a requirement on the obs-comp-finding profile ? I see that specimen is required, but then subject is not required on specimen, so there is still the potential to not end up being able to affiliate the finding with the patient.</p>\n<p>Is there some reasoning that goes behind the decision to make certain attributes required and not others?</p>\n<p>Can someone explain the logic behind requiring specimen on the genotype/haplotype/variant parent profile obs-comp-findings but not requiring subject on profiles like the obs-medication-implication?</p>",
        "id": 165089832,
        "sender_full_name": "Larry Babb",
        "timestamp": 1557248300
    },
    {
        "content": "<p>Generally because sometimes testing is done without any knowledge of who the patient is - all you've got is a specimen with a specimen id.  The linking back to the patient is handled back in the ordering system.</p>",
        "id": 165092586,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1557250350
    },
    {
        "content": "<p>That makes sense to me. </p>\n<p>In the documentation (see below) both the <strong>Requirements</strong> - <em>Observations have no value if you don't know who or what they're about.</em>   and the second sentence in the <strong>Comments</strong> -  <em>... The only circumstance in which the subject can be missing is when the observation is made by a device that does not know the patient. ...</em> make it seem like it should always be used when available. I'm seeing genomics DR examples that don't have it - so I was wondering why.</p>\n<p>Maybe your note about how sometimes testing is done without any knowledge of who the patient is... should be added to the docs to help accentuate that it is really important and should only be left out when truly not available. </p>\n<p>Thanks.</p>\n<blockquote>\n<p><strong>Observation.subject</strong><br>\n<strong>Element Id</strong> Observation.subject<br>\n<strong>Definition</strong> <br>\nThe patient, or group of patients, location, or device this observation is about and into whose record the observation is placed. If the actual focus of the observation is different from the subject (or a sample of, part, or region of the subject), the focus element or the code itself specifies the actual focus of the observation.</p>\n<p><strong>Cardinality</strong>    0..1<br>\n<strong>Type</strong>   Reference(Patient | Group | Device | Location)<br>\n<strong>Requirements</strong>   Observations have no value if you don't know who or what they're about.</p>\n<p><strong>Summary</strong>    true<br>\n<strong>Comments</strong>   <br>\nOne would expect this element to be a cardinality of 1..1. The only circumstance in which the subject can be missing is when the observation is made by a device that does not know the patient. In this case, the observation SHALL be matched to a patient through some context/channel matching technique, and at this point, the observation should be updated.</p>\n</blockquote>",
        "id": 165106622,
        "sender_full_name": "Larry Babb",
        "timestamp": 1557260063
    },
    {
        "content": "<p>Feel free to submit a change request</p>",
        "id": 165119217,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1557270089
    }
]