[
    {
        "content": "<p><strong>2021 Annual Value Set Update Cycle has Started for C-CDA R2.1</strong></p>\n<p>On March 4, 2021, Structured Documents WG announced it has begun the annual update of value sets used by templates defined in C-CDA R2.1 and its companion and supplemental implementation guides (IGs). This includes the value sets used in the following IGs:</p>\n<ol>\n<li>HL7 Implementation Guide for CDA® Release 2: Consolidated CDA Templates for Clinical Notes (US Realm) Draft Standard for Trial Use Release 2.1</li>\n<li>HL7 C-CDA Templates for Clinical Notes R2.1 Companion Guide, Release 2</li>\n<li>HL7 C-CDA Templates for Clinical Notes R2.1 Companion Guide, Release 2 Appendix A</li>\n<li>HL7 C-CDA Templates for Clinical Notes R2.1 Companion Guide, Release 2 Appendix B UDI</li>\n<li>HL7 C-CDA Templates for Clinical Notes R2.1 Companion Guide, Release 2 Appendix C Provenance</li>\n<li>HL7 CDA® R2 Implementation Guide: C-CDA R2.1 Supplemental Templates for Pregnancy Status, Release 1 – US Realm</li>\n<li>HL7 CDA® R2 Implementation Guide: C-CDA R2.1 Supplemental Templates for Nutrition, Release 1 - US Realm</li>\n<li>HL7 CDA® R2 Implementation Guide: C-CDA R2.1 Supplemental Templates for Infectious Disease, Release 1, STU 1 - US Realm</li>\n<li>HL7 CDA® R2 Implementation Guide: Consolidated CDA Templates for Clinical Notes; Occupational Data for Health Release 1.1 – US Realm</li>\n</ol>\n<p>This year the C-CDA value set annual update also will be identifying value sets aligned with the value sets used in US Core profiles for draft USCDI V2 data elements.  If you have interest or prior mapping work in this area which you would like to contribute to this analysis, it would be appreciated.</p>\n<p>The work will be discussed during the weekly SDWG calls on Thursday from 10am - noon ET.  The task force doing the analysis and updates also meets on Tuesdays 4pm-5pm ET.  A C-CDA Value Set Update for 2021 Confluence page has been established for this aspect of the C-CDA project. SDWG is tentatively targeting the new value set expansion release package to be published on the NLM Value Set Authority Center in August 2021.</p>\n<p>Terminology issues reported through JIRA for these specifications before April 13th, 2021 will be considered for this update cycle.  If you have questions, please contact Lisa Nelson (<a href=\"mailto:Lnelson@max.md\">Lnelson@max.md</a>).</p>",
        "id": 230246712,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1615737321
    }
]