[
    {
        "content": "<p>Hi, We are looking for an option to convert C-CDA (CCD) to FHIR document/bundle. We are specifically looking at C-CDA on FHIR R4 IG (<a href=\"http://build.fhir.org/ig/HL7/ccda-on-fhir-r4/branches/master/index.html\" title=\"http://build.fhir.org/ig/HL7/ccda-on-fhir-r4/branches/master/index.html\">http://build.fhir.org/ig/HL7/ccda-on-fhir-r4/branches/master/index.html</a>). Wondering if we can get the mapping document for CCDAonFHIRContinuityOfCareDocument and XSLTs</p>",
        "id": 192452100,
        "sender_full_name": "Bosky Mathew",
        "timestamp": 1585690068
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191407\">@Rick Geimer</span> <span class=\"user-mention\" data-user-id=\"191505\">@Sean McIlvenna</span>   Rick can you help us with this?</p>",
        "id": 193465164,
        "sender_full_name": "Linda",
        "timestamp": 1586445718
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191924\">@Linda</span> <br>\nI'm discussing this with Rick. Hopefully will have a response to you soon</p>",
        "id": 193962958,
        "sender_full_name": "Sean McIlvenna",
        "timestamp": 1586902106
    },
    {
        "content": "<p>The R4 transforms are not ready yet. We will likely dig into updating and testing them for the R4 version of C-CDA on FHIR after the spec itself has been published, which should be soon.</p>",
        "id": 194325247,
        "sender_full_name": "Rick Geimer",
        "timestamp": 1587052053
    },
    {
        "content": "<p>AllergyIntolerance transform C-CDA --&gt; FHIR Question/opinion request. In CDA and carried forth into C-CDA entry templates we allow multiple authors. Why we did that is a another question. In FHIR in general, and specifically in, AllergyIntorerance, 0..1 Recorder is allowed. (Makes sense). So, if you have a C-CDA AllergyIntolerance Instance with 2 different authors - with the same date. How do you transform? 1) Create 2 Allergy Intolerance instances each with its own unique recorder derived from the 2 authors in the C-CDA instance<br>\n2) Create a second FHIR VERSION of the same resource instance with the different versions containing unique recorder derived from the 2 authors in the C-CDA instance. Leveraging the metadata data type  in the AllergyIntolerance Resource:  <a href=\"http://hl7.org/fhir/R4/resource.html#Meta\" title=\"http://hl7.org/fhir/R4/resource.html#Meta\">http://hl7.org/fhir/R4/resource.html#Meta</a> ?? <span class=\"user-mention\" data-user-id=\"191407\">@Rick Geimer</span> , <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> ??</p>",
        "id": 194469368,
        "sender_full_name": "Gay Dolin",
        "timestamp": 1587142473
    },
    {
        "content": "<p>Do entries with multiple authors exist in the wild? If not, this could be a technical correction to C-CDA...</p>",
        "id": 194487939,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1587151187
    },
    {
        "content": "<p>If you have actual data that looks like that, you'd have to figure out what the intention was.  If you have no clue, I'd pick one as the recorder and capture the other as an extension.  I wouldn't recommend duplicating the allergy just to keep both recorders as core elements.</p>",
        "id": 194489355,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1587151909
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192685\">@Vassil Peytchev</span>  Yes - they do exist in the wild - just saw one today and is why I am asking. Plus both base CDA and C-CDA templates have persisted 0...* authors.  <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> - correct - no clue. Thanks for the advice- capturing the other as an extension - that was one thing we thought of as well - but wasn't sure that would be OK.  An aside: Should I have posted this toe the CDA to FHIR stream instead?</p>",
        "id": 194490093,
        "sender_full_name": "Gay Dolin",
        "timestamp": 1587152294
    },
    {
        "content": "<p>That's probably the best place for questions about mapping back and forth as it's where most folks looking for that sort of guidance will tend to search to find it</p>",
        "id": 194490663,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1587152619
    }
]