[
    {
        "content": "<p>I've devoured the internet on this subject and have yet to find a straight answer.  Does the CCD use case meet the certification requirements for CEHRT.  For the individual elements, I believe it does.  But, for the CCD, it appears that you do not provide coded data for the individual sections, but instead just include references along with human readable text, which seems like it would force the system to make further calls to retrieve the individual coded information.  Does this meet the certification criteria \"Enable a user to receive a transition of care / referral summary formatted in accordance with the standards adopted in 170.205 a 3 and 170.205 a 4...\"</p>",
        "id": 206019544,
        "sender_full_name": "Jason Wright",
        "timestamp": 1596632884
    },
    {
        "content": "<p>Which CCD are you referring to? The CCD is one of the document types in the C-CDA Implementation Guide. All the document types include information where Entries (coded information) are required or optionally available.</p>",
        "id": 206024876,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1596635923
    },
    {
        "content": "<p>The one found here:<br>\n<a href=\"http://hl7.org/fhir/us/ccda/2016Sep/StructureDefinition-ccda-ccd-composition.html\">http://hl7.org/fhir/us/ccda/2016Sep/StructureDefinition-ccda-ccd-composition.html</a></p>\n<p>Unless I am misunderstanding it, with this document, you only send references to the other FHIR resources.</p>",
        "id": 206025145,
        "sender_full_name": "Jason Wright",
        "timestamp": 1596636053
    },
    {
        "content": "<ol>\n<li>In order to satisfy the CEHRT requirements, you need to support the <a href=\"http://www.hl7.org/implement/standards/product_brief.cfm?product_id=492\">C-CDA Implementation Guide</a> - it also has a <a href=\"http://www.hl7.org/implement/standards/product_brief.cfm?product_id=447\">companion guide</a></li>\n<li>The current C-CDA on FHIR implementation guide is <a href=\"http://hl7.org/fhir/us/ccda/\">here</a>, however, as far as I understand, it does not meet the requirements that you reference.</li>\n</ol>",
        "id": 206081315,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1596663362
    }
]