[
    {
        "content": "<p>Hello,<br>\nCan somebody guide me in mapping the element primarySource in Immunization resource in FHIR to the C-CDA template of Immunization activity. If the performer is present in the Immunization activity template AND the performer is same as the author present in the immunization activity template then can it be assumed that the primarySource can be marked as 'true'? Is there any other approach -please share. Thank you.</p>",
        "id": 204167562,
        "sender_full_name": "Tushar Nair",
        "timestamp": 1594956861
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"194285\">Tushar Nair</span> <a href=\"#narrow/stream/179311-C-CDA/topic/Immunization.2EprimarySource.20in.20C-CDA/near/204167562\">said</a>:</p>\n<blockquote>\n<p>Hello,<br>\nCan somebody guide me in mapping the element primarySource in Immunization resource in FHIR to the C-CDA template of Immunization activity. If the performer is present in the Immunization activity template AND the performer is same as the author present in the immunization activity template then can it be assumed that the primarySource can be marked as 'true'? Is there any other approach -please share. Thank you.</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>  , not sure if  I have posted the query in the wrong stream. Can you guide me - if this query belongs here or not. Thanks.</p>",
        "id": 204382408,
        "sender_full_name": "Tushar Nair",
        "timestamp": 1595213776
    },
    {
        "content": "<p>You're in the right place.  <span class=\"user-mention\" data-user-id=\"192205\">@Lisa Nelson</span> <span class=\"user-mention\" data-user-id=\"191407\">@Rick Geimer</span> ?</p>",
        "id": 204433595,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1595257404
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192205\">@Lisa Nelson</span> , <span class=\"user-mention\" data-user-id=\"191407\">@Rick Geimer</span> , please help/advise.</p>",
        "id": 205553373,
        "sender_full_name": "Tushar Nair",
        "timestamp": 1596164371
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194285\">@Tushar Nair</span> Immunization.primarySource is an element in a FHIR Resource. It is not a CDA element. </p>\n<p>Definition from FHIR. <br>\nElement Id  Immunization.primarySource<br>\nDefinition  <br>\nAn indication that the content of the record is based on information from the person who administered the vaccine. This reflects the context under which the data was originally recorded.  </p>\n<p>My advice:  1. check the guidance and constraints supplied for Immunization in the US Core Profile on this resource.  If no mapping guidance is supplied, then you'll have to reason through this by looking at the definitions of the participations in CDA.  My advice would be to take a look at Immunization/performer in CDA to see if that sheds light on thngs.  Another approach would be to see if the low order cardinality remains 0 in US Core Immunization.  If the field is not required and you don't have the right information to determine how it should be populated, then don't use that part of the FHIR structure.</p>",
        "id": 205581649,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1596195649
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192205\">@Lisa Nelson</span>  thank you for the inputs. I understand that it is a FHIR element. I am primarily doing this with respect to mapping USCDI elements for which Immunization USCORE profile has been specified. In the profile it's a mandatory field with cardinality 1..1. The performer element  as well as the author in the immunization activity template (C-CDA 2.1) have a cardinality of 0..1. My understanding was that the person who authored this information/event has to be the performer as well, then and only then this could be marked as 'true'. Does it make sense? If you feel that this is implementation centric and does not have a clear guidance, then I guess best thing would be to use the dataAbsent extension here.</p>",
        "id": 205977617,
        "sender_full_name": "Tushar Nair",
        "timestamp": 1596588024
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194285\">@Tushar Nair</span> I highly recommend you check out the discussions from the recent C-CDA IAT about a very related topic.  There is a lot of work and analysis here which you should consider. The topic is called Mapping Author Participation Information to FHIR US CDI Resources Derived from C-CDA Documents. The Event Notes include a full recording of this topic <a href=\"https://confluence.hl7.org/pages/viewpage.action?pageId=82911944#id-2020.07IATEventPage-EventNotes\">https://confluence.hl7.org/pages/viewpage.action?pageId=82911944#id-2020.07IATEventPage-EventNotes</a>.  We did not get as fulling into Immunizations, but with PAMPI resources in focus, we do need to focus on Immunization performers too. <span class=\"user-mention\" data-user-id=\"195703\">@David Riddle</span> This might be a good discussion to jump into.</p>",
        "id": 206577893,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1597154255
    }
]