[
    {
        "content": "<p><strong>Save the Date for March 2022 CCDA Implementation-A-Thon (IAT)</strong></p>\n<p>The next virtual C-CDA Implementation-A-Thon is scheduled for Wednesday and Thursday, March 23rd and 24th! If you have a topic you would like to know more about or to share with the community, visit <a href=\"https://confluence.hl7.org/display/IAT/Topic+Suggestions+for+2022.03+C-CDA+IAT\">https://confluence.hl7.org/display/IAT/Topic+Suggestions+for+2022.03+C-CDA+IAT</a> and we will be in touch.</p>",
        "id": 261672188,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1637082010
    },
    {
        "content": "<p>Update your calendars! The March 2022 C-CDA Implementation-A-Thon is being <strong>moved to Wednesday and Thursday March 30 and 31, 2022.</strong> </p>\n<p>To keep track of updates to the agenda for the event, check out <a href=\"https://confluence.hl7.org/display/IAT/2022.03+Virtual+IAT+Track+Agenda\">https://confluence.hl7.org/display/IAT/2022.03+Virtual+IAT+Track+Agenda</a></p>",
        "id": 269599411,
        "sender_full_name": "Natasha Kreisle",
        "timestamp": 1643301472
    },
    {
        "content": "<p>C-CDA Implementation-A-Thon Registration NOW OPEN!!     <br>\n<a href=\"https://www.hl7.org/events/c-cda/implementation/2022/03/index.cfm\">https://www.hl7.org/events/c-cda/implementation/2022/03/index.cfm</a></p>",
        "id": 270116897,
        "sender_full_name": "Dave Hamill",
        "timestamp": 1643668085
    },
    {
        "content": "<p>As we seek to strengthen the flow of information across the many communities using CDA documents to improve interoperability and accelerate health information exchange, we aim to make the C-CDA Implementation-A-Thon a place where implementers come to get and give new news about challenges, solutions, expected changes, and the roadmap forward for C-CDA.  </p>\n<p>Highlights for March 30th include:<br>\n•   Upcoming changes to support outpatient progress notes, and guidance for representing complex conditions requiring multiple qualifiers <br>\n•   Continued discussion on transforming information between C-CDA and FHIR using US Core Profiles<br>\n•   Review of guidance available for representing data elements in the draft USCDI V3 to gather implementer feedback on challenges that need to be addressed for proposed elements<br>\n•   Representation of procedures that are completed, but didn’t complete successfully<br>\n•   Introduction to the new Web IG publishing format for CDA IGs, demonstrated in the new C-CDA R2.1 SD edition</p>\n<p>It’s also a place to get updates from the ONC and answers to your questions in our session called, “Ask the ONC.” </p>\n<p>March 31st will be a full-day hands-on workshop where participants will discuss valuable scenarios for new templates defined the C-CDA R2.1 Companion Guide. We’ll discuss ballot reconciliation changes impacting the C-CDA R2.1 Companion Guide and generate additional examples to serve as references that promote consistency and accelerate interoperability for USCDI V2 data elements.  </p>\n<p>This virtual event is a great investment in interoperability for your products and your organization.  Non-HL7 Member rate is $199 and the HL7 Member rate is $99 for the two-day Implementation-A-Thon. Registration information is available here: <a href=\"https://www.hl7.org/events/c-cda/implementation/2022/03/index.cfm\">https://www.hl7.org/events/c-cda/implementation/2022/03/index.cfm</a></p>",
        "id": 271862003,
        "sender_full_name": "Natasha Kreisle",
        "timestamp": 1644860738
    }
]