[
    {
        "content": "<p>Announcing the May 2020 C-CDA Implementation-A-Thon<br>\nVIRTUAL Event Information<br>\nMay 20, 2020 Wednesday noon – 5:00 pm </p>\n<p>Register: <a href=\"https://www.hl7.org/events/c-cda/implementation/2020/index.cfm\" title=\"https://www.hl7.org/events/c-cda/implementation/2020/index.cfm\">https://www.hl7.org/events/c-cda/implementation/2020/index.cfm</a></p>\n<p>Justification and Objectives: Improve consistency and quality of information representation in C-CDA exchange documents</p>",
        "id": 195694125,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1588159703
    },
    {
        "content": "<p>Confluence Site for the event:<br>\n<a href=\"https://confluence.hl7.org/pages/resumedraft.action?draftId=82903126&amp;draftShareId=16ab203e-5ac1-41b2-9c43-32267d6ee48c&amp;\" title=\"https://confluence.hl7.org/pages/resumedraft.action?draftId=82903126&amp;draftShareId=16ab203e-5ac1-41b2-9c43-32267d6ee48c&amp;\">https://confluence.hl7.org/pages/resumedraft.action?draftId=82903126&amp;draftShareId=16ab203e-5ac1-41b2-9c43-32267d6ee48c&amp;</a></p>",
        "id": 195694195,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1588159766
    },
    {
        "content": "<p>Here's the agenda for today's C-CDA Implementation-A-Thon.  Even if you can't join the call (noon -5pm ET.  We will be having some good discussions on Zulip.  </p>\n<p>It's not too late to register: <a href=\"https://www.hl7.org/events/c-cda/implementation/2020/index.cfm\">https://www.hl7.org/events/c-cda/implementation/2020/index.cfm</a></p>\n<p>C-CDA IAT Confluence Page:  <a href=\"https://confluence.hl7.org/display/IAT/2020.05.20+Virtual+IAT+Track+Agenda\">https://confluence.hl7.org/display/IAT/2020.05.20+Virtual+IAT+Track+Agenda</a></p>\n<p>Watch our minutes and action items from the event:  <a href=\"https://confluence.hl7.org/display/IAT/2020.05.20+Virtual+IAT+Event+Page\">https://confluence.hl7.org/display/IAT/2020.05.20+Virtual+IAT+Event+Page</a></p>\n<p>Time  | Topic   | Speaker(s)<br>\n12:00 - 1:00 pm | Topic 1: USCDI -Rubric Rules – Scorecard Updates  | Matt Rahn, ONC, Gay Dolin, Namaste    <br>\n1:00 - 1:45 pm | Topic 2: C-CDA for Quality Measures | Wendy Talbot, Anne Marie Smith, NCQA<br>\nBreak (30 Mins)<br>\n2:15 - 3:00 pm | Topic 3: C-CDA on FHIR and transforming C-CDA to FHIR |    Rick Geimer<br>\nBreak (15 Mins)<br>\n3:15 – 4:00 pm  | Topic 4: Top issues from CommonWell – Carequality |Joe Lamy, Aegis<br>\n4:00 - 4:45pm   | Topic 5: New format for Implementer Led IATs | Jean Duteau<br>\n4:45 - 5:15pm   | Feedback, Questions, and Parting Thoughts | Jean Duteau</p>",
        "id": 198178002,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1589969837
    },
    {
        "content": "<p>Welcome to the C-CDA IAT.  If you would like to start discussions, please use Zulip in this thread.</p>",
        "id": 198220194,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1589990664
    },
    {
        "content": "<p>C-CDA Rubric Rule informative document just published yesterday.</p>\n<p>You can download the document from <a href=\"http://HL7.org\">HL7.org</a> from two different places:</p>\n<ol>\n<li>\n<p>the C-CDA Product Page:<br>\n<a href=\"http://www.hl7.org/implement/standards/product_brief.cfm?product_id=492\">http://www.hl7.org/implement/standards/product_brief.cfm?product_id=492</a></p>\n</li>\n<li>\n<p>the HL7 Master Grid<br>\n<a href=\"http://www.hl7.org/implement/standards/product_brief.cfm?product_id=534\">http://www.hl7.org/implement/standards/product_brief.cfm?product_id=534</a></p>\n</li>\n</ol>",
        "id": 198220867,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1589990941
    },
    {
        "content": "<p>Is it clear why Referral Note is not in the list of Clinical Notes?</p>\n<p>We are using the Referral Note document to carry the information used when making a referral.  This can be a referral to another care provider or to a community based organization that might perform social care services.  The document can carry clinical information but its focus in supplying information needed to initiate a referral.  </p>\n<p>I think that may be why the USCDI doesn't include the Referral Note in the data class called \"Clinical Notes\".</p>\n<p>Sounds like the Clinical Notes Data class is only referring to types of Clinical Notes sections in a C-CDA document.  Despite the close naming correspondences,  this data class is not about a whole Clinical Note Document.</p>",
        "id": 198224035,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1589992433
    },
    {
        "content": "<p>Does the Score Card require an EXACT MATCH on the display name to the preferred term of the code in the code system?  For example, if the preferred term was \"Food insecurity (finding)\" and the displayName was populated with \"Food Insecurity (finding)\" would that be an error (capitalization doesn't match)?</p>\n<p>What if the displayName was populated with \"Food insecurity\" would that be an error (left off the hierarchy)?</p>",
        "id": 198224433,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1589992619
    },
    {
        "content": "<p>New Score Card COMING SOON.....</p>\n<p>On June 1, 2020 there will be a new Score Card available. sitenv.or/ccda-smart-scorecard  <br>\nThe downloadable version of the tool also will be updated.</p>\n<p>The Confluence page for the Rubric Criteria Project Page includes a place where Criteria Suggestions can be made.</p>",
        "id": 198225438,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1589993105
    },
    {
        "content": "<p>Six implementers attending the C-CDA IAT are already experimenting with creation of FHIR Documents.</p>",
        "id": 198240407,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1590000200
    },
    {
        "content": "<p>We'd like there to be some discussion on how a system should incrementally move towards FHIR. I.e. start with basic context-free queries to replace need for CCDs, while keeping encounter summaries in a document form, incrementally moving from C-CDA to FHIR documents or maintaining both.</p>",
        "id": 198240701,
        "sender_full_name": "Joe Lamy",
        "timestamp": 1590000356
    },
    {
        "content": "<p>Debate about the difference between using Composition and DocumentReference.  Group discussed different views on how these two FHIR Resources work differently.</p>\n<p>Rick described how CCD documents could be more easily produced via FHIR Compositions. But acknowledged a role for C-CDA Care Plan, Discharge Summaries, Progress Notes, etc. for information this is captured in time.</p>",
        "id": 198242904,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1590001408
    },
    {
        "content": "<p>One of the things that is so difficult about these discussions sometimes is the fact that we spend so much time talking about this standard without putting it in the context of an actual use case.</p>",
        "id": 198243824,
        "sender_full_name": "Andrew Statler",
        "timestamp": 1590001865
    },
    {
        "content": "<p>When we talk about any of our standards in HL7, we start with the base standard and what needs to be in it and we may think about use cases long enough to make sure we accounting for various use cases, but we are thinking of the one size fits all approach while we are doing that because we are building that base standard. Then we end up with this broad base of a standard, whether it is V2, V3, CDA, or FHIR, we get that initial release out there, but then adoption is slow because because nobody is really sure how to use it. Until we start creating specific use cases and developing Implementation Guides for those  standards, the community doesn't really know how to take advantage of those standards. Inevitably, the development of the Implementation Guides necessitates changes to the base standard. </p>\n<p>The point that I'm trying to make is that we spend so much of our time on the one-size-fits-all solution (i.e. the base standard), that we aren't really creating solutions that are implementable. There is nothing wrong with having a strong base to build from, but when it comes time to implementing, we need to identify real-world use cases that we are solving. There is competition about which standard is better, whether that is V2 or CDA or FHIR, and academically we can say that FHIR is the best based on technology and concept design, but when we released the initial versions of FHIR it did not automatically displace everything else. Why is that? For one, it was still growing and maturing. For another, people did not know how to use it. That's no different than any of the other standards. To make them valuable, you need use cases. There is a reason why V2 is still around today. There are use cases where V2 IS the best solution. V3 was too complex to replace V2 and introduced way more overhead than was needed for transactional data between known endpoints where there is a high volume of data and efficiency is needed. Certainly CDA wasn't going to do anything being an offshoot of V3. FHIR doesn't stand much chance to replace all of the V2 space because FHIR has overhead as well. Perhaps FHIR may be a little more efficient when compared to V3, but it will never be as efficient as V2. At some point, the paradigm to update downstream systems by pushing data via a constant stream of transactions may just go away. At that point, FHIR may win the day, but it has been a long time coming. When we are working with these standards, we should talk to the various use cases that we are solving.</p>\n<p>Another example of where we find the challenge of talking to the base standard vs. a use case is in the <br>\nC-CDA guides. The most basic of C-CDA document types is the CCD. The CCD is practically the base standard. It is an all purpose document type. We create it, we put it out there and then somebody else picks it up and they pull data from it. But what is the workflow around it supposed to be? At what point do we create it? Who is creating it? How do they create it? We can easily translate that into FHIR and talk about how FHIR is better, but how do we know that? What is the use case we are talking about? Without knowing the creation points and how it's created and how the system works, will FHIR be the better option? What is the actual requirement we need to meet?</p>\n<p>I think we need to re-think our approach and focus on the use case regardless of the standard. The requirements for certifications, the samples, the standards, spend too much time outlining requirements independent of use cases. Some of the document types in C-CDA give us a better impression of what the use case is, for example, the discharge summary or the transfer summary make it a  little more clear what the use case is for those. An example could be further described when providing an example. Similarly, some of the more specific C-CDA IG's get more detailed in terms of what they are to be used for such as the Personal Advanced Care Plan, so this is not completed unprecedented in terms of what is needed. We have some good models to draw from.</p>",
        "id": 198253686,
        "sender_full_name": "Andrew Statler",
        "timestamp": 1590006826
    },
    {
        "content": "<p>Andrew. I couldn't agree with you more.  And who is the best to describe specific use cases than actual implementers.  In the past, as the IAT leader, I was coming up with scenarios --and that is backwards.  The scenarios and use cases need to come from the implementers who are facing real world implementation problems.  David Riddle is a good example of that, so is Raychelle, and Emma.  They come saying we need to do X.  We have a customer who needs to do Y.  We are outputting information from our system and we need to figure out how to do Z.  These real implementer use cases are what we need the topics of IAT to focus on.</p>\n<p>The feedback from IAT's past is we need to do this.  HL7 has heard that request and starting in July, the environment will be shifted to support this change.  We needed implementers to find out --WITH PLENTY OF ADVANCED NOTICE TO TAKE ADVANTAGE OF THE OPPORTUNITY.  We ran the May IAT as a virtual event to supply some informative topics which implementers asked to be updated on, and to set the foundation for implementers to take charge and identify a specific Use Case they need to address.    </p>\n<p>Cerner must have 1 or 2 top use cases that they aim to support.  What are your key challenges? Chances are, if the use case is important to Cerner, it will likely be of interest to other implementers too.</p>\n<p>Grab a slot in the July IAT, propose a use case to focus on, and go for it! HL7 has given their support to have implementers take charge of the topics in this way.</p>",
        "id": 198260675,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1590010842
    },
    {
        "content": "<p>I do hear what I'm saying and I've learned not to speak up unless I'm ready to put up, so yes, I did already sign up for a spot in July. (I had to fix the form first, BTW. It wasn't letting me submit at all until I corrected it.) :-)</p>",
        "id": 198312166,
        "sender_full_name": "Andrew Statler",
        "timestamp": 1590062101
    },
    {
        "content": "<p><strong>May 2020 C-CDA IAT Executive Summary</strong></p>\n<p>The May 2020 C-CDA Implmentation-A-Thon  (C-CDA IAT) was held as a half-day virtual event on Wednesday, May 20, 2020 from noon to 5pm ET.  This was the eleventh running of the implementation-a-thon. It was well attended with 82 participants including program facilitators and topic presenters.  Five EHR vendors sent representative:  Allscripts, Cerner, e-Clinical Works, Epic, and NextGen. Representatives from the Sequoia Project, Carequality, eHealthConnection, and CommonWell communities attended. Representatives from the US Government participated as well. There was a strong showing from the quality and payer communities along with many integrators and innovators who utilize C-CDA in information exchange solutions.</p>\n<p>The May 2020 C-CDA IAT covered several topics requested by the implementer community in order to remain informed of changes and updates.  Gay Dolin of Namaste Consulting and Matthew Rahn from the ONC provided an update on changes coming this June for the Score Card validator. They also reviewed the new set of Rubric Rules balloted through the HL7 Community in 2019 and published on May 17, 2020. These rules are established to \"raise the bar\" on the quality of C-CDA documents and they are used to create the rules used in the Score Card validator.  Representatives from the National Committee for Quality Assurance (NCQA) Wendy Talbot and Anne Marie Smith provided an updated about the processes developing at NCQA to audit and validate processes used to create C-CDA CCD documents which provide data used in quality measure assessment programs. These two topics led to conversations regarding the need for the industry to orchestrate and manage changing data quality expectations.  The group discussed what would be a reasonable frequency for validation tools and processes to change.  They also discussed the need for alignment between validation tools to reduce burden on implementers  and avoid inconsistencies in the validation tools.  Didi Davis from the Sequoia Project described the validation tools available through their suite of testing tools. She explained Sequoia Project presently offers free access to their validators as an additional option for implementers who want to confirm the quality of their C-CDA exchange documents.</p>\n<p>Discussions in the afternoon covered C-CDA and FHIR. Lantana Consulting Group CTO Rick Geimer explained the challenges and possibilities for data transformation and co-use of the two standards to support a variety of information exchange needs within the community of implementers who are maximizing existing investments as well as implementers making new investments in interoperable data exchange.</p>\n<p>Joe Lamy, representing issues being explored within the CommonWell/Carequality Community, described several technical topics this large Community of C-CDA implementers is struggling with as they progress toward the creation and consumption of C-CDA encounter summaries such as Discharge Summary and Progress Note documents.  Topics ranged from questions about document creation workflows, such as \"on demand\" documents, to questions about versioning of information and expectations for Content Consumers. </p>\n<p>The day closed with a presentation from C-CDA IAT facilitator Jean Duteau explaining what implementers can expect from the next C-CDA IAT to be held virtually on Wednesday, July 22, 2020. As a result of implementer feedback requesting a greater focus on specific use cases and examples stemming from production uses of C-CDA, the next C-CDA IAT will focus on topics selected and driven by implementers.  The C-CDA implementer community is being supported to initiate discussion of topics relevant to use cases and challenges they or their customers are facing in production environments.  The topic sign-up grid for the July 2020 C-CDA IAT is already available on Confluence. Topics need to be identified before June 15, 2020 so the July session can be confirmed and promoted. C-CDA IAT facilitators are available to help topic presenters develop and prepare their topic presentations.  Ideas discussed as possibilities included focusing on consuming and comparing collections of production-level documents, looking at a variety of \"clinical note\" sections within C-CDA documents, and exploring specific implementer-defined use cases for C-CDA document exchange.</p>\n<p><strong>If you have a C-CDA implementation topic you would like to explore on July 22, 2020 with the growing C-CDA Implementer Community, sign-up (<a href=\"https://confluence.hl7.org/display/IAT/Sign+Up+for+2020.07.22+C-CDA+IAT\">https://confluence.hl7.org/display/IAT/Sign+Up+for+2020.07.22+C-CDA+IAT</a> )  BEFORE JUNE 15, 2020. </strong></p>",
        "id": 198345104,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1590079515
    }
]