[
    {
        "content": "<p>Call for Implementer Topic Presenters</p>\n<p>Are you a part of the C-CDA implementer community, interested in presenting on a problem C-CDA implementers are experiencing today AND willing to propose a potential solution or a set of options the implementer community could consider which would improve the situation?</p>\n<p>Sign up before September 15, 2020 to play a critical role in the next virtual C-CDA IAT.</p>\n<p><a href=\"https://confluence.hl7.org/display/IAT/2020.10.21+Virtual+IAT+Track+Agenda\">https://confluence.hl7.org/display/IAT/2020.10.21+Virtual+IAT+Track+Agenda</a></p>",
        "id": 206687551,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1597235639
    },
    {
        "content": "<p>The October C-CDA Implementation-A-Thon is less than 20 days away! </p>\n<p>Registration link will be available on <a href=\"http://HL7.org\">HL7.org</a> after October 5th </p>\n<p>If you or your customers use HL7 C-CDA documents to exchange data, you won’t want to miss the upcoming virtual C-CDA Implementation-A-Thon, Wednesday, October 21st from 9am – 6pm ET. </p>\n<p>This virtual event promises to be packed with useful information you need to manage your product roadmap for C-CDA support. We will cover some of today’s most urgent implementer needs and provide updates on changes resulting from the July Implementation-A-Thon. </p>\n<p>Topics will be presented by C-CDA implementers including: Allscripts, Cerner, the CommonWell/CareQuality communities, Diameter Health, Optum, and others. </p>\n<p>Be a part of shaping what we accomplish using this mature HL7 standard: </p>\n<ul>\n<li>\n<p>Learn about potential advancements for representing Problems and Allergies resulting from harmonization between C-CDA CCD and International Patient Summary (IPS) Templates </p>\n</li>\n<li>\n<p>Weigh in on a recommendation to require CDA IGs to include illustrative use cases help accelerate interoperability using C-CDA documents </p>\n</li>\n<li>\n<p>Ask the ONC about USCDI, certification questions, and rising Score Card expectations <br>\nStay abreast of the optimal way to represent pregnancy information </p>\n</li>\n<li>\n<p>Hear about implementation of the new alternate identifier extension for CDA R2.0 that aligns with identifiers used in FHIR and get an update on possible refinements for the USCDI Clinical Notes data class </p>\n</li>\n<li>\n<p>Provide input on representing a patient’s health insurance information in the Payer section </p>\n</li>\n<li>\n<p>Stay abreast of what the CommonWell/Carequality community is doing to advance sharing of C-CDA Encounter Summaries and Patient Summaries </p>\n</li>\n<li>\n<p>Find out how USCDI information maps from C-CDA templates to FHIR profiles and the FHIR Provenance Resource </p>\n</li>\n</ul>\n<p>Check out the full agenda: 2020.10.21 Virtual IAT Track Agenda: <a href=\"https://confluence.hl7.org/display/IAT/2020.10.21+Virtual+IAT+Track+Agenda\">https://confluence.hl7.org/display/IAT/2020.10.21+Virtual+IAT+Track+Agenda</a> </p>\n<p>VIRTUAL EVENT!! $99 for HL7 members ($199 for non-members) <br>\nQuestions? Contact Lisa Nelson (<a href=\"mailto:Lnelson@max.md\">Lnelson@max.md</a>)</p>",
        "id": 212131628,
        "sender_full_name": "Natasha Kreisle",
        "timestamp": 1601674475
    },
    {
        "content": "<p>Check out the full agenda: 2020.10.21 Virtual IAT Track Agenda <a href=\"https://confluence.hl7.org/display/IAT/2020.10.21+Virtual+IAT+Track+Agenda\">https://confluence.hl7.org/display/IAT/2020.10.21+Virtual+IAT+Track+Agenda</a></p>\n<p>Register now!  <a href=\"http://www.hl7.org/events/c-cda/implementation/2020/10/\">http://www.hl7.org/events/c-cda/implementation/2020/10/</a></p>",
        "id": 212345204,
        "sender_full_name": "Natasha Kreisle",
        "timestamp": 1601925804
    },
    {
        "content": "<p>Topic 1: Potential advancements for representing Problems and Allergies resulting from harmonization between C-CDA and IPS Templates presented by <span class=\"user-mention\" data-user-id=\"191415\">@Giorgio Cangioli</span></p>",
        "id": 214055828,
        "sender_full_name": "Natasha Kreisle",
        "timestamp": 1603289901
    },
    {
        "content": "<p>Topic 2: Participation Roles in C-CDA will be presented by <span class=\"user-mention\" data-user-id=\"197638\">@John D'Amore</span></p>",
        "id": 214065278,
        "sender_full_name": "Natasha Kreisle",
        "timestamp": 1603293453
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"281641\">Natasha Kreisle</span> <a href=\"#narrow/stream/179311-C-CDA/topic/October.202020.20C-CDA.20Implementation-A-Thon/near/214055828\">said</a>:</p>\n<blockquote>\n<p>Topic 1: Potential advancements for representing Problems and Allergies resulting from harmonization between C-CDA and IPS Templates presented by <span class=\"user-mention silent\" data-user-id=\"191415\">Giorgio Cangioli</span></p>\n</blockquote>\n<p>Topic #1 Giorgio Cangioli from HL7 Europe reviewed the differences between the Problems and Allergy and Intolerance templates and showed a draft template for each that combines the constraints to achieve templates that are conformant to both C-CDA and IPS.  Check out his presentation here:  <a href=\"https://confluence.hl7.org/download/attachments/90898467/20201021%20C-CDA%20IAT%2020201020%20Fiorgio%20Cangioli%20Problems%20and%20Allergies.pdf?version=1&amp;modificationDate=1603223695532&amp;api=v2\">https://confluence.hl7.org/download/attachments/90898467/20201021%20C-CDA%20IAT%2020201020%20Fiorgio%20Cangioli%20Problems%20and%20Allergies.pdf?version=1&amp;modificationDate=1603223695532&amp;api=v2</a></p>",
        "id": 214066433,
        "sender_full_name": "Natasha Kreisle",
        "timestamp": 1603293821
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"281641\">Natasha Kreisle</span> <a href=\"#narrow/stream/179311-C-CDA/topic/October.202020.20C-CDA.20Implementation-A-Thon/near/214066433\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"281641\">Natasha Kreisle</span> <a href=\"#narrow/stream/179311-C-CDA/topic/October.202020.20C-CDA.20Implementation-A-Thon/near/214055828\">said</a>:</p>\n<blockquote>\n<p>Topic 1: Potential advancements for representing Problems and Allergies resulting from harmonization between C-CDA and IPS Templates presented by <span class=\"user-mention silent\" data-user-id=\"191415\">Giorgio Cangioli</span></p>\n</blockquote>\n<p>Topic #1 Giorgio Cangioli from HL7 Europe reviewed the differences between the Problems and Allergy and Intolerance templates and showed a draft template for each that combines the constraints to achieve templates that are conformant to both C-CDA and IPS.  Check out his presentation here:  <a href=\"https://confluence.hl7.org/download/attachments/90898467/20201021%20C-CDA%20IAT%2020201020%20Fiorgio%20Cangioli%20Problems%20and%20Allergies.pdf?version=1&amp;modificationDate=1603223695532&amp;api=v2\">https://confluence.hl7.org/download/attachments/90898467/20201021%20C-CDA%20IAT%2020201020%20Fiorgio%20Cangioli%20Problems%20and%20Allergies.pdf?version=1&amp;modificationDate=1603223695532&amp;api=v2</a></p>\n</blockquote>\n<p>The take away action is to consider the possibility of eliminating the outer \"concern wrappers\" in these templates and limiting each of these entry templates to support only a single observation.  </p>\n<p>As an implementer, what do you think of this suggestion?<br>\nWould it eliminate a troublesome complexity?  <br>\nWould it help you in positioning to convert information to FHIR resources?  <br>\nWould your company consider adopting this change?</p>",
        "id": 214067260,
        "sender_full_name": "Natasha Kreisle",
        "timestamp": 1603294090
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"281641\">Natasha Kreisle</span> <a href=\"#narrow/stream/179311-C-CDA/topic/October.202020.20C-CDA.20Implementation-A-Thon/near/214065278\">said</a>:</p>\n<blockquote>\n<p>Topic 2: Participation Roles in C-CDA will be presented by <span class=\"user-mention silent\" data-user-id=\"197638\">John D'Amore</span></p>\n</blockquote>\n<p>Using an ER visit use case, John walks through several scenarios and explains how the different roles are used to tell the story of who performed certain activities and who recorded the information in the chart, and explains who the informant might be and how participant would be used. </p>\n<p>Keep an eye out for new examples and additional guidance in an update of the Companion Guide to add more clarity around how these roles should be used and how to determine WHO belongs in each.</p>\n<p>Check out John's presentation here <a href=\"https://confluence.hl7.org/download/attachments/90898467/20201021%20C-CDA%20IAT%2020201020%20John%20D%27Amore.pdf?version=1&amp;modificationDate=1603226000940&amp;api=v2\">https://confluence.hl7.org/download/attachments/90898467/20201021%20C-CDA%20IAT%2020201020%20John%20D%27Amore.pdf?version=1&amp;modificationDate=1603226000940&amp;api=v2</a></p>",
        "id": 214081543,
        "sender_full_name": "Natasha Kreisle",
        "timestamp": 1603299685
    },
    {
        "content": "<p>Topic 3:  <span class=\"user-mention\" data-user-id=\"199429\">@Andrew Statler</span> from Cerner described the importance of clear use cases in implementation guides.  He explained why IGs are more effective when they include well-defined Use Cases.  He discussed two projects where the eICR specification was attempted to be applied.  In one case, there wasn't a clear use case, and since the specification didn't provide one either, it was very challenging to understand how to apply the guidance in the IG.  In another case, there was a very clear COVID Reporting use case, and the adoption was easier and faster. Andrew has recommended that the new CDA IG Quality Criteria be updated to include criteria that requires CDA IG to have clearly documented Use Case that form the basis for the spec.</p>\n<p>Andrew shared an example of using FHIR as a triggering mechanism for information exchange, and a CDA eICR (electronic initial case report) document as the mechanism for delivering a well-defined, rich set of data elements that were relevant to a specific case.  </p>\n<p>Exacting standards don't limit innovation, they accelerate it. </p>\n<p>Better use cases provide the HOW? and WHEN? of the spec.  Without use cases, this important aspect of development is missing. </p>\n<p>The Use Case needs to take the full story telling power of CDA into consideration so that semantically meaningful information will be conveyed.   </p>\n<p>Implementer bring and discuss use case at the IAT as a way of understanding how the C-CDA specification is expected to work.   If we required more use case information to be included in the IG as the basis for developing the constraints, then implementers would be more enabled to use the spec.</p>\n<p>Based on all the evidence he presented, Andrew encouraged the group to agree and request that the inclusion of Use Cases in IGs would be added as quality criteria for all CDA IGs going forward.</p>",
        "id": 214083192,
        "sender_full_name": "Natasha Kreisle",
        "timestamp": 1603300337
    },
    {
        "content": "<p>Topic 4: ONC representatives <span class=\"user-mention\" data-user-id=\"191942\">@Matt Rahn</span> and <span class=\"user-mention\" data-user-id=\"194723\">@Al Taylor</span>  presented on the new Cures Act rule and USCDI.  They reviewed the revised criteria and summarized where to find all the rule related information. </p>\n<p>Health IT modules that have already certified against the 2015 CEHRT only need to attest to conformance against certain criteria that hasn't changed. Matt Rahn announced a recently detected errata in 170.315(f)(5) and explained that updated language will be coming in a Certification Companion Guide. There are no specific IG requirements for electronic case reporting at this time, and the guidance in 170.315(f)(5) is currently incorrect.  Implementers have till August 2022 (due to COVID) to update from supporting CCDS to USCDI. </p>\n<p>Al Taylor reviewed the existing USCDI v1 and how it is organized. The USCDI Draft V2 reflects incoming submissions. Comment is the lowest level of maturity, Level 1 is higher and Level 2 is the highest (most ready, most feasible). ONC will draft USCDI V2 from items ranked as Level 2. 20 new data classes and about 200 new data elements have been submitted so far. ONC is accepting USCDI v2 submissions until this coming Friday 10/30. </p>\n<p>Link to errata USCDI V1 <a href=\"https://www.healthit.gov/isa/sites/isa/files/2020-10/USCDI-Version-1-July-2020-Errata-Final_0.pdf\">https://www.healthit.gov/isa/sites/isa/files/2020-10/USCDI-Version-1-July-2020-Errata-Final_0.pdf</a> </p>\n<p>More on USCDI here: <a href=\"https://www.healthit.gov/isa/united-states-core-data-interoperability-uscdi\">https://www.healthit.gov/isa/united-states-core-data-interoperability-uscdi</a></p>",
        "id": 214095267,
        "sender_full_name": "Natasha Kreisle",
        "timestamp": 1603305627
    },
    {
        "content": "<p>Topic 5: <span class=\"user-mention\" data-user-id=\"192274\">@Joe Lamy</span> from the Carequality/Commonwell Joint Content workgroup reported on the issue of how to determine when an encounter is over. </p>\n<p>The debate has lots of facets to it and it is impacted by many different perspectives.   </p>\n<p>Some definitive conclusions have been made, but the topic will be picked up in the newly announced Sequoia Data Usability Workgroup. </p>\n<p>On the question of including section time range in CCD documents, the joint workgroup has suggested that the Section Time Range template be used on every section.  Lots of discussion ensued, and the current guidance was explained.  Alignment with FHIR came up with a business case.</p>",
        "id": 214103889,
        "sender_full_name": "Natasha Kreisle",
        "timestamp": 1603309235
    },
    {
        "content": "<p>C-CDA Implementation-A-Thon <br>\nOctober 2020 Executive Summary<br>\nBy Lisa R. Nelson</p>\n<p>The October 2020 C-CDA Implementation-A-Thon (C-CDA IAT) was held as a full-day virtual event on Wednesday, October 21st, from 10am to 6pm ET. This was the thirteenth running of the Implementation-A-Thon. <br>\nThis IAT was well attended with 41 participants including program facilitators and topic presenters. Five EHR vendors sent representative: Allscripts, Cerner, e-Clinical Works, NextGen, and Epic. Representatives from the Sequoia Project, Carequality, eHealthConnection, and CommonWell communities attended. Representatives from the US Government participated as well. Optum participated from the payer communities. Two DirectTrust HISPs along with many integrators and innovators who utilize C-CDA in information exchange solutions also attended.</p>\n<p>The October 2020 C-CDA IAT covered several topics led by representatives from the implementer community. Giorgio Cangioli from HL7 Europe led off sharing a comparison of the C-CDA Problem Concern and Allergy-Intolerance templates. He showed a draft template for each that combines the constraints to achieve templates that are conformant to both C-CDA and IPS. The takeaway action is to consider how to incorporate these findings into the design of these templates going forward to achieve greater harmony and alignment.</p>\n<p>Diameter Health’s John D'Amore followed with a topic to clarify the participation roles in C-CDA. Using an ER visit use case, John walked through several scenarios and explained how the different CDA document participation roles are used to tell the story of who performed certain activities, who recorded the information in the chart, who the informant was and what other participants were involved. Keep an eye out for new examples and additional guidance to be covered in an update of the Companion Guide. The CDA implementer community acknowledged the need for greater clarity around how these roles should be used and how to determine WHO belongs in each.</p>\n<p>Andrew Statler from Cerner described the importance of clear use cases in implementation guides.  He explained why IGs are more effective when they include well defined Use Cases.  He discussed two projects where the eICR specification was attempted to be applied.  In one case, there wasn't a clear use case, and since the specification didn't provide one either, it was very challenging to understand how to apply the guidance in the IG.  In another case, there was a very clear COVID Reporting use case, and the adoption was easier and faster. Andrew shared an example of using FHIR as a triggering mechanism for information exchange, and a CDA eICR (electronic initial case report) document as the mechanism for delivering a well-defined, rich set of data elements that were relevant to a specific case. ”More exact standards don't limit innovation, they accelerate it,” he asserted. Without use cases, this important aspect of development is missing, and development goes slower. Better use cases provide the HOW and WHEN of the spec and accelerates their use. Implementers bring and discuss use case at the IAT as a way of understanding how the C-CDA specification is expected to work.  The IGs need to be based on use case to allow implementations to take the full story telling power of CDA into consideration and so that semantically meaningful information will be conveyed.  If we required more use case information to be included in the IG as the basis for developing the constraints, then implementers would be more enabled to use the spec. The CDA implementer community moved to bring this recommendation back to SDWG to see what could be done to encourage the inclusion of use cases in CDA IGs.</p>\n<p>ONC representatives Matt Rahn and Al Taylor presented on the new Cure Act rule and USCDI.  They reviewed the revised criteria and summarized where to find all the rule related information. Health IT modules that have already certified against the 2015 CEHRT only need to attest to conformance against certain criteria that hasn't changed, they explained. Matt Rahn announced a recently detected errata in 170.315(f)(5) and explained that updated language will be coming in a Certification Companion Guide. There are no specific IG requirements for electronic case reporting at this time, and the guidance in 170.315(f)(5) is currently incorrect. Implementers have till August 2022 (due to COVID) to update from supporting CCDS to USCDI. ONC is accepting USCDI v2 submissions until this coming Friday 10/30.</p>\n<p>Al Taylor reviewed the existing USCDI v1 and how it is organized. There may not be an applicable standard --you can drill into the data element level on the USCDI web page. Al reminded implementers that the USCDI v1 had a published errata in June. The requirements to exchange USCDI v1 differ depending on the use of C-CDA or FHIR US Core. The USCDI Draft V2 reflects incoming submissions. Comment is the lowest level of maturity, Level 1 is higher and Level 2 is the highest (most ready, most feasible). <br>\nLink to errata USCDI V1 <a href=\"https://www.healthit.gov/isa/sites/isa/files/2020-10/USCDI-Version-1-July-2020-Errata-Final_0.pdf\">https://www.healthit.gov/isa/sites/isa/files/2020-10/USCDI-Version-1-July-2020-Errata-Final_0.pdf</a><br>\nMore on USCDI here: <a href=\"https://www.healthit.gov/isa/united-states-core-data-interoperability-uscdi\">https://www.healthit.gov/isa/united-states-core-data-interoperability-uscdi</a></p>\n<p>Al reviewed the ONDEC submission system and explained that everyone can make a submission. He explained that ONC will draft USCDI V2 from items ranked as Level 2. He also explained the ONDEC submission page includes a prep sheet to help submitters gather the information needed to do a submission. Al described the annual cycle for developing newer versions of the USCDI and then the ONC would decide if the update could be included in the Health IT rule before new regulation from ONC comes out. ONC is adjudicating their evaluation of the submissions as they come in. 20 new data classes and about 200 new data elements have been submitted so far. The process includes an annual cycle with voluntary adoption. <br>\nMatt and Al also went over the new Standards Version Advancement Process (SVAP) to enable health IT developers’ ability to incorporate newer versions of Secretary-adopted standards and implementation specifications, as part of the “Real World Testing” Condition and Maintenance of Certification requirement . Working with industry stakeholders and providing ample notice, ONC will follow a collaborative process to identify a more advanced version of the standards or implementation specifications, for approval by the National Coordinator. More details, including timelines, anticipated comment periods, and other operational information for the SVAP will be made available at this page soon. <br>\nJoe Lamy from the Carequality/Commonwell Joint Content workgroup reported on the issue of how to determine when an encounter is over. The debate has lots of facets to it and it is impacted by many different perspectives.  Some definitive conclusions have been made, but the topic will be picked up in the newly announced Sequoia Data Usability Workgroup. On the question of including section time range in CCD documents, the joint workgroup has suggested that the Section Time Range template be used on every section.  Lots of discussion ensued, and the current guidance was explained.  Alignment with FHIR came up with a business case.</p>\n<p>CDA Management Co-chair Lisa Nelson reported on the progress made toward completing action items from the July C-CDA IAT.  Of the eleven (11) actions items resulting from the previous IAT, 2 had been completed, 6 had been started, 2 were waiting on other actions to complete before they could get started, and 1 item was escalated to the FHIR Management Group to address (an escalation for Patient Work Group).  Eight (8) new action items were identified during this IAT.  Action was started on 50% of the new actions.  Lisa also noted a new job opening within HL7 for a US Program Manager to take on oversite for US specific projects. </p>\n<p>C-CDA IAT facilitator Jean Duteau closed the day by thanking the ONC for sponsoring the event and thanking Natasha Kreisle for the amusing break-out slides inspired so much fun conversation.  He solicited feedback from participants which was mostly positive regarding the new implementer-led format. Everyone agreed to do more to encourage newcomers to participate more. He announced the proposed date of Wednesday, March 24th, 2021 for the next IAT. Participants were encouraged to work on advancing the available guidance for implementers by contributing to the ongoing work of the C-CDA Examples Task Force which meets on Thursdays from noon – 1:00pm ET.  Conference calls for the group are announced on the <a href=\"http://HL7.org\">HL7.org</a> Conference Call Center. The Zulip chat C-CDA Stream will be used to continue discussion on the topics introduced during the event. (<a href=\"#narrow/stream/179311-C-CDA\">https://chat.fhir.org/#narrow/stream/179311-C-CDA</a>)</p>\n<p>Dave Hamill reminded everyone how important and valuable the feedback surveys were to improving future IATs. The topic sign-up grid for upcoming C-CDA IATs is already available on Confluence. Topics for the March IAT need to be identified before January 15th, 2021. C-CDA IAT facilitators are available to help topic presenters develop and prepare their topic presentations. Next year’s IATs will all be held as virtual events.  Save the dates:  March 24th, 2021; July 21st, 2021; October 20th, 2021.</p>",
        "id": 214636090,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1603748000
    }
]