[
    {
        "content": "<p>Hi There, <br>\nI'm new to Zulip and this #C-CDA stream. I was hoping someone might have some information on telehealth data, and how it is expected to be coded in CCDA. I have been working with a client who collects telehealth data—vital signs collected via telemetric devices that are connected to their EHR—and they are trying to code it using CCDA 1.1. The client wants to keep this data separate from their clinician measured vital signs, but we have not found any HL7 standards for coding these telemonitored values. Do you have any idea if this has been a discussion at <a href=\"http://HL7.org\" target=\"_blank\" title=\"http://HL7.org\">HL7.org</a> discussing the gold standard on coding these values? Any information you might have would be extremely helpful. Thank you so much for your time!</p>",
        "id": 164095975,
        "sender_full_name": "Julia Prusik",
        "timestamp": 1556123105
    },
    {
        "content": "<p>Julia, this would be a good spot to create an example. I'll mention this at next CDA examples task force (and place a Trello card here: <a href=\"https://trello.com/b/kJaKXp0Z/example-task-force\" target=\"_blank\" title=\"https://trello.com/b/kJaKXp0Z/example-task-force\">https://trello.com/b/kJaKXp0Z/example-task-force</a> ) If you can join, it's usually every other Thursday at noon ET and the announcement goes out on HL7 SDWG list-serv</p>",
        "id": 165626916,
        "sender_full_name": "John D'Amore",
        "timestamp": 1557844159
    },
    {
        "content": "<blockquote>\n<p>Hi There, <br>\nI'm new to Zulip and this #C-CDA stream. I was hoping someone might have some information on telehealth data, and how it is expected to be coded in CCDA. I have been working with a client who collects telehealth data—vital signs collected via telemetric devices that are connected to their EHR—and they are trying to code it using CCDA 1.1. The client wants to keep this data separate from their clinician measured vital signs, but we have not found any HL7 standards for coding these telemonitored values. Do you have any idea if this has been a discussion at <a href=\"http://HL7.org\" target=\"_blank\" title=\"http://HL7.org\">HL7.org</a> discussing the gold standard on coding these values? Any information you might have would be extremely helpful. Thank you so much for your time!</p>\n</blockquote>\n<p>Julia, we haven't made an example for this yet, but I believe the distinguishing aspect of the information you intend to record is the authorship.  In this device case, the authorship of the information is the device.  Now, we haven't debated if an authoring person will not be present. Perhaps the person involved is the performer of the test and the device is the sole author.  Is the human required to accept the device information into the medical record? In that case, I think they would still have a role as \"author\" with respect to that information being in the patient's medical record.  If the device is permitted to write the info into the patient's chart without any oversight from a human, then I would argue the device is the sole author of that information.  This has not been heavily debated in C-CDA Examples Task Force.  You should bring this example to the Wednesday noon ET call. <br>\nLisa</p>",
        "id": 173651658,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1566303152
    },
    {
        "content": "<p>oops, sorry Julia, I meant Thrusdays at noon ET.</p>",
        "id": 173670396,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1566316664
    }
]