[
    {
        "content": "<p>We've added sample corresponding extensions to the Blood Pressure Panel Observations based on the IG. Looking for feedback if this was what was expected from the profile. This is just a mock implementation, so all the blood pressure panels return the same extensions:</p>\n<p><a href=\"https://fhir-open.stagingcerner.com/beta/0b8a0111-e8e6-4c26-a91c-5069cbc6b1ca/Observation?patient=4342008&amp;code=http%3A%2F%2Floinc.org%7C85354-9&amp;_format=json\">https://fhir-open.stagingcerner.com/beta/0b8a0111-e8e6-4c26-a91c-5069cbc6b1ca/Observation?patient=4342008&amp;code=http%3A%2F%2Floinc.org%7C85354-9&amp;_format=json</a></p>",
        "id": 197585979,
        "sender_full_name": "Madhur Rajendran",
        "timestamp": 1589475720
    },
    {
        "content": "<p>It looks okay to me Madhur. Probably the best person to weigh in is Nathan. For the reference range, it might vary based on guideline (ACC2017, JNC8), patient (&gt; 60, with CKD), etc... If included it would be good to specify this somehow.</p>",
        "id": 197588539,
        "sender_full_name": "Claude Nanjo",
        "timestamp": 1589476755
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197634\">@Madhur Rajendran</span>  It looks okay to me as well.  What you have for reference range works but,  Claude is correct here; reference ranges will depend on which guideline is being used.  It seems to me that the best place for this to go into is the referenceRange.appliesTo element but I don't know if these reference range guidelines are in any standard code system.  We could create a temporary CodeSystem profile to hold the codes we need until they've been included in a standard such as SNOMED, if you need us to.  Or we could extend referenceRange with a Guidline Source that would be a CodeableConcept.  Either of these options would take some time to get into the profile.</p>",
        "id": 197596325,
        "sender_full_name": "Nathan Davis",
        "timestamp": 1589480252
    },
    {
        "content": "<p>I'm not sure we know <em>where</em> the reference range comes from in our server (guideline wise) as I think each site may be able to modify and specify. I think we know what \"concepts\" they're based on (like age, gender) since that's how we choose which range gets associated to an observation that interprets to H/N/L</p>",
        "id": 197601712,
        "sender_full_name": "Jenni Syed",
        "timestamp": 1589482482
    },
    {
        "content": "<p>In our case, clinicians may select the desired guidelines/targets they wish to consider for their patients.</p>",
        "id": 197604811,
        "sender_full_name": "Claude Nanjo",
        "timestamp": 1589483890
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191703\">@Claude Nanjo</span> Do you have a list of the guidelines the clinicians may choose from?</p>",
        "id": 197607545,
        "sender_full_name": "Nathan Davis",
        "timestamp": 1589485324
    },
    {
        "content": "<p>Right now we are using only JNC8 and ACC2017</p>",
        "id": 197616094,
        "sender_full_name": "Claude Nanjo",
        "timestamp": 1589489415
    }
]