[
    {
        "content": "<p>In the resource profiles some elements are marked as 'SHOULD be omitted' (eg <a href=\"http://Patient.address.city\">Patient.address.city</a>) whereas other are are actually removed with max cardinality = 0 (eg Patient.address.text) - why the two different approaches?</p>",
        "id": 240347703,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1622044730
    },
    {
        "content": "<p>It may be \"SHOULD be omitted\" in the Allowable Data profile because US Core and IPS Patient profiles have .address as 0..1 and MUST SUPPORT, but for the SHC QR code, the Data Minimization profile is used which sets it to 0..0.  The case you mentioned, <a href=\"http://address.city\">address.city</a>, the invariant name suggests that the reason to not include it is for privacy, but maybe there are legal reasons to include it.<br>\n<a href=\"https://github.com/dvci/vaccine-credential-ig/issues/88\">https://github.com/dvci/vaccine-credential-ig/issues/88</a> has some discussion. <span class=\"user-mention\" data-user-id=\"322501\">@Max Masnick</span> ?</p>",
        "id": 240374999,
        "sender_full_name": "Paul Denning",
        "timestamp": 1622056022
    },
    {
        "content": "<p>Because SMART Health Cards can't be modified after they are issued, it's important to not put information into them that a Holder might not want to give to a Verifier (and isn't necessary for verification purposes).</p>\n<p>Exact address is disallowed (<code>0..0</code> cardinality) because of this -- there are circumstances where a Holder may need to show their SHC but not want to provide their precise street address.</p>\n<p>Other elements like <code>address.city</code> are not as sensitive, but do still present a level of privacy risk and take up space in our limited payload size. This is where the <code>SHOULD NOT populate</code> conformance criteria come from. We're trying to strike a balance between privacy vs. being overly constraining.</p>",
        "id": 240375741,
        "sender_full_name": "Max Masnick",
        "timestamp": 1622056285
    },
    {
        "content": "<p>OK, got it, thanks Max</p>",
        "id": 240385813,
        "sender_full_name": "Michele Mottini",
        "timestamp": 1622060639
    },
    {
        "content": "<p>We generally want/expect issuers to follow the data minimizing profiles; I still worry that the message may be confusing here.</p>",
        "id": 240416788,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1622085991
    },
    {
        "content": "<p>Agreed -- we're working on improving documentation now that the IG content is pretty much solidifed. If you have suggestions on how we can address this specifically we'd love to hear them :)</p>",
        "id": 241074669,
        "sender_full_name": "Max Masnick",
        "timestamp": 1622581098
    },
    {
        "content": "<p>I'd consider making the \"DM\" profiles the main / easiest ones to find. And more or less \"hiding\" the others behind a \"I need more for my use case\" link of some kind.</p>",
        "id": 241074897,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1622581205
    }
]