[
    {
        "content": "<p>Hi, I'm developing a health app meant to connect school to parents and children, specifically for vaccines and immunizations. In so doing, I have a back-end server that relies on the NodeJS and Apollo Server Express. I am using express to store session data, but I'm not sure this is the best workflow. Moreover, I am not sure what would be the best way for patients to connect to their FHIR Smart Card profile. <br>\nI'm sorry if these are obvious questions, but I can't seem to find guides for integration, or where to even begin finding a smart card provider. <br>\nIdeally, the clients would simply sign on to our app, and we would determine what their patient Id is, and fetch their immunization and vaccine records.<br>\nAny help is appreciated. <br>\nThanks in advance!</p>",
        "id": 235691697,
        "sender_full_name": "Hayden Veytia",
        "timestamp": 1619103146
    },
    {
        "content": "<p>There are a few options. If your goal is to allow users to share an existing health card with your app, you can enable this by having them scan a QR code, or selecting a file from the file system on their device. If the user has a health card already stored in a mobile Health wallet application, you may be able to use apis on the device to request data from that wallet (e.g., <span class=\"user-mention\" data-user-id=\"365368\">@James Kizer</span> might be able to share details about how the common health app will support this functionality).</p>",
        "id": 235719735,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1619113687
    },
    {
        "content": "<p>If the user does not yet have a health card in their possession, you could always build a FHIR API client to connect to a health system and request issuance of a health card.</p>",
        "id": 235720218,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1619113866
    },
    {
        "content": "<p>Depending on your trust model, you may not need health cards. I don't know if your app is running on behalf of the school district, or whether it is an intermediary to help individuals get their data organized for submission to the school district.</p>",
        "id": 235720354,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1619113920
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"407376\">@Hayden Veytia</span> , as Josh mentioned, CommonHealth will be making SMART Health Cards available via on-device data sharing. This will be a new feature that's being added to our existing SDK once support for SMART Health Cards is released in CommonHealth and we're still working to define the SDK surface for SMART Health Cards, but the developer workflow and user experience should more or less the same as our existing implementation for accessing traditional clinical data. The existing documentation can be found <a href=\"https://github.com/the-commons-project/CommonHealthClientSample\">here</a></p>",
        "id": 235730885,
        "sender_full_name": "James Kizer",
        "timestamp": 1619118139
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"407376\">Hayden Veytia</span> <a href=\"#narrow/stream/284830-smart.2Fhealth-cards/topic/Apollo.20Server.20Immunizations/near/235691697\">said</a>:</p>\n<blockquote>\n<p>Hi, I'm developing a health app meant to connect school to parents and children, specifically for vaccines and immunizations. In so doing, I have a back-end server that relies on the NodeJS and Apollo Server Express.</p>\n</blockquote>\n<p>Have care with Apollo.  GraphQL support is extremely nascent in the FHIR ecosystem, and you'll find that not much of the spec actually embraces it.</p>",
        "id": 235743734,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1619123862
    },
    {
        "content": "<p>Thanks for the replies!</p>",
        "id": 236202289,
        "sender_full_name": "Hayden Veytia",
        "timestamp": 1619453738
    }
]