[
    {
        "content": "<p>How should we handle COVID booster shots as part of the spec?  Would we include all of the shots in the QR code, or just the most recent 1 or 2?</p>",
        "id": 246738484,
        "sender_full_name": "Brian Agnes",
        "timestamp": 1626882594
    },
    {
        "content": "<p>I think the current advice is: when issuing SMART Health Card with types (<code>#covid19</code> &amp;&amp; <code>#immunization</code>), you should include any relevant COVID-19 immunizations you know about. So if an individual has had an initial series of two doses plus a \"booster\", and the issuer knows about all three of these, it'd make sense to pack all three into a single SMART Health Card.</p>",
        "id": 246739450,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1626883037
    },
    {
        "content": "<p>From a FHIR resource perspective, a booster Immunization resource looks just like part of the original series of shots, unless the formulation changes so a different <code>vaccineCode</code> is needed.</p>",
        "id": 246746815,
        "sender_full_name": "Max Masnick",
        "timestamp": 1626886254
    },
    {
        "content": "<p>(This is indeed a big part of the value of <em>not</em> trying to capture intended protocols, \"dose 2 of 2\", etc -- dose \"2 of 2\" can easily turn into \"2 of 3\"... er. \"2 of 5\"... over time.)</p>",
        "id": 246756903,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1626890670
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> <span class=\"user-mention\" data-user-id=\"328301\">@JP Pollak</span>  Do we know when CVX/SNOMED may be updating codes for boosters?</p>",
        "id": 258555452,
        "sender_full_name": "G D",
        "timestamp": 1634826601
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"322501\">@Max Masnick</span> may be better equipped to respond. (I think the main thing is dose, yes? Like, someone who received a full dose \"as a booster\" would have the regular CVX code, and someone who received a half-dose might have a different CVX code?)</p>",
        "id": 258570434,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1634831545
    },
    {
        "content": "<p>I'm honestly not sure. We can definitely ask the CVX folks.</p>",
        "id": 258583309,
        "sender_full_name": "Max Masnick",
        "timestamp": 1634836416
    },
    {
        "content": "<p>In my experience, the booster was captured against the same CVX code. I received Pfizer for each of the 3 doses and they were recorded in the same EHR.</p>",
        "id": 258595728,
        "sender_full_name": "Michael Turman",
        "timestamp": 1634841239
    },
    {
        "content": "<p>The Pfizer booster is the same quantity as the first two shots; but the recently FDA emergency-use approval for Moderna is for a half dose, right?</p>",
        "id": 258601765,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1634843848
    },
    {
        "content": "<p>CVX codes 217/218/219 are for different Pfizer formulations, but I think those are the kids versions? <a href=\"https://www.cdc.gov/vaccines/programs/iis/COVID-19-related-codes.html\">https://www.cdc.gov/vaccines/programs/iis/COVID-19-related-codes.html</a></p>",
        "id": 258608897,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1634846827
    },
    {
        "content": "<p>Just to confirm \"booster\" doses or \"extra doses\" of a vaccine are generally given the same CVX code as the series, and this applies to Covid as well. The CVX doesn't indicates the agent given, not which part of the schedule it is intended to meet. We expect that Covid is going to have lots of schedule changes and the goal of CVX is just to record what was given. And what it means may change as future revisions are done.</p>",
        "id": 258953814,
        "sender_full_name": "Nathan Bunker",
        "timestamp": 1635166293
    },
    {
        "content": "<p>I know that there is a Moderna half dose. This is still using the same CVX code because the NDC code is going to be the same. We are advocating that it would be best if we had a separate NDC, maybe that will happen in the future. If we do then we could have a CVX specific for these half-doses, but until then we won't. For now the correct way to code these half-doses in a SHC is just the same as the full doses. In a full profile you could indicate the dosage amount, but as long as the dosage was correct for the age then it's considered an effective dose. We also have some guidance from ACIP on how to record doses based on dose amount:</p>",
        "id": 258954477,
        "sender_full_name": "Nathan Bunker",
        "timestamp": 1635166603
    },
    {
        "content": "<p><a href=\"/user_uploads/10155/UQUUtcK1a9PHKnyXiLpDn9xI/ACIP-recommendations.png\">ACIP-recommendations.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/UQUUtcK1a9PHKnyXiLpDn9xI/ACIP-recommendations.png\" title=\"ACIP-recommendations.png\"><img src=\"/user_uploads/10155/UQUUtcK1a9PHKnyXiLpDn9xI/ACIP-recommendations.png\"></a></div>",
        "id": 258954729,
        "sender_full_name": "Nathan Bunker",
        "timestamp": 1635166747
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"193813\">@Nathan Bunker</span> !</p>",
        "id": 258967286,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1635172401
    }
]