[
    {
        "content": "<p>From <a href=\"http://build.fhir.org/ig/dvci/vaccine-credential-ig/branches/main/conformance.html#data-minimization\">http://build.fhir.org/ig/dvci/vaccine-credential-ig/branches/main/conformance.html#data-minimization</a></p>\n<blockquote>\n<p>Implementers SHALL use resource:0 syntax for IDs and references</p>\n</blockquote>\n<p>Where is the URI scheme resource: defined?</p>",
        "id": 235424627,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1618956897
    },
    {
        "content": "<p>Great question.  +1 for this.  I just rolled with it, but first I'd ever seen or heard of it.</p>",
        "id": 235425491,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1618957393
    },
    {
        "content": "<p>There's an old provisional scheme (prov/resource) sitting in the <a href=\"https://www.iana.org/assignments/uri-schemes/uri-schemes.xhtml\">IANA registry</a> next to (prov/oid, which incidentally appears to be the OID scheme FHIR uses). It was used by firefox back in the day, but I don't think this usage is meaningfully related.</p>",
        "id": 235433765,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618962624
    },
    {
        "content": "<p>We could register a new scheme for this purpose; the functional requirements are basically: short, and works for bundle-relative links, e.g., with single-character suffixes</p>",
        "id": 235433838,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618962677
    },
    {
        "content": "<p>And if there's some documentation around this that would be helpful to include in the IG, please let us know what you'd like to see.</p>",
        "id": 235433863,
        "sender_full_name": "Max Masnick",
        "timestamp": 1618962704
    },
    {
        "content": "<p>I'd like us to be practical about the benefits of changing this, though -- like, if we register a new <code>fhir-bundled:</code> scheme with IANA and switch to that... would this be an improvement?</p>",
        "id": 235434144,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618962880
    },
    {
        "content": "<p>I'm not sure. I don't mind resource:. but the IG should be explicit about the provenance of the URL scheme</p>",
        "id": 235441659,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1618968982
    },
    {
        "content": "<p>but the usage is not consistent with <a href=\"https://www.iana.org/assignments/uri-schemes/prov/resource\">https://www.iana.org/assignments/uri-schemes/prov/resource</a>. So that suggests making up our own</p>",
        "id": 235441699,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1618969032
    },
    {
        "content": "<p>That's why I say I don't think our usage is meaningfully related.</p>",
        "id": 235441715,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618969064
    },
    {
        "content": "<p>or use cid: from <a href=\"https://tools.ietf.org/html/rfc2392\">https://tools.ietf.org/html/rfc2392</a>, which would be consistent with how it was used in SOAP from my pov</p>",
        "id": 235441718,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1618969072
    },
    {
        "content": "<p>I looked at this a while back when I was casting around for existing schemes... They seem longer and email like (e.g., <code>cid:foo4%25foo1@bar.net</code>).</p>",
        "id": 235441781,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618969123
    },
    {
        "content": "<p>well, they don't have to be email like, so far as I can see. but you may be right about being longer</p>",
        "id": 235441870,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1618969217
    },
    {
        "content": "<div class=\"codehilite\"><pre><span></span><code>     content-id    = url-addr-spec\n     message-id    = url-addr-spec\n     url-addr-spec = addr-spec  ; URL encoding of RFC 822 addr-spec\n     cid-url       = &quot;cid&quot; &quot;:&quot; content-id\n</code></pre></div>\n<p>... it refers to RFC822 for add-rspec, so I don't see how to avoid this.</p>",
        "id": 235441924,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618969275
    },
    {
        "content": "<p>hmm ok.</p>",
        "id": 235441939,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1618969301
    },
    {
        "content": "<p>If we wanted to change from <code>resource:0</code> I guess we'd just use <code>r:0</code> as the MITRE team suggested in a previous round of edits. I don't see value in breaking our \"v1\" implementers for this (given there's no practical implementation issue) but if folks feel strongly that it'd be a benefit, we could look at this as part of a v2 (I expect we'll have... a lot of proposed changes as we enter the HL7 consensus process).</p>",
        "id": 235442000,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618969338
    },
    {
        "content": "<p>back to resource:0, it supposed to be resource:{n} where n is a serially incrementing number? That's what I guess but it's not clear</p>",
        "id": 235442001,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1618969340
    },
    {
        "content": "<blockquote>\n<p>Grahame Grieve: back to resource:0, it supposed to be resource:{n} where n is a serially incrementing number? That's what I guess but it's not clear</p>\n</blockquote>\n<p>Yes that's the expectation, but any \"short\" suffix after <code>:</code> is OK currently. I'd like to be prescriptive as you suggest here.</p>",
        "id": 235442031,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618969374
    },
    {
        "content": "<p>well, being prescriptive would be good, but being clear would be better :-)</p>",
        "id": 235442113,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1618969453
    },
    {
        "content": "<p>I'm looking at this:</p>",
        "id": 235442126,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1618969464
    },
    {
        "content": "<p>Warning: FHIR validation currently does not work</p>\n<p>The FHIR Validator currently generates a number of spurious errors when validating resources that are in fact valid. This is due to the following issues:</p>\n<ul>\n<li>For data minimization reasons, we use absolute URIs in resource:# format within our Bundles. We recently received clarification that this is supported in FHIR R4, but the FHIR Validator does not fully support this yet.</li>\n<li>We do not include id elements in our resources for data minimization reasons. This element is not required as the cardinality is 0..1 (though this is only strictly allowed for sending resources to a server for create operations). The FHIR Validator requires id to be populated for all resources.</li>\n<li>The terminology server used by the FHIR Validator (<a href=\"http://tx.fhir.org\">tx.fhir.org</a>) does not support a number of value sets that we use, and some of the value sets that are supported our out of date (like CVX). This causes errors both in validating codes and Bundles that slice based on profiles with required value set bindings.</li>\n<li>You will see warnings related to <a href=\"http://meta.security\">meta.security</a> when validating that say A code with no system has no defined meaning. A system should be provided. This cannot be suppressed, but can be safely ignored.</li>\n</ul>",
        "id": 235442128,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1618969467
    },
    {
        "content": "<p>#1 I'm looking at this. I have a PR to support <code>resource:</code>, and that's why I'm checking the authority for that </p>\n<p>#2: I'll investigate. </p>\n<p>#3: I'll have to work on the phinvads code systems. CVX is fixed up now</p>\n<p>#4: I don't understand this at all. Why?</p>",
        "id": 235442446,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1618969774
    },
    {
        "content": "<blockquote>\n<p>I have a PR to support resource:, and that's why I'm checking the authority for that</p>\n</blockquote>\n<p>(1) Might aim to support <a href=\"http://jira.hl7.org/browse/FHIR-31422\">FHIR-31422</a> with support for any URI scheme when resolving from Reference.value in a bundle to Entry.fullUrl -- irrespective of scheme.</p>",
        "id": 235442536,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618969838
    },
    {
        "content": "<p>(4) the IG <a href=\"http://build.fhir.org/ig/dvci/vaccine-credential-ig/branches/main/#identity-assurance\">says to populate a value like</a>:</p>\n<div class=\"codehilite\"><pre><span></span><code>&quot;meta&quot;: {\n  &quot;security&quot;: [{&quot;code&quot;: &quot;IAL1&quot;}]\n}\n</code></pre></div>\n<p>... which is valid FHIR but generates a warning for lack of <code>Coding.system</code>.</p>",
        "id": 235442589,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618969907
    },
    {
        "content": "<p>an d so it should.FMG won't approve an IG that says that</p>",
        "id": 235443866,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1618971062
    },
    {
        "content": "<p>why not provide a system? (\"system\" : \"<a href=\"http://terminology.hl7.org/CodeSystem/loa\">http://terminology.hl7.org/CodeSystem/loa</a>\")</p>",
        "id": 235443890,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1618971101
    },
    {
        "content": "<p>The rationale was just not to burn bytes on something that can't vary. But we could populate a system here.</p>",
        "id": 235443952,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618971155
    },
    {
        "content": "<p>(It's really unclear how often issuers will be able to populate this with a meaningful value anyway. Our IG should probably recommend omitting LOA <em>1</em> markers anyway, because they don't really you anything useful.)</p>",
        "id": 235443995,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618971220
    },
    {
        "content": "<p>that's the same as a default value, which can't be asserted in an IG. It's worth the bytes on that one.</p>",
        "id": 235444005,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1618971233
    },
    {
        "content": "<p>and yes, I did wonder about that LOA as a security tag. It's more a tag at the most; Or actually, it's a statement about the provenance. I can't say whether it's useful or not in US context, but the usefulness of it is in the media here in Australia (by implication).</p>",
        "id": 235444092,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1618971313
    },
    {
        "content": "<p>I think that's fair, especially with the advice to omit LOA1</p>",
        "id": 235444098,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618971319
    },
    {
        "content": "<p>Yeah, I mean it's an important \"capability to have\" because in real life nobody is checking anything, and issuers that actually have id verification policies need a way to say it. But I don't think it'll make any practical difference, and mostly it'll be missing so the byte count is theoretical ;-)</p>",
        "id": 235444178,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618971376
    },
    {
        "content": "<p>As to where it belongs or how to convey it better... we had an extensive discussion that didn't reveal much, but led to some pragmatic suggestions</p>\n<ul>\n<li><a href=\"https://github.com/dvci/vaccine-credential-ig/issues/1\">https://github.com/dvci/vaccine-credential-ig/issues/1</a></li>\n<li><a href=\"#narrow/stream/179247-Security-and.20Privacy/topic/Representing.20IAL.20in.20FHIR\">https://chat.fhir.org/#narrow/stream/179247-Security-and.20Privacy/topic/Representing.20IAL.20in.20FHIR</a></li>\n</ul>",
        "id": 235444218,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618971465
    },
    {
        "content": "<p>well, the definition of security label is broader than I'd like, but I still think level of assurance of identity is a not a security property of the resource</p>",
        "id": 235444538,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1618971773
    },
    {
        "content": "<p>I thought it would be a property of the id, not the resource, but I see patient ids are profiled out. So I don't really follow the value of LOA anyway</p>",
        "id": 235444586,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1618971843
    },
    {
        "content": "<p>The use case is: explain whether/how you validated the patient's identity in the context of this immunization record.</p>",
        "id": 235444992,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618972268
    },
    {
        "content": "<p>It an differ from one immunization to the next (e.g., across vaccine doses)</p>",
        "id": 235445011,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618972288
    },
    {
        "content": "<p>so you claim that you did, but don't detail with id you used... how is that useful?</p>",
        "id": 235445090,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1618972370
    },
    {
        "content": "<p>?? You document the policy you applied, which could be \"we checked against some kind of gov't id\" vs \"we didn't do anything\".</p>",
        "id": 235445154,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618972420
    },
    {
        "content": "<p>It's useful because some verifiers may not want to trust records of immunizations where no identiy validation was performed. (In practice, I think I agree with you that much of the time it won't matter, but we need at least an official answer to this question.)</p>",
        "id": 235445254,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618972488
    },
    {
        "content": "<p>(When I received my first dose on Sunday, nobody asked for any kind of ID at all. This is pretty consistent with all the  experience of friends and family I've talked to here. So any vaccination credential I ultimately receive will be based on the name I used to <em>register</em> with Walgreens.)</p>",
        "id": 235445293,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618972527
    },
    {
        "content": "<p>my point is, what does it mean 'we checked against some id' when the id you checked with isn't specified?</p>",
        "id": 235455320,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1618980621
    },
    {
        "content": "<p>The demographics that you verified are specified, and the kind of source you verified against is specified.</p>",
        "id": 235455727,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618981107
    },
    {
        "content": "<p>I think you're just pointing out that we don't include specific document identifiers as part of this metadata, which is true because (for instance) your driver's license number is not critical to interpreting the fact that I verified your name and birthdate from your driver's license.</p>",
        "id": 235455785,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618981194
    },
    {
        "content": "<p>It's helpful to document the fact that I verified your name and birth date from a valid government ID, even without documenting more information about that id.</p>",
        "id": 235455963,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618981307
    },
    {
        "content": "<p>if the id was provided, the details would be in the use code for the id. But ok, I can understand that a statement that some government id was seen is useful. I do think it's an extension</p>",
        "id": 235468211,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1618991043
    },
    {
        "content": "<p>define what level of assurance is most likely to have been used, and say that is the meaning of none being indicated. Then you just have the edge cases of higher and lower that need to use up the bits to carry a value.</p>",
        "id": 235498179,
        "sender_full_name": "John Moehrke",
        "timestamp": 1619006877
    },
    {
        "content": "<p>we clearly are not using exactly the concept of any level of assurance, we are representing the kind of assurance commonly used in vaccine processing. Thus we should just define our own range of values, and not imply they are anything like NIST or other identity assurance standards.</p>",
        "id": 235498352,
        "sender_full_name": "John Moehrke",
        "timestamp": 1619006957
    },
    {
        "content": "<p>the assurance level that the vaccine-credential relying-parties \"want\" is very unlikely to be the one under which the patient was given the vaccine. Especially for covid, as the scale is well beyond typical scale. My family experience in Wisconsin is that they are requiring a government picture ID, but they have procedures for accepting a friendly face. I am sure the scale and urgency of covid vaccine, they are never sending someone  away. That someone may not realize they would not qualify for a high assurance vaccine-credential.</p>",
        "id": 235498733,
        "sender_full_name": "John Moehrke",
        "timestamp": 1619007152
    },
    {
        "content": "<p>Adding to the 'assurance level' discussion, as a vendor, we do not have visibility to an Issuer's SOPs related to identity verification, so we will not be populating that field. To do so would be a 'guess' on our part (and likely a default across all Issuers we support), which seems to defeat the purpose.</p>",
        "id": 235513211,
        "sender_full_name": "Michael Turman",
        "timestamp": 1619013111
    },
    {
        "content": "<p>Fortunately, the cases where issuers <em>don't</em> populate this field are very easy to model ;-)</p>",
        "id": 235537128,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1619021055
    },
    {
        "content": "<p>For cases where we <em>do</em> populate this field, we've have prolonged discussion about <code>extension</code> vs <code>Meta.security</code> vs. <code>Meta.tag</code>. Any of these will work equivalently; we settled on <a href=\"http://Meta.security\">Meta.security</a> in the current spec based on feedback from discussion. I'd rather not thrash without a clear rationale.</p>",
        "id": 235537301,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1619021132
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> <span class=\"user-mention\" data-user-id=\"353749\">@Michael Turman</span> -- what's the consensus here regarding <code>Meta.security</code>? It sounds to me like:</p>\n<ol>\n<li>We are going to continue using <code>Meta.security</code> unless there's a rational for a different approach</li>\n<li>We need to provide <code>Meta.security.system</code>. <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> Is <code>http://terminology.hl7.org/CodeSystem/loa</code> the correct system? This URI doesn't resolve, and I don't see anything related to this on <a href=\"https://terminology.hl7.org/codesystems.html\">https://terminology.hl7.org/codesystems.html</a> (but maybe I'm just missing it)</li>\n</ol>\n<p>Is that right? If so I'll add an issue on GitHub for this.</p>",
        "id": 235550310,
        "sender_full_name": "Max Masnick",
        "timestamp": 1619026270
    },
    {
        "content": "<p>(3) Captured in <a href=\"https://github.com/dvci/vaccine-credential-ig/issues/115\">https://github.com/dvci/vaccine-credential-ig/issues/115</a> already (\"Recommend against including LOA1\")</p>",
        "id": 235550756,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1619026441
    },
    {
        "content": "<p>I think for (2) Grahame was saying... we'd need to define a new valueset and get HL7 to agree to publishing it, which creates a bit of a dependency for us. I guess the best we could do would be to <em>assume</em> we can get this through, but the name or the contents could change in ways we don't anticipate.</p>",
        "id": 235550957,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1619026511
    },
    {
        "content": "<p>you have a value set. you just need to specify to fill out <code>Meta.security.system</code> with the value <code>http://terminology.hl7.org/CodeSystem/loa</code>. I don't see why there would be anything else required</p>",
        "id": 235575616,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1619036765
    },
    {
        "content": "<p>Just that <a href=\"http://terminology.hl7.org/CodeSystem/loa\">http://terminology.hl7.org/CodeSystem/loa</a> needs to exist (or have a path to existing -- e.g. if we hit a snag and HL7 doesn't approve this name, that'd require a bit of rework)</p>",
        "id": 235576158,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1619037022
    },
    {
        "content": "<p>ah you are defining that yourself. Well, you can define it yourself, but then you need to give it the URL <code>http://hl7.org/fhir/uv/smarthealthcards-vaccination/CodeSystem/loa</code>. Or else you need to propose it through UTG. I think you're supposed to do UTG for stuff like this, but I'm not sure what the policy is right now </p>\n<p>btw I am surprised at the length of the canonical here. Is this sometihng FMG approved? shc-vci would be shorter...</p>",
        "id": 235576539,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1619037217
    },
    {
        "content": "<p><a href=\"http://hl7.org/fhir/uv/smarthealthcards-vaccination/CodeSystem/loa\">http://hl7.org/fhir/uv/smarthealthcards-vaccination/CodeSystem/loa</a> is definitely too long ;-)</p>",
        "id": 235577348,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1619037612
    },
    {
        "content": "<p>And for sure not having <code>vaccination</code> in the url would be good, given the scope is broader.</p>",
        "id": 235577382,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1619037631
    },
    {
        "content": "<p>I think we are supposed to request this through UTG. I'm becoming good friends with Vocab so I'll ask them for help with this :)</p>",
        "id": 235587059,
        "sender_full_name": "Max Masnick",
        "timestamp": 1619041321
    },
    {
        "content": "<p>(Re: canonical URL for the IG though, it'd be good to update that even if we use a UTG-based LOA vocab.)</p>",
        "id": 235588126,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1619041851
    },
    {
        "content": "<blockquote>\n<p>The FHIR Validator requires id to be populated for all resources.</p>\n</blockquote>\n<p>not any more as of next release. Now it depends on the bundle type</p>",
        "id": 235615425,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1619062776
    },
    {
        "content": "<p>will type=\"collection\" require .id?</p>",
        "id": 235690827,
        "sender_full_name": "Paul Denning",
        "timestamp": 1619102835
    },
    {
        "content": "<p>no</p>",
        "id": 235729080,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1619117368
    },
    {
        "content": "<p>The LOA codes already exist in HL7 in this valueset <a href=\"https://terminology.hl7.org/ValueSet-v3-SecurityTrustObservationValue.html\">https://terminology.hl7.org/ValueSet-v3-SecurityTrustObservationValue.html</a><br>\nThus your codesystem would be <a href=\"http://terminology.hl7.org/CodeSystem/v3-ObservationValue\">http://terminology.hl7.org/CodeSystem/v3-ObservationValue</a></p>",
        "id": 236489633,
        "sender_full_name": "John Moehrke",
        "timestamp": 1619609105
    },
    {
        "content": "<p>Based on our discussion in <a class=\"stream\" data-stream-id=\"179247\" href=\"/#narrow/stream/179247-Security-and-Privacy\">#Security and Privacy</a>  we needed to craft specific new \"intermediate\" LOA codes to capture the fact that most real-world id verifications don't reach IAL2.</p>",
        "id": 236497486,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1619612878
    },
    {
        "content": "<p>I agree adding a code to the HL7 managed codesystem is appropriate. (Adding a code to a codesystem managed by NIST would not be appropriate for us to do). But this is clearly a need driven code, and the current LOA codes are in an HL7 managed codesystem.</p>",
        "id": 236655763,
        "sender_full_name": "John Moehrke",
        "timestamp": 1619694861
    },
    {
        "content": "<p>if you think the URL is too long, then how about using the OID?  <br>\n<code>urn:oid:2.16.840.1.113883.5.1063</code></p>",
        "id": 236656191,
        "sender_full_name": "John Moehrke",
        "timestamp": 1619695087
    },
    {
        "content": "<p>Here is my take on this:   <strong>IAL 1.5</strong>.     <a href=\"https://github.com/TransparentHealth/healthcare-trustmark\">https://github.com/TransparentHealth/healthcare-trustmark</a>    Feel free to use/adapt this if you want.  I think some refinement/maturity is needed around 1.5 criteria, but you get the general idea.   I don't think 1.2, 1.4, 1.8, etc is needed or desirable. Just a single level between IAL 1 and 2 is enough IMHO.  I would really like to discuss this notion with NIST, ONC, CMS, etc.</p>",
        "id": 236668325,
        "sender_full_name": "Alan Viars",
        "timestamp": 1619701308
    },
    {
        "content": "<p>getting back to this resource issue... I think that resource: is superceded allowed by <a href=\"http://jira.hl7.org/browse/FHIR-31422\">J#31422</a>, but I also think that something more specific should be used. I see some resistance about to just fixing it, but I think it should be done at some stage. Anyway, next release of the validator will OK any absolute URL that is an internal reference in a bundle</p>",
        "id": 237433978,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1620183838
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191404\">John Moehrke</span> <a href=\"#narrow/stream/284830-smart.2Fhealth-cards/topic/Bundle.20Format/near/235498179\">said</a>:</p>\n<blockquote>\n<p>define what level of assurance is most likely to have been used, and say that is the meaning of none being indicated. Then you just have the edge cases of higher and lower that need to use up the bits to carry a value.</p>\n</blockquote>\n<p>I’m wondering if the IAL level etc is really relevant if one can use something like a ICAO passport key to be embedded in a verifiable credential that’s included the smart on fhir card and it’s presentation?</p>",
        "id": 237522468,
        "sender_full_name": "Peter Bachman",
        "timestamp": 1620230972
    },
    {
        "content": "<p>We don't have a \"passport key\" embedded in Health Cards, though. We're trying to graft the Health Cards ecocystem onto existing patient identity practices.</p>",
        "id": 237531520,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1620234546
    },
    {
        "content": "<p>Any chance updated validator will be released before the Connectathon?</p>",
        "id": 238487553,
        "sender_full_name": "Neelima Karipineni",
        "timestamp": 1620831322
    },
    {
        "content": "<p>I think this is a question for <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> or <span class=\"user-mention\" data-user-id=\"248736\">@Mark Iantorno</span></p>",
        "id": 238502279,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1620836256
    },
    {
        "content": "<p>If the changes are in the codebase I can release at any time</p>",
        "id": 238502928,
        "sender_full_name": "Mark Iantorno",
        "timestamp": 1620836499
    },
    {
        "content": "<p>are the changes you want currently committed? I can release now if you _need_ it</p>",
        "id": 238503069,
        "sender_full_name": "Mark Iantorno",
        "timestamp": 1620836549
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194164\">@Neelima Karipineni</span></p>",
        "id": 238503082,
        "sender_full_name": "Mark Iantorno",
        "timestamp": 1620836557
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"248736\">@Mark Iantorno</span> . I was referring to <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> 's earlier comment about upcoming fix for allowing reference URLs that are internal references in a bundle. I just checked the org.hl7.fhir.validation repo and I couldn't identify a commit in BundleValidator for this. Unless I'm missing something, I think not ready for release.</p>",
        "id": 238512230,
        "sender_full_name": "Neelima Karipineni",
        "timestamp": 1620840323
    },
    {
        "content": "<p>Once the fix is in, shoot me a message and I'll do a release for you</p>",
        "id": 238525275,
        "sender_full_name": "Mark Iantorno",
        "timestamp": 1620845414
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"248736\">@Mark Iantorno</span> I had intended to get a release out a few days ago, but that went to hell. I'm on the road today, so I'll commit some stuff tonight, and you can push a new version out</p>",
        "id": 238565583,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1620866780
    },
    {
        "content": "<p>kk just let me know and I'll run it</p>",
        "id": 238565597,
        "sender_full_name": "Mark Iantorno",
        "timestamp": 1620866801
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"353749\">Michael Turman</span> <a href=\"#narrow/stream/284830-smart.2Fhealth-cards/topic/Bundle.20Format/near/235513211\">said</a>:</p>\n<blockquote>\n<p>Adding to the 'assurance level' discussion, as a vendor, we do not have visibility to an Issuer's SOPs related to identity verification, so we will not be populating that field. To do so would be a 'guess' on our part (and likely a default across all Issuers we support), which seems to defeat the purpose.</p>\n</blockquote>\n<p>As a practical matter the type of identification provided to get immunized at the point of service varies. For my use case involving tourism in Europe, I know the traveller will have a passport so I got a development license for a passport reader sdk which processes the data from the e-passport using a passport reader  and will combine that with the data minimized Immunization resource to sign it.</p>",
        "id": 238645409,
        "sender_full_name": "Peter Bachman",
        "timestamp": 1620923435
    },
    {
        "content": "<p>Looks like yesterdays' release of the validator resolves the warnings we were seeing related to new CVX codes and the <code>resource:0</code> syntax for URIs. Thank you!</p>",
        "id": 238785656,
        "sender_full_name": "Max Masnick",
        "timestamp": 1621006608
    },
    {
        "content": "<p>If you require a level of assurance, it's helpful to include 1 in order to describe the level of verification as \"self asserted\".</p>",
        "id": 246683362,
        "sender_full_name": "Julie Maas",
        "timestamp": 1626848274
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194368\">@Julie Maas</span> are you suggesting we should revise our current recommendation to omit LOA when it's \"just\" 1? (That's what we currently say, to avoid spending bytes communicating information that won't help \"convince\" a verifying party of anything.)</p>",
        "id": 246712589,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1626870970
    },
    {
        "content": "<p>From what I've seen, most real world Health Cards implementations today have no reliable way to reach levels higher than 1 (the issuer often just doesn't have this kind of information; it's not reliably tracked/knowable in individual cases).</p>",
        "id": 246712919,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1626871160
    },
    {
        "content": "<p>I thought that might still be up for discussion; until we are more formally capturing something like a declaration of identity (subject claims the indicated demographics belong to them), it's certainly less meaningful to indicate \"self asserted\" (IAL1). My thoughts are that taking 1 away leaves its absence more ambiguous, though (NULL could mean either self asserted OR unknown); I also thought that some level of assurance was always required in the SHC spec. (What does that mean for an entity that cannot assert 1.2, 1.4, or 2?) If the community feedback is that \"1\" is not meaningful and won't be used, that does say something &amp; I can understand the decision in that case. I suppose IAL1 is still in the new ValueSet so other workflows can opt to use it if it makes sense in their use cases.</p>",
        "id": 246722719,
        "sender_full_name": "Julie Maas",
        "timestamp": 1626875750
    }
]