[
    {
        "content": "<p>If I have lab tests and vaccination records for a patient would I create 1 or 2 QR codes?  I know that if JWT gets too large that it will auto span multiple QR code.  What I am asking is: should a single JWT be created with all the info?</p>",
        "id": 239490790,
        "sender_full_name": "Brian Agnes",
        "timestamp": 1621456127
    },
    {
        "content": "<p>Our general advice is to only bundle information if an IG (and the use case the IG is based on) needs this information presented together. That's a non-answer, but a framework for thinking about it.</p>",
        "id": 239491204,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1621456295
    },
    {
        "content": "<p>The best recommendation right now is to keep things separate (other than doses of vaccine, which are combined; or observations associated with a given diagnostic report, which are combined)</p>",
        "id": 239491335,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1621456344
    },
    {
        "content": "<p>thanks for the answer</p>",
        "id": 239505341,
        "sender_full_name": "Brian Agnes",
        "timestamp": 1621463626
    },
    {
        "content": "<p>The FHIR IG also currently doesn't allow for lab results and immunizations to be mixed into the same Bundle. The reason for this is we wanted a closed slice so that other unexpected resources couldn't be included in a conforming Bundle. This is important to make sure data isn't unexpectedly added to a SHC by an Issuer that patient-facing applications can't display.</p>",
        "id": 239515521,
        "sender_full_name": "Max Masnick",
        "timestamp": 1621469933
    },
    {
        "content": "<p>We could technically add a bundle that includes both lab results and immunizations, but our sense is that this may hit up against payload limits. </p>\n<p>Also, patients may want to present just their immunizations but not their lab test, so there may be some benefits in keeping them separate.</p>",
        "id": 239515657,
        "sender_full_name": "Max Masnick",
        "timestamp": 1621470023
    }
]