[
    {
        "content": "<p>I'm just diving into Smart Health Cards (finally) and I've got some comments on the specification</p>\n<ul>\n<li>the spec should really explain the idea of 'fall back' profiles better. It's partially explained, but I had to go hunting for that. </li>\n<li>It's a bit mystifying that Patient.name.period is allowed, but only one <a href=\"http://Patient.name\">Patient.name</a> is allowed.</li>\n<li>I would have thought that Patient.name.text could be excluded for US use. But given that it can't be and the comments on it. it's a bit weird to not mark it as must-support</li>\n<li>there's no need to download the package for validation - just refer to it by package  id (and version)</li>\n<li>is there any usefulness in the FHIR Validator being able to validate the JWS directly? </li>\n<li>what is the expectation for patient profiles for other countries? Same IG, or different?</li>\n<li>I believe that the DM profile for patient will be a problem in Australia, since the clinical standard here is three facts for identifying people, while the card only has two - name, dob. Why not include gender as at least allowed? (I may be wrong in my surmise; this may never qualify as clinical - I've given up predicting how these things play out)</li>\n<li>The identity proofing levels for vaccination don't match what's happening here in Australia at GPs: the GPs don't explicitly check your identity when you get the injection, but you're 50% likely to get a person who knows you personally when you turn up, and the GPs talk to you about it before and afterwards. So: no ID was used, but there's actually a pretty good verification system in place (enough? I'll leave that to others to debate)</li>\n<li>why is immunization status 'entered=in-error' allowed in this context? under what circumstances would that ever appear in a card? I would have thought that if it's allowed, it's use should be discussed. I think of entered-in-error as a primary record source thing</li>\n<li>where does dose number go in the immunization resource? The example descriptions talk about dose number but I don't see it in the example</li>\n<li>The lab binding for Observation.code is bound to a US Specific value set?</li>\n<li>surely the lab profile could fix to a dateTime not a period for effective[x}?</li>\n<li>There's no use case for a card that contains both Immunization and lab result records?</li>\n</ul>",
        "id": 251654386,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1630547034
    },
    {
        "content": "<p>Not sure if this an 'entered-in-error' use case, but there have been some cases in NZ where <a href=\"https://www.stuff.co.nz/national/health/coronavirus/300390578/covid19-vaccine-mistake-in-auckland-sparks-investigation\">patients mistakenly received a dose of saline solution, instead of a COVID-19 vaccination</a>. Pre-COVID-19 vaccination Identity checks (plus general health and 'any previous adverse reaction' ?s) are taking place here, notably where administration is at pharmacies or large-scale events; but I get also get asked those questions before my annual flu jab at the local general practice where I'm well-known.</p>",
        "id": 251665744,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1630558267
    },
    {
        "content": "<p>indeed there have been such cases, and in those cases, the primary source should absolutely have an 'entered-in-error' record. But why would you get a card for that?</p>",
        "id": 251666785,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1630559298
    },
    {
        "content": "<p>Guess it depends on what the card is supposed to prove, or disprove. Many have a physical card given when vaccinated, but the electronic record may be modified or augmented after that so the SMART Heath Card might differ - although this is probably an edge case with regard to COVID-19 vaccinations anyway.</p>",
        "id": 251667496,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1630560045
    },
    {
        "content": "<p>Thanks for this feedback <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  -- will you also submit through ballot, or shall we track here? I'll create sub-topics here for a few where I have some thoughts, at any rate.</p>",
        "id": 251731238,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1630595474
    },
    {
        "content": "<p>I didn't sign up for ballot - was out in the bush when sign up was open</p>",
        "id": 251766650,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1630608661
    },
    {
        "content": "<p>I am signed up so if you want me to put ballot weight behind any comments for you on jira I am happy to do so :-)</p>",
        "id": 251766785,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1630608704
    }
]