[
    {
        "content": "<p>Does this always have to be fhir?  what if the data was in HL7 2.x?  Would it need to be converted to to fhir?</p>",
        "id": 237309437,
        "sender_full_name": "Richard Braman (FLY.HEALTH)",
        "timestamp": 1620129094
    },
    {
        "content": "<p>Is there a possibility for duplicate credentials?  Because the  NBF value is changing, each generation is unique at the credential level.  But what about at the credential subject level?  Is it bad for two credentials to exist from the same issuer with the same credential Subject?</p>",
        "id": 237312875,
        "sender_full_name": "Richard Braman (FLY.HEALTH)",
        "timestamp": 1620130681
    },
    {
        "content": "<p>What is the harm in 'duplicate' credentials? Both can be independently verified.<br>\nA consumer may request their SHC from one device, and then use a different device and request the SHC again - I don't see any problems in supporting that workflow from an Issuer or Verifier perspective.</p>",
        "id": 237335696,
        "sender_full_name": "Michael Turman",
        "timestamp": 1620139194
    },
    {
        "content": "<p>We don't try to express any constraints about the universe of credentials; we're focused on helping issuers create a narrowly defined set of Health Cards for purposes of broad interoperability. Issuers are free and welcome to generate other credentials (and of course to share data in other formats that might not be verifiable), but that is beyond the scope of this project.</p>",
        "id": 237336297,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1620139392
    },
    {
        "content": "<p>Josh, I get that. But isn't the most broadly implemented interop standard for immunizations and lab results hl7 2.x ?</p>",
        "id": 237358397,
        "sender_full_name": "Richard Braman (FLY.HEALTH)",
        "timestamp": 1620146306
    },
    {
        "content": "<p>are we just saying fhir only in the credential subject?</p>",
        "id": 237358777,
        "sender_full_name": "Richard Braman (FLY.HEALTH)",
        "timestamp": 1620146480
    },
    {
        "content": "<p>We're saying a lot more than just \"FHIR\"; we are providing specific profile guidance for these use cases, all in the context of FHIR.</p>",
        "id": 237362756,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1620148029
    },
    {
        "content": "<p>While it is true that many connections between EHR and public health use HL7v2, it does not follow that this format is suitable for consumer access and sharing (where it's important to align with other investments in consumer access; these are FHIR based).</p>",
        "id": 237363073,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1620148157
    },
    {
        "content": "<p>I think <span class=\"user-mention\" data-user-id=\"396697\">@Richard Braman (FLY.HEALTH)</span>  has a pretty valid point here.  An HL7 v2 representation would be much smaller and more easily ingestible by existing EHRs.   While I'm no fan of Hl7 v2, this is a  more compact way to represent the same data.   I made  an ADT to Identity structure converter  last spring which is somewhat relevant. <a href=\"https://github.com/TransparentHealth/oauth2org/blob/adt/apps/adt/parse_adt.py\">https://github.com/TransparentHealth/oauth2org/blob/adt/apps/adt/parse_adt.py</a>  It accepts an  HL7v2 ADT stream and outputs id_token like JSON objects.</p>",
        "id": 237403137,
        "sender_full_name": "Alan Viars",
        "timestamp": 1620163586
    },
    {
        "content": "<p>A custom JSON schema would be compact and contemporary :-)</p>",
        "id": 237404683,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1620164335
    },
    {
        "content": "<p>Even if we used v2 instead of FHIR, new profiles would have to be developed. Existing standard messages like VXU and the RSP_K11 z32 profile don't comply with the health card requirement for data minimization/privacy. A lot of data elements that are currently allowed (encounter details, insurance info) would have to be disallowed. So any currently implemented standard for interop in IIS or LIS systems would still have to be modified/enhanced.</p>",
        "id": 237408700,
        "sender_full_name": "Neelima Karipineni",
        "timestamp": 1620166299
    },
    {
        "content": "<p>I would add that while state systems don't widely support FHIR. They do support HL7 v2 quite extensively, but these were designed for a different workflow (IIS to EHR or IIS to IIS). They are not prepared to support a \"consumer access\" interface. The biggest problem facing state systems is not the message format, it is the interaction with consumers. Converting the data from an HL7 v2 RSP format into FHIR and then into VCI is a pretty straightforward technical exercise. We did this in an internal project and it was completed in a few hours, message format is one of our easier problems to solve. We are expecting to continue using HL7 v2 for our legacy interfaces and are looking to FHIR to support new cases.</p>",
        "id": 238556086,
        "sender_full_name": "Nathan Bunker",
        "timestamp": 1620860059
    }
]