[
    {
        "content": "<p>Hi Guys, I've been trying to generate a SMART Health Card JWT using .net and have struggled with the requirement that the payload is compressed with DEFLATE. I'm no expert at JWT but my reading leads me to believe that a JWT payload must be JSON and not compressed JSON. Of course, I do understand why compression is desired but do the specifications for JWT allow this? If I read RCF 7519 section 7.2 Validating a JWT, it says in point 10 \"Verify that the resulting octet sequence is a UTF-8-encoded representation of a completely valid JSON object conforming to RFC 7159 [RFC7159]; let the JWT Claims Set be this JSON object\" I'm also lead to the very same reference if I paste one of the examples from the   <a href=\"https://smarthealth.cards/\">https://smarthealth.cards/</a> into the site <a href=\"https://jwt.io/\">https://jwt.io/</a>. Can someone help me understand what I am missing here? Is it possible that I struggle with the standard .net classes for JWT generation due to this point?</p>",
        "id": 238239382,
        "sender_full_name": "Angus Millar",
        "timestamp": 1620697992
    },
    {
        "content": "<p>I went through the same thing. A SMART Health Card is a JWS, not a JWT. A JWT has a JSON payload, but a JWS can have an arbitrary payload. Since it's not a JWT, <a href=\"http://jwt.io\">jwt.io</a> isn't very helpful, and you'll need to be sure that you are using a JWS library rather than a JWT library.</p>",
        "id": 238311416,
        "sender_full_name": "Stephen MacVicar",
        "timestamp": 1620741391
    },
    {
        "content": "<p>Indeed -- <a href=\"https://github.com/smart-on-fhir/health-cards/issues/128#issuecomment-826854186\">https://github.com/smart-on-fhir/health-cards/issues/128#issuecomment-826854186</a> has some additional details and background on this point.</p>",
        "id": 238356478,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1620756240
    },
    {
        "content": "<p>Let us know if you're having trouble finding libraries that work with JWS, once you get to this stage; we'd like to have good library references/recommendations for common languages.</p>",
        "id": 238356597,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1620756276
    },
    {
        "content": "<p>Ok, thankyou <span class=\"user-mention\" data-user-id=\"225612\">@Stephen MacVicar</span>  and <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> , I will keep digging</p>",
        "id": 238390707,
        "sender_full_name": "Angus Millar",
        "timestamp": 1620771838
    }
]