[
    {
        "content": "<p>We are looking to display the issuer along with the SHC content, but the \"iss\" url can be awfully cryptic. Is there a known way for mapping the issuer back to something human readable?</p>",
        "id": 241547090,
        "sender_full_name": "Matt Printz",
        "timestamp": 1622818397
    },
    {
        "content": "<p>Taking the ISS back to an Issuer directory is one path - the VCI team is working on standing up an interim directory until more formal trust frameworks are in place. The design for the directory includes a 'display' name and optional logo for each Issuer.</p>",
        "id": 241553810,
        "sender_full_name": "Michael Turman",
        "timestamp": 1622821224
    },
    {
        "content": "<p>Thanks Michael. Do we know if the directory will have an API so that we can pull down and cache the display name info?</p>",
        "id": 241573900,
        "sender_full_name": "Matt Printz",
        "timestamp": 1622830455
    },
    {
        "content": "<blockquote>\n<p>\"iss\" url can be awfully cryptic. Is there a known way for mapping the issuer back to something human readable?</p>\n</blockquote>\n<p>This is indeed the kind of thing a trust framework can help with -- but it's also the reason why we encourage <code>iss</code> URLs to be meaningful, because without a trust framework, that's often all you've got. (And to state the obvious: relying on an <em>untrustworthy</em> source of this mapping leads to confusion and mistakes for a verifier.)</p>",
        "id": 241575348,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1622831263
    },
    {
        "content": "<p>The directory is hosted in a public repo and could be cached. <span class=\"user-mention\" data-user-id=\"383014\">@Daniel Levenson</span>  can weigh in with more specifics.</p>",
        "id": 241603247,
        "sender_full_name": "Michael Turman",
        "timestamp": 1622848852
    },
    {
        "content": "<p>Apologies for the delayed follow-up here. I'm no longer working on the trust directory with TCP, but I believe the latest thinking is that name is a recommended (but technically not a required) field on an VC Issuer within a trust directory and very much cache-able. Plan is to host a JSON file on a publically accessible GH repo, so an API with one endpoint (GET path/to/issuers.json). However, <span class=\"user-mention\" data-user-id=\"328301\">@JP Pollak</span> and <span class=\"user-mention\" data-user-id=\"365368\">@James Kizer</span> are the best point of contacts for this information going forward.</p>",
        "id": 242237391,
        "sender_full_name": "Daniel Levenson",
        "timestamp": 1623344169
    }
]