[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"322501\">@Max Masnick</span> You asked for examples outside Covid where knowing the manufacturer is important for understanding the patient history. I've been pinging another expert here and going through codes and have some information. The complexity of coding Covid is similar to other vaccinations, we don't see any new patterns coming up with Covid. </p>\n<p>If a vaccination (including Covid) is coded with a good code system that indicates the specific formulation then the manufacturer information is not usually critical, and in fact in about 90% of cases knowing a CVX code can point to a single manufacturer. But there are cases where knowing the manufacture would be helpful, especially if the concept is not coded with enough specificity. So we typically ask for both, but in many cases only look at the manufacturer when the vaccine code is not clear enough. </p>\n<p>Here are some examples:</p>\n<p>Recombivax made by Merck is approved for 11 through 15 year old (2-doses) AND adults (3-doses). While Engerix made by GSK is only approved for adults (3 doses). (This is approved in the US, rules will vary by country.) </p>\n<p>Rotateq is a 3-dose vaccine and Rotarix is a 2 dose vaccine. They could both be reported by a generic Snomed code, in which case it would be important to know the manufacturer. (Although important to note that this wouldn't matter for any one over a year old as the vaccine is no longer recommended after that, even if they are not up-to-date on doses.)</p>",
        "id": 239481442,
        "sender_full_name": "Nathan Bunker",
        "timestamp": 1621451995
    },
    {
        "content": "<p>Thank you, this is really helpful.</p>\n<p>We're looking at refocusing the documentation around this in the FHIR IG around identifying formulation based on our discussion today. This wouldn't change the computable part of the IG, just the accompanying documentation.</p>",
        "id": 239483412,
        "sender_full_name": "Max Masnick",
        "timestamp": 1621452855
    }
]