[
    {
        "content": "<p>Hi,</p>\n<p>Akinox is the producer of SHC for the province of Quebec in Canada. We have been ask to include information in the SHC that would indicate a patient is exempt from the covid-19 vaccination due to his conditions. Has there been talk to include the FHIR Condition object in the SHC standard? If so could you point out where I can read about this. </p>\n<p><a href=\"https://www.hl7.org/fhir/condition.html\">https://www.hl7.org/fhir/condition.html</a></p>\n<p>Thank you</p>\n<p>David Charron<br>\nAkinox</p>",
        "id": 250399476,
        "sender_full_name": "David Charron",
        "timestamp": 1629746698
    },
    {
        "content": "<p>Hi David! This is not currently supported in the SHC FHIR IG for Vaccination &amp; Testing.</p>",
        "id": 250399986,
        "sender_full_name": "Max Masnick",
        "timestamp": 1629746964
    },
    {
        "content": "<p>I'd love to hear more about the use cases for this enhancement though, especially from the Verifier's perspective.</p>",
        "id": 250400355,
        "sender_full_name": "Max Masnick",
        "timestamp": 1629747129
    },
    {
        "content": "<p>Hi Max,</p>\n<p>One example is for pregnant women that are not eligible for vaccination.  This condition has an end (as you can guess it's about 9 months) . So the verifier Akinox is also providing must be able to to show \"green\" even thought the patient is not fully vaccinated.</p>\n<p>Another example is for immunosuppress patient.</p>\n<p>David.</p>",
        "id": 250400893,
        "sender_full_name": "David Charron",
        "timestamp": 1629747452
    },
    {
        "content": "<p>Ok, thanks for the information. We will consider this enhancement for a future release.</p>\n<p>If you can share more information about how Verifiers will change how they handle an unvaccinated person based on the reason they are unvaccinated, that would be helpful for us to understand this use case.</p>\n<p>Also, it sounds like there may be different contraindications in your jurisdiction than in the US where I believe the only contraindication is an allergic reaction to the vaccine. If you can share links to the official list of contraindications, that would also be helpful. Thanks!</p>",
        "id": 250433408,
        "sender_full_name": "Max Masnick",
        "timestamp": 1629768805
    },
    {
        "content": "<p>I expect these special cases will continue to appear. How do we continue to support the non-healthcare treatment use-case of this credential? Adding in the ability to carry these special cases is not hard, but each one adds complexity for the intended consumer to interpret; Meaning, the airline ticketing desk, etc.  Would seem a re-usable indicator for 'authorized special case' would be needed. right?</p>",
        "id": 250477134,
        "sender_full_name": "John Moehrke",
        "timestamp": 1629808251
    },
    {
        "content": "<p>thus the logic to determine a regional special case is actually legitimate is in the hands of the credential issuer, not all those trying to keep events safe. We already trust the credential issuer to confirm that the vaccine was properly given, so they already have the interpretation of legitimacy responsibility. This kind of a solution could then be used for any new special case that comes up. The compact credential stays stable format.</p>",
        "id": 250477533,
        "sender_full_name": "John Moehrke",
        "timestamp": 1629808491
    },
    {
        "content": "<p>I'm not 100% clear on what you're suggesting <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span>; <a href=\"https://spec.smarthealth.cards/#how-can-we-share-conclusions-like-a-safe-to-fly-pass-instead-of-sharing-clinical-results\">https://spec.smarthealth.cards/#how-can-we-share-conclusions-like-a-safe-to-fly-pass-instead-of-sharing-clinical-results</a> captures a bit of the design philosophy for SMART Health Cards (as I like to say, we're focused on conveying immutable clinical facts).</p>",
        "id": 250665920,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1629918291
    },
    {
        "content": "<p>Hi,</p>\n<p>Here is a sample of the implementation we have put in place</p>\n<p>{<br>\n   \"@context\":[<br>\n      \"<a href=\"https://www.w3.org/2018/credentials/v1\">https://www.w3.org/2018/credentials/v1</a>\"<br>\n   ],<br>\n   \"type\":[<br>\n      \"VerifiableCredential\",<br>\n      \"https://smarthealth.cards#health-card\",<br>\n      \"https://smarthealth.cards#covid19\",<br>\n      \"https://smarthealth.cards#condition\",<br>\n      \"https://smarthealth.cards#laboratory\",<br>\n      \"https://smarthealth.cards#immunization\"<br>\n   ],<br>\n   \"credentialSubject\":{<br>\n      \"fhirVersion\":\"1.0.2\",<br>\n      \"fhirBundle\":{<br>\n         \"resourceType\":\"Bundle\",<br>\n         \"type\":\"Collection\",<br>\n         \"entry\":[<br>\n            {<br>\n               \"resource\":{<br>\n                  \"resourceType\":\"Patient\",<br>\n                  \"name\":[<br>\n                     {<br>\n                        \"family\":\"Test\",<br>\n                        \"given\":[<br>\n                           \"Sunny\"<br>\n                        ]<br>\n                     }<br>\n                  ],<br>\n                  \"birthDate\":\"1970-01-01\"<br>\n               }<br>\n            },<br>\n            {<br>\n               \"resource\":{<br>\n                  \"resourceType\":\"Condition\",<br>\n                  \"subject\":{<br>\n                     \"reference\":\"resource:0\"<br>\n                  },<br>\n                  \"code\":{<br>\n                     \"coding\":[<br>\n                        {<br>\n                           \"system\":\"<a href=\"https://mc.covid19.quebec.ca/\">https://mc.covid19.quebec.ca/</a>\",<br>\n                           \"code\":\"MC002\"<br>\n                        }<br>\n                     ]<br>\n                  },<br>\n                  \"onsetDateTime\":\"2021-08-26\"<br>\n               }<br>\n            }<br>\n         ]<br>\n      }<br>\n   }<br>\n}</p>",
        "id": 251610349,
        "sender_full_name": "David Charron",
        "timestamp": 1630522367
    },
    {
        "content": "<p>We've got a similar requirement in Ontario - we need to support exemptions for our \"vaccine certificate\". Some fields we consider: Exemption Type (e.g. Medical, Religious), Comments, Start Date, End Date, Status (Active, Inactive, Duplicate/Merged, Entered in Error). I'm wondering if an Observation resource would be a better match to this (rather than a Condition).</p>\n<p>I assume more and more jurisdictions will need to support exemptions. It would be great to have a common approach to accommodate this use case rather than have each jurisdiction implement this on their own.</p>",
        "id": 251748754,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1630602101
    },
    {
        "content": "<p>It's important to keep in mind that these \"exempt from public health requirements\" use cases go a bit beyond what SMART Health Cards is focused on conveying (which is: verifiable clinical information) and tips into the space of vaccine passports. <a href=\"https://spec.smarthealth.cards/#how-can-we-share-conclusions-like-a-safe-to-fly-pass-instead-of-sharing-clinical-results\">https://spec.smarthealth.cards/#how-can-we-share-conclusions-like-a-safe-to-fly-pass-instead-of-sharing-clinical-results</a> gets at the designing thinking here.</p>\n<p>That said, if you wanted to build on existing FHIR bundles for this use case, you could consider adding resources like:</p>\n<ul>\n<li><code>ImmunizationRecommendation</code> where <code>.recommendation.forecastStatus</code> is <code>contraindicated</code></li>\n<li><code>Basic</code> as a wrapper for your own custom semantics, like:</li>\n</ul>\n<div class=\"codehilite\"><pre><span></span><code>{\n  &quot;resourceType&quot;: &quot;Basic&quot;,\n  &quot;subject&quot;: {&quot;reference&quot;: &quot;resource:0&quot;},\n  &quot;code&quot;: {\n    &quot;coding&quot;: [{\n      &quot;system&quot;: &quot;https://yourdomain.example.org&quot;,\n      &quot;value&quot;: &quot;exempt-from-vaccine-requirements&quot;}]}\n}\n</code></pre></div>",
        "id": 251764910,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1630607971
    },
    {
        "content": "<p>You'd probably want to bake in time periods, so you knew how long the exemption lasts.</p>\n<p>I'd <em>strongly recommend against</em> even considering baking \"reasons\" into these assertions (like, you would certainly not want to say \"reason: pregnancy\" or \"reason: religious exception\")</p>",
        "id": 251765033,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1630608013
    },
    {
        "content": "<p>Thank you so much Josh! We've just started discussing this new requirement today, so your feedback is invaluable.</p>",
        "id": 251827872,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1630649751
    },
    {
        "content": "<p>In Ontario (one province over), the Ministry of Health policy says that an mRNA vaccine is safe for a pregnant woman to receive at any stage of pregnancy.   Local public policy that a verifier has on what is acceptable risk for individuals based on vaccination level varies by region and time and current conditions such as medical capacity.  </p>\n<p>How to deal with valid medical conditions that make persons unable to be vaccinated or more susceptible to infection even having been vaxed while still protecting privacy and preventing abuse from folks claiming that they should be exempt for religious or other non-sensical reasons is a tough problem to solve...  I like that the current spec is a clear statement of this is what you got, and when you got it.   For folks who don't have vaccinations, they should probably present a doctor's letter that explains why they cannot be vaccinated rather than look to this credential.</p>\n<p>It's a terrible idea that health policy would treat any unvaccinated (or more susceptible to infection) individual the same as a vaccinated person; these folks are at much higher risk for much more severe negative health outcomes.  Where possible we should try to accommodate the medically vulnerable with additional safety measures, however sadly once the 4th wave gets close to exhausting hospital capacity we'll probably need to exclude them from many settings for their own safety.</p>",
        "id": 252126870,
        "sender_full_name": "Deftdawg",
        "timestamp": 1630904364
    },
    {
        "content": "<p>Note that a <code>Basic</code> resource can't be added into any of the Bundles defined in <a href=\"http://hl7.org/fhir/uv/shc-vaccination/2021Sep/profiles.html\">http://hl7.org/fhir/uv/shc-vaccination/2021Sep/profiles.html</a>. These bundles are (intentionally) closed, and can only accept specific resources.</p>\n<p>The reason for this is so implementers know what to expect inside a SHC so they can properly assess/display everything.</p>\n<p>So from a FHIR conformance standpoint, the approach Josh suggests above would have to be in a separate SHC -- it couldn't be bundled in with the vaccine info without breaking conformance to the FHIR IG.</p>",
        "id": 252494906,
        "sender_full_name": "Max Masnick",
        "timestamp": 1631119982
    }
]