[
    {
        "content": "<p>We want to set up a recurring meeting for SHC FHIR IG ballot reconciliation discussion. The goal would be to decide on a proposed disposition for ballot comments, and review proposed implementations of the dispositions as needed. We would take the output of this process to PHWG for official voting.</p>\n<p>Until a few weeks ago, we had an every-other-Wednesday meeting at 12pm Eastern. Our current plan is to make this meeting weekly until ballot reconciliation is completed.</p>\n<p><span aria-label=\"alert\" class=\"emoji emoji-1f6a8\" role=\"img\" title=\"alert\">:alert:</span> For anyone who is interested in regularly participating, <strong>please tell me if 12pm Eastern on Wednesdays <em>doesn't</em> work</strong>. Barring objections to this time, we will begin meeting then on October 6.</p>",
        "id": 253441761,
        "sender_full_name": "Max Masnick",
        "timestamp": 1631722504
    },
    {
        "content": "<p>I can not make that time.</p>",
        "id": 253449571,
        "sender_full_name": "John Moehrke",
        "timestamp": 1631725029
    },
    {
        "content": "<p>for me, this conflicts with the weekly HL7 CDS wg call. Max, sure you don't want to use doodle? Your current method to solicit input is going to result in a lot of people telling you that a timeslot doesn't work; but what you need is to know which timeslot works for the greatest number of people.</p>",
        "id": 253490430,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1631741141
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span> yes, we are going to do a meeting time poll -- several people have indicated that they want to participate but this time isn't good.</p>",
        "id": 253578708,
        "sender_full_name": "Max Masnick",
        "timestamp": 1631797906
    },
    {
        "content": "<p><span aria-label=\"alert\" class=\"emoji emoji-1f6a8\" role=\"img\" title=\"alert\">:alert:</span> <strong>If you are interested in participating regularly in our ballot reconciliation calls:</strong></p>\n<p>Please fill out <a href=\"https://www.when2meet.com/?12902766-61zOt\">this poll</a> with when you are available. The poll dates are just for the first week we will meet, but this will be a <strong>recurring weekly meeting</strong> so please respond accordingly. Thanks!!</p>\n<p>(If you live outside US time zones and 8am-6pm Eastern doesn't work at all for you, please PM me.)</p>",
        "id": 253579817,
        "sender_full_name": "Max Masnick",
        "timestamp": 1631798339
    },
    {
        "content": "<p>(I've also shared this poll on the vaccination@ and pher@ listservs.)</p>",
        "id": 253580683,
        "sender_full_name": "Max Masnick",
        "timestamp": 1631798687
    },
    {
        "content": "<p>It looks like 10am-11am Eastern on Mondays is the best time for 8 of the 10 current respondents to the <a href=\"https://www.when2meet.com/?12902766-61zOt\">poll</a>.</p>\n<p>We will finalize the meeting time early next week, so if you want to participate in FHIR IG ballot reconciliation discussions please add your response as soon as possible. Thanks!</p>",
        "id": 253782453,
        "sender_full_name": "Max Masnick",
        "timestamp": 1631901634
    },
    {
        "content": "<p>And please consider adding a calendar hold from 10am-11am Eastern on Mondays starting Oct 4 as this will likely be our time unless we get a lot more responses.</p>",
        "id": 253782588,
        "sender_full_name": "Max Masnick",
        "timestamp": 1631901685
    },
    {
        "content": "<p>Tue 4-5pm Eastern had the same number of \"I can make it\", can it also be considered? Would work better for me.</p>",
        "id": 254139648,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1632184493
    },
    {
        "content": "<p>and is possible for me</p>",
        "id": 254144269,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632188843
    },
    {
        "content": "<p>Agreed, Tues 4-5pm Eastern makes more sense. That covers 8 of the 11 people who filled out the poll (plus Grahame). I'll schedule the conference call. Thanks everyone!</p>\n<p>Meeting agendas will be announced in this stream + <a href=\"mailto:vaccination@lists.hl7.org\">vaccination@lists.hl7.org</a>. We will endeavor to have agendas out on the Friday preceding the call, so if anyone can't make the scheduled time but still wants to participate asynchronously there will be time to provide comments.</p>",
        "id": 254185087,
        "sender_full_name": "Max Masnick",
        "timestamp": 1632220185
    }
]