[
    {
        "content": "<p>There are a set of changes to the SHC Vaccination FHIR IG that are ready for review:  <a href=\"https://github.com/dvci/vaccine-credential-ig/pull/167\">#167 Reorganize profile navigation, rename profiles, add non-US Patient profile</a> (<a href=\"http://build.fhir.org/ig/dvci/vaccine-credential-ig/branches/reorganize/index.html\">CI build</a>)</p>\n<p>Highlightes include:</p>\n<ul>\n<li>Reframing our use of DM and AD profiles. The DM (data minimization) profiles are now referred to as \"primary\" profiles throughout, and users are directed do the DM profiles first (with AD as \"fallback\").</li>\n<li>Introduction of \"Profile Groups\" and a bespoke navigation interface to make moving between the relevant profiles/documentation easier. This allows us to group together all the lab test related profiles, future additions of related profiles, and the...(see next item)</li>\n<li>New patient patient profile that allows <code>identifier</code> to be filled. The existing profile that didn't allow <code>identifier</code> is now \"US-only\". The new one is a \"general\" profile for elsewhere.</li>\n<li>Profiles are renamed for consistency (not a breaking change for implementers, but may break testing apparatus that hard-coded profile IDs or names).</li>\n<li>Rewrite of the <a href=\"http://build.fhir.org/ig/dvci/vaccine-credential-ig/branches/reorganize/index.html\">home page</a>, and moving/rewriting the conformance information to the new <a href=\"http://build.fhir.org/ig/dvci/vaccine-credential-ig/branches/reorganize/profiles.html\">Profiles page</a>.</li>\n<li>Change of the IG canonical URI to <code>http://hl7.org/fhir/uv/shc-vaccination</code>, which is what will be used going forward as we move everything into HL7 and bring the IG to ballot.</li>\n<li>Bump version to <code>0.6.0-pre-ballot-stable</code> in anticipation of merging this branch into <code>main</code>, along with some other forthcoming PRs to address some of the open issues on GitHub sometime in the next week.</li>\n</ul>\n<p>Please let us know if you have any comments/questions/suggestions!</p>",
        "id": 244737669,
        "sender_full_name": "Max Masnick",
        "timestamp": 1625248832
    },
    {
        "content": "<p>If there are no comments/suggestions on this today, #167 will be merged into <code>dev</code> tomorrow in preparation for releasing <code>0.6.0-pre-ballot-stable</code> based on this.</p>",
        "id": 245030599,
        "sender_full_name": "Max Masnick",
        "timestamp": 1625574372
    }
]