[
    {
        "content": "<p>Following up on the ongoing discussion of the difficulty of supporting GTIN as a Verifier (due to the lack of a central list of valid GTINs), and more mature COVID-19 vaccine code support in some of the code systems we use, I want to open a discussion on the following proposed changes that would in theory be part of STU1 ballot reconciliation (making <a href=\"https://jira.hl7.org/browse/FHIR-33475\">FHIR-33475</a> from <span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span> persuasive with mod):</p>\n<ol>\n<li>Creation of a value set that includes codes for identifying COVID-19 vaccines that are sufficiently granular for Verifiers to determine whether the proper dose series was followed, AND have a centrally maintained list of codes that is freely accessible to Verifiers. Currently I believe this includes CVX and AIR, and could potentially include SNOMED as well depending on how \"freely accessible\" is defined and what codes are in SNOMED GPS. If other code systems meet these criteria, they should be included as well.</li>\n<li>Issuers SHALL include at least one code from #1 for all COVID-19 SHCs. (There is a generic CVX code that could be used as a fallback if a more specific code doesn't exist, and if SNOMED is included in #1 then that has generic codes too.)</li>\n<li>Verifiers SHALL support interpretation of all codes in #1 that map to vaccines they support in any code system. (So if a Verifier reads CVX#207 for the Moderna vaccine, they would also be expected to read AIR and SNOMED codes that mean \"Moderna vaccine\".)</li>\n</ol>\n<p>/cc <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> re: GTIN</p>",
        "id": 254212803,
        "sender_full_name": "Max Masnick",
        "timestamp": 1632233337
    },
    {
        "content": "<p>I'm interested in feedback on whether or not we should support \"supplemental codes\" or expect Issuers to only use codes in the value set described above for <code>https://smarthealth.cards#covid19</code> cards. Some thoughts on this:</p>\n<ul>\n<li>There was some discussion of asking for SNOMED GPS codes that mirror the granularity/scope of CVX's COVID codes. These could be included in the value set described above. If we did this, should we still include the country-specific SNOMED edition codes as part of the value set, only allow these as supplemental codes, or not allow them at all?</li>\n<li>The CVX/AIR/SNOMED(?) value set would likely be implemented as a required binding in a slice in a separate COVID-19-specific profile of Immunization. We would still have the generic profile as well, and Issuers could fall back to this if needed (mirroring our approach to lab tests).</li>\n<li>I think we want to keep the value set bindings for <code>vaccineCode</code> as <code>required</code> because wallet and verifier apps need to be able to know the full universe of codes they may encounter.</li>\n</ul>",
        "id": 254215283,
        "sender_full_name": "Max Masnick",
        "timestamp": 1632234230
    },
    {
        "content": "<p>This topic will likely be first on the agenda for our Oct 5th conference call</p>",
        "id": 254215455,
        "sender_full_name": "Max Masnick",
        "timestamp": 1632234275
    },
    {
        "content": "<p>In general, I think that this makes sense. Not sure I'd include AIR on the list though. A code system should only get on the list if it's unencumbered, and there's evidence it's not country specific</p>",
        "id": 254217767,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632235100
    },
    {
        "content": "<p>but requiring an extra code is more bytes than allowing display <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>",
        "id": 254217899,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632235156
    },
    {
        "content": "<blockquote>\n<p>SARS-COV-2 (COVID-19) vaccine, mRNA, spike protein, LNP, preservative free, 100 mcg or 50 mcg dose</p>\n</blockquote>\n<p>...seems like that may not compress quite as well as a code system URI <span aria-label=\"grinning\" class=\"emoji emoji-1f600\" role=\"img\" title=\"grinning\">:grinning:</span></p>",
        "id": 254218370,
        "sender_full_name": "Max Masnick",
        "timestamp": 1632235331
    },
    {
        "content": "<p>But in all seriousness, we should look at the utility of allowing <code>display</code>...do you remember where you posted about this already?</p>\n<p>Edit: <a href=\"#narrow/stream/284830-smart.2Fhealth-cards/topic/Additional.20parameters.20for.20.24health-card-issue/near/254129955\">https://chat.fhir.org/#narrow/stream/284830-smart.2Fhealth-cards/topic/Additional.20parameters.20for.20.24health-card-issue/near/254129955</a></p>",
        "id": 254218578,
        "sender_full_name": "Max Masnick",
        "timestamp": 1632235416
    },
    {
        "content": "<blockquote>\n<p>Creation of a value set that includes codes for identifying COVID-19 vaccines that are sufficiently granular for Verifiers to determine whether the proper dose series was followed, AND have a centrally maintained list of codes that is freely accessible to Verifiers. </p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"322501\">@Max Masnick</span> I think you're saying that <em>any</em> vocab that met these conditions would be added to our valueset. From an interop perspective: why do we need to include so many? Why not pick one (either an existing one, or or own) instead of accreting synonyms?</p>",
        "id": 254225983,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632237942
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> my main goal here was describing why we would pick just CVX and maybe SNOMED (assuming AIR drops out per above), but I agree that we don't necessarily want to keep adding additional code systems that start to meet these criteria.</p>\n<p>My main concern with using only CVX is that as far as I know there's not a process for requesting new codes. So I think we would at least need one other code system that supports this and has permissive licensing (e.g., SNOMED GPS).</p>\n<p>I think the main arguments against defining our own code system are that we don't have the infrastructure in place to manage regular updates (and CVX/SNOMED do already), and defining a new code system creates implementer burden. So if we did this, the benefits would need to outweigh the burden, and we'd need to figure out how to handle issuing new codes. There may be other concerns I'm missing here too -- I'm not a terminology expert.</p>",
        "id": 254229713,
        "sender_full_name": "Max Masnick",
        "timestamp": 1632239224
    },
    {
        "content": "<p>Another option would be to use CVX + define our own code system to be used in case a vaccine is missing from CVX (even temporarily). We could then provide mappings from our code system back to CVX. This addresses the implementer burden argument (most are already using CVX as far as I know), and the regular update argument (only needed if implementers identify a code missing from CVX).</p>",
        "id": 254230312,
        "sender_full_name": "Max Masnick",
        "timestamp": 1632239444
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"322501\">Max Masnick</span> <a href=\"#narrow/stream/284830-smart.2Fhealth-cards/topic/FHIR.20IG.20vaccineCode.20changes.3F/near/254230312\">said</a>:</p>\n<blockquote>\n<p>Another option would be to use CVX + define our own code system to be used in case a vaccine is missing from CVX (even temporarily). We could then provide mappings from our code system back to CVX. This addresses the implementer burden argument (most are already using CVX as far as I know), and the regular update argument (only needed if implementers identify a code missing from CVX).</p>\n</blockquote>\n<p>Another benefit to this approach is it becomes much clearer for Issuers which code system to use. I believe the best practice is to not have synonyms in the same value set, which this would support (we could even deprecate our custom codes if a CVX becomes available).</p>",
        "id": 254230595,
        "sender_full_name": "Max Masnick",
        "timestamp": 1632239548
    },
    {
        "content": "<p>Anyway, lots of options here, which is why I wanted to start this discussion now. We'll work on putting together a menu of options for the Oct 5 call, so please continue to add comments to this thread.</p>",
        "id": 254230749,
        "sender_full_name": "Max Masnick",
        "timestamp": 1632239607
    },
    {
        "content": "<blockquote>\n<p>we should look at the utility of allowing display...do you remember where you posted about this already?</p>\n</blockquote>\n<p>Right, I assumed that was part of the input into this topic. requiring a CVX or SCT code and mandating that they are understood would avoid the need for allowing display, but can a rule like that stick? I suspect not.</p>",
        "id": 254232248,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632240106
    },
    {
        "content": "<blockquote>\n<p>SARS-COV-2 (COVID-19) vaccine, mRNA, spike protein, LNP, preservative free, 100 mcg or 50 mcg dose</p>\n</blockquote>\n<p>Need a consumer suitable display term - business to be taken up elsewhere</p>",
        "id": 254234353,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632240848
    },
    {
        "content": "<blockquote>\n<p>Another benefit to this approach is it becomes much clearer for Issuers which code system to use. I believe the best practice is to not have synonyms in the same value set, which this would support (we could even deprecate our custom codes if a CVX becomes available).</p>\n</blockquote>\n<p>I agree <span class=\"user-mention\" data-user-id=\"322501\">@Max Masnick</span> ; I think this is worth exploring. (Also, we might just see if CVX can publish a policy for requesting changes. which would settle the first question; in practice, they've been quite responsive, so this would just be documenting their practices.)</p>",
        "id": 254243008,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632244054
    },
    {
        "content": "<p>I like this plan a lot!</p>",
        "id": 254256577,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1632249516
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191316\">Grahame Grieve</span> <a href=\"#narrow/stream/284830-smart.2Fhealth-cards/topic/FHIR.20IG.20vaccineCode.20changes.3F/near/254234353\">said</a>:</p>\n<blockquote>\n<blockquote>\n<p>SARS-COV-2 (COVID-19) vaccine, mRNA, spike protein, LNP, preservative free, 100 mcg or 50 mcg dose</p>\n</blockquote>\n<p>Need a consumer suitable display term - business to be taken up elsewhere</p>\n</blockquote>\n<p>By the Vocabulary Work Group?  </p>\n<p>Looking beyond the next 6 months, I think it might be prudent to add ICD-11 support (but definitely not AIR).</p>",
        "id": 254295787,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1632268641
    },
    {
        "content": "<blockquote>\n<p>By the Vocabulary Work Group?</p>\n</blockquote>\n<p>Depends on the coding system.</p>",
        "id": 254302410,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632274233
    },
    {
        "content": "<p>see <a href=\"#narrow/stream/179173-australia/topic/Smart.20health.20Cards\">https://chat.fhir.org/#narrow/stream/179173-australia/topic/Smart.20health.20Cards</a> - In Australia, we'll be publishing consumer friendly display codes, using the value set described there. (where 'we' is the first implementer to go live; hopefully, that'll turn into established policy, but that's yet to be discussed)</p>",
        "id": 254327813,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632296889
    },
    {
        "content": "<blockquote>\n<p>see <a href=\"#narrow/stream/179173-australia/topic/Smart.20health.20Cards\">https://chat.fhir.org/#narrow/stream/179173-australia/topic/Smart.20health.20Cards</a> - In Australia, we'll be publishing consumer friendly display codes, using the value set described there. (where 'we' is the first implementer to go live; hopefully, that'll turn into established policy, but that's yet to be discussed)</p>\n</blockquote>\n<p>The Australia implementation is using CVX codes, and populating <code>display</code>.</p>",
        "id": 254334368,
        "sender_full_name": "Max Masnick",
        "timestamp": 1632300349
    },
    {
        "content": "<p>One of the problems with CVX is that the human-readable value we would want for <code>display</code> isn't defined in a consistent place.</p>\n<p>For the newer (500-series) CVX codes, it's embedded in the \"short description\" like:</p>\n<blockquote>\n<p>COVID-19 IV Non-US Vaccine (CoronaVac, Sinovac)</p>\n</blockquote>\n<p>In other cases it's in the table <a href=\"https://www.cdc.gov/vaccines/programs/iis/COVID-19-related-codes.html\">found here</a> but not in the <a href=\"https://www2a.cdc.gov/vaccines/iis/iisstandards/vaccines.asp?rpt=cvx\">canonical list of CVX codes</a>  (or the <a href=\"https://www2a.cdc.gov/vaccines/iis/iisstandards/XML2.asp?rpt=cvx\">computable version</a>).</p>\n<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> how is the Australia implementation standardizing on <code>display</code> values? Is this part of the value set you're maintaining?</p>",
        "id": 254335070,
        "sender_full_name": "Max Masnick",
        "timestamp": 1632300739
    },
    {
        "content": "<blockquote>\n<p>Also, we might just see if CVX can publish a policy for requesting changes. which would settle the first question; in practice, they've been quite responsive, so this would just be documenting their practices.)</p>\n</blockquote>\n<p>It looks like they just added a new CVX for Pfizer 5-12 years old (219)</p>",
        "id": 254335456,
        "sender_full_name": "Max Masnick",
        "timestamp": 1632300952
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191364\">@Peter Jordan</span> re: display names for CVX, I was commenting on this earlier in this thread â†‘</p>",
        "id": 254336575,
        "sender_full_name": "Max Masnick",
        "timestamp": 1632301432
    },
    {
        "content": "<p>One issue with embedding <code>display</code> in SHCs: these can change over time -- we saw this when Moderna and Pfizer introduced their tradenames (Spikevax and Comirnaty).</p>",
        "id": 254337096,
        "sender_full_name": "Max Masnick",
        "timestamp": 1632301673
    },
    {
        "content": "<p>Other new CVX Codes are 217 (for 12 yrs and older) and 218 (5-11 years)); although, like 219 (2-4 years), they are noted as 'potential'.</p>",
        "id": 254338435,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1632302341
    },
    {
        "content": "<blockquote>\n<p>how is the Australia implementation standardizing on display values? Is this part of the value set you're maintaining?</p>\n</blockquote>\n<p>yes, for now, I'm maintaining it until there's a better place for it to live (if that happens)</p>",
        "id": 254342659,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632304689
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> would you be opposed to the IG using your value set in some capacity?</p>",
        "id": 254342757,
        "sender_full_name": "Max Masnick",
        "timestamp": 1632304748
    },
    {
        "content": "<p>(Either pointing to it in the narrative as the source of human-readable versions of CVX codes, and/or as part of a binding?)</p>",
        "id": 254342812,
        "sender_full_name": "Max Masnick",
        "timestamp": 1632304785
    },
    {
        "content": "<blockquote>\n<p>One issue with embedding display in SHCs: these can change over time -- we saw this when Moderna and Pfizer introduced their tradenames </p>\n</blockquote>\n<p>And Astrazeneca too! And yes, that's a true but it's not the name it had when you had it, so there's more than one way to look at it. But it would ease our concerns a wee bit if there was an official set of 'consumer friendly names' maintained by CVX. But probably just a wee bit; we need to have the display values from the smart codes be codes that police and bouncers etc immediately recognise as valid vaccines here in Australia. Otherwise the whole process will be a disaster in practice</p>",
        "id": 254342902,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632304808
    },
    {
        "content": "<blockquote>\n<p>would you be opposed to the IG using your value set in some capacity?</p>\n</blockquote>\n<p>not opposed, no, but the consumer friendly names we'll choose will be based on Australian vernacular usage, and not necessarily suitable for other countries</p>",
        "id": 254343094,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632304915
    },
    {
        "content": "<p>suggest to fork the value set and choose US friendly names in the DM profile.</p>",
        "id": 254343162,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632304942
    },
    {
        "content": "<blockquote>\n<p>not opposed, no, but the consumer friendly names we'll choose will be based on Australian vernacular usage, and not necessarily suitable for other countries</p>\n</blockquote>\n<p>Interesting...is there a supported model for i18n of display names in FHIR?</p>",
        "id": 254343209,
        "sender_full_name": "Max Masnick",
        "timestamp": 1632304968
    },
    {
        "content": "<p>It would be great if, hypothetically, we could maintain one canonical value set that could be translated as needed</p>",
        "id": 254343261,
        "sender_full_name": "Max Masnick",
        "timestamp": 1632304996
    },
    {
        "content": "<p>well, yes and we could do that. I'm about to have nap. Later, I'll post an example of what that could look like</p>",
        "id": 254343401,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632305084
    },
    {
        "content": "<p>Ok, thanks! <span aria-label=\"zzz\" class=\"emoji emoji-1f4a4\" role=\"img\" title=\"zzz\">:zzz:</span></p>",
        "id": 254343446,
        "sender_full_name": "Max Masnick",
        "timestamp": 1632305110
    },
    {
        "content": "<blockquote>\n<p>But probably just a wee bit; we need to have the display values from the smart codes be codes that police and bouncers etc immediately recognise as valid vaccines here in Australia. Otherwise the whole process will be a disaster in practice</p>\n</blockquote>\n<p>The Commons Project's Verifier app handles translation of CVX codes into human-readable strings. I recognize that supporting all the code systems currently allowed in an IG is a problem for a Verifier app, but if we downsize the terminology and provide the <code>display</code> values as part of a value set, it would at least be a lot easier.</p>",
        "id": 254343919,
        "sender_full_name": "Max Masnick",
        "timestamp": 1632305381
    },
    {
        "content": "<p>i18n is another reason why embedding <code>display</code> in the SHC may not make sense -- if Verifiers are going to have to support look-ups to deal with translations from int'l SHCs anyway, they might as well just do it all the time.</p>",
        "id": 254344053,
        "sender_full_name": "Max Masnick",
        "timestamp": 1632305448
    },
    {
        "content": "<p>the spec can make whatever rules it likes, but if the implementations don't support it, it doesn't matter.</p>",
        "id": 254347203,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632307329
    },
    {
        "content": "<blockquote>\n<p>Commons Project's Verifier app handles translation of CVX codes into human-readable strings</p>\n</blockquote>\n<p>Really? where? I'm not seeing it</p>",
        "id": 254347212,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632307335
    },
    {
        "content": "<p><a href=\"https://thecommonsproject.org/smart-health-card-verifier\">https://thecommonsproject.org/smart-health-card-verifier</a> is the app I'm talking about. You can download it and scan Josh's SHC from <a href=\"https://github.com/jmandel/my-health-data/blob/master/my-data/smart-health-card-jmandel.png\">https://github.com/jmandel/my-health-data/blob/master/my-data/smart-health-card-jmandel.png</a>. It displays \"Moderna\" for his vaccines even though the FHIR Bundle just has the CVX code</p>\n<div class=\"message_inline_image\"><a href=\"https://github.com/jmandel/my-health-data/blob/master/my-data/smart-health-card-jmandel.png\"><img src=\"https://uploads.zulipusercontent.net/92ecfe6e8db57140ad3c796c1395e31b09f935d1/68747470733a2f2f7261772e67697468756275736572636f6e74656e742e636f6d2f6a6d616e64656c2f6d792d6865616c74682d646174612f6d61737465722f6d792d646174612f736d6172742d6865616c74682d636172642d6a6d616e64656c2e706e67\"></a></div><div class=\"codehilite\"><pre><span></span><code>{\n        &quot;resourceType&quot;: &quot;Immunization&quot;,\n        &quot;status&quot;: &quot;completed&quot;,\n        &quot;vaccineCode&quot;: {\n          &quot;coding&quot;: [\n            {\n              &quot;system&quot;: &quot;http://hl7.org/fhir/sid/cvx&quot;,\n              &quot;code&quot;: &quot;207&quot;\n            }\n          ]\n        },\n        &quot;patient&quot;: {\n          &quot;reference&quot;: &quot;resource:0&quot;\n        },\n        &quot;occurrenceDateTime&quot;: &quot;2021-04-18&quot;,\n        &quot;lotNumber&quot;: &quot;UNKNOWN&quot;,\n        &quot;performer&quot;: [\n          {\n            &quot;actor&quot;: {\n              &quot;display&quot;: &quot;Walgreens 06130&quot;\n            }\n          }\n        ]\n      }\n    }\n</code></pre></div>",
        "id": 254347779,
        "sender_full_name": "Max Masnick",
        "timestamp": 1632307743
    },
    {
        "content": "<p>interesting. when I scan my card, I get nothing.</p>",
        "id": 254348177,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632308030
    },
    {
        "content": "<p>where does it get the display from?</p>",
        "id": 254348237,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632308047
    },
    {
        "content": "<p><a href=\"/user_uploads/10155/EWlvfHVCFh_wgSvH3e80h7BX/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/EWlvfHVCFh_wgSvH3e80h7BX/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/EWlvfHVCFh_wgSvH3e80h7BX/image.png\"></a></div>",
        "id": 254348248,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632308062
    },
    {
        "content": "<p>Weird...let me investigate</p>",
        "id": 254348317,
        "sender_full_name": "Max Masnick",
        "timestamp": 1632308124
    },
    {
        "content": "<p>that'll be because it's AIR codes in that one.</p>",
        "id": 254348472,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632308254
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"322501\">@Max Masnick</span> asked:</p>\n<blockquote>\n<p>is there a supported model for i18n of display names in FHIR?</p>\n</blockquote>",
        "id": 254349877,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632309110
    },
    {
        "content": "<p>so here's what that would look like:</p>",
        "id": 254349888,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632309117
    },
    {
        "content": "<div class=\"codehilite\" data-code-language=\"JSON\"><pre><span></span><code><span class=\"p\">{</span>\n  <span class=\"nt\">\"resourceType\"</span><span class=\"p\">:</span> <span class=\"s2\">\"ValueSet\"</span><span class=\"p\">,</span>\n  <span class=\"nt\">\"id\"</span><span class=\"p\">:</span> <span class=\"s2\">\"shc-covid-cvx\"</span><span class=\"p\">,</span>\n  <span class=\"nt\">\"language\"</span> <span class=\"p\">:</span> <span class=\"s2\">\"en\"</span><span class=\"p\">,</span>\n  <span class=\"nt\">\"url\"</span><span class=\"p\">:</span> <span class=\"s2\">\"http://healthintersections.com.au/fhir/ValueSet/shc-covid-cvx\"</span><span class=\"p\">,</span>\n  <span class=\"nt\">\"version\"</span><span class=\"p\">:</span> <span class=\"s2\">\"4.0.1\"</span><span class=\"p\">,</span>\n  <span class=\"nt\">\"name\"</span><span class=\"p\">:</span> <span class=\"s2\">\"ShcCovidCvxCodesAustralia\"</span><span class=\"p\">,</span>\n  <span class=\"nt\">\"title\"</span><span class=\"p\">:</span> <span class=\"s2\">\"CVX Covid Codes for use in Australian Smart Health Cards\"</span><span class=\"p\">,</span>\n  <span class=\"nt\">\"status\"</span><span class=\"p\">:</span> <span class=\"s2\">\"draft\"</span><span class=\"p\">,</span>\n  <span class=\"nt\">\"date\"</span><span class=\"p\">:</span> <span class=\"s2\">\"2021-09-22\"</span><span class=\"p\">,</span>\n  <span class=\"nt\">\"publisher\"</span><span class=\"p\">:</span> <span class=\"s2\">\"Health Intersections\"</span><span class=\"p\">,</span>\n  <span class=\"nt\">\"contact\"</span><span class=\"p\">:</span> <span class=\"p\">[</span>\n    <span class=\"p\">{</span>\n      <span class=\"nt\">\"name\"</span><span class=\"p\">:</span> <span class=\"s2\">\"Grahame Grieve\"</span><span class=\"p\">,</span>\n      <span class=\"nt\">\"telecom\"</span><span class=\"p\">:</span> <span class=\"p\">[</span>\n        <span class=\"p\">{</span>\n          <span class=\"nt\">\"system\"</span><span class=\"p\">:</span> <span class=\"s2\">\"email\"</span><span class=\"p\">,</span>\n          <span class=\"nt\">\"value\"</span><span class=\"p\">:</span> <span class=\"s2\">\"grahame@healthintersections.com.au\"</span>\n        <span class=\"p\">}</span>\n      <span class=\"p\">]</span>\n    <span class=\"p\">}</span>\n  <span class=\"p\">],</span>\n  <span class=\"nt\">\"description\"</span><span class=\"p\">:</span> <span class=\"s2\">\"A list of CVX codes with recommended consumer suitable displays for use in Australian Smart Health Cards\"</span><span class=\"p\">,</span>\n  <span class=\"nt\">\"jurisdiction\"</span><span class=\"p\">:</span> <span class=\"p\">[</span>\n    <span class=\"p\">{</span>\n      <span class=\"nt\">\"coding\"</span><span class=\"p\">:</span> <span class=\"p\">[</span>\n        <span class=\"p\">{</span>\n          <span class=\"nt\">\"system\"</span><span class=\"p\">:</span> <span class=\"s2\">\"urn:iso:std:iso:3166\"</span><span class=\"p\">,</span>\n          <span class=\"nt\">\"code\"</span><span class=\"p\">:</span> <span class=\"s2\">\"AU\"</span>\n        <span class=\"p\">}</span>\n      <span class=\"p\">]</span>\n    <span class=\"p\">}</span>\n  <span class=\"p\">],</span>\n  <span class=\"nt\">\"copyright\"</span><span class=\"p\">:</span> <span class=\"s2\">\"Creative Commons 0\"</span><span class=\"p\">,</span>\n  <span class=\"nt\">\"compose\"</span><span class=\"p\">:</span> <span class=\"p\">{</span>\n    <span class=\"nt\">\"include\"</span><span class=\"p\">:</span> <span class=\"p\">[</span>\n      <span class=\"p\">{</span>\n        <span class=\"nt\">\"system\"</span><span class=\"p\">:</span> <span class=\"s2\">\"http://hl7.org/fhir/sid/cvx\"</span><span class=\"p\">,</span>\n        <span class=\"nt\">\"concept\"</span><span class=\"p\">:</span> <span class=\"p\">[</span>\n          <span class=\"p\">{</span>\n            <span class=\"nt\">\"code\"</span><span class=\"p\">:</span> <span class=\"s2\">\"210\"</span><span class=\"p\">,</span>\n            <span class=\"nt\">\"display\"</span><span class=\"p\">:</span> <span class=\"s2\">\"COVID-19 vaccine, vector-nr, rS-ChAdOx1, PF, 0.5 mL\"</span><span class=\"p\">,</span>\n            <span class=\"nt\">\"designation\"</span> <span class=\"p\">:</span> <span class=\"p\">[{</span>\n               <span class=\"nt\">\"language\"</span> <span class=\"p\">:</span> <span class=\"s2\">\"en-AU\"</span><span class=\"p\">,</span>\n               <span class=\"nt\">\"use\"</span> <span class=\"p\">:</span> <span class=\"p\">{</span>\n                 <span class=\"nt\">\"system\"</span> <span class=\"p\">:</span> <span class=\"s2\">\"http://example.org/fhir/CodeSystem/designation-use\"</span><span class=\"p\">,</span>\n                 <span class=\"nt\">\"use\"</span> <span class=\"p\">:</span> <span class=\"s2\">\"consumer-friendly\"</span>\n               <span class=\"p\">},</span>\n               <span class=\"nt\">\"value\"</span> <span class=\"p\">:</span> <span class=\"s2\">\"AstraZeneca (Vaxzevria)\"</span>\n            <span class=\"p\">}]</span>\n          <span class=\"p\">},</span>\n          <span class=\"p\">{</span>\n            <span class=\"nt\">\"code\"</span><span class=\"p\">:</span> <span class=\"s2\">\"208\"</span><span class=\"p\">,</span>\n            <span class=\"nt\">\"display\"</span><span class=\"p\">:</span> <span class=\"s2\">\"COVID-19, mRNA, LNP-S, PF, 30 mcg/0.3 mL dose\"</span><span class=\"p\">,</span>\n            <span class=\"nt\">\"designation\"</span> <span class=\"p\">:</span> <span class=\"p\">[{</span>\n               <span class=\"nt\">\"language\"</span> <span class=\"p\">:</span> <span class=\"s2\">\"en-AU\"</span><span class=\"p\">,</span>\n               <span class=\"nt\">\"use\"</span> <span class=\"p\">:</span> <span class=\"p\">{</span>\n                 <span class=\"nt\">\"system\"</span> <span class=\"p\">:</span> <span class=\"s2\">\"http://example.org/fhir/CodeSystem/designation-use\"</span><span class=\"p\">,</span>\n                 <span class=\"nt\">\"use\"</span> <span class=\"p\">:</span> <span class=\"s2\">\"consumer-friendly\"</span>\n               <span class=\"p\">},</span>\n               <span class=\"nt\">\"value\"</span> <span class=\"p\">:</span> <span class=\"s2\">\"Pfizer (Comirnaty)\"</span>\n            <span class=\"p\">},</span> <span class=\"p\">{</span>\n               <span class=\"nt\">\"language\"</span> <span class=\"p\">:</span> <span class=\"s2\">\"en-US\"</span><span class=\"p\">,</span>\n               <span class=\"nt\">\"use\"</span> <span class=\"p\">:</span> <span class=\"p\">{</span>\n                 <span class=\"nt\">\"system\"</span> <span class=\"p\">:</span> <span class=\"s2\">\"http://example.org/fhir/CodeSystem/designation-use\"</span><span class=\"p\">,</span>\n                 <span class=\"nt\">\"use\"</span> <span class=\"p\">:</span> <span class=\"s2\">\"consumer-friendly\"</span>\n               <span class=\"p\">},</span>\n               <span class=\"nt\">\"value\"</span> <span class=\"p\">:</span> <span class=\"s2\">\"Pfizer/Covid\"</span>\n            <span class=\"p\">},</span> <span class=\"p\">{</span>\n               <span class=\"nt\">\"language\"</span> <span class=\"p\">:</span> <span class=\"s2\">\"en-NZ\"</span><span class=\"p\">,</span>\n               <span class=\"nt\">\"use\"</span> <span class=\"p\">:</span> <span class=\"p\">{</span>\n                 <span class=\"nt\">\"system\"</span> <span class=\"p\">:</span> <span class=\"s2\">\"http://example.org/fhir/CodeSystem/designation-use\"</span><span class=\"p\">,</span>\n                 <span class=\"nt\">\"use\"</span> <span class=\"p\">:</span> <span class=\"s2\">\"consumer-friendly\"</span>\n               <span class=\"p\">},</span>\n               <span class=\"nt\">\"value\"</span> <span class=\"p\">:</span> <span class=\"s2\">\"Pfizer-BioNTech COVID-19 Vaccine\"</span>\n            <span class=\"p\">}]</span>\n          <span class=\"p\">},</span>\n          <span class=\"p\">{</span>\n            <span class=\"nt\">\"code\"</span><span class=\"p\">:</span> <span class=\"s2\">\"207\"</span><span class=\"p\">,</span>\n            <span class=\"nt\">\"display\"</span><span class=\"p\">:</span> <span class=\"s2\">\"COVID-19, mRNA, LNP-S, PF, 100 mcg or 50 mcg dose\"</span><span class=\"p\">,</span>\n            <span class=\"nt\">\"designation\"</span> <span class=\"p\">:</span> <span class=\"p\">[{</span>\n               <span class=\"nt\">\"language\"</span> <span class=\"p\">:</span> <span class=\"s2\">\"en-AU\"</span><span class=\"p\">,</span>\n               <span class=\"nt\">\"use\"</span> <span class=\"p\">:</span> <span class=\"p\">{</span>\n                 <span class=\"nt\">\"system\"</span> <span class=\"p\">:</span> <span class=\"s2\">\"http://example.org/fhir/CodeSystem/designation-use\"</span><span class=\"p\">,</span>\n                 <span class=\"nt\">\"use\"</span> <span class=\"p\">:</span> <span class=\"s2\">\"consumer-friendly\"</span>\n               <span class=\"p\">},</span>\n               <span class=\"nt\">\"value\"</span> <span class=\"p\">:</span> <span class=\"s2\">\"Moderna (Spikevax)\"</span>\n            <span class=\"p\">},</span> <span class=\"p\">{</span>\n               <span class=\"nt\">\"language\"</span> <span class=\"p\">:</span> <span class=\"s2\">\"en-US\"</span><span class=\"p\">,</span>\n               <span class=\"nt\">\"use\"</span> <span class=\"p\">:</span> <span class=\"p\">{</span>\n                 <span class=\"nt\">\"system\"</span> <span class=\"p\">:</span> <span class=\"s2\">\"http://example.org/fhir/CodeSystem/designation-use\"</span><span class=\"p\">,</span>\n                 <span class=\"nt\">\"use\"</span> <span class=\"p\">:</span> <span class=\"s2\">\"consumer-friendly\"</span>\n               <span class=\"p\">},</span>\n               <span class=\"nt\">\"value\"</span> <span class=\"p\">:</span> <span class=\"s2\">\"Pfizer/Moderna\"</span>\n            <span class=\"p\">}]</span>\n          <span class=\"p\">}</span>\n        <span class=\"p\">]</span>\n      <span class=\"p\">}</span>\n    <span class=\"p\">]</span>\n  <span class=\"p\">}</span>\n<span class=\"p\">}</span>\n</code></pre></div>",
        "id": 254349934,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632309130
    },
    {
        "content": "<p>so far, that has only english. The base language of the resource is english, so the unadorned display is in english. In addition, the codes all have an Australian consumer friendly display, and also some example UK and NZ terms.</p>\n<p>adding other languages etc is a linear extension of this idea</p>",
        "id": 254349956,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632309142
    },
    {
        "content": "<p>There is a general need for vocabulary display strings for non clinicians. For example the subject of the medical data, the patient. These display strings need just as much translation as the clinician display string.</p>",
        "id": 254353466,
        "sender_full_name": "John Moehrke",
        "timestamp": 1632311178
    },
    {
        "content": "<p>Packing strings into these payloads we're going to limit our capacity very quickly. Even if we do provide an official set of consumer-facing display names (which I think is a nice idea), I'm concerned about packing these names into our <em>instance data</em>, given the space constraints (and competing pressures like including additional vaccines, relevant durable labs, and probably more to come over time).</p>\n<p>If the vocabulary is licensed appropriately, any verifier app can easily maintain an up-to-date set of names (and in a multitude of languages, character sets, etc) and layer them on to the UI in context.</p>\n<p>(And context matters -- like, \"Moderna\" is an ok name if I'm presenting a list of covid vaccines in March 2021, but with brand names, or as Moderna produces new vaccines for other conditions, not so much.)</p>",
        "id": 254361935,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632315372
    },
    {
        "content": "<p>I think \"don't populate <code>display</code>\" can be a stronger recommendation if we have that value set with display names.</p>",
        "id": 254364977,
        "sender_full_name": "Max Masnick",
        "timestamp": 1632316659
    },
    {
        "content": "<blockquote>\n<p>If the vocabulary is licensed appropriately, any verifier app can easily maintain an up-to-date set of names (and in a multitude of languages, character sets, etc) and layer them on to the UI in context.</p>\n</blockquote>\n<p>That's a huge <em>if</em>, and also, I think you and I use the word 'easily' differently. Particularly since it isn't happening now</p>",
        "id": 254379396,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632321867
    },
    {
        "content": "<p>Licensing:  it's the thing most worth pushing on, because we already have examples (e.g., CVX) that meet this bar.</p>",
        "id": 254380169,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632322176
    },
    {
        "content": "<p>well, we can use CVX codes, but not CVX displays. That's a show stopper for use in Australia. Period</p>",
        "id": 254380440,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632322271
    },
    {
        "content": "<p>Today we have apps that layer their own names onto concepts from CVX -- e..g <a href=\"https://thecommonsproject.org/smart-health-card-verifier\">https://thecommonsproject.org/smart-health-card-verifier</a></p>",
        "id": 254380462,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632322280
    },
    {
        "content": "<p>where does it get them from? just make them up?</p>",
        "id": 254380488,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632322292
    },
    {
        "content": "<p>If we want to publish a set of \"recommended display names\" to make this easier, we can.</p>",
        "id": 254380498,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632322296
    },
    {
        "content": "<p>It's a small set today, at least.</p>",
        "id": 254380516,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632322304
    },
    {
        "content": "<p>It's also worth saying that many verification scenarios don't require displaying this granularity of data.</p>",
        "id": 254380605,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632322337
    },
    {
        "content": "<p>really? I'm not following. When doesn't it need to be displayed?</p>",
        "id": 254380651,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632322359
    },
    {
        "content": "<p>Just a \"two valid doses according to jurisdictional rules\", or even \"::checkmark\".</p>",
        "id": 254380654,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632322360
    },
    {
        "content": "<p>Like, verifiers don't <em>need</em> to surface raw data; they can also compute and display conclusions.</p>",
        "id": 254380713,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632322385
    },
    {
        "content": "<p>I'm not saying one is better than the other; just emphasizing there's a wide design space.</p>",
        "id": 254380746,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632322401
    },
    {
        "content": "<p>Ideally humans (e.g., event staff) are not manually interpreting the data in SHCs. There's a lot more risk of a human making a mistake than a computer.</p>",
        "id": 254380926,
        "sender_full_name": "Max Masnick",
        "timestamp": 1632322464
    },
    {
        "content": "<p>there certainly is. But if consumers are seeing a description of their vaccination in Apple or Android that doesn't match what they were told or see elsewhere, then that's a show stopper. At least for me</p>",
        "id": 254380931,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632322465
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"322501\">@Max Masnick</span> somebody has to look at it and decide.</p>",
        "id": 254380964,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632322482
    },
    {
        "content": "<p>Look and see the right name and two doses of pfizer - tick. Look and see two doses of \"COVID-19, mRNA, LNP-S, PF, 30 mcg/0.3 mL dose\" - not tick.</p>",
        "id": 254381063,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632322520
    },
    {
        "content": "<p>Why does a person have to look at it? Can't a person just scan the QR code, and then read the output of the Verifier app that says <span aria-label=\"check\" class=\"emoji emoji-2705\" role=\"img\" title=\"check\">:check:</span> or <span aria-label=\"red circle\" class=\"emoji emoji-1f534\" role=\"img\" title=\"red circle\">:red_circle:</span> ?</p>",
        "id": 254381074,
        "sender_full_name": "Max Masnick",
        "timestamp": 1632322523
    },
    {
        "content": "<p>maybe. but the churn comes when they look at it in apple or android and see something else. I can see I'm not getting anywhere here. That's obviously a show stopper to me for the whole use of the spec at all, but you guys just don't seem to understand</p>",
        "id": 254381264,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632322595
    },
    {
        "content": "<p>With all the possible vaccines + different schedules depending on the vaccine + boosters, I don't think it's realistic for non-clinical people to be interpreting whether someone is \"fully vaccinated\".</p>",
        "id": 254381309,
        "sender_full_name": "Max Masnick",
        "timestamp": 1632322615
    },
    {
        "content": "<p>So, the needs of consumer records apps and verifiers are a bit different. They might even prefer different display names, etc. Packing names into instance data doesn't solve this issue, and we really don't have a lot of <del>fights</del> bytes to spare.</p>",
        "id": 254381327,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632322621
    },
    {
        "content": "<p>Grahame, I want to understand what your deep concerns are here with the approach of publishing display names out of band, and potentially a set of different display names for different purposes.</p>",
        "id": 254381386,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632322647
    },
    {
        "content": "<p>There's one issue I hear which is the pragmatic one of can we really do it. Let's assume we could. What next?</p>",
        "id": 254381405,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632322657
    },
    {
        "content": "<p>I agree it's important to have consistent display of friendly versions of codes for Holders (\"wallet apps\").</p>",
        "id": 254381679,
        "sender_full_name": "Max Masnick",
        "timestamp": 1632322758
    },
    {
        "content": "<p>Australian rules: you need a vaccination certificate that says you have two doses of astrazeneca or pfizer. Consumer, looking in the apple health app: \"I have two doses of COVID-19, mRNA, LNP-S, PF, 30 mcg/0.3 mL dose\". Guess the government has no idea what it's doing again. An the government , looking ahead... it says, 'we'll never use a spec that stops us from lining up thos ducks so that people know what's going on.'</p>",
        "id": 254381710,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632322767
    },
    {
        "content": "<p>I don't care whether it's solved in band or out of band, really. But I don't think that I've heard a realistic story for how it's solved out of band</p>",
        "id": 254381784,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632322793
    },
    {
        "content": "<p>Our spec allows this -- wallet apps can show what they like</p>",
        "id": 254381872,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632322811
    },
    {
        "content": "<p>Publishing a list of recommended names in a public JSON file is not a technically hard thing, and apps can use it.</p>",
        "id": 254381996,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632322849
    },
    {
        "content": "<p>well, I might as well stop being interested then. Because unless the displays are meaningfully consistent, we're wasting our time</p>",
        "id": 254382010,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632322854
    },
    {
        "content": "<p>And even if you populate <code>display</code> a given wallet app may ignore it. So I don't think populating <code>display</code> really solves the problem Grahame is describing</p>",
        "id": 254382015,
        "sender_full_name": "Max Masnick",
        "timestamp": 1632322856
    },
    {
        "content": "<p>Correct; displays may vary with context</p>",
        "id": 254382075,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632322875
    },
    {
        "content": "<p>That's why we're focused on the codes -- those tell the story of <em>what product was injected</em>.</p>",
        "id": 254382144,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632322901
    },
    {
        "content": "<p>What if an Issuer uses English but the patient doesn't speak English? Then the wallet should be able to display in their native language, right?</p>",
        "id": 254382152,
        "sender_full_name": "Max Masnick",
        "timestamp": 1632322904
    },
    {
        "content": "<p>not the names of the immunizations. Other things, absolutely.</p>",
        "id": 254382194,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632322919
    },
    {
        "content": "<p>Trade names may vary by country, right?</p>",
        "id": 254382316,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632322947
    },
    {
        "content": "<p>I'm trying to explain, and failing, why control over the user experience is critical to the choice of adopting the specification. Right now, there seems to be no prospect of any semblence of control</p>",
        "id": 254382394,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632322981
    },
    {
        "content": "<p>indeed. they do vary by country.</p>",
        "id": 254382434,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632322993
    },
    {
        "content": "<p>Whose control?</p>",
        "id": 254382446,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632322997
    },
    {
        "content": "<p>You can't control whether an US based issuer embeds an Australian trade name in a display field</p>",
        "id": 254382529,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632323030
    },
    {
        "content": "<p>But you can interpret and translate the code.</p>",
        "id": 254382556,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632323039
    },
    {
        "content": "<p>You also can't control how the wallet apps are going to display SHCs, regardless of what we put in the spec or what the Issuer puts in <code>display</code>.</p>",
        "id": 254382731,
        "sender_full_name": "Max Masnick",
        "timestamp": 1632323091
    },
    {
        "content": "<p>but <em>i</em> can't. How can I be clearer about this. The users encounter a set of applications. Some written by developers we control, and others written by developers we don't. And the second set matter because that's the consumer apps</p>",
        "id": 254382776,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632323111
    },
    {
        "content": "<p>Why would you want to control the behavior of every consumer app?</p>",
        "id": 254382867,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632323149
    },
    {
        "content": "<p>what? I don't want to control their behaviour, I just want them to render the code comprehensibly</p>",
        "id": 254382977,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632323187
    },
    {
        "content": "<p>To be clear, we see some jurisdictions building their own verifier apps, for user within the jurisdiction. That works fine.</p>",
        "id": 254383001,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632323199
    },
    {
        "content": "<p>I'm wasting my breath here. You're just not listening</p>",
        "id": 254383050,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632323219
    },
    {
        "content": "<p>But if different jurisdictions prefer different trade names, and the consumer only gets one SHC, you can't force the consumer wallets to do the right thing because there's no single right thing</p>",
        "id": 254383104,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632323243
    },
    {
        "content": "<p>I'm trying hard to listen</p>",
        "id": 254383126,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632323249
    },
    {
        "content": "<p>I'm not understanding though, for sure.</p>",
        "id": 254383156,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632323261
    },
    {
        "content": "<p>Let's schedule a call to talk through this?</p>",
        "id": 254383250,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632323290
    },
    {
        "content": "<p>there's no coherent user experience unless the set of applications that the typical consumer encounters describe the codes coherently. There needs to be a story about how that can happen in the spec. My preferred solution is \"provide the correct consumer friendly display for the jurisdiction\" and make the rule that 'international apps default to using the provided display unless they know better' (and if one isn't provided, then use look up).</p>",
        "id": 254383544,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632323422
    },
    {
        "content": "<p>there might be other solutions. But the response 'it's not a problem that matters' isn't workable from my pov</p>",
        "id": 254383689,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632323480
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> it seems like if we standardize on CVX (or CVX + a small number of other codes), and then point to a value set that includes int'l translations in the spec, we would be closer to this than we are now?</p>",
        "id": 254384262,
        "sender_full_name": "Max Masnick",
        "timestamp": 1632323705
    },
    {
        "content": "<p>So, adding guidance for consumer apps makes sense, sure. Most such apps are scoped internationally, and for these we could say \"use the consumer friendly display names published at _______ unless you know better\".</p>",
        "id": 254384317,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632323727
    },
    {
        "content": "<p>Over time we could augment those with translations, etc.</p>",
        "id": 254384384,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632323752
    },
    {
        "content": "<p>closer, yes. I have three concerns about that approach:</p>\n<ul>\n<li>is it maintainable?</li>\n<li>how does that work for something other covid vaccinations (harder problem)</li>\n<li>what conformance langauge in the spec?</li>\n</ul>",
        "id": 254384465,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632323773
    },
    {
        "content": "<p>Maintainable; I don't know. It's an ongoing commitment, but I think it's manageable.</p>",
        "id": 254384546,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632323805
    },
    {
        "content": "<p>In our reference implementations, we are using the CDC tradename at <a href=\"https://www2a.cdc.gov/vaccines/iis/iisstandards/vaccines.asp?rpt=tradename\">https://www2a.cdc.gov/vaccines/iis/iisstandards/vaccines.asp?rpt=tradename</a> if available as it is much more consumer friendly. If not available, we're using the CVX Short Description.</p>\n<p>For CVX 218 -<br>\ntradename - 'Pfizer-BioNTech COVID-19 Vaccine (EUA labeled) COMIRNATY (BLA labeled)'<br>\nshort description - 'COVID-19, mRNA, LNP-S, PF, 10 mcg/0.2 mL dose, tris-sucrose'</p>",
        "id": 254384612,
        "sender_full_name": "Neelima Karipineni",
        "timestamp": 1632323832
    },
    {
        "content": "<p>Other vaccines: same question, scaled up. I think a community effort is totally feasible.</p>",
        "id": 254384629,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632323840
    },
    {
        "content": "<p>Conformance language: \"SHALL use... Unless you know better\" seems silly, so I'm thinking \"SHOULD use, unless you know better\"</p>",
        "id": 254384755,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632323886
    },
    {
        "content": "<p>There's a fair amount of room for \"knowing better\" though, when it comes to decisions on brand names, manufacturers, etc.</p>",
        "id": 254384918,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632323974
    },
    {
        "content": "<p>As <span class=\"user-mention\" data-user-id=\"194164\">@Neelima Karipineni</span>'s assessment makes clear</p>",
        "id": 254384974,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632323998
    },
    {
        "content": "<p>In the FHIR IG, we have language like:</p>\n<blockquote>\n<p>If an Issuer has a good faith belief that resolving a validation error against a primary (DM) profile would reduce utility for Holders or Verifiers, they MAY instead validate against the less constrained fallback (AD) profile instead.</p>\n</blockquote>",
        "id": 254385370,
        "sender_full_name": "Max Masnick",
        "timestamp": 1632324132
    },
    {
        "content": "<p>well, that would solve the issue if we got alignment to that. The value set above shows how to represent that knowledge; what would be needed would be an agreement about (a) how to maintain it and (b) that international consumer applications would honour it</p>",
        "id": 254385564,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632324206
    },
    {
        "content": "<p>There's definitely some thought that will need to go into how to maintain it. I think getting a minimal viable version up for COVID CVXs is pretty easy, and keeping that up-to-date won't be too much of a lift.</p>\n<p>Once we start adding language/jurisdiction-specific translations it will be more difficult. How do we ensure translation quality? What if multiple stakeholders in the same jurisdiction want different things? Etc. etc.</p>",
        "id": 254386736,
        "sender_full_name": "Max Masnick",
        "timestamp": 1632324636
    },
    {
        "content": "<p>defer to HL7 affiliate if there is one. Otherwise... refer to HL7 execs for building relationships. I can do that with many countries, and have many levers to pull</p>",
        "id": 254386938,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632324713
    },
    {
        "content": "<blockquote>\n<p>If the vocabulary is licensed appropriately, any verifier app can easily maintain an up-to-date set of names (and in a multitude of languages, character sets, etc) and layer them on to the UI in context.</p>\n</blockquote>\n<p>As Grahame said, _huge if_. This is hard even for us; as soon as licensing is not world wide using lookup tables becomes incredibly complex. For this reason, if we can make sure that licenses are friendly (like CVX or SNOMED GPS) _then_ I agree, an up-to-date list can be maintained by Wallets and Verifiers.</p>",
        "id": 254392272,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1632326674
    },
    {
        "content": "<p>As for the <code>display</code> discussion: an app can always display both, what's in the payload and one taken from the lookup table, which can be localized, more up to date, ...</p>",
        "id": 254393001,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1632326930
    },
    {
        "content": "<p>Translations also come with legal baggage, depending on who did the translation.</p>",
        "id": 254393119,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1632326990
    },
    {
        "content": "<blockquote>\n<p>For this reason, if we can make sure that licenses are friendly (like CVX or SNOMED GPS) _then_ I agree, an up-to-date list can be maintained by Wallets and Verifiers.</p>\n</blockquote>\n<p>Yet another reason to simplify/strengthen the terminology requirements</p>",
        "id": 254393128,
        "sender_full_name": "Max Masnick",
        "timestamp": 1632326994
    },
    {
        "content": "<p>what's the license on CVX?</p>",
        "id": 254393413,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632327063
    },
    {
        "content": "<p>As far as I know it's in the US public domain. I don't know if this differs by country. We can ask.</p>",
        "id": 254393628,
        "sender_full_name": "Max Masnick",
        "timestamp": 1632327149
    },
    {
        "content": "<p>I can't find the particular license right now, but it was free to use worldwide, not sure about the requirements right now. I can find out, too.</p>",
        "id": 254394075,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1632327305
    },
    {
        "content": "<p>I just emailed JP...I believe he's in touch with people who could answer</p>",
        "id": 254394292,
        "sender_full_name": "Max Masnick",
        "timestamp": 1632327378
    },
    {
        "content": "<p>anyway, we can publish my value set riffing on it above as CC0</p>",
        "id": 254397196,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632328495
    },
    {
        "content": "<p>Do we have any examples of consumer-friendly terms from countries who have implemented COVID-19 vaccine credential apps (e.g. NHS)? I'd like to think that we could agree on a common prefix, e.g. \"COVID-19 vaccine\" that even an Australian nightclub bouncer might understand and then add product/manufacturer names.  If you look at this collection of COVID-19 vaccine codes from around the world, this might be the most feasible approach...<br>\n<a href=\"https://terminz.azurewebsites.net/fhir/ValueSet/covid-19-vaccines/$expand\">https://terminz.azurewebsites.net/fhir/ValueSet/covid-19-vaccines/$expand</a></p>",
        "id": 254432807,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1632342136
    },
    {
        "content": "<p>All of this info can be derived from existing CDC IIS standards assets. I don't think we need to be maintaining a separate set. There are caveats (CDC took awhile to add the non-US codes, not all non-US codes have tradenames) but I don't think we could necessarily do a better. It might be helpful to add the vaccine groups as a concept map somewhere.</p>\n<p>To add to example above for CVX 218 -<br>\n<a href=\"https://www2a.cdc.gov/vaccines/iis/iisstandards/vaccines.asp?rpt=tradename\">tradename</a> - 'Pfizer-BioNTech COVID-19 Vaccine (EUA labeled) COMIRNATY (BLA labeled)'<br>\n<a href=\"https://www2a.cdc.gov/vaccines/iis/iisstandards/vaccines.asp?rpt=cvx\">short description</a> - 'COVID-19, mRNA, LNP-S, PF, 10 mcg/0.2 mL dose, tris-sucrose'<br>\n<a href=\"https://www2a.cdc.gov/vaccines/iis/iisstandards/vaccines.asp?rpt=vg\">vaccine group</a> - 'COVID-19'<br>\nif provided, <a href=\"https://www2a.cdc.gov/vaccines/iis/iisstandards/vaccines.asp?rpt=mvx\">manufacturer</a> code - PFR, display - 'Pfizer, Inc'</p>",
        "id": 254437603,
        "sender_full_name": "Neelima Karipineni",
        "timestamp": 1632344059
    },
    {
        "content": "<p>I don't think that it's a general model for a consumer friendly name, as soon as a single manufacturer provides more than one variant (a la pfizer already)</p>",
        "id": 254439102,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632344586
    },
    {
        "content": "<p>I'm jumping into this (lively!) discussion a bit late (thanks to <span class=\"user-mention\" data-user-id=\"191339\">@Pascal Pfiffner</span> for alerting me to it!). This has, indeed, been a struggle for us. I imagine if we're struggling with it, just about anyone else would as well.</p>\n<p>I totally see <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>'s point that the only way to ensure absolute consistency in display names across a variety of apps is to use the <code>display</code> name that comes with the record. But as has been pointed out, we can't force any app to do this, and some display names are downright hostile to patients because they were designed for use by providers.</p>\n<p>In the Health app, for example, we currently have a hierarchy of Category -&gt; Concept -&gt; Record. We've curated custom, user-friendly \"Concept\" names such as \"COVID-19 Vaccine\" or \"Flu Vaccine.\" Within the \"COVID-19 Vaccine\" Concept room (which is what we call them) you'll find all of the COVID vaccines that we've mapped to that concept via its CVX code. We're currently using the \"Sole Proprietary Name\" for these COVID vaccines since those seem to be the most user-friendly.</p>\n<p>From our POV, having a curated set of (localized?) COVID-19 vaccine names with a permissive license would mostly solve the problem. Apps would gravitate towards using it and you would likely achieve consistency over time simply because it's 1) freely available and 2) high quality (assuming it's actually high quality). The million dollar question is how we actually get to this Nirvana? Perhaps we need to create our own open terminology and call it ERTH (Entire Reference Terminology for Health)? ;)</p>",
        "id": 254457305,
        "sender_full_name": "Ricky Bloomfield",
        "timestamp": 1632354155
    },
    {
        "content": "<p>Weâ€™re not taking on a general terminology for this, thatâ€™s for sure. No matter how tempting it is for this problem. But we can do a value set that solves this particular problem - i18ned consumer friendly terms for common covid vaccine codes. Logically, it would be a value set next to the vci registry json file, and some group of editors curate the PRs for jurisdictions (Iâ€™d be happy to volunteer to admin it at first), with shared responsibility between HL7 and VCI. Thatâ€™s a location that the clients already trust, and that we could reference from the specification in a â€œSHOULDâ€ conformance requirement</p>",
        "id": 254457817,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632354601
    },
    {
        "content": "<p>But thinking that through did make me wonder about i18n needs for the vci registry?</p>",
        "id": 254457874,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632354618
    },
    {
        "content": "<p>Sounds like a good plan to me!</p>",
        "id": 254460193,
        "sender_full_name": "Ricky Bloomfield",
        "timestamp": 1632356170
    },
    {
        "content": "<p>We are talking to CDC to make sure we're not missing anything re: CVX, but assuming they don't throw up any flags it sounds like...</p>\n<p>1) We have general agreement to move forward with a proposal to (1) publish a CVX value set with localized display names; and (2) add a SHOULD conformance requirement to the <a href=\"http://spec.smarthealth.cards\">spec.smarthealth.cards</a> that anytime an SHC is displayed it should be using these display names. <br>\nA maintenance/governance plan should be part of this proposal, and can be based on what Grahame said above on this.</p>\n<p>2) In a separate-but-related parallel path, we will propose changes to the FHIR IG that reduce the scope of SHALL-support code systems for <code>vaccineCode</code> to only CVX and possibly a small number of other equivalently granular and permissively licensed code systems. The first discussion about this will likely be in Public Health's Q4 session today, and will continue in our upcoming <a href=\"#narrow/stream/284830-smart.2Fhealth-cards/topic/FHIR.20IG.20ballot.20comment.20reconciliation.20meetings\">ballot reconciliation calls</a>.</p>\n<p>I believe that all of the above can apply to vaccines for all diseases, but the value set will likely only include robust localization for COVID for the foreseeable future.</p>\n<p>I wrote the above in definitive-sounding language, but this is really a question to to make sure I got this all correct...if not please propose edits accordingly. Thank you!</p>",
        "id": 254568743,
        "sender_full_name": "Max Masnick",
        "timestamp": 1632416439
    },
    {
        "content": "<p>that works for me</p>",
        "id": 254569092,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632416562
    },
    {
        "content": "<p>Agreed, this is a great plan.</p>",
        "id": 254582147,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632421786
    },
    {
        "content": "<p>We just discussed this on the PHWG Q4 call.</p>\n<p>The additions of non-US vaccine CVX codes was a one-off for CDC and it took a lot of time, so they likely can't keep that up to date without somehow getting support from the community.</p>\n<p>Everyone agrees that having a small number (one ideally, or two if needed) terminologies that meet the needs for SHCs is critical. We are going to pursue CVX, SNOMED GPS, and ICD-11 as the possible options for this.</p>",
        "id": 254603389,
        "sender_full_name": "Max Masnick",
        "timestamp": 1632430385
    },
    {
        "content": "<p>That implies that our community build ValueSet will include consumer friendly displays for those code systems as well</p>",
        "id": 254603654,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632430492
    },
    {
        "content": "<p>and ideally, concept maps between them. At least for vaccine codes, it should be possible to get solid maps</p>",
        "id": 254603719,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632430528
    },
    {
        "content": "<p>Yes</p>",
        "id": 254603757,
        "sender_full_name": "Max Masnick",
        "timestamp": 1632430553
    },
    {
        "content": "<p>Quick update from some internal discussions here at the American Immunization Registry Association on code sets. We are very supportive of trying to find a good common Interational code set that we can use. We are trying to do our own research on ICD-11 and Snomed to see how well these codesets might work, in comparison to what we have in CVX right now. (Because we know CVX, and not because we think it should be the primary standard.)</p>\n<p>The only wrinkle in all this, is that our community wants to use VCI beyond Covid. So we are looking at how all vaccine codes will be represented in an international set. We know that Covid is getting all the attention, and we should focus on supporting that first, but there is a larger need for credentials for all immunizations to support school entry, international travel, employment, etc. In our community we are pushing the adoption of VCI, not as just a Covid-specific solution, but as a general solution that will help meet public health goals we've had for decades.</p>\n<p>So we are going to look and give our feedback first on Covid and then secondarily what would be the benefit/drawbacks when we expand beyond this. Hopefully I'll have updates for the group on what we find out in the next week after a little investigation and comparison.</p>",
        "id": 256800999,
        "sender_full_name": "Nathan Bunker",
        "timestamp": 1633725002
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"322501\">@Max Masnick</span> pragmatically, apps and services would really benefit from an up-to-date ValueSet that includes CVX codes from <a href=\"https://www.cdc.gov/vaccines/programs/iis/COVID-19-related-codes.html\">https://www.cdc.gov/vaccines/programs/iis/COVID-19-related-codes.html</a> with helpful properties like \"Sale Proprietary Name\" (the closest we have to a friendly name so far). Baking this into an IG means it'll get outdated quickly; have you thought about pragmatic ways to publish this kind of artifact somewhere outside the IG and keep updated?</p>",
        "id": 263189990,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1638298000
    },
    {
        "content": "<p>(Like, if we don't have a planned answer for this I'll maybe just publish a GH repo with a FHIR-ified version of the CVX ValueSet including additional properties for these columns...)</p>",
        "id": 263190497,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1638298242
    },
    {
        "content": "<p>we already talked about VCI curating a value set with consumer friendly names for different languages - this is just the US friendly consumer name.</p>",
        "id": 263197094,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1638301061
    },
    {
        "content": "<p>proposal was to do it next to the VCI directory</p>",
        "id": 263197121,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1638301072
    },
    {
        "content": "<p>Yes, we want to have a ValueSet for this defined outside the IG (so it can be updated easily)</p>",
        "id": 263197571,
        "sender_full_name": "Max Masnick",
        "timestamp": 1638301290
    },
    {
        "content": "<p>That's fine; I'm trying to figure out whether someone is actively doing this yet, or if just getting started is the best thing.</p>",
        "id": 263197572,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1638301292
    },
    {
        "content": "<p>I'll defer to <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> and <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> on the best mechanism for doing this</p>",
        "id": 263197596,
        "sender_full_name": "Max Masnick",
        "timestamp": 1638301309
    },
    {
        "content": "<p>MITRE can work on the content once we know where it goes.</p>\n<p>I can also update the IG to point to this value set as soon as it's stood up</p>",
        "id": 263197690,
        "sender_full_name": "Max Masnick",
        "timestamp": 1638301347
    },
    {
        "content": "<p>I wrote a candidate - in this stream somewhere previously, but it's not being managed yet</p>",
        "id": 263197696,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1638301352
    },
    {
        "content": "<p>For a ValueSet like this that's presumably living on GitHub -- what do we do in the profile for the value set binding on <code>vaccineCode</code>?</p>",
        "id": 263197766,
        "sender_full_name": "Max Masnick",
        "timestamp": 1638301398
    },
    {
        "content": "<p><a href=\"#narrow/stream/284830-smart.2Fhealth-cards/topic/FHIR.20IG.20vaccineCode.20changes.3F/near/254349934\">https://chat.fhir.org/#narrow/stream/284830-smart.2Fhealth-cards/topic/FHIR.20IG.20vaccineCode.20changes.3F/near/254349934</a></p>",
        "id": 263198062,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1638301458
    },
    {
        "content": "<p>I think that the answer is to provide a static copy of it as an example binding, and point to the source of truth for implementers to decide how to manage it</p>",
        "id": 263198300,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1638301509
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> do you want to create a repo (or file within an existing repo) for this?</p>\n<p>And are you ok with us working on populating it, or did you want the first crack at it?</p>",
        "id": 263198750,
        "sender_full_name": "Max Masnick",
        "timestamp": 1638301677
    },
    {
        "content": "<p>I think a repository in the VCI org makes sense;  I don't have permissions to create repositories there, but if you give me permissions I can create one <span aria-label=\"smile\" class=\"emoji emoji-1f642\" role=\"img\" title=\"smile\">:smile:</span></p>",
        "id": 263202852,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1638303687
    },
    {
        "content": "<p>And I'd be happy if MITRE plans to work on populating this;  just want to make sure it is on someone's radar and that you can share an estimate of when a draft might be available.</p>",
        "id": 263203012,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1638303767
    },
    {
        "content": "<p>I'm happy to populate it if I get write access</p>",
        "id": 263205952,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1638305163
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> I appear to have the ability to create the repo. What should we name it? /cc <span class=\"user-mention\" data-user-id=\"197651\">@Reece Adamson</span></p>",
        "id": 263213614,
        "sender_full_name": "Max Masnick",
        "timestamp": 1638308925
    },
    {
        "content": "<p>what's the scope going to be? terminology assets that support SHC implemnetations? or just covid?</p>",
        "id": 263214044,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1638309165
    },
    {
        "content": "<p>I think it should be aspirationally scoped to any infectious disease (mirroring the FHIR IG), but practically will be COVID-only in the near term</p>",
        "id": 263214137,
        "sender_full_name": "Max Masnick",
        "timestamp": 1638309223
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193813\">@Nathan Bunker</span> said they may have some interest in this as well</p>",
        "id": 263214226,
        "sender_full_name": "Max Masnick",
        "timestamp": 1638309257
    },
    {
        "content": "<p>well, the full name would be \"Terminology Assets that support SHC implementations for infectious disease\" then? </p>\n<p>But I think that in practice, it's going to be all SHC terminology assets. Say we decide later to create a different repo for some other application of SHCs... are client applications that make use of the repo going to be able to decide which repo to use, and use it?</p>",
        "id": 263214466,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1638309390
    },
    {
        "content": "<p>It's possible that there will be other SHC use cases that none of us are involved in that have their own terminology assets</p>",
        "id": 263214708,
        "sender_full_name": "Max Masnick",
        "timestamp": 1638309515
    },
    {
        "content": "<p>but that will be about authority not scope of focus</p>",
        "id": 263214770,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1638309560
    },
    {
        "content": "<p>Ok for the sake of simplicity I went with <a href=\"https://github.com/dvci/shc-terminology\">https://github.com/dvci/shc-terminology</a>.</p>",
        "id": 263215538,
        "sender_full_name": "Max Masnick",
        "timestamp": 1638309920
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> and <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>, you should have invites to get write access</p>",
        "id": 263215551,
        "sender_full_name": "Max Masnick",
        "timestamp": 1638309931
    },
    {
        "content": "<p>It's licensed as CC0. I imagine this is fine for CVX as it's in the public domain, but not sure how this will work for other code systems that are not as permissively licensed (like SNOMED).</p>",
        "id": 263215774,
        "sender_full_name": "Max Masnick",
        "timestamp": 1638310044
    },
    {
        "content": "<p>I added a draft value set to get us going</p>",
        "id": 263216183,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1638310262
    },
    {
        "content": "<p>in terms of license, what we usually say is that the license on the value set etc as a whole is CC0, but there may be additional IP encumberments on some of the details, and we note those explicit in the copyright statement, or vocab has defined an extension for being more specific on value set includes</p>",
        "id": 263216372,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1638310350
    },
    {
        "content": "<p>Thanks Grahame and Max -- this is a great start. I added <a href=\"https://github.com/dvci/shc-terminology/issues/1\">https://github.com/dvci/shc-terminology/issues/1</a> about aligning wiht the \"Sale Proprietary Name\" values from CDC as a starting point in USA.</p>",
        "id": 263222566,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1638313946
    },
    {
        "content": "<p>Confirmed. I have some interest in helping with this as well, although don't necessarily need direct write access. We have an interest in the vaccination codes for all vaccines, not just covid. We are working to get some initial mappings together between CVX, Snomed, and ICD-11. It will be start, and something that can generate feedback from others. We also have a process for updating CVX codes, we could look to see if we can extend this to automatically propose updates as CVX codes are released. That might be helpful long term.</p>",
        "id": 263342152,
        "sender_full_name": "Nathan Bunker",
        "timestamp": 1638386057
    },
    {
        "content": "<p>we can add a mapping to that repository. Here's a template to get you going:</p>",
        "id": 263379271,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1638406001
    },
    {
        "content": "<p><a href=\"https://github.com/HealthIntersections/australian-fhir-support/blob/main/fhir/ConceptMap/covid-cvx-air-mapping.json\">https://github.com/HealthIntersections/australian-fhir-support/blob/main/fhir/ConceptMap/covid-cvx-air-mapping.json</a></p>",
        "id": 263379290,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1638406020
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193813\">@Nathan Bunker</span> whatâ€™s your GitHub username? No reason you canâ€™t have write access to the repo.</p>",
        "id": 263448677,
        "sender_full_name": "Max Masnick",
        "timestamp": 1638456970
    },
    {
        "content": "<p>At some point we will presumably institute a code review process before merges go in, but at this point I think we just want to populate as rapidly as folks have time for.</p>",
        "id": 263448762,
        "sender_full_name": "Max Masnick",
        "timestamp": 1638457006
    },
    {
        "content": "<p>Sounds good. Here is my GitHub id: nathanbunker</p>",
        "id": 263449520,
        "sender_full_name": "Nathan Bunker",
        "timestamp": 1638457265
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193813\">@Nathan Bunker</span> look for a GitHub invite in your email please!</p>",
        "id": 263515609,
        "sender_full_name": "Max Masnick",
        "timestamp": 1638488130
    },
    {
        "content": "<p>Josh and I have already been doing PR review</p>",
        "id": 263732448,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1638653327
    }
]