[
    {
        "content": "<p><strong>v0.6.0 of the SHC Vaccination &amp; Testing FHIR IG</strong> is ready for review (<a href=\"http://build.fhir.org/ig/HL7/fhir-shc-vaccination-ig/branches/dev/\">CI build</a>).</p>\n<p>From the <a href=\"https://github.com/HL7/fhir-shc-vaccination-ig/pull/148\">GitHub pull request for this release</a>:</p>\n<blockquote>\n<p>These are the changes we plan to submit to HL7 for our STU1 (Standard for Trial Use) ballot.</p>\n<p>This will be submitted to our sponsoring HL7 work group (Public Health) today (July 22). Content must be locked for ballot by August 8th. The ballot is open from August 13th through September 13th.</p>\n<p>The ballot-ready release that comes out before August 8th (which we expect will be very similar to v0.6.0) will likely be the final \"stable\" release of this IG outside the HL7 process. We expect the next major release to be the official STU1 release after reconciling HL7 ballot comments sometime this fall.</p>\n<p>If you notice any issues with v0.6.0 that need to be resolved before balloting, they <strong>must</strong> be resolved before August 8 so please let us know right away by <a href=\"https://github.com/HL7/fhir-shc-vaccination-ig/issues/new/choose\">logging a GitHub issue</a>.</p>\n<p>Going forward, the best ways to stay involved with the IG development process are:</p>\n<ol>\n<li>To join the <a href=\"http://lists.hl7.org/read/?forum=vaccination\">vaccination listserv at HL7</a> (<a href=\"https://www.hl7.org/Special/committees/pher/listserv.cfm\">sign up here</a>) for announcements about our meetings</li>\n<li>Continue to monitor this stream on Zulip</li>\n<li>Attend our meetings which are typically every 2 weeks at 12pm Eastern (search for \"SMART Health Card\" <a href=\"https://www.hl7.org/concalls/CallDirectory.aspx\">on this page</a>) -- but will likely be on hiatus until after balloting concludes September 13th</li>\n</ol>\n</blockquote>\n<p><a href=\"https://github.com/HL7/fhir-shc-vaccination-ig/pull/148\">The changelog is included in the pull request for this release</a>. There hopefully aren't any surprises in this release, but if you notice any issues please let us know right away. Thanks!!</p>",
        "id": 246832731,
        "sender_full_name": "Max Masnick",
        "timestamp": 1626951676
    },
    {
        "content": "<p>The design of the IG has been updated to use the default HL7 FHIR template: <a href=\"http://build.fhir.org/ig/HL7/fhir-shc-vaccination-ig/branches/dev/\">http://build.fhir.org/ig/HL7/fhir-shc-vaccination-ig/branches/dev/</a></p>",
        "id": 246879346,
        "sender_full_name": "Max Masnick",
        "timestamp": 1626974860
    },
    {
        "content": "<p>There are no new issues or comments on the v0.6.0 pull request, which we will take as a good sign <span aria-label=\"smiley\" class=\"emoji emoji-1f603\" role=\"img\" title=\"smiley\">:smiley:</span>. Unless something is identified today, <a href=\"https://github.com/HL7/fhir-shc-vaccination-ig/pull/148\">https://github.com/HL7/fhir-shc-vaccination-ig/pull/148</a> will be merged into <code>main</code> and become the official v0.6.0 release.</p>\n<p>It's possible the Public Health work group will request QA changes during the next 2 weeks, which will likely be released as v0.6.1 -- this will be the ballot version of the IG. We would then anticipate v1.0.0 to be released sometime after balloting closes mid-September -- this will include changes to address ballot comments.</p>\n<p>The one additional enhancement that we will try to get in before balloting is method of specimen collection (<a href=\"https://github.com/HL7/fhir-shc-vaccination-ig/issues/165\">https://github.com/HL7/fhir-shc-vaccination-ig/issues/165</a>). Otherwise we expect the spec to be stable through v1.0.0, apart from QA changes and responses to ballot comments.</p>",
        "id": 246979689,
        "sender_full_name": "Max Masnick",
        "timestamp": 1627048231
    }
]