[
    {
        "content": "<p>Need to get the Secret key for the user and provider account we created. When we tried to access the user accounts page we are getting 403 Access Forbidden. So we cant able to get the secret key to generate the access token.<br>\nuser-account-url: https://cernercentral.com/user-accounts(403 Access Forbidden)<br>\ncc: <span class=\"user-mention\" data-user-id=\"341228\">@Suprakash Maity</span>  <span class=\"user-mention\" data-user-id=\"194167\">@Santosh Jami</span>  <span class=\"user-mention\" data-user-id=\"373305\">@Rohit Bankia</span></p>",
        "id": 234455023,
        "sender_full_name": "Cibi Siddharth",
        "timestamp": 1618386109
    },
    {
        "content": "<p>tagging <span class=\"user-mention\" data-user-id=\"353749\">@Michael Turman</span> <span class=\"user-mention\" data-user-id=\"191809\">@Joe Rattazzi</span></p>",
        "id": 234459932,
        "sender_full_name": "Santosh Jami",
        "timestamp": 1618388500
    },
    {
        "content": "<p><a href=\"/user_uploads/10155/eKkEsZXYjY3zJzLc-JjeBsGR/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/eKkEsZXYjY3zJzLc-JjeBsGR/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/eKkEsZXYjY3zJzLc-JjeBsGR/image.png\"></a></div>",
        "id": 234485843,
        "sender_full_name": "Santosh Jami",
        "timestamp": 1618401689
    },
    {
        "content": "<p>Hi. Can you share the system account id, please?</p>\n<p>Edit: for this specific issue, we want to resolve this via Private message or email (to avoid any private app information from being posted)</p>",
        "id": 234493473,
        "sender_full_name": "Joe Rattazzi",
        "timestamp": 1618405108
    },
    {
        "content": "<p>As a note, for the HealthCards integration, the specification only supports Patient access workflows (where the patient directly authenticates). System accounts (like you have listed) can't be used to generate the OAuth token</p>",
        "id": 234493779,
        "sender_full_name": "Joe Rattazzi",
        "timestamp": 1618405225
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191809\">Joe Rattazzi</span> <a href=\"#narrow/stream/284830-CARIN-April.20'21.20Connectathon.20-.20SHC.20-.20.20Track/topic/Getting.20403.20in.20user.20accounts.20page/near/234493779\">said</a>:</p>\n<blockquote>\n<p>As a note, for the HealthCards integration, the specification only supports Patient access workflows (where the patient directly authenticates). System accounts (like you have listed) can't be used to generate the OAuth token</p>\n</blockquote>\n<p>Is this set in stone? One of our main concerns is around adoption, and we've found that small \"snags\" in the workflow like this can cause a good amount of users to give up. Either they don't know/can't find their password, or just don't want to bother, especially given the hesitancy out there on this topic, having it \"just work, and work well\" might make the difference.</p>",
        "id": 234499069,
        "sender_full_name": "Matt Printz",
        "timestamp": 1618407167
    },
    {
        "content": "<p>That's a great question - from my understanding, the goal of the project is for the patient to be able to integrate with their different hospitals/clinics/etc. to personally retrieve their health cards.</p>\n<p>This might be a question we need to direct to the larger group in the <code>smart/internal-health-cards</code> chats. If you're not already in that chat, I'm not sure if I have the power to add you or if we need someone like <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>  to invite folks in</p>",
        "id": 234499965,
        "sender_full_name": "Joe Rattazzi",
        "timestamp": 1618407488
    },
    {
        "content": "<p>I am not in that chat and am not finding it to join. Would be happy to join.</p>",
        "id": 234500515,
        "sender_full_name": "Matt Printz",
        "timestamp": 1618407697
    },
    {
        "content": "<p>I think I got you added, so hopefully that worked</p>",
        "id": 234500654,
        "sender_full_name": "Joe Rattazzi",
        "timestamp": 1618407749
    },
    {
        "content": "<p>SMART Health Cards is focused on sharing data with consumers. When a consumer wants to connect an app of their choice to their health records inside of a clinical provider system, we use the SMART App Launch to accomplish this; the pattern is based on consumer approval and right of access, rather than business to business trust.</p>",
        "id": 234502000,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618408276
    },
    {
        "content": "<p>Let's keep this conversation here, in public!</p>",
        "id": 234502169,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618408335
    },
    {
        "content": "<p>It's always possible for a clinical provider to enable business to business trust through use of technologies like SMART Backend Services, but the details of those kinds of arrangements are out of scope for the scenarios we established for this connectathon.</p>\n<p>(On a practical level, I hope it is very clear what that would look like -- e.g., a somehow-authorized app could use Backend Services to obtain an access token with scopes like <code>system/patient.read system/Immunization.read</code>, and then could invoke an issuance operation just like we do for consumer authorized apps.)</p>",
        "id": 234502619,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618408519
    },
    {
        "content": "<p>Is there a potential middle ground here? We are a \"connected health\" company, and as such, our users authorize us to and have the expectation that we will collect their medical information once they authorize the connection one time. We only collect the information on behalf of the users, to be viewed/used at the users' sole discretion.<br>\nBeing able to pull in the SHC info along with, say, the rest of the Cerner EHR data could drive adoption of the use, as it would just show up in the app as ready to use and wouldn't require an additional, extra flow that might discourage adoption.</p>",
        "id": 234503275,
        "sender_full_name": "Matt Printz",
        "timestamp": 1618408788
    },
    {
        "content": "<p>What you are describing is the crux of interoperability! And (...to be a bit provocative here -- please understand that I totally know where you're coming from!) from a certain vantage point, what you are asking for is that the ecosystem simply trust you because you're going to do the right thing. I'm not saying that's a bad idea; I am only saying it does not scale well, and does not build an end-to-end model of consumer trust.</p>",
        "id": 234505728,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618409732
    },
    {
        "content": "<p>If you can negotiate this level of trust with Cerner and with healthcare providers, the APIs are there to support you. But in my experience this negotiation is extremely challenging, slow, and (for some good reasons) limited; as such, it is safer to fall back on a consumer's right to access, which trumps these kinds of organizational trust decisions.</p>",
        "id": 234505870,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618409788
    },
    {
        "content": "<p>The forces of HIT Certification rules, HIPAA right of access, and Information Blocking prohibitions are all aligned to ensure the consumers have this kind of choice, but the alignment breaks down (i.e., you no longer get these <em>guarantees</em>) as soon as the trust decisions move into the hands of a covered entity.</p>",
        "id": 234506234,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618409936
    },
    {
        "content": "<p>I understand all that and strongly sympathize. The place where I'm getting a bit stuck thinking it through is: Say we (my company) have authorization to pull EHRs that include immunization information, and the customer requests that we pull their data: that immunization info is already going to be in our system. <br>\nIn such a case, I'm not sure if there is a greater risk for a immunization SHC to be pulled over as well, without requiring the user to OAuth all over again. We already have the information, we just don't have the SHARABLE information.<br>\nI would, of course, not want to be able to pull information that we are not authorized to have via SHC, but if we are authorized, allowing the automatic sharing of the SHC as an extension of EHRs make sense to me, if there is not a technical reason why this couldn't be done.</p>",
        "id": 234508987,
        "sender_full_name": "Matt Printz",
        "timestamp": 1618410882
    },
    {
        "content": "<p>I would say that's a good topic of discussion for you to work out with the vendors where you are currently authorized to pull data, building on whatever mechanism you're using there. Again, not saying this is a bad idea ; just saying this is out of scope for the scenarios we are focused on here.</p>",
        "id": 234509172,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618410951
    },
    {
        "content": "<p>To be clear: if you can get buy-in to work on this as an additional scenario beyond the ones that we drafted for the connect-a-thon, I would say it's worth exploring. I just wanted to explain why it is outside of our area of focus.</p>",
        "id": 234509340,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618410993
    },
    {
        "content": "<p>I agree. (Which is why I originally tried to move it out of the Connectathon thread)</p>",
        "id": 234509351,
        "sender_full_name": "Matt Printz",
        "timestamp": 1618410998
    },
    {
        "content": "<p>Not a good topic for the \"internal\" chat (which is focused on implementers participating in VCI).</p>\n<p>It seems like a fine thing to discuss in this thread, or else I'd maybe bring this up in Cerner's forums.</p>",
        "id": 234509730,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1618411148
    },
    {
        "content": "<p>Understand your position, Matt. We have to be pragmatic about our scope decisions - right now the priority is on consumer driven workflows. We should continue the conversation in the space of 'connected health' and the kinds of patterns systems like yours want to see related to verified health credentials.</p>",
        "id": 234517003,
        "sender_full_name": "Michael Turman",
        "timestamp": 1618413083
    },
    {
        "content": "<p>Sure. I'm not expecting the change to be done today... but I would like to continue the conversation.</p>",
        "id": 234518191,
        "sender_full_name": "Matt Printz",
        "timestamp": 1618413385
    }
]