[
    {
        "content": "<blockquote>\n<p>There's no use case for a card that contains both Immunization and lab result records?</p>\n</blockquote>\n<p>There might be. So far, we've erred towards keeping these discrete so applications can individually request the pieces they need; so people aren't coerced into over-sharing; and because we have pretty steep size limits on SMART Health Card contents. Lab results about <em>infection status</em> are the ones we see most widely requested in real-world workflows, and these are relevant for O(1 day), whereas vaccine records are relevant for O(1 year), so combining them into a single card can be challenging for that reason, too.</p>\n<p>We don't prohibit this, but <a href=\"https://spec.smarthealth.cards/#data-minimization\">we do say</a>:</p>\n<blockquote>\n<p>Additionally, Health Card FHIR Profiles SHOULD only include data that need to be conveyed together. (e.g., immunizations for different diseases should be kept separate. Immunizations and lab results should be kept separate.)</p>\n</blockquote>",
        "id": 251733915,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1630596571
    },
    {
        "content": "<p>well, given that the slices in the bundle profiles are closed, the spec does prohibit this</p>",
        "id": 251767629,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1630608975
    },
    {
        "content": "<p>I'm ok with the explanation, though an antibody titre might be relevant for longer. We're not doing that here, and I don't know if anyone is (though I read a passionate article yesterday abotu the importance of that as a human right, since having been sick is as good protection as getting immunized)</p>",
        "id": 251767822,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1630609056
    },
    {
        "content": "<blockquote>\n<p>given that the slices in the bundle profiles are closed</p>\n</blockquote>\n<p>Oh, I see -- yes, I guess my answer just applies at the level of the framework, not the vaccine/testing IG. Agreed that <em>some</em> lab tests may be relevant for longer stretches, though I also haven't seen these requirements in practice.</p>",
        "id": 251768201,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1630609199
    },
    {
        "content": "<p>well, I'll let this rest, but I suspect it will come up somewhere</p>",
        "id": 251769077,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1630609504
    }
]