[
    {
        "content": "<blockquote>\n<p>where does dose number go in the immunization resource? The example descriptions talk about dose number but I don't see it in the example</p>\n</blockquote>\n<p>It doesn't; <a href=\"https://build.fhir.org/ig/HL7/fhir-shc-vaccination-ig/vaccination.html#why-protocolapplied-is-not-allowed\">https://build.fhir.org/ig/HL7/fhir-shc-vaccination-ig/vaccination.html#why-protocolapplied-is-not-allowed</a> has rationale on this point.</p>",
        "id": 251733460,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1630596374
    },
    {
        "content": "<p>I did realise that, but didn't realise is was the same thing. And I disagree with some of that content. The fact that a dose is my second is not a matter of <em>intent</em>. It's a fact - this is my second dose. And you couldn't possibly determine from a single record whether it's the second or not. That implies that you must always provide the whole series, but your bang out of luck if you get the shots from different authorities then</p>",
        "id": 251767182,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1630608836
    },
    {
        "content": "<blockquote>\n<p>your bang out of luck if you get the shots from different authorities then</p>\n</blockquote>\n<p>In this case, if both authorities issued SHCs, then you would have to present separate QR codes for each dose.</p>",
        "id": 252314273,
        "sender_full_name": "Max Masnick",
        "timestamp": 1631025010
    },
    {
        "content": "<p>Long-term for COVID, I suspect Verifiers will end up looking for a single vaccine with the last X months (assuming regular boosters are necessary, which seems likely given the data on post-vaccination immunity and appearance of new variants)</p>",
        "id": 252314524,
        "sender_full_name": "Max Masnick",
        "timestamp": 1631025096
    },
    {
        "content": "<p>I believe a single QR code holds only a few Immunization resources anyway due to payload constraints, so we will likely end up needing multiple QR codes anyway to represent an entire series of vaccinations anyway unless it really is a one/two-and-done situation.</p>",
        "id": 252314920,
        "sender_full_name": "Max Masnick",
        "timestamp": 1631025230
    },
    {
        "content": "<p>I still think that dose number should be explicit, and I predict that this will cause adoption resistance problems if it is not</p>",
        "id": 252363035,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1631044626
    },
    {
        "content": "<p>Ok, thanks. We will investigate.</p>",
        "id": 252439713,
        "sender_full_name": "Max Masnick",
        "timestamp": 1631098490
    },
    {
        "content": "<blockquote>\n<p>The fact that a dose is my second is not a matter of intent. It's a fact - this is my second dose. And you couldn't possibly determine from a single record whether it's the second or not. </p>\n</blockquote>\n<p>This can easily be \"known\" but incorrect; it depends on how robust/complete a given issuer's knowledge is. I'm not <em>against</em> allowing this field, but I suspect it'll cause more confusion than clarity.</p>",
        "id": 252503443,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1631123348
    },
    {
        "content": "<p>Yeah, I would be concerned that Verifiers would treat <code>protocolApplied</code> as more authoritative than it actually is.</p>",
        "id": 252503751,
        "sender_full_name": "Max Masnick",
        "timestamp": 1631123489
    },
    {
        "content": "<p>I'm also not sure how often the dose number information are captured in the data used by Issuers, or if there is consistent interpretation of this across EHRs.</p>",
        "id": 252504012,
        "sender_full_name": "Max Masnick",
        "timestamp": 1631123589
    },
    {
        "content": "<p>I can't speak to US experience, but it's not a matter of question here. Other protocol information may be unclear, but there's no question about whether it's your first or second dose</p>",
        "id": 252517170,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1631128812
    },
    {
        "content": "<p>A couple of use cases to consider, WRT to COVID-19 vaccination dose numbers...<br>\na. Two vaccinations - 2 different vaccines<br>\nb. 'Booster' vaccinations</p>",
        "id": 252526797,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1631132554
    },
    {
        "content": "<p>If you get your e.g. 3rd shot from a different location, would they need to verify first that you indeed did have 2 shots already? Is it practicable to do this verification at e.g. mass vaccination sites? If we include the dose number, will verifiers just trust an SHC with one vaccination that claims it's the third shot, and can that be abused?</p>",
        "id": 252699316,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1631223039
    },
    {
        "content": "<p>Another sub-use case to consider... Annual 'booster' vaccinations. <br>\nIn my NZ primary care record, the dose sequence number in the records for my annual 'flu shot is always 1.</p>",
        "id": 252702229,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1631224487
    },
    {
        "content": "<blockquote>\n<p>would they need to verify first that you indeed did have 2 shots already</p>\n</blockquote>\n<p>of course it should not be a mandatory element. But this is no argument for not being able to say it at all</p>",
        "id": 252729356,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1631246387
    },
    {
        "content": "<p>Yes, we just want to be clear that these numbers may be accurate in some contexts but not in others, and to discourage populating if you're not quite confident and to discourage verifiers from trusting these numbers independently of data they have external to the resource</p>",
        "id": 252788024,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1631281092
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"322501\">Max Masnick</span> <a href=\"#narrow/stream/284830-smart.2Fhealth-cards/topic/GG.20Comment.3A.20Dose.20Number/near/252314920\">said</a>:</p>\n<blockquote>\n<p>Long-term for COVID, I suspect Verifiers will end up looking for a single vaccine with the last X months (assuming regular boosters are necessary, which seems likely given the data on post-vaccination immunity and appearance of new variants)</p>\n<p>I believe a single QR code holds only a few Immunization resources anyway due to payload constraints, so we will likely end up needing multiple QR codes anyway to represent an entire series of vaccinations anyway unless it really is a one/two-and-done situation.</p>\n</blockquote>\n<p>^- This.  Dose number is irrelevant, what is relevant is type of vaccine and date the dose was administered (which is captured), verifiers will be implementing rules of X number of doses within the immunity period for a shot of X months, it won't matter if it's dose 2 or dose 5.   If we need 5 doses of a vaccine, then shots 1 and 2 are obviously no longer effective or relevant to your immunization status.</p>\n<p>In testing with a stripped down payload we are able to get around 10 different types of vaccines in a single QR code when the payload is <code>rawDeflated</code></p>",
        "id": 252794381,
        "sender_full_name": "Deftdawg",
        "timestamp": 1631283637
    },
    {
        "content": "<p>(agree with this assessment as of today; it's worth saying none of this was clear a year ago, and the story may evolve  to sound different a year from now. So, to keep beating the same drum: this is why we've been focused on communicating the facts rather than conclusions. There's absolutely a role for downstream \"pass\" systems to focus on decision support logic and conclusions.)</p>",
        "id": 252795013,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1631283931
    },
    {
        "content": "<p>One thing to consider is that if SHCs include dose number, then this would need to be displayed on the human readable versions. I think there's serious risk for confusion with that unless dose number is authoritative -- which my understanding is that this is not the intent of <code>protocolApplied</code> currently. There's just not going to be an effective way to clearly communicate the nuance of \"provider intent\" in a SHC reader app.</p>\n<p>I also suspect Issuers will be reluctant to sign a SHC indicating an authoritative dose number unless they are the primary source of the whole series (in which case they they can bundle all the Immunization records into a single SHC anyway so the dose number is redundant).</p>",
        "id": 252800461,
        "sender_full_name": "Max Masnick",
        "timestamp": 1631286138
    },
    {
        "content": "<p>Given that certain source systems are unable to definitively ascertain the dose number, I agree with the reasoning of excluding elements from protocolApplied from what is included in the SHC. There should be a clear delineation of responsibilities, and with changing guidelines, a long term sustainable approach would be to say Patient X had vaccine Y at date Z, and then it's entirely the verifier's responsibility to determine if that meets the criteria for access to an event/flight/country.</p>",
        "id": 252802572,
        "sender_full_name": "Alex",
        "timestamp": 1631287035
    },
    {
        "content": "<p>I'm a bit late to this, but have to say that in generally it's not a good idea to communicate the dose number. And while it seems clear to those not involved with immunizations closely that the dose number is a very straightforward field, it is actually not in practice.  It implies a great deal about how the dose should be interpreted, and that interpretation changes across time, and changes depending on the perspective of the reader.  In the CDS space for immunizations we have come up with at least three different definitions for what a \"dose number\" is, and in some cases it's not even a number! We have also found no business reason why it needs to be transmitted as the receiver would still be advised to through this information away and determine the dose number based on their own needs. So for this reason, we don't transmit this with the immunization in most normal transactions.</p>",
        "id": 256798860,
        "sender_full_name": "Nathan Bunker",
        "timestamp": 1633723997
    },
    {
        "content": "<p>Thanks Nathan, that matches my understanding of this as well. We have no plans to change our current treatment of <code>protocolApplied</code> (<code>0..0</code> everywhere).</p>",
        "id": 256896238,
        "sender_full_name": "Max Masnick",
        "timestamp": 1633810906
    }
]