[
    {
        "content": "<blockquote>\n<p>what is the expectation for patient profiles for other countries? Same IG, or different?</p>\n</blockquote>\n<p>This is a universal realm IG, and the hope is we'll include a patient profile that works quite broadly.</p>",
        "id": 251731762,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1630595690
    },
    {
        "content": "<p>but in Australia, we'd likely want to say quite a bit about identifiers. So we'd want a profile somewhere</p>",
        "id": 251771247,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1630610365
    },
    {
        "content": "<p>Ideally we'd ensure that any Australian profiles could inherit from the IG's \"General\" patient profile -- so definitely call out if there's anything preventing this.</p>",
        "id": 251773724,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1630611399
    },
    {
        "content": "<p>I called that out. but there's a policy question here - why is the US specific profile in the IG. Are other countries going to be as well?</p>",
        "id": 251786295,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1630616731
    },
    {
        "content": "<p>Policy-wise, I'm not sure -- it's fair to say we don't currently have a good strategy for publishing \"coherent international guidance that incorporates pieces of jurisdiction specific stuff for 1 or more jurisdictions\".</p>",
        "id": 251786534,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1630616851
    },
    {
        "content": "<p>Splitting across multiple guides with their own review cycles is not an obvious improvement.</p>",
        "id": 251786657,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1630616898
    },
    {
        "content": "<p>right. And given the nature of being solved, I think it's worth putting them in the base guide.</p>",
        "id": 251794223,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1630620619
    },
    {
        "content": "<p>that implies that the IG needs a strategy</p>",
        "id": 251794231,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1630620628
    },
    {
        "content": "<p>Any suggestions for what that might look like?</p>",
        "id": 251794919,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1630621044
    }
]