[
    {
        "content": "<blockquote>\n<p>The identity proofing levels for vaccination don't match what's happening here in Australia at GPs: the GPs don't explicitly check your identity when you get the injection, but you're 50% likely to get a person who knows you personally when you turn up, and the GPs talk to you about it before and afterwards. So: no ID was used, but there's actually a pretty good verification system in place (enough? I'll leave that to others to debate)</p>\n</blockquote>\n<p>In practice we've seen very little use of our \"IAL\" tags in real-world implementations. Policies aren't consistent enough for issuers to hard-code a single value, and nobody takes the time to individually record or assert the identity verification practices used at the time of a specific clinical visit or immunization. I'm not against adding more elements into our vocabulary (\"IAL1.2B\", or whatever, to capture flavors of \"the patient was known to the practitioner\") but I'm skeptical about how useful or widely used this will be.</p>",
        "id": 251733099,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1630596242
    },
    {
        "content": "<p>(surprise) NOT... security is hard.   I suspect this will continue to be more of a theory than real-world. The cases where fraud happens will continue to be handled after-the-fact.   <a href=\"https://www.cnn.com/videos/business/2021/09/02/vaccine-fake-card-hawaii-arrest-moos-pkg-vpx.cnn\">https://www.cnn.com/videos/business/2021/09/02/vaccine-fake-card-hawaii-arrest-moos-pkg-vpx.cnn</a></p>",
        "id": 251764508,
        "sender_full_name": "John Moehrke",
        "timestamp": 1630607826
    },
    {
        "content": "<p>that said, it is useful for the interop standards to support the case where IAL is really used.</p>",
        "id": 251764663,
        "sender_full_name": "John Moehrke",
        "timestamp": 1630607885
    },
    {
        "content": "<p>Well, if it's worth including it, it's worth including the case. Though I'd rephrase it more generally as 'identified by routine clinical identification practices'</p>",
        "id": 251770569,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1630610097
    },
    {
        "content": "<p>Cross-posting for awareness of <a href=\"#narrow/stream/294750-FHIR-at.20Scale.20Taskforce.20.28FAST.29.3A.20Identity/topic/Implementer.20use.20of.20Identity\">this related thread in Identity stream</a>.</p>",
        "id": 253441313,
        "sender_full_name": "Julie Maas",
        "timestamp": 1631722361
    }
]