[
    {
        "content": "<p>hi all. <span class=\"user-mention\" data-user-id=\"197651\">@Reece Adamson</span>  recently added <a href=\"https://github.com/the-commons-project/vci-directory/blob/main/METADATA.md\">broader metadata support</a> to the VCI Directory and we intend to begin filling that out.</p>\n<p>today i’m looking at <code>issuer_type</code>. this could be useful for those of us making consumer facing tools and some verifiers are likely to be interested in what type of entity has issued an SHC. would love some quick feedback before we go with this and start populating. </p>\n<p>here is the starting point for the value set that may expand over time, ie don’t worry if you feel it’s incomplete unless you think there are <em>current or soon-to-be</em> issuers who do not fit:</p>\n<ul>\n<li><code>nation</code></li>\n<li><code>state_province_territory</code></li>\n<li><code>city</code></li>\n<li><code>health_system</code></li>\n<li><code>insurer</code></li>\n<li><code>laboratory</code></li>\n<li><code>pharmacy</code></li>\n</ul>\n<p>question for the channel. if you would make use of these data, would you rather it be (1) flat as above or (2) include some baked in hierarchy for filtering on entity types like governments and organizations? eg:</p>\n<ul>\n<li><code>governmental.nation</code></li>\n<li><code>governmental.state_province_territory</code></li>\n<li><code>governmental.city</code></li>\n<li><code>organizational.health_system</code></li>\n<li><code>organizational.insurer</code></li>\n<li><code>organizational.laboratory</code></li>\n<li><code>organizational.pharmacy</code></li>\n</ul>\n<p>feel free to vote </p>\n<ul>\n<li><span aria-label=\"one\" class=\"emoji emoji-0031-20e3\" role=\"img\" title=\"one\">:one:</span> for flat</li>\n<li><span aria-label=\"two\" class=\"emoji emoji-0032-20e3\" role=\"img\" title=\"two\">:two:</span> for hierarchical</li>\n</ul>\n<p>or weigh in if this is off, could be improved, or otherwise. thanks!</p>",
        "id": 269274844,
        "sender_full_name": "JP Pollak",
        "timestamp": 1643125284
    },
    {
        "content": "<p>These should also be verifiable credentials signed by the issuer, same key used on the QRs.</p>",
        "id": 269277215,
        "sender_full_name": "Vitor Pamplona",
        "timestamp": 1643126152
    },
    {
        "content": "<p>Otherwise, there is still too much trust on the system.</p>",
        "id": 269277416,
        "sender_full_name": "Vitor Pamplona",
        "timestamp": 1643126223
    },
    {
        "content": "<p>To be clear, these assertions are being made by VCI directory, not by the issuers</p>",
        "id": 269277823,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1643126379
    },
    {
        "content": "<p>So I don't understand how it makes sense for them to be signed by the issuer keys.</p>",
        "id": 269277862,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1643126395
    },
    {
        "content": "<p>We do have a separate discussion about how issueres can published additional metadata, but I would suggest we leave that out of scope for this thread, so we can have a scoped discussion about the codes/hierarchy here. Might start a separate thread for discussion about publication patterns beyond a simple directory.</p>",
        "id": 269278098,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1643126449
    },
    {
        "content": "<p>When issuers register to insert the data, that data should be signed as well. Otherwise, it is quite meaningless for verifiers since we can't figure out if the person applying for the VCI directory is the same as the one issuing credentials.</p>",
        "id": 269278431,
        "sender_full_name": "Vitor Pamplona",
        "timestamp": 1643126564
    },
    {
        "content": "<p>Basically, I am asking for a proof of keys for each entry on the registry.</p>",
        "id": 269278582,
        "sender_full_name": "Vitor Pamplona",
        "timestamp": 1643126635
    },
    {
        "content": "<p>VCI directory process/policies are at <a href=\"https://github.com/the-commons-project/vci-directory\">https://github.com/the-commons-project/vci-directory</a> - feel free to raise issues if there are specific concerns (but to be clear, this model absolutely places trust in the directory and its operators; we have not tried to avoid that in the current process)</p>",
        "id": 269278713,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1643126670
    },
    {
        "content": "<p>I know. And that sucks. There are options to avoid that trust</p>",
        "id": 269278796,
        "sender_full_name": "Vitor Pamplona",
        "timestamp": 1643126700
    },
    {
        "content": "<p>Agreed there is more that can be done; all a question of priority</p>",
        "id": 269279076,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1643126807
    },
    {
        "content": "<p>Sure. But since people are defining the payload now, it's going to be a lot easier to do it right than having to significantly change it later.</p>",
        "id": 269279354,
        "sender_full_name": "Vitor Pamplona",
        "timestamp": 1643126930
    },
    {
        "content": "<p>And since the EU Gateway, the WHO Registry and the Linux Foundation GCCN networks are all going into that direction, you might as well get ready for it now.</p>",
        "id": 269279911,
        "sender_full_name": "Vitor Pamplona",
        "timestamp": 1643127132
    },
    {
        "content": "<p>For the payload structure, I would also suggest taking a hard look at groups whose sole career is to design schemas for Trust Registries, like the ESSIF-TRAIN lab at the Fraunhofer Institute: <a href=\"https://gitlab.grnet.gr/essif-lab/infrastructure/fraunhofer/train_project_summary\">https://gitlab.grnet.gr/essif-lab/infrastructure/fraunhofer/train_project_summary</a></p>",
        "id": 269281117,
        "sender_full_name": "Vitor Pamplona",
        "timestamp": 1643127613
    },
    {
        "content": "<p>On top of that, making this metadata a verifiable credential kills all the constant criticism of requesting everyone to use verifiable credentials but not using it ourselves (among people defining verifiable credentials). The registry needs to be a verifier and an issuer at the same time. Let's lead by example. \"Do as I do\" is a lot more compelling than \"Do as I say\".</p>",
        "id": 269284278,
        "sender_full_name": "Vitor Pamplona",
        "timestamp": 1643128818
    },
    {
        "content": "<p>The hierarchical looks best to me, but flat would probably work fine too. </p>\n<p>This will be very helpful to Immunization Information Systems (registries). Which, in the US are mostly 'governmental.state_province_territory' and a couple '<a href=\"http://governmental.city\">governmental.city</a>'.  We used to have IIS who operated at the county level, but I think the last one that might have issued SHC's is merging with their state system that already supports SHCs. So these categories should work for the US.</p>",
        "id": 269330250,
        "sender_full_name": "Nathan Bunker",
        "timestamp": 1643147522
    }
]