[
    {
        "content": "<p>An issue that has come up during the Australian connectathon - the nbf is documented as the 'IssuanceDate'. For a lab report, that's a little obscure - is that issuance date of the smart health card, or the date that the Observation itself was issued (Observation.issued)</p>",
        "id": 262532931,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1637713468
    },
    {
        "content": "<p>We're treating nbf as the timestamp that the SHC was issued. Otherwise, when there were multiple Observations or Immunizations, would the nbf be the timestamp at which the most recent lab was resulted or most recent immunization administered?</p>",
        "id": 262533654,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1637714202
    },
    {
        "content": "<p>It's intended as the issuance date of the credential, whether it's about a vaccine, lab, or anything's else</p>",
        "id": 262589044,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1637761104
    },
    {
        "content": "<p>Clarification PRs welcome if this is confusing</p>",
        "id": 262589073,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1637761124
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> I would either copy the text from the W3C VC's <code>issuanceDate</code> field to explain what it is OR not mention the name <code>issuanceDate</code> at all. The name is the source of confusion. Unless people understand both the W3C VC and the JWT specs, it's hard to grasp what the spec is trying to say. The confusion is generated from using W3C VC terms in a JWT-based spec.</p>",
        "id": 262596732,
        "sender_full_name": "Vitor Pamplona",
        "timestamp": 1637764731
    },
    {
        "content": "<p>well, I could, but the spec just refers to 'the issuanceDate property' out of the blue. Should that be clarified in line? or should there be a section defining 'the properties' elsewhere? I could do a PR but I'm not sure which is better. I prefer the second. </p>\n<p>But it's more complicated than that because 'the properties' appear to be references to the vc-data model, where they are partially compliant... I really think that what's going on here requires better explanation generally</p>",
        "id": 262622917,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1637777288
    },
    {
        "content": "<p>oh. what <span class=\"user-mention\" data-user-id=\"458846\">@Vitor Pamplona</span> said.</p>",
        "id": 262622995,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1637777330
    }
]