[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194164\">@Neelima Karipineni</span> further comment on lab: effectivePeriod is allowed. I cannot think of any lab test that fits the category \"laboratory test results related to infection with or immunity to an infectious disease.\" that are collected over a period of time (e.g. urine collection). They're all point in time collections.</p>",
        "id": 253473512,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1631734114
    },
    {
        "content": "<p>so it should just be effectiveDateTime, I think</p>",
        "id": 253473543,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1631734131
    },
    {
        "content": "<p>The other question that's bothering me - it always does with accessing observations... we have the _since parameter, but who decides (a) how long is relevant and (b) do you want only the latest, or do  you want the whole series</p>\n<p>e.g. antigen testing - if you're not vaccinated, this is mandated to happen regularly, right. But previous antigen tests are irrelevant after another one is performed?</p>",
        "id": 253474514,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1631734516
    },
    {
        "content": "<p>For the generic lab profile we might want to leave the effectivePeriod, since we can't say for sure there won't be other infectious disease tests that don't have a collection period. But for the COVID specific lab profile makes sense to limit to effectiveDateTime.</p>\n<p>Re: antigen testing, in the scenario you mentioned earlier where someone in AU who has had COVID infection in the last 6 months does not get vaccinated, you may want older test results as evidence of past infection, not just most recent. We don't have great guidance on this (and I think we had a thread on this at some point, will hunt it down).</p>",
        "id": 253476180,
        "sender_full_name": "Neelima Karipineni",
        "timestamp": 1631735253
    },
    {
        "content": "<p>I only remember verbal communication with regards to <code>_since</code>, and the issuers at that point said that it would match a query if any of the resources contained in the SHC had been added/updated since.</p>",
        "id": 253478636,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1631736265
    },
    {
        "content": "<p>This might be useful for some people. All current (including unpublished) Covid LOINC codes.</p>",
        "id": 253484296,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1631738478
    },
    {
        "content": "<p><a href=\"/user_uploads/10155/O3lni-cKN1eJcEWnn7a672e6/covid-tests.json\">covid-tests.json</a></p>",
        "id": 253484374,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1631738520
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194164\">@Neelima Karipineni</span> some of them are Titres. But as you say, they mightn't be being used in USA</p>",
        "id": 253484485,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1631738566
    },
    {
        "content": "<p>and here's a candidate value set for all labs</p>",
        "id": 253486195,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1631739294
    },
    {
        "content": "<p><a href=\"/user_uploads/10155/E9Qe4qNPi9BhURfEeG4Nimuz/micro-tests.json\">micro-tests.json</a></p>",
        "id": 253486208,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1631739302
    },
    {
        "content": "<p>Alos, <span class=\"user-mention\" data-user-id=\"194164\">@Neelima Karipineni</span>, response from the IT lead for a state health pathology service here in Australia:</p>\n<blockquote>\n<p>Antigen (ie RATs): No reportable profile as NSWHP does have an orderable for this.</p>\n<p>Antibody: Depends upon methodology, assay, target and platform. IF is reported as titre but some tests may be semi-quantitative, such as the ‘Trimeric Spike’ and ‘Nucleoprotein’ assays. They may also be, on some infrequent occasions, reported as titres. Commercial assays I believe are reported as titres, as far as I am aware.</p>\n<p>PCR: ‘Positive/Negative/Indeterminate (Other)’ depending upon the assay/platform and the sample. Eg. If saliva NSWHP never reports a ‘positive’, only a ‘non-negative’, as the putative ‘positive’ must be confirmed by N&amp;T swab PCR. Depending upon the platform, positives results may include the target genes and the Ct value.</p>\n</blockquote>\n<p>So, some conclusions: the generic lab profile should absolutely allow for titres (valueRatio). I'm not so sure about the covid profile. Positive results include the Ct value and the target genes? That implies Component :-(  </p>\n<p>At least here in Australia. And I laugh at the antigen thing. Labs really are against that here, and still have the government on side on that. Which means that RAT is not done through the labs here - sounds like an own goal to me ;-)</p>",
        "id": 253525860,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1631765067
    },
    {
        "content": "<p>sometime in the next 24 hours, <a href=\"http://test.fhir.org\">test.fhir.org</a> will start supporting lab cards, using the two value sets I posted above to select observations to include, and it will only include the latest observation for any code. Whether that's appropriate will be a contentious clinical decision going forward</p>",
        "id": 253526026,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1631765249
    }
]