[
    {
        "content": "<p>Are you generating SHC barcodes on iOS or Android? It seems like many libraries (e.g. Swift's CoreImage, zxing) do <strong>not</strong> support mixed mode encoding. How are others accomplishing this?</p>",
        "id": 237729889,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1620335334
    },
    {
        "content": "<p>In Java, folks have had good a experience with <a href=\"https://github.com/nayuki/QR-Code-generator\">https://github.com/nayuki/QR-Code-generator</a></p>",
        "id": 237733313,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1620336299
    },
    {
        "content": "<p>I'm not familiar with iOS libraries -- wonder if <span class=\"user-mention\" data-user-id=\"191339\">@Pascal Pfiffner</span> might be able to comment.</p>",
        "id": 237734165,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1620336750
    },
    {
        "content": "<p>(Note the library above also includes a C and Rust language implementation that presumably could be wrapped on iOS, but this sounds painful.)</p>\n<p>Library support for our encoding scheme is a key consideration; if we determine support isn't good enough, this could be reason to re-work how we encode QRs or even potentially how we generate JWSs.</p>",
        "id": 237735071,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1620337258
    },
    {
        "content": "<p>On the flip side, this sounds like a great opportunity for enhancing Core Image!</p>",
        "id": 237745028,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1620343077
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span> did you have any luck finding an good iOS library for multi-mode QRs?</p>",
        "id": 240462114,
        "sender_full_name": "James Kizer",
        "timestamp": 1622120069
    },
    {
        "content": "<p>Probably late to the party, but CoreImage's <code>CIQRCodeGenerator</code> applies multi-mode automatically in iOS 15 and should work well for SHC QR codes.</p>",
        "id": 253204817,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1631601576
    },
    {
        "content": "<p>@James Kizer We explored possible iOS libraries - but the consensus was that wrapping the nayuki C/Rust implementations for iOS was likely the road we'd have to go down. We didn't go that route in the end so unfortunately can't be of much help.</p>\n<p>Pascal makes a good point for iOS 15 too.</p>",
        "id": 253301836,
        "sender_full_name": "Oliver Pang",
        "timestamp": 1631644978
    }
]