[
    {
        "content": "<p>Was kicking around the idea of using some endpoint in FHIR to generate the document we given to a patient which contains the QRcode for the VC... perhaps via $docref (<a href=\"https://www.hl7.org/fhir/us/core/OperationDefinition-docref.html\">https://www.hl7.org/fhir/us/core/OperationDefinition-docref.html</a>)</p>\n<p>General thoughts on that?  </p>\n<p>Assuming there arent' any big holes there, I'm kinda struggling w/ what the appropriate \"type\" parameter would be.  Anyone know what c80-doc-type-codes would be appropriate here?</p>",
        "id": 236721925,
        "sender_full_name": "Rob Resendez",
        "timestamp": 1619720700
    },
    {
        "content": "<p>We define a FHIR operation today for issuing Health Cards; I think you're saying you'd also want a FHIR operation that retuned a QR image? Or A PDF?</p>",
        "id": 236722502,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1619720984
    },
    {
        "content": "<p>Yes, the goal here is to create a document containing the qrcode(s) as needed</p>\n<p>Probably pdf given that we must break up qrcodes into chunks, but could be html if the qrcode images used base64 data uris</p>",
        "id": 236725024,
        "sender_full_name": "Rob Resendez",
        "timestamp": 1619721989
    },
    {
        "content": "<p>Who would be the consumers of this API?</p>",
        "id": 236726769,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1619722725
    },
    {
        "content": "<p>As it stands there seems to be an opportunity for some of our various applications or workflows (practitioner and patient facing) to make use of this so they don't all have to go through the effort of knowing how to chunk qr codes and what not... You have various tech stacks so sharing libraries isn't necessarily an option and an api seems like a good solution.</p>\n<p>I have also been thinking that some automation that creates a docref record would be a good way to make this document available \"for free\" in patient portals that already read document reference / binary...  So presumably a \"system access\" profile could be creating that document when immunization data is changed.</p>\n<p>So, no real concrete cases as of yet... Just thinking there are some opportunities here.  Was conducting a code review and noted that we have this chunk of code that I know we will need in other areas</p>\n<p>_edit_ that chunk of code currently calls issuevc, and so the notion was that it could call something else in the fhir layer and save some subsequent steps</p>",
        "id": 236728674,
        "sender_full_name": "Rob Resendez",
        "timestamp": 1619723436
    },
    {
        "content": "<p>Makes sense; I might suggest pursuing this as an internal API and seeing if there are patterns worth generalizing across systems.</p>",
        "id": 236732953,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1619725209
    },
    {
        "content": "<p>Hello! I've been modeling the examples here <a href=\"https://github.com/smart-on-fhir/health-cards-designs/\">https://github.com/smart-on-fhir/health-cards-designs/</a> to create a pdf of the SMART Health Card. </p>\n<p>Currently, we are working on the COVID-19 Vaccination Record Card and also a Full Vaccination Record Card. </p>\n<p>Should the example be followed for ALL different types of SMART Health Cards or is this example specific to COVID-19 or vaccinations?</p>",
        "id": 244450980,
        "sender_full_name": "Shannon Locklear",
        "timestamp": 1625070486
    },
    {
        "content": "<p>Re: \"Full Vaccination Record Card\", our general advice is not to group records unless a use case requires it. So, general advice would be to have a card for each vaccine, since cards can only be shared wholesale. See <a href=\"https://spec.smarthealth.cards/#granular-sharing\">https://spec.smarthealth.cards/#granular-sharing</a> for background</p>",
        "id": 244454802,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1625072233
    },
    {
        "content": "<p>On the reference designs: they <em>should</em> be a good starting point for any vaccine cards, though certainly there has been more attention/focus on COVID-19 specific issues. If you run into anything surprising or if questions come up, please raise them; we'd like these to be as generally useful as they can!</p>",
        "id": 244455012,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1625072297
    },
    {
        "content": "<p>(Oh, and <strong>welcome</strong> <span class=\"user-mention\" data-user-id=\"365018\">@Shannon Locklear</span> !)</p>",
        "id": 244455051,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1625072314
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191315\">Josh Mandel</span> <a href=\"#narrow/stream/284830-smart.2Fhealth-cards/topic/QRcode.20document/near/244455051\">said</a>:</p>\n<blockquote>\n<p>(Oh, and <strong>welcome</strong> <span class=\"user-mention silent\" data-user-id=\"365018\">Shannon Locklear</span> !)</p>\n</blockquote>\n<p>Thank you for the welcome! :)</p>",
        "id": 244455683,
        "sender_full_name": "Shannon Locklear",
        "timestamp": 1625072531
    }
]