[
    {
        "content": "<p>I'd like to explore a general pattern of creating \"SMART Health Card Links\", so QRs can link to bundles of data when the data are too big to fit in a SMART Health Card directly. Given <a class=\"stream-topic\" data-stream-id=\"284830\" href=\"/#narrow/stream/284830-smart.2Fhealth-cards/topic/Digital.20Insurance.20Card\">#smart/health-cards &gt; Digital Insurance Card</a> discussion, CARIN's digital insurance card use case may be a good first target for this technique.</p>",
        "id": 254736559,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632502594
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> I am not sure if we should abandon the idea or trim the data payload.  <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> yes would be great to explore this.  So basically there are two options with the QR code either embed the data directly in QR which is 7089 characters or link to a bundle of data.  The latter option may be ideal.  For the use case of vaccines or lab tests, the results don't change.  Insurance cards on the other hand can change and so this functionality would be a value add to the digital version of the card.</p>",
        "id": 254742979,
        "sender_full_name": "Adam Culbertson",
        "timestamp": 1632505082
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"216906\">@Amy Ballard</span> curious to get your take on this?</p>",
        "id": 254744012,
        "sender_full_name": "Adam Culbertson",
        "timestamp": 1632505485
    },
    {
        "content": "<p>yeah, the QR code containing a link really does seem to be the best option. Unlike COVID/clinical data use-cases, there's not a goal of minimizing the amount of data in the card, right? Further, the privacy concerns of a server knowing when you used your card are lessoned as well. Josh, how would a \"SHC Link\" differ from a normal QR card with an https url in it? Or do you mean that you'd just profile the Bundle? or authnz?</p>",
        "id": 254760065,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1632512124
    },
    {
        "content": "<blockquote>\n<p>7089 characters</p>\n</blockquote>\n<p>This is beyond the <em>usable</em> range  that you'll get out of QRs. I'd stick to V22 or lower.</p>",
        "id": 254767284,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632515144
    },
    {
        "content": "<p>the workflow is a whole lot simpler if you don't need links. But I suspected that you would get there... I was leading towards that conclusion slower than Josh went there.</p>",
        "id": 254767681,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632515328
    },
    {
        "content": "<p>if it's a QR code link... it's just a URL? A quick assessment in my head says that there's not really a need to sign the URL, since it's the integrity of the target that matters. You just need to wrap it with an identifying protocol so it gets handled right?</p>",
        "id": 254767980,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632515445
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> still would use shc:/ for the protocol benefits?</p>",
        "id": 254768056,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1632515477
    },
    {
        "content": "<p>Just a URL is not great unless you have a good process for managing expirations -- and those goal of de-activating the URL can conflict with the goal of allowing long-term access to the data for some recipeints. I have a bunch of thoughts here, all 10% baked. (For background, we considered some options for links back before we launched the SHC 1.0 spec, and ultimately <a href=\"https://github.com/smart-on-fhir/health-cards/pull/49\">decided against it</a>, which was absolutely the right call given our 1.0 focus.)</p>",
        "id": 254769107,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632515990
    },
    {
        "content": "<p>My update recent thoughts (from, like... this week) are at <a href=\"https://hackmd.io/kvyVFD5cQK2Bg1_vnXSh_Q?both\">https://hackmd.io/kvyVFD5cQK2Bg1_vnXSh_Q?both</a> (you should probably just squint at and ignore the GNAP stuff in there -- this was mainly an excuse for me to take a closer look at how GNAP is coming along, and I like what I see but it's early days.)</p>",
        "id": 254769212,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632516039
    },
    {
        "content": "<p>This kind of thing will need a lot focus and scoping, and some reference implementations to give us a feel for it. So I'm definitely not proposing anything at this stage, just noodling (and now... noodling out in the open).</p>",
        "id": 254769268,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632516079
    },
    {
        "content": "<p>are there cases where it would be useful to put some of the clinical data along with the URL in the QR? for partial offline support, for example?</p>",
        "id": 254769488,
        "sender_full_name": "JP Pollak",
        "timestamp": 1632516188
    },
    {
        "content": "<p>Yes, I think if we have a way of doing \"persistent links\" on their own, then having a way to stick such links into a \"regular 1.0\" health card alongside the fhirBundle makes good sense.</p>",
        "id": 254769795,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632516330
    },
    {
        "content": "<p>Josh, the \"claiming\" of a link to enable single or limited uses is really neat. The AS encrypts and generates the QR with the decryption key, right? Is it therefore able to decrypt the file?</p>",
        "id": 254779352,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1632520897
    },
    {
        "content": "<blockquote>\n<p>The AS encrypts and generates the QR with the decryption key, right</p>\n</blockquote>\n<p>Not quite -- whoever uploads the file to the server would (could) encrypt it prior to upload. If you want your AS to handle this, then sure it'd have access to the raw data. But the proposed design allows for separation.</p>",
        "id": 254789431,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632527740
    },
    {
        "content": "<p>I see how my write-up is confused on this point though; the (minimally scoped) authorization server would only provide part of the data for the QR code and not actually generate the full thing. Client would insert any description key</p>",
        "id": 254791114,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632528918
    },
    {
        "content": "<p>Figured I'd record a quick video sketching out this design space as I see it. I think there could be tie-ins with projects like CARIN's digital insurance card, HL7 advance directives, and other patient access initiatives. Would love to get feedback or questions on the concept.</p>\n<p><a href=\"https://youtu.be/SbM9I20lH64\">https://youtu.be/SbM9I20lH64</a></p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"SbM9I20lH64\" href=\"https://youtu.be/SbM9I20lH64\"><img src=\"https://uploads.zulipusercontent.net/811e1a6f72e6b753398862512a394a97724bad76/68747470733a2f2f692e7974696d672e636f6d2f76692f53624d394932306c4836342f64656661756c742e6a7067\"></a></div><p>From the YouTube description...</p>\n<blockquote>\n<p>This is a quick design sketch for a data sharing concept I'm calling (for now) 'SMART Health Links\". It's intended as the starting point for a broader conversation;  my goal is to provide a few specific examples while leaving the concept open-ended so we can explore where else it might fit, or how it might morph into something different.</p>\n<p>Design goals: <a href=\"https://hackmd.io/kvyVFD5cQK2Bg1_vnXSh_Q\">https://hackmd.io/kvyVFD5cQK2Bg1_vnXSh_Q</a><br>\nAPI sketch: <a href=\"https://hackmd.io/qx2capMpSTSz488f8juf_A\">https://hackmd.io/qx2capMpSTSz488f8juf_A</a><br>\nPrototype: <a href=\"https://github.com/jmandel/shclinks\">https://github.com/jmandel/shclinks</a></p>\n</blockquote>",
        "id": 256815939,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1633732942
    }
]