[
    {
        "content": "<p>Ontario has a business requirement to have an expiration date on the vaccine certificates. The rational is to have an  ability to identify a vaccine certificate that was issued awhile ago (e.g. 6 months) so that the client can be directed to get a new certificate with the latest data and format.  It doesn’t imply the client’s vaccinations has expired.  It’s that their certificate is dated and given the contents are constantly changing, we want them to be using the latest and greatest.</p>\n<p>I'm wondering if any other jurisdiction or organization has similar requirements. Was this discussed before? Are there any reasons to not include this in the standard?</p>",
        "id": 261827845,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1637174021
    },
    {
        "content": "<p>Hey Igor, the <code>nbf</code> field in the JWT does effectively contain a timestamp documenting when the SHC was generated. It could be used to determine that a card was 6+ months old. I'd wager that agreeing on the amount of time an SHC should be valid before expiration would be difficult to reach consensus on.</p>",
        "id": 261832873,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1637176109
    },
    {
        "content": "<p>And your logic is all about the issue date</p>",
        "id": 261832894,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1637176122
    },
    {
        "content": "<p>I agree -- the logic here doesn't require explicit, pre-specified expiration. Clients implementing jurisdictional logic can recommend \"get a new card\" based on issuance time, or availability of new data, etc.</p>",
        "id": 261833062,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1637176220
    },
    {
        "content": "<p>The problem with expiration times is that they <em>take away</em> the ability for a consumer to use/share records even though the records are still accurate. There may be cases where this makes sense, like for a VC representing a driver's license that expires at a certain time (or as we've discussed elsewhere, a time-limited exemption or pass). But for verifiable clinical information, these concerns don't apply.</p>",
        "id": 261833199,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1637176302
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span>, <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> and <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> </p>\n<p>It seems to be a question on how we look at the SHC: as a Verifiable Credential or as a Clinical Record. In our view, the SHC is being used as a  Verifiable Credential (rather than a clinical record) and a VC should support an expiration date that is not based on its content. </p>\n<p>Having an expiration date doesn't mean that any record (e.g. Immunization) in the certificate has expired. It rather means that the certificate itself has expired and that a new certificate needs to be issued to its holder.</p>\n<p>For example, the W3C VC work (<a href=\"https://www.w3.org/TR/vc-data-model/#expiration\">https://www.w3.org/TR/vc-data-model/#expiration</a>) has a requirement for an expiry date on the credential. However, the term \"expiration\" seems to be confusing, so they are going to rename the \"expirationDate\" to \"validUntil\".</p>\n<p>Having the \"Valid Until\" for the Verifiable Credential is actually the requirement for our jurisdiction and it would be great if SHC can define this in the standard. This might be an optional element, but having this in the standard would ensure consistent use and interpretation by systems that want to support this.</p>",
        "id": 261855819,
        "sender_full_name": "Igor Sirkovich",
        "timestamp": 1637186188
    },
    {
        "content": "<p>We can document this as an optional field in the core spec, but populating this field in your COVID-19 vaccination record SMART Health Cards would still be out of alignment with the specification, for the reasons described above.</p>",
        "id": 261856647,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1637186535
    },
    {
        "content": "<p>Given discussion here, I'm concerned about confusion on this point.</p>",
        "id": 261856701,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1637186574
    },
    {
        "content": "<p>Yeah, that's a good point and we should probably better document what <code>exp</code> means on an SHC, especially for verifiers. FWIW we will surface this date but not use it to mark a card as invalid.</p>",
        "id": 261966140,
        "sender_full_name": "Pascal Pfiffner",
        "timestamp": 1637258636
    }
]