[
    {
        "content": "<p>Hi everyone,</p>\n<p>New to stream so will apologize ahead of time if this has been discussed. Our Corporate Compliance department has a concern with the paper QR code. Can anyone scan QR code or does it require a special device by the venue to scan and retrieve info? The concern is that data would could fall into the wrong hands.</p>",
        "id": 261029793,
        "sender_full_name": "Marjorie Rosario",
        "timestamp": 1636567611
    },
    {
        "content": "<p>welcome <span class=\"user-mention\" data-user-id=\"456710\">@Marjorie Rosario</span> !</p>\n<p>the concerns are correct: since the spec is open and the QR codes contain all of the data necessary for decoding and reading, absolutely anyone can scan a SMART Health Card and access the data with a camera and the right software. the 'right software' could mean a PHR app that supports the spec, a scanner/ verifier app, or code someone has written themselves.</p>\n<p>that makes it pretty hard to regulate the scanning of QRs. we do have a handful of strategies that while far from impenetrable, can help:</p>\n<ul>\n<li>VCI has published a code of conduct for verifiers, and will remove  anyone found violating that code from VCI</li>\n<li>Google and Apple have specific requirements for apps that deal with COVID vaccination or testing, in some cases requiring endorsement from an appropriate jurisdictional government to be allowed into the app stores</li>\n<li>there are free verifier apps and tools made by VCI members and by NYS that at least have good data/ privacy hygiene and are widely used</li>\n<li>governments could regulate the verification of SMART Health Cards, limiting businesses to the use of approved apps only</li>\n</ul>",
        "id": 261036730,
        "sender_full_name": "JP Pollak",
        "timestamp": 1636570272
    },
    {
        "content": "<p>oh- the other strategy is user education!</p>",
        "id": 261037176,
        "sender_full_name": "JP Pollak",
        "timestamp": 1636570454
    },
    {
        "content": "<p>The FAQ at <a href=\"https://smarthealth.cards/faq.html\">https://smarthealth.cards/faq.html</a>  explains some of this from the consumer perspective as well</p>",
        "id": 261037192,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1636570463
    }
]