[
    {
        "content": "<p>Are there any States that have implemented smart health cards in their web portals?</p>",
        "id": 237366955,
        "sender_full_name": "Kelly Taylor",
        "timestamp": 1620149650
    },
    {
        "content": "<p>None in production today -- but in many states, state-level access is a good pattern for getting to scale.  Another pattern is healthcare providers with access to IIS data.</p>",
        "id": 237388522,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1620158245
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"409925\">@Kelly Taylor</span>   My observation is that no state has implemented this, but please let me know if you find otherwise.   I think states should have a statewide IdP for many citizen services, healthcare being one among them.  I think an \"Identity CoOp\" amongst states is an interesting approach for states/governance.  Also states need to issue personal safety identifiers (PSIs) and (optionally ) public \"pointer pages\".</p>",
        "id": 237400348,
        "sender_full_name": "Alan Viars",
        "timestamp": 1620162870
    },
    {
        "content": "<p>Here is my QR as an example:   <a href=\"/user_uploads/10155/gwbI2Rn6U8nEZCUcETrn5LVZ/image.png\">image.png</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/gwbI2Rn6U8nEZCUcETrn5LVZ/image.png\" title=\"image.png\"><img src=\"/user_uploads/10155/gwbI2Rn6U8nEZCUcETrn5LVZ/image.png\"></a></div>",
        "id": 237401039,
        "sender_full_name": "Alan Viars",
        "timestamp": 1620163030
    },
    {
        "content": "<p>I'm okay with my birthday and this info being shared.</p>",
        "id": 237401275,
        "sender_full_name": "Alan Viars",
        "timestamp": 1620163093
    },
    {
        "content": "<p>Sweet! BTW after trying and failing to scan with my <a href=\"http://joshuamandel.com/health-card-scanner-demo\">browser-based demo</a> (which relies on CORS) I'm realizing we don't test for CORS in the validator -- just added <a href=\"https://github.com/microsoft/health-cards-validation-SDK/issues/81\">https://github.com/microsoft/health-cards-validation-SDK/issues/81</a></p>",
        "id": 237404566,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1620164282
    },
    {
        "content": "<p>At the state level, <a href=\"https://lawallet.com/covid19\">https://lawallet.com/covid19</a> includes an announcement of work that Louisiana is planning on top of their digital driver's license app.</p>",
        "id": 237531610,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1620234585
    },
    {
        "content": "<p>I'm not aware of any that have implemented VCI, but some do have consumer portals that allow access to download a PDF. The states that have these have had them for years. States will look to implement things such as VCI, but they are waiting for (1) national strategy and (2) time/money to implement. States are doing all they can to keep their current HL7 v2 infrastructures operational with traffic that is 5-10 times higher than normal. But now that the initial rush of data flows is starting to ebb, a little, the states are starting to look at what is happening and see how they can be involved.</p>",
        "id": 238555690,
        "sender_full_name": "Nathan Bunker",
        "timestamp": 1620859748
    },
    {
        "content": "<p>The LA state implementation is very interesting. They build on a state digital drivers license to allow residents to display/share a green check mark. Different than VCI, this standard does not transfer vaccine information, just an indication if enough doses were given of the right product for the patient to be considered immune.</p>",
        "id": 238556249,
        "sender_full_name": "Nathan Bunker",
        "timestamp": 1620860192
    },
    {
        "content": "<p>On today's VCI call the LA Wallet team showed their SMART Health Cards implementation; it appeared to be fully compatible with our spec (perhaps in addition to other formats they'll support). <span class=\"user-mention\" data-user-id=\"328301\">@JP Pollak</span> can you comment, since I had to miss the call?</p>",
        "id": 238559630,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1620862500
    },
    {
        "content": "<p>yes! Nathan, you're description of their 'green check mark version' is what they have currently in the app stores. along with that release, they announced their planned support for SMART Health Cards (<a href=\"https://lawallet.com/covid19\">https://lawallet.com/covid19</a>) and have been wrapping up their implementation. the demo of that version we saw today maintained the green check but added a SMART Health Card QR and Export SMART Health Card button to share with other mobile apps. i understand the release of that to be imminent but don't have specific timing. VCI will post the video of the webinar in the next couple of days (at <a href=\"https://vci.org/events\">https://vci.org/events</a>) and it will be worth checking that portion out!</p>",
        "id": 238560702,
        "sender_full_name": "JP Pollak",
        "timestamp": 1620863290
    },
    {
        "content": "<p>Good to know. I think the green check mark is very useful, as it greatly simplifies what you are exposing outwards. Here at the American Immunization Registry Association we had a community wide presentation about some of the efforts and we had a demonstration of the LA solution. Overall it looks like a good solution. Would be interested to hear about plans to create a vaccine-credential itself. My take is that the VCI standard is pretty straightforward and I hope to see many systems be able to create them.</p>",
        "id": 238614939,
        "sender_full_name": "Nathan Bunker",
        "timestamp": 1620909205
    }
]