[
    {
        "content": "<p>Hi Guys, just a few questions about available mobile device functionality for SMART Health Cards.</p>\n<ul>\n<li>Can the Apple iOS 15 release directly scan a QR Code barcode to get the SHC into the device or can it only be downloaded from a SMART on FHIR enabled FHIR API?</li>\n<li>Can the Android CommonPass App directly scan a QR Code barcode to get the SHC into the device or can it only be downloaded from a SMART on FHIR enabled FHIR API?<br>\n-Is Common's 'SMART Health Card Verifier App' a separate app dedicated to verifiers?  If so why is it not seen in the google play store, I only see the former app?</li>\n</ul>\n<p>What I am trying to work out is if we currently, or very soon, will have the ability for both iPhone and Android users to manually scan a SMART Health Card QR Code to allow them to store it on their phone, without the use of SMART on FHIR and a FHIR API.</p>\n<p>Thanks guys</p>",
        "id": 256995860,
        "sender_full_name": "Angus Millar",
        "timestamp": 1633911102
    },
    {
        "content": "<blockquote>\n<p>Can the Apple iOS 15 release directly scan a QR Code barcode to get the SHC into the device or can it only be downloaded from a SMART on FHIR enabled FHIR API?</p>\n</blockquote>\n<p>Yes, scanning in the camera app will offer to open in the Health app. (And in the 15.1 beta, these can be added to Apple Wallet also.)</p>",
        "id": 256999377,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1633914695
    },
    {
        "content": "<blockquote>\n<p>Can the Android CommonPass App directly scan a QR Code barcode to get the SHC into the device or can it only be downloaded from a SMART on FHIR enabled FHIR API?</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"365368\">@James Kizer</span>  <span class=\"user-mention\" data-user-id=\"328301\">@JP Pollak</span> may be able to chime in</p>",
        "id": 256999385,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1633914707
    },
    {
        "content": "<blockquote>\n<p>Is Common's 'SMART Health Card Verifier App' a separate app dedicated to verifiers? If so why is it not seen in the google play store, I only see the former app?</p>\n</blockquote>\n<p>There's a SMART Health Card Verifier app (on Android and iOS; see <a href=\"https://thecommonsproject.org/smart-health-card-verifier\">https://thecommonsproject.org/smart-health-card-verifier</a>) for verifying SHCs; this is distinct from the <strong>Common Health</strong> app which is for storing/managing health data including SHCs (analogous to Apple's Health app on iOS). I'm not sure what you mean by \"only see the former\".</p>",
        "id": 256999475,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1633914809
    },
    {
        "content": "<blockquote>\n<p>What I am trying to work out is if we currently, or very soon, will have the ability for both iPhone and Android users to manually scan a SMART Health Card QR Code to allow them to store it on their phone, without the use of SMART on FHIR and a FHIR API.</p>\n</blockquote>\n<p>You definitely never need a FHIR API to access a SMART Health Card. Even without any special wallet app, you can just save it as a file or print it out. (FHIR API access can be a convenient way to access a SHC if you <em>already</em> have an app connected to your FHIR API, but by design this is definitely in the \"nice to have, not required\" category.)</p>",
        "id": 256999541,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1633914870
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>  Thanks for the info on the Apple app. Just what I wanted to hear. <br>\nIt will be good to hear if the CommonsApp can do the same. <br>\nI have now found the 'SMART Health Card Verifier App' on the Google play store, so thanks on that as well.<br>\nI understand you don't need a FHIR API in the sense that you can print a QR Code or save it as a file. I was rather referring to the digital wallet Apps and how you can import a SHC into them. I feared that some only allowed the import via a FHIR API and not via a camera scan. If the CommanApp can import via camera scan then that covers off Android and I am good.<br>\nThanks again for your help.</p>",
        "id": 257025190,
        "sender_full_name": "Angus Millar",
        "timestamp": 1633938063
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> <span class=\"user-mention\" data-user-id=\"191391\">@Angus Millar</span> sorry for missing this earlier in the week. CommonHealth supports the following methods of importing SHCs:</p>\n<ul>\n<li>Via SMART on FHIR for data sources that support it</li>\n<li>Scanning a QR code via the camera from within the app</li>\n<li>Importing an image or PDF that has a QR code in it</li>\n<li>Importing a <code>.smart-health-card</code> file</li>\n</ul>",
        "id": 257753902,
        "sender_full_name": "James Kizer",
        "timestamp": 1634327181
    },
    {
        "content": "<p>Excellent, thank you <span class=\"user-mention\" data-user-id=\"365368\">@James Kizer</span></p>",
        "id": 257783676,
        "sender_full_name": "Angus Millar",
        "timestamp": 1634342739
    }
]