[
    {
        "content": "<p>Not sure if this is the correct stream, but here we go.</p>\n<p>We are looking to create a set of IGs to publish as packages. The IGs will be fairly small, one per domain, in order to have separate release-pipelines, versioning and dependencies.</p>\n<p>From the registry doc.:</p>\n<blockquote>\n<p>DIY: Create your own package feed and add it to the list of package feeds:<br>\n- Create an RSS feed (template at <a href=\"http://hl7.org/fhir/package-feed.xml\">http://hl7.org/fhir/package-feed.xml</a>)<br>\n- Register the package feed in <a href=\"https://github.com/FHIR/ig-registry/blob/master/fhir-ig-list.json\">https://github.com/FHIR/ig-registry/blob/master/fhir-ig-list.json</a> (by making a GitHub PullRequest. The package -server will regularly check the RSS feed for new packages.</p>\n</blockquote>\n<p>The  IG development is done on GitHub and new releases are created using <a href=\"https://docs.github.com/en/github/administering-a-repository/releasing-projects-on-github/managing-releases-in-a-repository\">GitHub's release management</a> including changelog and NPM Package.</p>\n<p>The current plan is to create a github-action to trigger on <code>release events</code> and generate a XML according to the Fhir package RSS feed template. This xml is hosted on github and can be registered as a package feed in the fhir-ig-list.json as mentioned in the registry doc.</p>\n<p>Such a solution should integrate well in our current CI\\CD pipeline. However, I'm concerned after finding only 11 registered feeds in the fhir-ig-list since this indicates that creating your own feed is not a common practice. I'm also curious about the <code>package-restrictions</code> and <code>guides</code> lists because they are not mentioned in the registry doc., do we need to populate them as well?</p>",
        "id": 252352208,
        "sender_full_name": "Eirik Myklebost",
        "timestamp": 1631040202
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span></p>",
        "id": 252361779,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631044082
    },
    {
        "content": "<p>actually we are moving that stuff to packages-list.json instead of fhir-ig-list.json, since they are separate things. You need to make PRs to both - once for your package feed, and to fhir-ig-list.json each time you release a new milestone version - it's kind of your summary of status</p>",
        "id": 252444870,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1631101242
    },
    {
        "content": "<p>package-restrictions, you can use that to specify that no one else can publish packages in your namespace</p>",
        "id": 252444916,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1631101264
    },
    {
        "content": "<p>Thanks for the reply <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>, hopefully you can clarify some things for me.</p>\n<p><em>Feeds</em> and <em>package-restrictions</em> are being moved to <a href=\"https://github.com/FHIR/ig-registry/blob/master/package-feeds.json\">package-feed.json</a> and <em>guides</em> will be the only element remaining in <em>fhir-ig-list.json</em>. <em>Feeds</em> and <em>package-restrictions</em> are still available in both, but his is only during a \"transition period\"?</p>\n<p>Why do I need to populate the <em>guides</em> element, what is it used for? This seems to somewhat overlap with what is provided in <em>package-feed.xml</em>.</p>\n<p>Can you clarify <strong>milestone release</strong>? We want to continuously release new versions of  multiple packages\\IGs, at least <strong>minor</strong> and <strong>patch</strong> (SemVer), do we need to update the <em>fhir-ig-list.json</em> every time? We want to automate as much as possible.</p>\n<p>Considering there only being 11 other registered feeds; is there anything wrong with our approach? Are there alternatives, except from Simplifier?</p>",
        "id": 252463483,
        "sender_full_name": "Eirik Myklebost",
        "timestamp": 1631109304
    },
    {
        "content": "<p>yes only during the transition period until all the people using it tell me that they've changed</p>",
        "id": 252518015,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1631129202
    },
    {
        "content": "<p>The guides element drives this: <a href=\"http://www.fhir.org/guides/registry/\">http://www.fhir.org/guides/registry/</a>. That's it's sole purpose. And that is built around the idea of periodic milestones. It doesn't really handle continuous new releases. and the guides do contain information that can't be built from what's available in the packages feed</p>",
        "id": 252518391,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1631129339
    },
    {
        "content": "<p>Ok, thanks <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> , we will continue on this path.</p>",
        "id": 252704120,
        "sender_full_name": "Eirik Myklebost",
        "timestamp": 1631225557
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"223185\">Eirik Myklebost</span> has marked this topic as resolved.</p>",
        "id": 252704126,
        "sender_full_name": "Notification Bot",
        "timestamp": 1631225562
    }
]