[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> In the discussions with <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> around the IHE FormatCodes content, he asserted that the reason the value set for FormatCodes in IHE renders in the FHIR R4 spec is \"you did some ftp magic\" whatever that means.    <span class=\"user-mention\" data-user-id=\"192205\">@Lisa Nelson</span> has put in a UTG request to add the value set for format codes into THO as a CDA ValueSet, and <span class=\"user-mention\" data-user-id=\"311999\">@Marc Duteau</span> assisted her with the resource definition.    He submitted it and I have been trying to figure out why it will not build and expand the value set no matter what I do - the identical &lt;compose&gt; and parameters as the FHIR R4 value set definition will not expand in a UTG/THO build.    I can only conjecture that this was in the infrastructure only temporarily, or only accessed in the FHIR R4 build.   The value set has been removed for FHIR R5 apparently, and it was one of those that was supposed to have been 'moved' to THO.   I have verified with John that the underlying code system with the correct (as per IHE) &lt;url&gt; exists and is resolvable to the resource (<a href=\"http://ihe.net/fhir/ihe.formatcode.fhir/CodeSystem/formatcode\">http://ihe.net/fhir/ihe.formatcode.fhir/CodeSystem/formatcode</a>) and John said that the IHE IG expands against it just fine in the Publisher.  In trying to get to the bottom of all this, it seems the canonical URL <a href=\"http://terminology.hl7.org/CodeSystem/hl7-document-format-codes\">http://terminology.hl7.org/CodeSystem/hl7-document-format-codes</a> does NOT exist in THO, but DOES exist in the publishing infrastructure somewhere as well; a compose like:           &lt;compose&gt;<br>\n    &lt;include&gt;<br>\n      &lt;system<br>\n              value=\"http://terminology.hl7.org/CodeSystem/hl7-document-format-codes\"/&gt;<br>\n    &lt;/include&gt;<br>\n  &lt;/compose&gt;</p>",
        "id": 257855982,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634413537
    },
    {
        "content": "<p>happily expands to all the codes without error.  The content cannot be found in FHIR or in THO.   Where is it coming from?   And why since the URL was obviously changed to THO from <a href=\"http://hl7.org/fhir\">hl7.org/fhir</a>, was the content not moved but it was left in the infrastructure somewhere?</p>",
        "id": 257856083,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634413638
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> that is the SDWG bit.   The IHE bit - as I understand it we (HL7) have three choices:</p>",
        "id": 257856108,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634413678
    },
    {
        "content": "<ol>\n<li>Create a 'convenience copy' of the IHE code system in THO (and take on the burden of maintenance and the MOU to do so)</li>\n</ol>",
        "id": 257856167,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634413709
    },
    {
        "content": "<ol start=\"2\">\n<li>Access it directly from IHE with a depends-on parameter to the IHE IG that  contains the code system source of truth (thus taking on the risk that if IHE moves it or does something with it that implies a ValueSet CLD change it breaks the THO copy and valuesets built on it)</li>\n</ol>",
        "id": 257856214,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634413782
    },
    {
        "content": "<ol start=\"3\">\n<li>Download a 'secret copy' of the content and stuff it in <a href=\"http://tx.fhir.org\">tx.fhir.org</a> or somewhere else in the infrastructure (taking on the burden of #1 above but without the MOU)</li>\n</ol>",
        "id": 257856308,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634413840
    },
    {
        "content": "<p>Any other options I missed?   <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> has told me he started the process of requesting an HTA page for the IHE format codes - is that accurate <span class=\"user-mention\" data-user-id=\"195036\">@Carol Macumber</span> ?   I would really like to figure this out for <span class=\"user-mention\" data-user-id=\"192205\">@Lisa Nelson</span> and the CDA gang for the THO release coming up, but of course the combined value set CLD which includes the IHE specific content in one &lt;include&gt; and the HL7 content in the other &lt;include&gt; fails to do any expanding, as the expansion operation fails when it is unable to access the IHE content at <a href=\"http://ihe.net/fhir/ihe.formatcode.fhir/CodeSystem/formatcode\">http://ihe.net/fhir/ihe.formatcode.fhir/CodeSystem/formatcode</a>.   Please also note the the URL used for this content in FHIR R4 is <a href=\"http://ihe.net/fhir/ValueSet/IHE.FormatCode.codesystem\">http://ihe.net/fhir/ValueSet/IHE.FormatCode.codesystem</a> which also fails in the Publisher as it is an old and invalid URL (as asserted by John) and you must have dispensed with it after the R4 publication.</p>",
        "id": 257856653,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634414172
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> please help me understand and untangle this mess.  I am happy to help Lisa, John, Marc, and Carol to get all the pieces aligned, but I am ignorant of where the content we can see is coming from in the Publisher, and am seeking your opinion on best course of action to be able to browsable include the IHE content in THO (it would be super nice to use the actual real URL which resolved to the page of the rendered resource)</p>",
        "id": 257856752,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634414273
    },
    {
        "content": "<p>A CodeSystem resource for this code system with the <a href=\"http://terminology.hl7.org/CodeSystem/hl7-document-format-codes\">http://terminology.hl7.org/CodeSystem/hl7-document-format-codes</a> canonical url does exist in the <a href=\"https://github.com/FHIR/packages.git\">packages</a> repository in 'fhir.tx.support.r4', and therefore that code system content (8 codes - 2 each for C-CDA 1.1, C-CDA 2.1, C-CDA 2.2 and PACP 1.0) is available on <a href=\"http://tx.fhir.org\">tx.fhir.org</a>.  The commit that added that CodeSystem resource instance was made by Grahame on Mar 3, 2020.</p>",
        "id": 257969241,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1634525372
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> I assumed so, as the value set built on that 'all codes' expands fine.  The issue is the with IHE codes, which are in the R4 expansion but I cannot find any way to access that content in THO currently.   This one that you reference is only the SDWG CDA additions to the IHE code system.</p>",
        "id": 258062416,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634576388
    },
    {
        "content": "<p>Yes, correct.</p>",
        "id": 258065520,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1634577414
    },
    {
        "content": "<p>Any clue where the IHE codes that are in the expansion in R4 came from?    They do not appear to be in the infrastructure anywhere I can find.</p>",
        "id": 258082723,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634584128
    },
    {
        "content": "<p>These are the ones I am talking about:   <a href=\"https://profiles.ihe.net/fhir/ihe.formatcode.fhir/CodeSystem-formatcode.html\">https://profiles.ihe.net/fhir/ihe.formatcode.fhir/CodeSystem-formatcode.html</a></p>",
        "id": 258184921,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634646189
    },
    {
        "content": "<p>FHIR R4 expansion:  <a href=\"http://hl7.org/fhir/valueset-formatcodes.html\">http://hl7.org/fhir/valueset-formatcodes.html</a></p>",
        "id": 258184982,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634646235
    },
    {
        "content": "<p>It seems like what we need and want to do is add an additional include for the HL7 <a href=\"http://terminology.hl7.org/CodeSystem/hl7-document-format-codes\">code system</a> to the <a href=\"http://hl7.org/fhir/valueset-formatcodes.html\">formatcodes</a> value set definition.  I believe that's what <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> has been wanting? <span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span></p>",
        "id": 258266600,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1634675419
    },
    {
        "content": "<p>UP-241.  this is what I have been trying to get working.    I commented out the IHE code system compose.include as it kills the expansion completely.  If you read carefully above, what I verified experimentally is that the IHE content which was in the system somewhere when R4 was a published as it is in the R4 value set expansion, and referred to by what John claimed was an erroneous and obsolete code system &lt;url&gt; has somehow been removed and none of the half dozen possible URIs that I tried will surface the IHE content - including the URI used in the R4 value set, which will not expand on a build;  it appears to no longer be anywhere in the infrastructure.   THO will have the value set including the HL7 content when UP-241 is approved and implemented, and Lisa stated unequivocally to me earlier today that she wants the HL7 code system to be an explicit THO resource, browsable through the THO interface.   You could probably make that easier by pulling the xml resource of the HL7 code system with the CDA content out of the package and giving it to me and Marc Duteau to be added to UP-241.</p>",
        "id": 258269830,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634676674
    },
    {
        "content": "<p>the valueSet that should live in FHIR should pull in both IHE codeSystem, and the HL7 codeSystem.<br>\nBut, as Ted explains, this doesn't work for the reasons Ted explains. The HL7 codeSystem does not seem to be in THO, and the IHE codeSystem needs to somehow be made available beyond the IG that IHE has published.</p>",
        "id": 258271607,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634677400
    },
    {
        "content": "<p>IHE has a valueSet much like this in their FormatCode IG. This however is IHE managed ValueSet. The reason for a FHIR managed ValueSet is for the purposes of FHIR defined DocumentReference resource.</p>",
        "id": 258271804,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634677467
    },
    {
        "content": "<p>IHE publication -- <a href=\"https://profiles.ihe.net/fhir/ihe.formatcode.fhir/index.html\">https://profiles.ihe.net/fhir/ihe.formatcode.fhir/index.html</a></p>",
        "id": 258271854,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634677490
    },
    {
        "content": "<p>IHE codeSystem canonical URI -- <a href=\"http://ihe.net/fhir/ihe.formatcode.fhir/CodeSystem/formatcode\">http://ihe.net/fhir/ihe.formatcode.fhir/CodeSystem/formatcode</a></p>",
        "id": 258271906,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634677510
    },
    {
        "content": "<p>IHE 'similar' valueSet canonical URI --     <a href=\"http://ihe.net/fhir/ihe.formatcode.fhir/ValueSet/formatcode\">http://ihe.net/fhir/ihe.formatcode.fhir/ValueSet/formatcode</a></p>",
        "id": 258271976,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634677536
    },
    {
        "content": "<p>the IHE 'similar' valueSet does find the HL7 codes, as it has in it an \"compose.include\"</p>\n<div class=\"codehilite\"><pre><span></span><code>      {\n        &quot;system&quot; : &quot;http://terminology.hl7.org/CodeSystem/hl7-document-format-codes&quot;\n      },\n</code></pre></div>",
        "id": 258272265,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634677673
    },
    {
        "content": "<p>the IG publisher does find and pull those codes into the IHE valueSet expansion.</p>",
        "id": 258272354,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634677695
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span> I don't know what tooling you are using that does not find the hl7 codes.</p>",
        "id": 258272396,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634677717
    },
    {
        "content": "<p>but I also don't know the magjic that the IG publisher is using when the IHE formatcode IG does find them</p>",
        "id": 258272429,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634677736
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> magic</p>",
        "id": 258272445,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634677746
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> I went over the options with <span class=\"user-mention\" data-user-id=\"192205\">@Lisa Nelson</span> earlier today.    If I understood correctly, she prefers to have a \"convenience copy\" of the IHE code system in THO since the IG Publisher and various servers cannot easily directly reference the source of truth in IHE beyond the IG that it is defined in.   This was done for SNODENT for basically the same reasons, and for CMS Present On Admission codes system.   But it is an HTA decision and agreement with you for such a thing.</p>",
        "id": 258272552,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634677800
    },
    {
        "content": "<p>yes. I think I agree. The mechanism for 'convenience copy' is not known to me, but if it can be automatic following IHE versioning of the IG that would be best for me. If it can't be automatic, then I need to know how to kick, the system when IHE versions their IG. I don't think this versioning of the IHE IG will happen often, usually once a year.</p>",
        "id": 258272836,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634677903
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> you are 100% on the money here.    The things to make it happen are:</p>",
        "id": 258274447,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634678498
    },
    {
        "content": "<ol>\n<li>Agreement by HTA with concurrence from TSMG</li>\n</ol>",
        "id": 258274485,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634678516
    },
    {
        "content": "<ol start=\"2\">\n<li>Agreement worked out by HTA between HL7 and IHE for HL7 to publish this copy of IHE content (copyright, IP issues, etc)</li>\n</ol>",
        "id": 258274590,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634678545
    },
    {
        "content": "<p>I agree</p>",
        "id": 258274618,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634678558
    },
    {
        "content": "<ol start=\"3\">\n<li>Process to keep it current</li>\n</ol>",
        "id": 258274621,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634678559
    },
    {
        "content": "<p>still agree</p>",
        "id": 258274640,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634678566
    },
    {
        "content": "<p>Item 3 is mostly manual as we have no tooling or automagical gizmos to \"know\" when you update your version.  My suggestion is that when you update it, you send a message to HL7 (which person exactly is not yet clear) that a it has been updated, and ideally a copy of the new content that can just be 'slapped in' to make the update happen.</p>",
        "id": 258274845,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634678657
    },
    {
        "content": "<p>We have TWO options for such a 'convenience copy':</p>",
        "id": 258274889,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634678676
    },
    {
        "content": "<p>A.  We have an xml resource marked as external code system with complete content (see the CMS Present on Admission example), but with the description having the URL to your master source of truth for browsing and perhaps download;</p>",
        "id": 258275016,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634678744
    },
    {
        "content": "<p>B. We have a 'hidden' copy in the 'infrastructure' which is probably a load of your content into thee package set that is the <a href=\"http://tx.fhir.org\">tx.fhir.org</a> content.  The THO code system resource  exists also but is flagged as metadata only with no content, and points to your page at IHE.</p>",
        "id": 258275169,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634678824
    },
    {
        "content": "<p>Either one permits folks to see the content and to build IGs with value sets that include it with no errors</p>",
        "id": 258275222,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634678856
    },
    {
        "content": "<p>solution A has the issue of a duplicate copy and need for timely update</p>",
        "id": 258275251,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634678878
    },
    {
        "content": "<p>B has the issue that it works for THO and the IG Publisher, but not so well for other servers that want to have the content for validation purposes, or folks that use their own server for IG Publisher operations (you can override it in the IG control file and use a different one than <a href=\"http://tx.fhir.org\">tx.fhir.org</a>).</p>",
        "id": 258275429,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634678956
    },
    {
        "content": "<p>example of B is the metadata code system resources in THO for UCUM, LOINC, and SNOMED.</p>",
        "id": 258275547,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634679009
    },
    {
        "content": "<p>Since IHE (myself) used the IG publisher, and IHE is hooked into the ig-registry.... there is a way HL7 can know when a version happens.</p>",
        "id": 258276614,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634679544
    },
    {
        "content": "<ul>\n<li>but I fully recognize \"can know\" is not all that helpful without the \"mechanism is deployed that does do something\"</li>\n</ul>",
        "id": 258276869,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634679703
    },
    {
        "content": "<p>you are reading my mind, my good man...</p>",
        "id": 258277724,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634679994
    },
    {
        "content": "<p>I would let Lisa and Carol M know so that they can decide how they want to move forward.  My sense is the technical bits are the easiest part; figuring out the organizational stuff and getting some decisions will likely take the longest.</p>",
        "id": 258277872,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634680075
    },
    {
        "content": "<p>Yes, agree.</p>",
        "id": 258296401,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1634691105
    },
    {
        "content": "<p>trying to keep track of all this is super confusing.</p>",
        "id": 258307849,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634701332
    },
    {
        "content": "<p>here's the source of the definitions:</p>",
        "id": 258307854,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634701339
    },
    {
        "content": "<p><a href=\"https://github.com/FHIR/packages/blob/master/packages/fhir.tx.support.r4/package/CodeSystem-hl7-format-codes.json\">https://github.com/FHIR/packages/blob/master/packages/fhir.tx.support.r4/package/CodeSystem-hl7-format-codes.json</a></p>",
        "id": 258307856,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634701340
    },
    {
        "content": "<p>I added it back in Mar 2020 but I have no memory of why. Presumably it didn't have a home</p>",
        "id": 258307871,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634701370
    },
    {
        "content": "<p>I have an email record which is where I got it from that says it was to be added to UTG but obviously that never happened, so I added to our backup instead, I guess</p>",
        "id": 258307963,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634701453
    },
    {
        "content": "<p>so:</p>\n<ul>\n<li>hl7 defines some codes in a code system that should live in THO, but doesn't. is the list wrong? incomplete?</li>\n<li>ihe defines some codes in a code system that has problems? or no? I can't tell</li>\n<li>there's an actual problem here somewhere?</li>\n</ul>",
        "id": 258308014,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634701516
    },
    {
        "content": "<p>the conversation is pretty confusing....</p>",
        "id": 258308028,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634701533
    },
    {
        "content": "<p>Well, the conversation been going on in various bits at a time for over 2 years now - so it's easy to get lost in the details of where it is and where it was supposed to be getting to.</p>",
        "id": 258308203,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1634701693
    },
    {
        "content": "<p>right. so can we get some clarity? what's our functional problems, and where do we want to get to?</p>",
        "id": 258308226,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634701724
    },
    {
        "content": "<p>anyway, for future reference:  CodeSystem definitions can come from one of 4 places:</p>\n<ul>\n<li>innate to <a href=\"http://tx.fhir.org\">tx.fhir.org</a> - big external code systems, and code systems with grammars</li>\n<li>the base FHIR specification</li>\n<li><a href=\"http://fhir.tx.support\">fhir.tx.support</a></li>\n<li>THO</li>\n<li>any content defined in IGs, or in referenced IGs. </li>\n</ul>\n<p>There's nowhere else for it come from</p>",
        "id": 258308455,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634701971
    },
    {
        "content": "<p>Apparently we don't have an HL7 value set yet that is defined to contain both of the sets of HL7 and IHE defined format codes and can be successfully expanded in the FHIR build process.  I <strong>think</strong> that is the most important thing that is missing, and then there are also the questions of source of truth and visibility and accessibility (as well as maintainability going forward).  I'll let <span class=\"user-mention\" data-user-id=\"191404\">@John Moehrke</span> and <span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span> add which ones of those they think are needed and where they should be located.</p>",
        "id": 258309300,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1634702751
    },
    {
        "content": "<p>it would be unusual to have an HL7 value set that contains bot the HL7 and IHE defined codes. Particularly if it's referenced in THO / FHIR c ore. That would really imply the IHE definitions are contained in THO, since FHIR core depends on THO and THO depends on FHIR core - not adding another external package to that deadly embrace</p>",
        "id": 258309407,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634702836
    },
    {
        "content": "<p>does HL7 really need the IHE defined codes?</p>",
        "id": 258309423,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634702851
    },
    {
        "content": "<p>There is a ValueSet that has been authored, but it will not \"build\". I am not sure what tool Ted is trying to use to build it.</p>",
        "id": 258350241,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634728882
    },
    {
        "content": "<p>The FHIR DocumentReference needs a ValueSet, that will be example going forward, that pulls some codes from IHE and some codes from HL7. We just want that to succeed.</p>",
        "id": 258350363,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634728933
    },
    {
        "content": "<p>I have noted that the IHE IG that defines their CodeSystem does also have a ValueSet that pulls in all of the IHE codes, AND also the HL7 codes. It succeeds to build using the IG builder. (again, I am not sure what tool Ted is using that is failing)</p>",
        "id": 258350569,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634729051
    },
    {
        "content": "<p>there isn't a path to having IHE codes in the base spec unless they are defined in the base spec or THO</p>",
        "id": 258403526,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634749068
    },
    {
        "content": "<p>dicom might be different</p>",
        "id": 258403607,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634749084
    },
    {
        "content": "<p>I thought that there was interest in something called \"a convenience copy\"?   is that the same thing as is done for LOINC, SNOMED, DICOM... right?</p>",
        "id": 258440910,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634762597
    },
    {
        "content": "<p>that's what we have now, and I got the impression that it's a problem</p>",
        "id": 258450817,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634767043
    },
    {
        "content": "<p>if that is what we got, then I think I am happy. Not sure then what is left broken.</p>",
        "id": 258451456,
        "sender_full_name": "John Moehrke",
        "timestamp": 1634767352
    },
    {
        "content": "<p>ok many questions sorry was offline in airplanes all day yesterday just catching up now today...here is the deal:</p>",
        "id": 258588808,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634838516
    },
    {
        "content": "<p>FHIR R4 has a value set <a href=\"http://hl7.org/fhir/valueset-formatcodes.html\">http://hl7.org/fhir/valueset-formatcodes.html</a> that contains the IHE content.    It was NOT on the docket to be migrated to THO as it is 'external' content (IHE content).     A new UTG proposal for a value set to contain BOTH the IHE content and the CDA content for extended format codes was put in, and I verified with Lisa that indeed this is the desire.    In attempting to validate it when submitted, it failed to build with errors in the &lt;compose&gt; that included the IHE content (using the same &lt;url&gt; value as the value set in R4 above).    I messed with it A LOT, and verified that the &lt;compose&gt; with the CDA content DOES expand if the IHE content composes are commented out.    This compose is:</p>",
        "id": 258589455,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634838791
    },
    {
        "content": "<div class=\"codehilite\"><pre><span></span><code>&lt;include&gt;\n  &lt;system value=&quot;http://terminology.hl7.org/CodeSystem/hl7-document-format-codes&quot;/&gt;\n&lt;/include&gt;\n</code></pre></div>",
        "id": 258589508,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634838815
    },
    {
        "content": "<p>This code system may have been scheduled to be put into THO through UTG, but the ball must have been dropped somewhere some time ago and it is NOT in THO - however, Rob Hausam verified that it IS in <a href=\"http://tx.fhir.org\">tx.fhir.org</a>; unknown when or who loaded it (unimportant).</p>",
        "id": 258589701,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634838895
    },
    {
        "content": "<p>The IHE code system is <a href=\"http://ihe.net/fhir/ihe.formatcode.fhir/CodeSystem/formatcode\">http://ihe.net/fhir/ihe.formatcode.fhir/CodeSystem/formatcode</a> and it is the only content (my understanding; may be erroneous) in the IHE IG at <a href=\"https://profiles.ihe.net/fhir/ihe.formatcode.fhir/index.html\">https://profiles.ihe.net/fhir/ihe.formatcode.fhir/index.html</a></p>",
        "id": 258589900,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634838980
    },
    {
        "content": "<p>If this &lt;url&gt; is in the compose in a THO value set, it does NOT expand</p>",
        "id": 258589930,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634838996
    },
    {
        "content": "<p>So...in my understanding, and please correct me if I am out in the zones here <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  what needs to be done, working from the end result backwards is:</p>",
        "id": 258590033,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634839042
    },
    {
        "content": "<ol>\n<li>get the HL7 format codes into THO where they are browsable and maintained through the UTG process, and can be used in any value set anywhere being built referencing them, and are part of the THO download package once the release is done;</li>\n</ol>",
        "id": 258590220,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634839105
    },
    {
        "content": "<ol start=\"2\">\n<li>Get the IHE code system with the correct system uri in the compose to be processed by the Publisher so the combined value set will expand;</li>\n</ol>",
        "id": 258590360,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634839159
    },
    {
        "content": "<ol start=\"3\">\n<li>Get the combined value set through UTG and into the THO ci build and the Release.</li>\n</ol>",
        "id": 258590410,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634839179
    },
    {
        "content": "<p>For #2 above, it is my understanding (again, correct me if I am ignorant and confused here <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> ) that this can be done one of three possible ways, all of which have pros and cons, but some of which are much more tractable:</p>",
        "id": 258590662,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634839242
    },
    {
        "content": "<p>2a.   Have the THO build include a 'depends-on' for the IHE IG containing the format codes.      Pros:  easy, no extra work.  Cons: makes THO builds depending upon being able to access and include the IHE IG when a ci build or THO release is done.    Unknown (to me) is whether or not the THO build will fail if the depends-on cannot be done, or it is a non-fatal error (for instance if IHE is doing server maintenance or updating the IG or whatever)</p>",
        "id": 258591051,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634839360
    },
    {
        "content": "<p>2b. Include a 'convenience copy' of the IHE code system in THO.    PROS:   no dependencies for THO builds.     CONS:  no process defined or resources identified for updating the content if IHE updates it, thus it gets out of sync with IHE.  Also, need an agreement to do so between HL7 and IHE, put together through the HTA process and approved by HL7 (may be time consuming and contentious);</p>",
        "id": 258591434,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634839511
    },
    {
        "content": "<p>#2 is probably the go, but this conversation would be able to go somewhere if this was specific:</p>\n<blockquote>\n<p>it failed to build with errors in the &lt;compose&gt; that included the IHE content</p>\n</blockquote>\n<p>what was the error?</p>",
        "id": 258591525,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634839558
    },
    {
        "content": "<p>2c.   Have IHE make the code system available with some way for the Publisher to access it when needed for an expansion, some kind of API or endpoint or something.    PROS:  Publisher can directly access code systems that are stood up by other organizations to be able to be included in FHIR builds, the content is always up to date.  CONS:   huge development task for both the IG Publisher and the content owner.</p>",
        "id": 258591731,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634839627
    },
    {
        "content": "<p>Grahame, just say you were online good we can continue...</p>",
        "id": 258591909,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634839690
    },
    {
        "content": "<p>there is a 2d:</p>",
        "id": 258591923,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634839695
    },
    {
        "content": "<p>a 'convenience copy' which is included int he infrastructure like we do with LOINC, SNOMED, country codes, others, either in a cache content file or in the <a href=\"http://tx.fhir.org\">tx.fhir.org</a> package so it is \"in there\" but no one really knows about it.</p>",
        "id": 258592084,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634839778
    },
    {
        "content": "<p>for all #2 we need a code system resource for formatcodes which is a 'stub' ie code system metadata record, which MUST identify where the source of truth of the content it, as well as where the HL7 convenience copy is and how it is to be updated when necessary.</p>",
        "id": 258592244,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634839839
    },
    {
        "content": "<p>as to your question <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>  I cannot find the damn FHIR page  with all the parameters for the ig.ini file so I can test what it does and what the error is, which I desperately want to do (and can do easily I think).   I simply do not know the syntax for the parameter for the depeends-on so I can test it and tell you what the error is</p>",
        "id": 258592408,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634839919
    },
    {
        "content": "<p>you don't need any depends on. Just try and build with the compose as Lisa proposed, and tell us what the error is</p>",
        "id": 258592545,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634839964
    },
    {
        "content": "<p>if the publisher merely gives an error that the IG cannot be included and another error that the code system in the value set &lt;compose&gt; is not accessible, then #1 may be the easiest by far.</p>",
        "id": 258592565,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634839974
    },
    {
        "content": "<p>but if it causes the whole build to fail, then it is unacceptable IMHO.</p>",
        "id": 258592609,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634839994
    },
    {
        "content": "<p>I will do that now, give me the 25m or so for the build to run...</p>",
        "id": 258592665,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634840021
    },
    {
        "content": "<p>but when I tried it last week, the value set expansion cannot be build and contains zero concepts becuyse the codes system cannot be found.  Here is the compose:</p>",
        "id": 258592795,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634840079
    },
    {
        "content": "<p>&lt;compose&gt;<br>\n  &lt;!-- From the IHE value set --&gt;<br>\n    &lt;include&gt;<br>\n      &lt;system value=\"http://ihe.net/fhir/ihe.formatcode.fhir/CodeSystem/formatcode\"/&gt;<br>\n      &lt;filter&gt;<br>\n        &lt;property value=\"notSelectable\"/&gt;<br>\n        &lt;op value=\"=\"/&gt;<br>\n        &lt;value value=\"false\"/&gt;<br>\n      &lt;/filter&gt;<br>\n    &lt;/include&gt;</p>\n<div class=\"codehilite\"><pre><span></span><code>&lt;!-- From what is in Grahame&#39;s R4  for the code system \n&lt;include&gt; \n  &lt;system value=&quot;http://ihe.net/fhir/ValueSet/IHE.FormatCode.codesystem&quot;/&gt; \n&lt;/include&gt;\n</code></pre></div>\n\n<p>--&gt;</p>\n<div class=\"codehilite\"><pre><span></span><code>&lt;include&gt;\n  &lt;system value=&quot;http://terminology.hl7.org/CodeSystem/hl7-document-format-codes&quot;/&gt;\n&lt;/include&gt;\n&lt;!-- \n&lt;include&gt;\n  &lt;system value=&quot;http://dicom.nema.org/resources/ontology/DCM&quot;/&gt;\n  &lt;concept&gt;\n    &lt;code value=&quot;1.2.840.10008.5.1.4.1.1.88.59&quot;/&gt;\n    &lt;display value=&quot;Key Object Selection Document&quot;/&gt;\n  &lt;/concept&gt;\n&lt;/include&gt;\n--&gt;\n</code></pre></div>\n\n<p>&lt;/compose&gt;</p>",
        "id": 258592981,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634840163
    },
    {
        "content": "<p>The DICOM include I commented out as it also breaks the expand of the value set.</p>",
        "id": 258593084,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634840210
    },
    {
        "content": "<p>what is it supposed to do?</p>",
        "id": 258593112,
        "sender_full_name": "Ted Klein",
        "timestamp": 1634840224
    },
    {
        "content": "<p>include the code. I would expect both of those includes to work as is</p>",
        "id": 258594295,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634840714
    },
    {
        "content": "<p>so what's the error?</p>",
        "id": 258594310,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1634840718
    }
]