[
    {
        "content": "<p>Pursuant to the vocab/HTA decision that implementers using external code systems should use a special HL7 url rather than the candidate external URL, here's a candidate set of tooling changes :</p>\n<ul>\n<li>create special support for <a href=\"http://hl7.org/fhir/pending/CodeSystem/xxxxx\">http://hl7.org/fhir/pending/CodeSystem/xxxxx</a> - no need for code systems in this space, but allow them in the IG</li>\n<li>any code system URL not recognised as declared in the FHIR spec, or defined by HTA (as code system or preferred URL in a naming system), or directly known by the validator (for some special cases) is an error if used in an HL7 implementation guides (hl7.uv and <a href=\"http://hl7.us\">hl7.us</a>)</li>\n<li>any IG that uses <a href=\"http://hl7.org/fhir/pending\">http://hl7.org/fhir/pending</a> will automatically get a notice about using pending code system URLs in the index.html, and any value set, questionnaire, or example that uses a pending code system </li>\n<li>the HTA summary page will be updated to list:<ul>\n<li>illegal URLs</li>\n<li>pending systems</li>\n<li>approved systems</li>\n</ul>\n</li>\n<li>HTA should be able to define proposed external URLs where there's reasonable confidence about the URL but not enough information to otherwise </li>\n</ul>\n<p>That's what logically flows from the decision on friday but I suspect that HTA doesn't have the capacity to deal with the initial workload (and rage) introducing this would create. </p>\n<p><span class=\"user-mention\" data-user-id=\"195036\">@Carol Macumber</span> <span class=\"user-mention\" data-user-id=\"235766\">@Julie James</span> <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span> <span class=\"user-mention\" data-user-id=\"191503\">@Robert McClure</span> <span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span></p>\n<p>I really think it's urgent to figure out how HTA relates to other HL7 affiliates</p>",
        "id": 211545978,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1601324896
    },
    {
        "content": "<p>I agree here on all points - we do need to get this sorted asap, esp wrt the Affiliates.</p>",
        "id": 211553222,
        "sender_full_name": "Ted Klein",
        "timestamp": 1601328813
    },
    {
        "content": "<p>Not quite sure about what was intended for this wording in the first bullet?</p>\n<blockquote>\n<p>... no need for code systems in this space, but allow them in the IG</p>\n</blockquote>",
        "id": 211554486,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1601329554
    },
    {
        "content": "<p>people can refer to them without a definition, but they can also define them in the IG if they want/need to say more about them</p>",
        "id": 211555176,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1601329953
    },
    {
        "content": "<p>How is the 'xxxxx' part of the url expected to be determined?  I don't recall hearing that (although I might have missed it).</p>",
        "id": 211555629,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1601330227
    },
    {
        "content": "<p>they make that up, I think</p>",
        "id": 211556185,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1601330530
    },
    {
        "content": "<p>Agree on all counts. Including what goes in the xxx part is not controllable (but some may try...)</p>",
        "id": 211561975,
        "sender_full_name": "Robert McClure",
        "timestamp": 1601334448
    },
    {
        "content": "<p>Since I can't even get into the HL7 HQ website to book a conference call at the moment (yesterday or today) it's going to be hard to make progress. <br>\n I'd particularly like clarification on what Grahame means with regard to \"other affiliates\".  My personal experience to date is that affiliates have less troubles with terminology than the US; they are in good communication with code system owners and can get all the necessary information to make things work according to the process (Canada is possibly a poster child here).  However, several of you have expressed \"concern\" so I would find it very helpful if you could be explicit about those concerns so that we can address them.</p>",
        "id": 211595175,
        "sender_full_name": "Julie James",
        "timestamp": 1601369415
    },
    {
        "content": "<p>the real problem I am concerned about is when affiliates want to use code systems that are from out of their country, but which HTA has not yet considered. This is certainly happening  quite a bit. They are generally, but not always, in good communication with code system owners in their own jurisdiction. Better than HTA, anyway</p>",
        "id": 211606670,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1601377838
    },
    {
        "content": "<p>I am generally supportive of the overall approach. But I do have the following follow-up queries:</p>\n<ol>\n<li>\n<p>Is \"pending\" in the best choice for this part of the path component of the URI? To make it more clear that this is definitely not the URI for publication  and/or production use, could we perhaps go with alternative like  \"non-production-uri\",  or \"temporary-uri\" ?</p>\n</li>\n<li>\n<p>Is it necessary to have the \"fhir\" part of the path component in the URI or  could it be left out? If not,  is the suggestion that these temporary URIs are only for use in the production of FHIR IGs?</p>\n</li>\n<li>\n<p>What does (or should) the temporary URI resolve to when entered into a web browser?</p>\n</li>\n</ol>\n<p>In relation to affiliates, I would hope that HTA endorsed URIs (for code systems outside the affiliates country) are adopted by the affiliates in the same way as OIDs in the OID Registry. However, I am not sure whether we have any policy around this or whether any of this is covered by the affiliate agreement. That said, I think establishment of an HL7 single authoritative source of external code system information as part of <a href=\"http://terminology.hl7.org\">terminology.hl7.org</a> would go a long way towards alignment. It would be good to consult with the HL7 International Council to find out whether a policy around this is desired and, if so,  how this can be achieved.</p>",
        "id": 211880434,
        "sender_full_name": "Reuben Daniels",
        "timestamp": 1601540224
    },
    {
        "content": "<p>1, I don't feel strongly about this</p>\n<ol start=\"2\">\n<li>I don't have the authority to propose something outside <a href=\"http://hl7.org/fhir\">http://hl7.org/fhir</a> but we could </li>\n<li>that's one useful reason to make it /fhir, because then I can do something about that</li>\n</ol>",
        "id": 211887153,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1601544996
    }
]