[
    {
        "content": "<p>[Uploading image.png…]()</p>",
        "id": 166520772,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558779047
    },
    {
        "content": "<p>hmm</p>",
        "id": 166520773,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558779047
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span> with regard to the diff question, I do think that Git really is the way to go. But what if we just wrap the complexity people are afraid of behind a simple facade. With that in mind, I could add a screen for this to the toolkit:</p>",
        "id": 166520774,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558779047
    },
    {
        "content": "<p><a href=\"/user_uploads/10155/qLMozcp5YS9uWrZdlxf5aSXD/pasted_image.png\" target=\"_blank\" title=\"pasted_image.png\">pasted image</a></p>\n<div class=\"message_inline_image\"><a href=\"/user_uploads/10155/qLMozcp5YS9uWrZdlxf5aSXD/pasted_image.png\" target=\"_blank\" title=\"pasted image\"><img src=\"/user_uploads/10155/qLMozcp5YS9uWrZdlxf5aSXD/pasted_image.png\"></a></div>",
        "id": 166520790,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558779075
    },
    {
        "content": "<p>This supports the simple workflows that the unwashed masses need, while anyone who wants more can just use git</p>",
        "id": 166520793,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558779113
    },
    {
        "content": "<p>in this screen, each proposal represents a local clone of a git branch of UTG</p>",
        "id": 166520839,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558779144
    },
    {
        "content": "<p>I would need a git staging repository from which you could make PRs to the main UTG repository, but I think that's a good idea anyway - any HL7 person can be granted permissions to commit to the staging repo, but only a few vocab workers can commit to the master</p>",
        "id": 166520854,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558779212
    },
    {
        "content": "<p>My friend, this is EXACTLY what I was trying, and failing miserably, to explain on our call.   We can use Git with the appropriate scripting functions behind a simple UI to do the major functions as you indicate.   One item I would like to explore further: instead of the UI for this being in the Editor, I'd prefer it to be in the JIRA workflow.  As you pointed out on the call, there exists much material for Jira and Git to work together in such a way.   Doing it like this would mean workflow and operations would be JIRA buttons and functions, and the Editor itself could be kept quite clean, and just edit code systems and value sets and (hopefully sometime in the not-too-distant-futiure) naming system resources.  Because I am more of a \"splitter\" than a \"lumper\", I am thinking that the DIFF should be carved out of the Editor (maybe not removed, but the code reused) into a function that could then do a Diff on the proposal branch and the 'current' release branch, as I think you are envisioning within the editor.  Such a utility could be executed also from a Jira button.</p>",
        "id": 166528480,
        "sender_full_name": "Ted Klein",
        "timestamp": 1558792763
    },
    {
        "content": "<p>What do you think about all this?</p>",
        "id": 166528482,
        "sender_full_name": "Ted Klein",
        "timestamp": 1558792770
    },
    {
        "content": "<p>None of the workflow here can be done in Jira. I didn’t propose anything that Jira can do. It’s only what you have to do on your desktop. And there is no diff here, because git does it behind the scenes</p>",
        "id": 166544671,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558819961
    },
    {
        "content": "<p>of  course there is the question of the relationship between things you do in Jira and things you do locally, but I can't see how to synchronise that workflow directly</p>",
        "id": 166548145,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558826334
    },
    {
        "content": "<p>I can see that the \"proposal\" word is problematic in this regard; I was looking for a single word that was 'your local copy of the branch of the UTG worksapce that matches a jira proposal you're working on'. I didn't want to use 'branch' since that frightens people.... I'm open to a better word</p>",
        "id": 166548253,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558826507
    },
    {
        "content": "<p>Are you sure none of the workflow here can be done in Jira? Jira can do pretty much anything you can imagine.  (Totally open to arguments about what it <em>should</em> do...)</p>",
        "id": 166558623,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1558846030
    },
    {
        "content": "<p>Jira can create git clones on your local drive?</p>",
        "id": 166560309,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558849382
    },
    {
        "content": "<p>Jira can do anything that Java code can do on the server side and anything the browser allows javascript to do on the client side</p>",
        "id": 166588526,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1558898408
    },
    {
        "content": "<p>Well, i don’t think that includes any of the things on that list there, since all of those are outside the sand-box</p>",
        "id": 166593393,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558906784
    },
    {
        "content": "<p>And the clone must be local - not server temp space?</p>",
        "id": 166593709,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1558907320
    },
    {
        "content": "<p>the editor can work on a server temp space if we can figure out how to provide access to that. But I have no idea how we’d organise for expansions based on a server side temp space</p>",
        "id": 166595088,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558909540
    },
    {
        "content": "<p>Now how we’d allow for offline editing, which is also one of the stated requirements</p>",
        "id": 166595136,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1558909581
    },
    {
        "content": "<p>ok</p>",
        "id": 166595600,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1558910496
    },
    {
        "content": "<p>I think that it can.   Let me find oit.</p>",
        "id": 166727386,
        "sender_full_name": "Ted Klein",
        "timestamp": 1559057173
    },
    {
        "content": "<p>I'm not feeling any certainty here.... currently we have:<br>\n- an editor/server to support editing and expansion - runs locally<br>\n- a web server based workflow <br>\n- a request to add diff support to link the 2 </p>\n<p>I'm not going to rewrite git. but people are afraid of git (with reason). So <br>\n- I can write a simplifying facade for git (saves work, allows experts to do git their own way)  <br>\n- but this still leaves manual integration between jira workflow and local <br>\n- we can push all the workflow into jira, and just launch the editor against some online space (I can do that part in the editor). <br>\n- but I don't know how to do expansions, and there would really be no working offline</p>",
        "id": 166757635,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1559076400
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> , can you check on the link to the FHIR Toolkit download for Windows on <a href=\"http://www.healthintersections.com.au/FhirServer/\">http://www.healthintersections.com.au/FhirServer/</a>?  It seems to be redirecting to another page rather than kicking off the download. Mac package is OK.</p>",
        "id": 211255122,
        "sender_full_name": "Jessica Bota",
        "timestamp": 1601039383
    },
    {
        "content": "<p>I guess, the redirect comes from the invalid link. Wrong version in filename?</p>",
        "id": 211484530,
        "sender_full_name": "Frank Oemig",
        "timestamp": 1601295736
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> , the FHIR Toolkit (both R3 and R4)  currently has a checkbox for ValueSet editing for 'extensible'. Since this is not a FHIR element, it is causing errors in the build when people check it for UTG proposals. Can you remove it? <br>\nCC: <span class=\"user-mention\" data-user-id=\"191982\">@Ted Klein</span></p>",
        "id": 216668705,
        "sender_full_name": "Jessica Bota",
        "timestamp": 1605299483
    },
    {
        "content": "<p>ok. I'll do that, though it won't be immediate</p>",
        "id": 216669029,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1605299639
    },
    {
        "content": "<p>appreciate it!</p>",
        "id": 216669104,
        "sender_full_name": "Jessica Bota",
        "timestamp": 1605299657
    }
]