[
    {
        "content": "<p>The UTG project is updating the current build content at <a href=\"http://build.fhir.org/ig/HL7/UTG/\">build.fhir.org/ig/HL7/UTG/</a>  to include information and direct links to educational material. We will update the community here when it is complete. In the meantime, please make sure you are accessing UTG from the current build as Version 1.0.0 (<a href=\"http://terminology.hl7.org\">terminology.hl7.org</a>) was a prototype to debug the content, process and tooling. The content there is insufficient and should be consumed with that in mind.</p>",
        "id": 211152787,
        "sender_full_name": "Jessica Bota",
        "timestamp": 1600963384
    },
    {
        "content": "<p>Currently the UTG Jira project is focused on recording and shepherding HL7 terminology content changes through consensus review. Its use will be extended to include the workflow to record and resolve requests for changes to the supporting content on <a href=\"http://terminology.hl7.org\">terminology.hl7.org</a>.</p>",
        "id": 211152997,
        "sender_full_name": "Jessica Bota",
        "timestamp": 1600963480
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196635\">@Jessica Snell</span> I think this should be posted to the Terminology or implementer stream.  Most people don't follow this stream</p>",
        "id": 211159265,
        "sender_full_name": "Melva Peters",
        "timestamp": 1600966360
    },
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"191759\">@Melva Peters</span> . I cross-posted it in Terminology.</p>",
        "id": 211159790,
        "sender_full_name": "Jessica Bota",
        "timestamp": 1600966583
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196635\">@Jessica Snell</span> I think posting a topic in the implementers stream will also be very helpful - and probably that needs to be refreshed a few times, as topics tend to get buried very easily there.</p>",
        "id": 211178293,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1600975450
    },
    {
        "content": "<p>Thanks for the tip <span class=\"user-mention\" data-user-id=\"191405\">@Rob Hausam</span>. I will try and keep each location updated as changes are made. With that said, we now have the information noted above  in the Documentation tab (previously the Background tab). We have noticed the typo in 'Documentation' on the page and that is being fixed.</p>",
        "id": 211183848,
        "sender_full_name": "Jessica Bota",
        "timestamp": 1600978324
    },
    {
        "content": "<p>That sounds good.  I am also suggesting, though, that even if there aren't additional changes, it might be a good idea to \"refresh\" the topic in implementers periodically (maybe in a couple of weeks or a month?) so that it will be more visible and it will be able to reach a larger audience.</p>",
        "id": 211184342,
        "sender_full_name": "Rob Hausam",
        "timestamp": 1600978607
    },
    {
        "content": "<p>That makes sense Rob.</p>",
        "id": 211185973,
        "sender_full_name": "Jessica Bota",
        "timestamp": 1600979470
    }
]