[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191355\">@Kevin Shekleton</span> what are your current thoughts about the 'sub' key in the JWT token?  There's a comment in the sandbox 2.0 issues where you suggest that it might get dropped from the standard.</p>",
        "id": 153956935,
        "sender_full_name": "Kevin Olbrich",
        "timestamp": 1525786808
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193229\">@Kevin Olbrich</span> -  I logged a ballot comment regarding that -- I don't know what value it is providing today. I haven't sat down and really put a ton of thought into what the intention behind that value was trying to serve and any threats it was trying to mitigate. I plan to do that this week/next :)</p>",
        "id": 153956941,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1525788945
    },
    {
        "content": "<p>We're trying to figure out how to associate a particular cds-hooks invocation to an organization.  The 'sub' (client_id) field would be one way for us to be able to do that since some of our partners are multi-tenant, which prevents us from just using the 'iss'.</p>",
        "id": 153956943,
        "sender_full_name": "Kevin Olbrich",
        "timestamp": 1525789302
    },
    {
        "content": "<p>Ah, the same old SMART on FHIR issue too :-)</p>\n<p>The way in which the <code>sub</code> field is documented today wouldn't necessary do what you're wanting to do. Today, it is documented as \"Client_id of the EHR.\" The intention from our security auditor was that this is the OAuth 2 client id of the EHR from the Authorization Server (AS). I don't think it is a safe assumption that EHRs will have a client id with the AS.</p>",
        "id": 153956944,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1525789489
    },
    {
        "content": "<p>And by SMART on FHIR issue, I'm referring to this issue here: <a href=\"https://github.com/smart-on-fhir/smart-on-fhir.github.io/issues/133\" target=\"_blank\" title=\"https://github.com/smart-on-fhir/smart-on-fhir.github.io/issues/133\">https://github.com/smart-on-fhir/smart-on-fhir.github.io/issues/133</a></p>",
        "id": 153956945,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1525789563
    },
    {
        "content": "<p>Hmmm... looks like that didn't actually come to any sort of resolution.</p>",
        "id": 153956947,
        "sender_full_name": "Kevin Olbrich",
        "timestamp": 1525789784
    },
    {
        "content": "<p>maybe we could just add an optional 'org' attribute and populate it with a FHIR Organization ID that is known to the cds-service provider.</p>",
        "id": 153956950,
        "sender_full_name": "Kevin Olbrich",
        "timestamp": 1525789887
    },
    {
        "content": "<p>Yeah, we couldn't agree on the name or the semantics of the value. It is just a tough issue because each vendor/app/service has different expectations for what the value should be.</p>",
        "id": 153956952,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1525790057
    },
    {
        "content": "<p>Tagging along to your thoughts, perhaps our best chance to standardize is simply come up with an optional attribute with a name we all agree upon whose value is &lt;list of all of the ways in which apps/services need this similar type of value&gt;.</p>\n<p>So, the field name is consistent and the value relates to these different uses everyone has for it. Whether that is a billing code, a logical identifier for the separation of data, an org/facility identifier, etc.</p>",
        "id": 153956956,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1525790240
    },
    {
        "content": "<p>Yes, perhaps specify it as an optional opaque value that has whatever semantics that are meaningful to the consuming system.</p>",
        "id": 153956958,
        "sender_full_name": "Jim Cain",
        "timestamp": 1525790384
    },
    {
        "content": "<p>Yeah, I agree <span class=\"user-mention\" data-user-id=\"193245\">@Jim Cain</span></p>",
        "id": 153956960,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1525790829
    },
    {
        "content": "<p>But then that sounds a bit like the ability to include in the payload any claims that are meaningful to the consuming system, so does that really need to be part of the standard?</p>",
        "id": 153956962,
        "sender_full_name": "Jim Cain",
        "timestamp": 1525791019
    },
    {
        "content": "<p>Now you're asking the questions that caused us to ultimately stop trying to standardize this in the SMART space :-)</p>",
        "id": 153956964,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1525791090
    },
    {
        "content": "<p>I think there may be value in having a consistent field/means in which we all communicate this value. Additionally, this need comes up continually -- both in SMART and here in CDS Hooks. So, addressing it (even if it is just in the documentation rather than some field) would help others see our discussion/thoughts on this, how we're handling it (or not), etc.</p>",
        "id": 153956965,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1525791188
    },
    {
        "content": "<p>Back on the standards argument: It seems like you would want a standard way during discovery to describe the contents of that secondary identifier field, so that integration partners don't have to make any additional development effort to support your hooks.</p>",
        "id": 153956967,
        "sender_full_name": "Jim Cain",
        "timestamp": 1525792168
    },
    {
        "content": "<p>We could probably work around this limitation if the sandbox gave us the ability to 1) see the contents of the JWT token, and 2) add arbitrary key-value pairs to the token on a per hook basis.  Then individual service providers can specify which keys they need in an implementation guide.</p>",
        "id": 153956971,
        "sender_full_name": "Kevin Olbrich",
        "timestamp": 1525794084
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191614\">@Kevin Olbrich</span> I am in a similar situation where we are trying to identify the specific tenant that's generating the CDS-hook call. Have you guys figured this out. I would appreciate any help.</p>",
        "id": 244623363,
        "sender_full_name": "Bala Sultanov",
        "timestamp": 1625171822
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"400655\">@Bala Sultanov</span>  CDS Clients can send a tenant in the Authorization header JWT payload sent to a CDS Service.  <a href=\"https://cds-hooks.hl7.org/1.0/#trusting-cds-clients\">https://cds-hooks.hl7.org/1.0/#trusting-cds-clients</a></p>",
        "id": 246784164,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1626904176
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191358\">Dennis Patterson</span> <a href=\"#narrow/stream/179159-cds-hooks/topic/'sub'.20key.20in.20JWT.20token/near/246784164\">said</a>:</p>\n<blockquote>\n<p><span class=\"user-mention silent\" data-user-id=\"400655\">Bala Sultanov</span>  CDS Clients can send a tenant in the Authorization header JWT payload sent to a CDS Service.  <a href=\"https://cds-hooks.hl7.org/1.0/#trusting-cds-clients\">https://cds-hooks.hl7.org/1.0/#trusting-cds-clients</a></p>\n</blockquote>\n<p>Hi Dennis, thanks for your reply. Really appreciate it. Do you guys practice that at Cerner for multi-tenant hospitals? If a specific hospital triggers a cds-service call do you guys send a unique id for that tenant as part of JWT payload? It is not the case for Epic CDS-Service calls and we have been trying to figure out a workaround for that. Appreciate your time.</p>",
        "id": 246784931,
        "sender_full_name": "Bala Sultanov",
        "timestamp": 1626904621
    }
]