[
    {
        "content": "<p>Can anyone explain how authorization/ scopes work with $everything... Or point to some right link<br>\nHow can I retrieve patient bulk data [baseurl]/Patient/{Id}/$everything ?</p>",
        "id": 197172154,
        "sender_full_name": "Neeraj Ojha",
        "timestamp": 1589215085
    },
    {
        "content": "<p>I don't know if any CDS Hooks clients actually support $everything, and it's worth saying this would be a strange thing to do in the context of a CDS Hooks invocation (CDS Hooks calls are supposed to return <em>quickly</em>, so trying to do a full data export would be unlikely to work).</p>",
        "id": 197208707,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1589233632
    },
    {
        "content": "<p>Very much agree with Josh.  It is odd to use $everything in a cds hooks client... I think the expectation is that as a specific hook client you know exactly the data you need to know, so would not be going on a fishing expedition asking for everything.</p>",
        "id": 197211572,
        "sender_full_name": "John Moehrke",
        "timestamp": 1589235331
    },
    {
        "content": "<p>That said, I don't think that a CDS hook client is any special than any client. So the more general answer is, check with the access control rules of the data holder you have. That data holder might be implementing SMART-on-FHIR, which will define the rules of getting authorized as an app, user, and session. That data holder might be using some other technology. Although SMART-on-FHIR is the most tangible security model, it does not hold a privileged position. That is to say there is no mandatory security model in FHIR, many security models will exist across many use-cases.</p>",
        "id": 197211813,
        "sender_full_name": "John Moehrke",
        "timestamp": 1589235480
    },
    {
        "content": "<p>Thanks guys.. I get the perspective now. We are from blockchain/ mobile background, little new to nuances of HL7 FHIR ..  Getting there !!<br>\nQuestion I had was how are scopes implemented within the FHIR Servers. For is to get Patient/{id}/$everything?_since is it sufficient to have read permissions  on Patient resource only  OR do we need to have read permissions on all resource types that may hold patient data. I am assuming that this operation will be run on FHIR Server and is independent of the EHR Client.  Not getting clear picture where the FHIR standards provide guidelines on Policy Enforcement at FHIR Servers. OR they don't. Then what's the accepted practice. Please point us to the right resources.<br>\nAlso, let us know which sandbox works most up to date. Little confused on when does order-select trigger. The demo sandbox triggers with reasonCodableConcepts not with Medication info. Specs say \"If supported by the CDS Client, this hook may also be invoked each time the clinician selects a detail regarding the order. \" Shouldn't it trigger multiple times as Practitioner enters more fields - specially entering medication.<br>\n Cheers</p>",
        "id": 197229990,
        "sender_full_name": "Neeraj Ojha",
        "timestamp": 1589252785
    },
    {
        "content": "<p>The core FHIR specification does not set out rules of access control and policies. Many EHRs support the SMART App Launch guide which defines a set of OAuth scopes at the resource level, as well as things like <code>patient/*.read</code> which grants access to all resources relevant to a particular patient record.</p>",
        "id": 197230142,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1589253095
    },
    {
        "content": "<p><a href=\"https://docs.smarthealthit.org/\">https://docs.smarthealthit.org/</a> has an overview and links</p>",
        "id": 197230186,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1589253123
    },
    {
        "content": "<p>Thanks Josh, Helps.  Just to ensure we are understanding right .. as long as the SMART App has patient/*.read the Query [path]/Observation?subject=Patient/XX will go through. No additional scopes required. Yup, we did start at that link, we'll run through that again. Cheers</p>",
        "id": 197236108,
        "sender_full_name": "Neeraj Ojha",
        "timestamp": 1589262616
    },
    {
        "content": "<p>Yes, that is all you should need to do. And all that you can do. It is very possible that there are patient consent, business rules, legal hold, or safety rules that might hide some information. These factors don't tend to get exposed in scopes and tokens as the exposure of the restrictions is itself an exposure...</p>",
        "id": 197274273,
        "sender_full_name": "John Moehrke",
        "timestamp": 1589289814
    },
    {
        "content": "<p>It's also worth saying that today not every service supports the <code>*.</code> scopes; these details are something you would learn about at the time when you register your app with a given server.</p>",
        "id": 197277946,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1589291281
    }
]