[
    {
        "content": "<p>Having some some work on backend services this weekend, I wanted to note one difference between the requirements for resolving keys in the backend services spec vs CDS Hooks: </p>\n<ul>\n<li>In CDS Hooks, the CDS Service (i.e. the thing issuing JWTs) is necessarily online and visible to the EHR at an <code>https</code> URL</li>\n<li>In Backend Services, the service (i.e. the thing issuing JWTs) may not be visible to the EHR -- it issues requests to the EHR, but it could be running on a server behind a VPN or a NAT somewhere and doesn't necessarily support inbound connections</li>\n</ul>\n<p>... so while in CDS Hooks it makes perfect sense to define a _required_ way to find a jwks from an issuer URI, I'm not sure this makes sense in the general case for backend services. (We might certainly recommend a way to do it, for the cases where the service _is_ reachable by the EHR, but I'm not sure we'd want to require it.) <span class=\"user-mention\" data-user-id=\"191355\">@Kevin Shekleton</span> <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span></p>",
        "id": 153931679,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1517119558
    },
    {
        "content": "<p>So are you thinking you'd rather have a jwks_url field in the JWT payload that points to a URL where the jwks.json file can be read?</p>",
        "id": 153931680,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1517119623
    },
    {
        "content": "<p>If so, I'm fine doing that rather than a <code>.well-known/jwks.json</code> path</p>",
        "id": 153931681,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1517119648
    },
    {
        "content": "<p>Not necessarily -- I'm just saying that in Backend Services the service may not have a JWKS to expose via URL to the EHR.</p>",
        "id": 153931684,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1517121917
    },
    {
        "content": "<p>When it _does_, then using a fixed URL pattern still seems fine to me.</p>",
        "id": 153931686,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1517121927
    },
    {
        "content": "<p>I'm trying to understand what 'the service' is, and what 'the EHR' is.</p>",
        "id": 153931687,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517122023
    },
    {
        "content": "<p>which is client and server in which exchange?</p>",
        "id": 153931688,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517122066
    },
    {
        "content": "<p>yeah, I said all of that very badly and partially backwards.</p>",
        "id": 153931689,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1517122068
    },
    {
        "content": "<p>Let me try again.</p>",
        "id": 153931690,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1517122071
    },
    {
        "content": "<p>CDS Hooks Use case: EHR Signs a JWT and presents it to the CDS Service. Issuer = EHR. Fair to assume EHR is online and can host a jwks.json? Yes (but not <em>necessarily</em> the case)</p>",
        "id": 153931691,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1517122146
    },
    {
        "content": "<p>agree. we have cases where the CDS Service will not be able to contact the EHR</p>",
        "id": 153931692,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517122198
    },
    {
        "content": "<p>Backend Services use case: Backend Service signs a JWT and presents it to an EHR. Issuer = the backend service. Fair to assume the backend service is online and can host a jwks.json? Not really; some services won't host routable endpoints.</p>",
        "id": 153931693,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1517122268
    },
    {
        "content": "<p>All I'm saying is that the token issuer won't necessarily be able to host a jwks.json file. So the rule \"to find a jwks, just append <code>/.well-known/jwks.json</code> to the issuer URI won't always apply.</p>",
        "id": 153931694,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1517122287
    },
    {
        "content": "<p>tricky because 'backend service' is actually the client here. But we don't require that the issuer be the back end service, do we?</p>",
        "id": 153931695,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517122389
    }
]