[
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span>  During a conversation this morning, <span class=\"user-mention\" data-user-id=\"191358\">@Dennis Patterson</span> asked some really good questions about <a href=\"https://github.com/cds-hooks/docs/pull/505\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/pull/505\">PR 505</a>.</p>\n<p>Can you weight in and help us understand:</p>\n<ul>\n<li>Why hasn't Clinical Reasoning already solved this? (or has it?)</li>\n<li>Can you elaborate on the intent of <code>PlanDefinition.topic</code>?</li>\n<li>And contrast it with <code>'PlanDefinition.purpose</code> and <code>PlanDefinition.Goal.Category</code> ?</li>\n</ul>",
        "id": 183174823,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1576082180
    },
    {
        "content": "<p><code>PlanDefinition.topic</code> provides the kind of categorization that would be useful for indexing the PlanDefinition in a repository. Purpose provides narrative guidance about why the PlanDefinition was created and what it's for. <code>goal.category</code> provides a categorization for that specific Goal. There is no GoalDefinition resource, so the <code>goal</code> elements provide a way to define goals within a PlanDefinition.</p>",
        "id": 183655540,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1576594652
    },
    {
        "content": "<p>As far as whether Clinical Reasoning has solved this, there are 3 main use cases related to identification/categorization that the metadata resources all support. The first is unique identification, which uses the canonical <code>url</code> and <code>version</code> elements in the same way as the conformance resources. The second is topical organization (using the <code>topic</code> element) to provide high-level categorization, mostly used for indexing the artifact in a repository. The third is <code>useContext</code>, which provides structured representation of the contexts in which it is appropriate to use the artifact (e.g. in-patient setting, males, aged 45-65, diagnosis of colon cancer, etc.).</p>",
        "id": 183656227,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1576595038
    },
    {
        "content": "<p>I think it makes good sense for cards to have a way to indicate what guidance was followed when producing the cards, and I think that's an instance of the first use case (canonical url and version). That's why I suggested a uri for that type of element. It may correspond to a FHIR PlanDefinition, but it could just as easily reference a guideline or a web page providing further documentation about the guidance that was followed.</p>",
        "id": 183656588,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1576595262
    },
    {
        "content": "<p>I also think it makes good sense for cards to have topics describing what the guidance is about, the second use case above.</p>",
        "id": 183656784,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1576595373
    },
    {
        "content": "<p>But I also think we should be careful about mixing those use cases. We should be clear about supporting them both.</p>",
        "id": 183656879,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1576595410
    }
]