[
    {
        "content": "<p>Hey CDS Hooks folks! </p>\n<p>Following a conversation last week in the CDS wg, I wrote up a <a href=\"https://github.com/cds-hooks/docs/pull/599\">PR</a> to propose a new <code>order-discontinue</code> hook. The idea here is that order-sign doesn't make sense, and order-select's specific context data structures don't align well with a discontinue workflow.</p>",
        "id": 266275246,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1640711228
    },
    {
        "content": "<p>Some outstanding questions -- an <code>order-discontinue</code> hooks makes a ton of sense for med prescriptions, also for standing orders (e.g. weekly labs, recurring infusions, etc). But should this apply to a one-time event, like a procedure? What's the difference between cancel and discontinue?</p>",
        "id": 266275248,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1640711232
    },
    {
        "content": "<p>Additionally, how do systems treat parent and child orders? I think that the primary value is in firing this hook for parent orders.</p>",
        "id": 266275249,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1640711233
    },
    {
        "content": "<p>Community review requested!</p>",
        "id": 266275259,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1640711243
    },
    {
        "content": "<p>From table 0119 - Order Status codes ( <a href=\"https://www.hl7.org/fhir/v2/0119/index.html\">https://www.hl7.org/fhir/v2/0119/index.html</a> )</p>\n<p>\"The differentiation between discontinue and cancel is that discontinue effects the order/service and all future occurrences, cancel refers to just the present action.\"</p>",
        "id": 266280455,
        "sender_full_name": "John Silva",
        "timestamp": 1640715910
    },
    {
        "content": "<p>Would this hook fire when an order expires naturally?  I.e. status changes to 'complete' or only when it terminates abnormally?</p>",
        "id": 266652103,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1641186350
    },
    {
        "content": "<p>Hey Lloyd, only for an unexpected, manual termination. That would make the most sense, right?</p>",
        "id": 266723900,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1641236469
    },
    {
        "content": "<p>Updated proposed hook definition to clarify Lloyd's question.</p>",
        "id": 266848145,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1641322351
    },
    {
        "content": "<p>Re: discontinue &amp; cancel. Could the request resource sent in toBeDiscontinued enable the service to differentiate between these two scenarios? (e.g. send child request for cancels, parent for discontinues?) Do y'all know how do systems handle this today?</p>",
        "id": 266848200,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1641322387
    }
]