[
    {
        "content": "<p>Hello!  I'm trying to figure where in a cds card return I can display the type of interaction - drug-drug, drug-food, drug-alcohol, etc.  I was thinking summary, but its limited to 140 char and already being taken up by the drug names.  Maybe detail, in the github markdown table?  Or anyone else have an idea?</p>",
        "id": 255232220,
        "sender_full_name": "Greg Zolton II",
        "timestamp": 1632841585
    },
    {
        "content": "<p>Why would you provide a card warning about drug-food or drug-alcohol?  CDS Hooks isn't where you provide warnings to the patient, it's about where you try to drive a change to prescribing behavior.  I.e. Every card should be something that could potentially cause the clinician to change their mind about prescribing.  I suppose, a drug-alcohol warning might be appropriate if there are indications of current/recent alcohol consumption issues.  However, even then, the text of the message  should be enough \"Drug X contraindicated due to alcohol consumption\" or \"Drug X reduces efficacy Drug Y\".   Stating drug-alcohol or drug-drug would be redundant and unnecessary.</p>",
        "id": 255240030,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632844337
    },
    {
        "content": "<p>The goal is to provide information at a glance to the provider, without having to make them read lengthy sentences for why.  I need to figure where I can provide this kind of information on the card</p>",
        "id": 255241650,
        "sender_full_name": "Greg Zolton II",
        "timestamp": 1632844923
    },
    {
        "content": "<p>This topic was moved here from <a class=\"stream-topic\" data-stream-id=\"179166\" href=\"/#narrow/stream/179166-implementers/topic/How.20to.20display.20type.20of.20interaction.20in.20card\">#implementers &gt; How to display type of interaction in card</a> by <span class=\"user-mention silent\" data-user-id=\"191315\">Josh Mandel</span></p>",
        "id": 255244017,
        "sender_full_name": "Notification Bot",
        "timestamp": 1632845725
    },
    {
        "content": "<p>In the current draft, there's a \"topic\" for each card, so I guess that would be a candidate</p>",
        "id": 255245812,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632846414
    },
    {
        "content": "<p>ah, that's pretty much exactly what I need, thanks!</p>",
        "id": 255246807,
        "sender_full_name": "Greg Zolton II",
        "timestamp": 1632846757
    },
    {
        "content": "<p>any idea when or if this draft will be added in?  I'm not familiar with how the cds process works for updating the spec</p>",
        "id": 255247154,
        "sender_full_name": "Greg Zolton II",
        "timestamp": 1632846875
    },
    {
        "content": "<p>I don't think the group has indicated a plan to go to ballot again yet.  I think they're still waiting on feedback from release 1 and testing new ideas at connectathon.  If they decided to got to ballot right away, earliest publication would probably be mid 2022, and I don't know there's a plan to go that soon.  So for now, you may need to look at using an extension.</p>",
        "id": 255248868,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632847506
    },
    {
        "content": "<p>Many thanks for all the help :)</p>",
        "id": 255249084,
        "sender_full_name": "Greg Zolton II",
        "timestamp": 1632847587
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"439906\">Greg Zolton II</span> has marked this topic as resolved.</p>",
        "id": 255249100,
        "sender_full_name": "Notification Bot",
        "timestamp": 1632847592
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> this is inaccurate. </p>\n<blockquote>\n<p>CDS Hooks isn't where you provide warnings to the patient, it's about where you try to drive a change to prescribing behavior.</p>\n</blockquote>\n<p>Prescribing is only one aspect of CDS Hooks. There are many other hooks capturing various other workflows which are not related to prescribing. And while there are no patient facing hooks today, the idea has been discussed in the CDS Hooks group before.</p>",
        "id": 255607098,
        "sender_full_name": "Matt Varghese",
        "timestamp": 1633020472
    },
    {
        "content": "<p>Understand it's not limited to prescribing (the types described by the individual raising the question were all drug-specific, so I responded in that manner).  Even if there were patient-specific hooks, would we expect generic product warnings to come back?  Certainly for the existing order-select and order-sign hooks, a card coming back saying \"don't take this with grapefruit\" seems outside the scope of \"decision support\" - i.e. it doesn't help the end user make or change their decision - though a recommendation that says \"Inform the patient of this risk\" might be appropriate I suppose.</p>",
        "id": 255612333,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1633022340
    }
]