[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191355\">@Kevin Shekleton</span> , could you provide approval and perhaps guidance on posting the description below to the CDS Hooks Connectathon wiki? <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> suggested this would be an appropriate first step to generating interest and find EHR partners for the September Connectathon. Thank you. </p>\n<p>\"===Implement Potential Drug-Drug Interaction check using 1.0 spec===<br>\n:'''Action''': With the medication-prescribe hook, the EHR sends a request that may include prefetch data to the CDS Service. The CDS Service may request additional data from the FHIR server then returns an array of Card(s) with associated suggestions. <br>\n:'''Precondition''': A prefetch or FHIR server query for contextual data element (below) resources (e.g., MedicationDispense, MedicationAdministration, MedicationRequest, MedicationStatement, Patient, Observation, Condition). Preference for obtaining medication resources with prefetch query. <br>\n:'''Success Criteria''': The EHR displays the appropriate Card response for the specified indicator element.<br>\n:'''Bonus point''': The EHR supports Card actions (i.e., create, update, delete) relevant to drug-drug interactions that may include canceling the current drug order, substituting the current drug order, discontinuing a historical drug, and adding an additional non-drug order (e.g., lab). The EHR supports parsing the DetectedIssue resource as an extension to the CDS Hooks Card Attributes. The EHR supports medication-select – defined as the step when the provider selects the drug product (i.e., ingredient and strength) during order entry. <br>\n''Specific data elements for Connectathon use case include: Current medications, Historical medications, Age, Serum digoxin, Serum creatinine, Potassium, Magnesium, Calcium, and History of Upper Gastrointestinal Bleed.''\"</p>",
        "id": 153977988,
        "sender_full_name": "Thomas Reese",
        "timestamp": 1532541938
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196481\">@Thomas Reese</span> - Sorry for the belated reply. Thanks for proposing this scenario. I've tweaked it slight and put it up on the <a href=\"http://wiki.hl7.org/index.php?title=201809_CDS_Hooks#Scenarios\" target=\"_blank\" title=\"http://wiki.hl7.org/index.php?title=201809_CDS_Hooks#Scenarios\">Wiki here</a>. Let me know if it looks OK to you.</p>\n<p>Besides yourself, do you know who use you have interested in implementing this?</p>",
        "id": 153980199,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1533127419
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191355\">@Kevin Shekleton</span>  for putting it up on the wiki. We are looking for EHR vendors that are interested in participating at the Connectathon. We may have some interest from a drug knowledge vendor and a UPMC (Pitt) representative. If you know of others, please send them our way.</p>",
        "id": 153981794,
        "sender_full_name": "Thomas Reese",
        "timestamp": 1533302226
    }
]