[
    {
        "content": "<p>Hi everyone, </p>\n<p>I have an enhancement for the feedback endpoint. Currently, if a Suggestion is accepted then we only report the id of the suggestion to the feedback endpoint. We should also include an <code>acceptedDetail</code> of sorts to include optional information on what specific follow-up was taken for that suggestion.</p>\n<p>For instance, there may be a workflow where a CDS Service returns a generic/broad category of follow-up (for instance, an HCC Condition Category rather than a specific ICD-10 or SNOMED code). In those scenarios, the CDS Client can choose to have the user pick a specific follow-up as a result of the generic suggestion from the CDS Service. It would be nice if the feedback endpoint could optionally include a set of <strong>Coding</strong> attributes in a given <code>AcceptedSuggestion</code> attributes, with coding systems to be defined by the CDS Client. This way, the CDS Service could learn meaningful information on how it's generic suggestions are translating to discrete ones.</p>\n<p>Any thoughts? I think the <code>AcceptedSuggestion</code> item is the best place for this, and that multiple <code>acceptedDetail</code> coding entries should be allowed to account for more complicated workflows.</p>",
        "id": 223554631,
        "sender_full_name": "adam strickland",
        "timestamp": 1611255486
    },
    {
        "content": "<p>Hey Adam, in this scenario, it sounds like we're placing a lot of the effort/complexity on the client: \"CDS Service returns a generic/broad category of follow-up\". I'd like to question why this is appropriate or even reasonable. At a high level, a CDS Hooks Service is enabled to interrupt / enhance a clinician's workflow in exchange for providing valuable decision support. I'm uncertain that the clinician is served by \"pick[ing] a specific follow-up as a result of the generic suggestion from the CDS Service\". </p>\n<p>Am I getting this wrong? Could anyone provide more details about the use-case?</p>",
        "id": 224143838,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1611727680
    }
]