[
    {
        "content": "<p>As part of CDS hooks, a CDS service can provide a card that recommends launching a particular SMART app.  When the user launches the SMART app from within the EHR, it will have an OAuth token that allows access to the EHR data (with permissions as granted by the user/system).  However, there may also be a need for the SMART app to have controlled access to the CDS service based on the context of that particular card and the CDS that drove the creation of it.  One possibility would be to just generate a custom SMART app link, but that might cause issues with EHRs that choose to trust certain SMART apps and not others.  What's the best way for a hook to communicate authorization information that should be conveyed to the SMART app when launched - and that will in turn allow that SMART app to have privileged access to an external server (i.e. not the EHR that launched it)?</p>",
        "id": 159733883,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551463351
    },
    {
        "content": "<p>Hey Lloyd, have you considered using the appContext field on the link object in the card? It's intended to be a general mechanism for app+service integration and a black box to the cds client.</p>",
        "id": 159766484,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1551488385
    },
    {
        "content": "<p>That'll teach me for raising a question during a call that I couldn't remember if there was an answer for without looking at the spec.  Yes, that should work.  Thanks for the quick response.</p>",
        "id": 159774762,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551496350
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"196359\">@Robert Dieterle</span></p>",
        "id": 159776612,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551499581
    },
    {
        "content": "<p>Thank you for following-up will communicate this to Andy and Larry at Mitre<br>\n<span class=\"user-mention\" data-user-id=\"198783\">@Larry Decelles</span> <br>\n<span class=\"user-mention\" data-user-id=\"191434\">@Andy Gregorowicz</span></p>",
        "id": 159805198,
        "sender_full_name": "Robert Dieterle",
        "timestamp": 1551545028
    }
]