[
    {
        "content": "<p>Also, I'd like to update the hooks that currently expose userid as a parameter to indicate that PractitionerRole is a permitted option for userid.  (In practice I expect PractitionerRole to be more common that Practitioner for STU3 and R4 where it's available because userids will typically be associated with a specific role, not just with a practitioner in general independent of hat and organization.)</p>",
        "id": 160127984,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551901540
    },
    {
        "content": "<p>Is that an appropriate thing to just submit a pull request for as well?</p>",
        "id": 160128078,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551901589
    },
    {
        "content": "<p>Yes, I think so. Should we also get <a href=\"http://www.hl7.org/fhir/smart-app-launch/scopes-and-launch-context/index.html#scopes-for-requesting-identity-data\" target=\"_blank\" title=\"http://www.hl7.org/fhir/smart-app-launch/scopes-and-launch-context/index.html#scopes-for-requesting-identity-data\">SMART's fhirUser</a> updated?</p>",
        "id": 160128803,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1551902151
    },
    {
        "content": "<p>I don't know what the process would be for doing that...</p>",
        "id": 160129877,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551902901
    },
    {
        "content": "<p>Umm. Not sure I agree. Roles are like user groups, not user ids. Unless it's for defaulting data in, and not used in the result of authentication.<br>\nIs the smart app expected to also ask which org/location they are in context of for the session when they can have multiple? (eg which role they are performing)</p>",
        "id": 160132344,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1551904739
    },
    {
        "content": "<p>I understand the challenge of using PractitionerRole, Practitioner, Patient and RelatedPerson as \"userids\".  My point is that PractitionerRole is more likely to be tied to a userid than Practitioner.   PractitionerRole is specific to a particular Practitioner, but adds in the context of what organization they're working for and what hat they're wearing.</p>",
        "id": 160132844,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551905112
    },
    {
        "content": "<p>userid would be a business identifier that very likely will appear in the .identifier of those FHIR Resources.   I don't think looking at this the other way around is proper. These are the kinds of reasons I have struggled to keep these independent.   This said, I am not against including the PractitionerRole as informative reference in the request/token; I just urge that the formal identifier is userid, and formal roles are specified.</p>",
        "id": 160138380,
        "sender_full_name": "John Moehrke",
        "timestamp": 1551909350
    },
    {
        "content": "<p>Right now, the 'userid' property is expressed as a string of the form \"[resource type]/[id]\".  I.e. the same syntax we used for a local resource reference.  The 'expected' resource types are enumerated and vary by type or request.  We can debate whether that's a good/not good thing to do.  However that's a different question from whether if we retain the approach whether PractitionerRole should be an option in addition to Practitioner</p>",
        "id": 160147485,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551911749
    },
    {
        "content": "<p>Or include both as options... Just like encounter adds more context than patient.</p>",
        "id": 160148593,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1551912615
    },
    {
        "content": "<p>That I would feel better about.</p>",
        "id": 160148605,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1551912626
    },
    {
        "content": "<p>If you've got a PractitionerRole id, the Practitioner id would be known from the PractitionerRole.</p>",
        "id": 160149252,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551913202
    },
    {
        "content": "<p>It wouldn't be appropriate to use PractitionerRole as a user id if it wasn't bound to a specific Practitioner.</p>",
        "id": 160149324,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551913229
    },
    {
        "content": "<blockquote>\n<p>Or include both as options... Just like encounter adds more context than patient.</p>\n</blockquote>\n<p>yes, that is my recommendation</p>",
        "id": 160196494,
        "sender_full_name": "John Moehrke",
        "timestamp": 1551965204
    },
    {
        "content": "<blockquote>\n<p>It wouldn't be appropriate to use PractitionerRole as a user id if it wasn't bound to a specific Practitioner.</p>\n</blockquote>\n<p>yes, and there are many user/roles that would never be put into a PractitionerRole</p>",
        "id": 160196522,
        "sender_full_name": "John Moehrke",
        "timestamp": 1551965232
    }
]