[
    {
        "content": "<p>Has there been any consideration for doing decision support without exchange of PHI? I believe some decision systems and some provider organizations would be more comfortable in this case. Can CDS Hooks support this?</p>",
        "id": 153964862,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1527270823
    },
    {
        "content": "<p>I know <span class=\"user-mention\" data-user-id=\"192085\">@Brian Alper</span> is interested in this as well.  There isn't anything in the standard that prevents it.  Some hooks might send over a Patient's FHIR id, which could be an issue in some cases.  You would want to avoid prefetches unless you use the _elements param to subset the data.  You could also propose a new hook that only sent over certain specific bits of data (like just age perhaps).  I have also been thinking about using something like <span class=\"user-mention\" data-user-id=\"191351\">@Chris Grenz</span> 's profile filtering work to actually help communicate the data requirements and possibly even restrict the data sent.</p>",
        "id": 153964978,
        "sender_full_name": "Kevin Olbrich",
        "timestamp": 1527281097
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193229\">@Kevin Olbrich</span> is correct -- the <code>context</code> field in each CDS Service request is what <em>may</em> contain PHI. Each hook defines its own context so you could design a hook (or set of hooks) that do not send any PHI.</p>\n<p>Alternatively, you could use the existing hooks and ensure that data like the <a href=\"http://Patient.id\" target=\"_blank\" title=\"http://Patient.id\">Patient.id</a> is mapped to some other value (eg, using a security tokenization solution).</p>",
        "id": 153965062,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1527415364
    },
    {
        "content": "<p>just removing the link to a Patient will reduce the risk that the data are identifiable, but doesn't bring it down much as there are many quasi-identifiers laying around in health data. I am not saying this isn't a useful step, I think it is a very useful step. I am just trying to keep us fully aware of proper anonymization. Note, that even the algorithm used to replace the Patient can be revealing...</p>",
        "id": 153965224,
        "sender_full_name": "John Moehrke",
        "timestamp": 1527602153
    },
    {
        "content": "<p>OK. So it should be possible, it's just a matter of defining the hook and setting expectations correctly. Thanks.</p>",
        "id": 153965386,
        "sender_full_name": "Elliot Silver",
        "timestamp": 1527630382
    },
    {
        "content": "<p>should not a new hook template be defined for anonymized CDS, because the patient-view has the patientid required in the context?</p>",
        "id": 153965450,
        "sender_full_name": "Roeland Luykx",
        "timestamp": 1527661425
    },
    {
        "content": "<p>The anonymous would likely need a Patient resource, to carry some useful values like age (offset by a random value), gender, other?</p>",
        "id": 153965513,
        "sender_full_name": "John Moehrke",
        "timestamp": 1527685274
    },
    {
        "content": "<p>If done right, the cds-hook should not need to be implemented differently. The difference would be on the requesting side to anonymize or not, and when anonymizing what method/algorithm.</p>",
        "id": 153965514,
        "sender_full_name": "John Moehrke",
        "timestamp": 1527685331
    },
    {
        "content": "<p>I guess one would need a profiled Patient to indicate the critical few elements, and the tolerance each element holds .</p>",
        "id": 153965515,
        "sender_full_name": "John Moehrke",
        "timestamp": 1527685393
    },
    {
        "content": "<p>The <code>patient-view</code> hook does have <code>patientId</code> as a required hook context field, but that doesn't mean that patientId can't be tokenized to some UUID. Also, the FHIR server doesn't have to be accessible so that tokenized <code>patientId</code> doesn't have to provide access to the actual Patient resource.</p>\n<p>But, it is interesting to think about what a value a CDS Service would be able to provide without any identifying information about a patient. As John mentioned, the fields defined as PII/PHI are too narrow. Studies have shown you can identify patients with data outside of PII/PHI. <span class=\"emoji emoji-1f937\" title=\"shrug\">:shrug:</span></p>",
        "id": 153965806,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1527714239
    },
    {
        "content": "<p>In some cases, you might be able to provide some value with just gender and age, but if you couple that with other information like the location of the customer and the time of the request, it wouldn't be too hard to identify the patient.</p>",
        "id": 153965811,
        "sender_full_name": "Kevin Olbrich",
        "timestamp": 1527715493
    },
    {
        "content": "<p>So, what elements in Patient are critical to the cds-hook doing the job? I would be glad to help define an anonymized Patient for this purpose. It would not be 100% privacy protecting, but nothing ever is. As long as we are clear that it is intended to lower the risk of exposure, and we indicate the potential residual risk, then we are being consistent with standards on de-identification. (gender, birthDate, communication, generalPratitioner?). Even better if we can define a tolerance on birthDate (+-30 days).</p>",
        "id": 153966566,
        "sender_full_name": "John Moehrke",
        "timestamp": 1527956504
    },
    {
        "content": "<p>Thus forbid (name, telecom, address, martialStatus, photo, contact).   Unclear to me if cds-hooks wants (link, managingOrganization,  multipleBirth, deceased[x])..... Lastly forbid ALL extensions.</p>",
        "id": 153966567,
        "sender_full_name": "John Moehrke",
        "timestamp": 1527956822
    },
    {
        "content": "<p>The identifier (and id) would need to be specified as a pseydonym (e,g, UUID assigned per transaction)</p>",
        "id": 153966568,
        "sender_full_name": "John Moehrke",
        "timestamp": 1527956948
    },
    {
        "content": "<p>deceasedBoolean would be relevant most of the time as most decision support only applies if it is false.  Can't think of use-cases where much of the rest would matter.</p>",
        "id": 153966577,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1527966378
    },
    {
        "content": "<p>I think link would be relevant all the time</p>",
        "id": 153966578,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1527969557
    },
    {
        "content": "<p>In what way would link be relevant in cds-hooks, when the Patient is anonymized? In the case where it is not anonymized, then I understand the use.</p>",
        "id": 153966579,
        "sender_full_name": "John Moehrke",
        "timestamp": 1527969698
    },
    {
        "content": "<p>It would be relevant for retrieving associated other records - conditions, observations, etc.</p>",
        "id": 153966582,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1527970841
    },
    {
        "content": "<p>ok I agree with that</p>",
        "id": 153966583,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1527970874
    },
    {
        "content": "<p>That would mean your resource server would need to have a complete shadow copy of all data</p>",
        "id": 153966584,
        "sender_full_name": "John Moehrke",
        "timestamp": 1527970892
    },
    {
        "content": "<p>ah, I am assuming th model where the EHR passes the data to the cds-hooks.. I might be out-of-date, as there is the model where the cds-hooks calls back to the EHR to retrieve the data.. I guess in this case there would need to be a shadow copy of the patient data that is only associated with the pseudo Patient resource copy. This callback model exposes more data, thus increasing risk of re-identification...</p>",
        "id": 153966585,
        "sender_full_name": "John Moehrke",
        "timestamp": 1527971123
    },
    {
        "content": "<p>The most rich and pervasive quasi-identifier is all the dates found in all FHIR Resources. The more Resources, the more rich the date cloud for that pseudo-Patient.  If someone knows key dates where patient Paul has seeked care, they can correlate the dates they know with the dates found in a pseudo-Patient to determine that pseudo-Patient is highly likely to be Paul. -- the shadow copy of the data would need to add some random offset to all dates,  yet not invalidate the clinical significance. Usually implemented as a single random offset for that pseudo-Patient that is applied consistently to all dates. Interrelationships are maintained, but absolute date can't be determined.  Most at-risk patients are well-known (VIP), or target of motivated attacker. -- Thus giving full access to all the data on a given pseudo-Patient, vs a sub-set, increases risk; thus my assertion the cds-hook calling back to the EHR is more dangerous, than EHR giving only select resources to the cds-hooks.</p>",
        "id": 153966587,
        "sender_full_name": "John Moehrke",
        "timestamp": 1527972221
    },
    {
        "content": "<p>One thing you could do is have the random offset be for a specific hook invocation.  So long as there are constraints on the queries to require a reasonable degree of filtering (specific lab tests rather than all lab tests, for example), then the hook can't grab too much.  If they see the same patient again, it'll have a different id and a different date offset.</p>",
        "id": 153966589,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1527974808
    },
    {
        "content": "<p>yes. The hard part is that the offset needs to be consistent for that whole pseudo-patient without exposing what the offset actually is.  There is fun design work to protect privacy -- Privacy by Design...</p>",
        "id": 153966591,
        "sender_full_name": "John Moehrke",
        "timestamp": 1527975678
    }
]