[
    {
        "content": "<p>With CDS-Hooks how is the CDS Service expected to authenticate the EHR user who clicks on an App Link? Is it OK for the CDS Service to issue a JWT token when the CDS Hook is invoked and append it as a parameter to the absolute URL of the App Link, or is there a better approach? Or may be absolute URLs are not the best choice when we need to identify the EHR user and a Smart App should be used instead? If that's the case, are there any open-source Smart App implementations which demonstrate the OAuth2 &amp; OpenID parts of the SMART spec?</p>",
        "id": 153890332,
        "sender_full_name": "Stefan Dimitrov",
        "timestamp": 1495062832
    },
    {
        "content": "<p>Here is our <a href=\"https://github.com/cds-hooks/docs/wiki/Proposed-Security-Model\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/wiki/Proposed-Security-Model\">proposed security model</a>. (Note: this has yet to see implementer feedback)</p>",
        "id": 153890336,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1495086954
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191355\">@Kevin Shekleton</span> thank you for your reply. I have seen the proposed security model but it does not address my question, it addresses 3 points: 1) The EHR trusting the CDS Services to invoke; 2) The CDS Service trusting communication with EHRs invoking them; 3) The CDS Service being able to access the FHIR server of the EHR. But it does not cover the app launched through a CDS hook trusting the EHR user who clicked on the link.</p>",
        "id": 153890395,
        "sender_full_name": "Stefan Dimitrov",
        "timestamp": 1495120787
    },
    {
        "content": "<p>Sorry <span class=\"user-mention\" data-user-id=\"191606\">@Stefan Dimitrov</span>, I misread your question. For app links, if you are you looking for a security model around your app links, you should return a SMART app link in your card. The EHR will then go through the standard SMART app launch workflow to the authorize and launch the app.</p>",
        "id": 153890406,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1495126518
    },
    {
        "content": "<p>You are correct in that if you want user identity, patient context, access to the FHIR server, etc, then returning a SMART app link is the way to go rather than an absolute URL link</p>",
        "id": 153890407,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1495126575
    },
    {
        "content": "<p>As far as open source SMART on FHIR reference implementations, there was a recent thread on the SMART mailing list that covered this that you would be interested in. You can <a href=\"https://groups.google.com/d/msg/smart-on-fhir/d7belynu2Q4/3EiSVMGUAwAJ\" target=\"_blank\" title=\"https://groups.google.com/d/msg/smart-on-fhir/d7belynu2Q4/3EiSVMGUAwAJ\">read it here</a>. Additionally, you can check on the <a href=\"https://chat.fhir.org/#narrow/stream/smart\" target=\"_blank\" title=\"https://chat.fhir.org/#narrow/stream/smart\">#smart</a> stream here.</p>",
        "id": 153890408,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1495126836
    }
]