[
    {
        "content": "<p><a href=\"/user_uploads/10155/tXkzcIZ8mH7qyGt-aW2zJq71/app-launch-hooks-proposal.pptx\" target=\"_blank\" title=\"app-launch-hooks-proposal.pptx\">app-launch-hooks-proposal.pptx</a> </p>\n<p>A few weeks I had initiated a conversation about using cds hooks to allow discovery of apps around data contexts (e.g., problem in the problem list). Based on feedback from the group, we look at infobuttons as an alternative approach.  I am attaching slides from today's CDS WG call where we discussed an approach to extending the infobutton spec.  The first part of the deck is the proposed approach. The latter slides capture the motivation and earlier discussions on alternative solutions.</p>\n<p>We're looking for feedback from the group on the infobutton approach.  Since there weren't any representatives of infobutton clients, i.e., EHRs, we'd like to call them out, in particular, to share their feedback.</p>",
        "id": 153996407,
        "sender_full_name": "Aziz Boxwala",
        "timestamp": 1536794685
    },
    {
        "content": "<p>Hey Aziz, </p>\n<p>1) I'm still not certain that the problem you're addressing is widely applicable.<br>\n2) Your current direction seems to make sense. </p>\n<p>When the the infobutton response is a webpage, including a hypertext anchor, such as:</p>\n<blockquote>\n<p>&lt;a class=\"hl7.org:fhir-app\" data-fhir-app-redirect=\"<a href=\"https://smartapp.com/diabetes/redirect.html\" target=\"_blank\" title=\"https://smartapp.com/diabetes/redirect.html\">https://smartapp.com/diabetes/redirect.html</a>\" href= =“https://smartapp.com/diabetes/launch.html”&gt;Diabetes app&lt;/a&gt;</p>\n</blockquote>\n<p>Are you expecting the Infobutton client to transform the hypertext reference into an EHR Launch url (i.e. add the iss and launch token GET parameters)? I'm not sure how a web-based EHR would be able to do that.</p>\n<p>Isaac</p>",
        "id": 153996480,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1536808694
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span> </p>\n<p>Yes, we are expecting the infobutton client to transform the anchor tag into an EHR launch URL. A client could use Javascript to perform the transformation. Is your concern that the client would not know how to set these parameters for an unknown (i.e., unregistered in EHR) app?</p>\n<p>I have two projects that have a need for such a solution. I can't be sure how widespread the need might be, but this seems like a small modification (in the grand scheme of all things HIT) and could have a positive impact on the use of apps. </p>\n<p>Thanks Isaac.</p>\n<p>--Aziz</p>",
        "id": 153996858,
        "sender_full_name": "Aziz Boxwala",
        "timestamp": 1536874314
    },
    {
        "content": "<blockquote>\n<p>Yes, we are expecting the infobutton client to transform the anchor tag into an EHR launch URL. A client could use Javascript to perform the transformation. </p>\n</blockquote>\n<p>Hey Aziz, </p>\n<p>My primary concern is that a web-based infobutton client wouldn't have the technical ability to reach into an iframe and transform the url of a hypertext reference. Maybe I'm wrong. Prototyping will definitely expose this problem, if it exists.</p>\n<p>Isaac</p>",
        "id": 153996892,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1536892708
    },
    {
        "content": "<p>Specifically cross site scripting would trigger and some browsers would deny it and view it as a security violation.<br>\nWe wouldn't do it for sure.</p>",
        "id": 153997208,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1537051697
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span> : Iframe for what? The infobutton client is the one that contains the  hyperlink.</p>",
        "id": 153997282,
        "sender_full_name": "Aziz Boxwala",
        "timestamp": 1537163200
    },
    {
        "content": "<p>Hey Aziz - maybe I'm missing the big picture, please let me know if you think so.</p>\n<p>My understanding is that the infobutton response is parsed/displayed in a browser based client. In the case where that client is fully web based, the primary method for displaying the infobutton response is within an iframe of a larger web application. In this case, the larger web application will not have the ability to modify a hyper text reference to a SMART app, as returned from the Infobutton service, to append the launch/iss parameters.</p>\n<p>Again, prototype testing will definitely expose this, if it's a problem. </p>\n<p>Isaac</p>",
        "id": 153997942,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1537334163
    },
    {
        "content": "<p>Hi Isaac. That's right. I imagine the client could insert their own javascript in the html received from the infobutton within the iframe (just like they might apply their own css). Would that pose a security risk?</p>\n<p>Do we still think infobutton is the approach we want to pursue? The alternative is to create a hook for \"problem-list-review\" ... and others in the future?</p>",
        "id": 153998291,
        "sender_full_name": "Aziz Boxwala",
        "timestamp": 1537378923
    },
    {
        "content": "<p>Hey Aziz,</p>\n<blockquote>\n<p>the client could insert their own javascript in the html received from the infobutton within the iframe</p>\n</blockquote>\n<p>I'm pretty sure that this is specifically not allowed in most browsers, when the domain of the page hosting the iframe is different from the domain of the page contained within the iframe. </p>\n<p>I personally think that adding additional hooks to CDS Hooks would be a far more desirable approach.<br>\n1. Adding more hooks would enhance CDS Hooks.<br>\n2. In some cases, _CDS clients_ already have non-standardized hooks available.<br>\n3. InfoButton's awesome as a clinical knowledgebase integration method, CDS Hooks is a bit more generic, enabling the cds service to query FHIR dynamically. I think that you want this capability.</p>\n<p>Isaac</p>",
        "id": 153999692,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1537847008
    },
    {
        "content": "<p>Isaac,</p>\n<p>cds-hooks is the approach I too prefer.</p>\n<p>When we initially proposed the project we considered both infobutton and cds-hooks requirements. The concern about infobutton operating in a non-PHI was identified then.  There were a different set of concerns around hooks - mostly usability if the user clicks resulted in no responses.  I believe that is less of a concern since there will be some apps that will cover a wide range of problems.</p>\n<p>We can further develop a proposal for a hook around the problem review for WG discussion in October.</p>\n<p>--Aziz</p>\n<blockquote>\n<p>Hey Aziz,</p>\n<blockquote>\n<p>the client could insert their own javascript in the html received from the infobutton within the iframe</p>\n</blockquote>\n<p>I'm pretty sure that this is specifically not allowed in most browsers, when the domain of the page hosting the iframe is different from the domain of the page contained within the iframe. </p>\n<p>I personally think that adding additional hooks to CDS Hooks would be a far more desirable approach.<br>\n1. Adding more hooks would enhance CDS Hooks.<br>\n2. In some cases, _CDS clients_ already have non-standardized hooks available.<br>\n3. InfoButton's awesome as a clinical knowledgebase integration method, CDS Hooks is a bit more generic, enabling the cds service to query FHIR dynamically. I think that you want this capability.</p>\n<p>Isaac</p>\n</blockquote>",
        "id": 154000167,
        "sender_full_name": "Aziz Boxwala",
        "timestamp": 1538006801
    }
]