[
    {
        "content": "<p>For the optional appContext attribute for a SMART app link (<a href=\"https://cds-hooks.org/specification/1.0/#link\" target=\"_blank\" title=\"https://cds-hooks.org/specification/1.0/#link\">https://cds-hooks.org/specification/1.0/#link</a>), the CDS Hooks specification states: \"The appContext field and value will be sent to the SMART app as part of the OAuth 2.0 access token response, alongside the other SMART launch parameters when the SMART app is launched.\"</p>\n<p>How does the authorization server know when to include the appContext in the token response? Is the appContext included as a parameter in the SMART launch as well?</p>",
        "id": 153995418,
        "sender_full_name": "Chuck Feltner",
        "timestamp": 1536605533
    },
    {
        "content": "<p>The EHR + AS have a very tight relationship. So, this is for the developers of those two systems to work that out.</p>",
        "id": 153995767,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1536680639
    },
    {
        "content": "<p>For example, speaking for Cerner, our EHR and AS have a private API they use to communicate various information during the launch of a SMART app so that the AS knows exactly what context data to pass to the SMART app on launch.</p>",
        "id": 153995768,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1536680691
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191355\">@Kevin Shekleton</span> . So CDS Hooks is not adding any additional SMART launch parameters to be able to correlate that specific launch which the appContext is for? It is just relying on the existing SMART launch parameter that the EHR adds to the URL specified in the CDS link?</p>",
        "id": 153995847,
        "sender_full_name": "Chuck Feltner",
        "timestamp": 1536691070
    },
    {
        "content": "<p>Right. The EHR/AS have to know how to create/understand what that launch parameter is.</p>\n<p>For instance, in Cerner's case the launch parameter is a UUID that points to a private datastore that contains the launch/context information. The EHR creates this row+UUID and makes it available to the AS via the aforementioned private API.</p>",
        "id": 153995895,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1536697530
    },
    {
        "content": "<p>Great. Thanks <span class=\"user-mention\" data-user-id=\"191355\">@Kevin Shekleton</span></p>",
        "id": 153995959,
        "sender_full_name": "Chuck Feltner",
        "timestamp": 1536704301
    },
    {
        "content": "<p>I'm looking to use the appContext to pass a SMART intent parameter to the SMART app.  It would be something simple like \"resources\" or \"calculator\" telling the app which flow should be followed.  </p>\n<p>If I use the appContext, will the resulting value be nested inside an appContext property (differing from the SMART \"intent\" parameter that not nested)?  Or is their another way for a CDS Hook app link to indicate intent?  </p>\n<p>{<br>\n  \"access_token\": \"i8hweunweunweofiwweoijewiwe\",<br>\n  ...<br>\n  \"intent\": \"calculator\",<br>\n  \"appContext\": \"{\\\"intent\\\":\\\"calculator\\\"}\"<br>\n}</p>\n<p>The alternate I can think of is simply adding a query parameter to the launch, but I think an EHR might be using the URL value to match a SMART app registration, and fail if I add custom parameters.</p>",
        "id": 154026135,
        "sender_full_name": "Travis Cummings",
        "timestamp": 1545156165
    },
    {
        "content": "<p>Yes, the <code>appContext</code> property will sit alongside the other SMART launch parameters via its own property as in your example.</p>\n<p>I definitely wouldn't do a query parameter on your SMART app launch URL. Custom URL parameters on SMART app launch URLs are not documented in the SMART spec and I suspect aren't widely supported.</p>",
        "id": 154722563,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1547040190
    },
    {
        "content": "<p>Should appContext added to SMART spec [http://www.hl7.org/fhir/smart-app-launch/scopes-and-launch-context/#launch-context-arrives-with-your-access_token] as optional or is the documentation in Hooks spec suffice (given this param is more specific to Hooks) ?</p>",
        "id": 154848954,
        "sender_full_name": "Raj M",
        "timestamp": 1547136120
    },
    {
        "content": "<p>I think <code>appContext</code> staying solely within the CDS Hooks specification is the right thing (rather than adding it to the SMART app launch specification).</p>",
        "id": 154983052,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1547297602
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191355\">@Kevin Shekleton</span> Is this issue closed?: <a href=\"https://github.com/smart-on-fhir/smart-launcher/issues/5\" target=\"_blank\" title=\"https://github.com/smart-on-fhir/smart-launcher/issues/5\">https://github.com/smart-on-fhir/smart-launcher/issues/5</a></p>\n<p>I ask because current sandboxes (Cerner Code, HSPC) do not seem to have a mechanism to specify an appContext to be returned as part of the /token response during app launch. The Da Vinci CRD and DTR use-cases (and reference implementations) are banking on the EHR using the appContext for the SMART app and then including it in the token response, along with access_token, token_type, etc.</p>\n<p>I agree that an additional query parameter in the launch url is not a documented technique, so (although it currently can be coerced) it is a brittle workaround.</p>",
        "id": 164900846,
        "sender_full_name": "Patrick Haren",
        "timestamp": 1557029151
    },
    {
        "content": "<p>When I launch a SMART App from a link in CDS card from the HSPC Sandbox where the <code>appContext</code> field was filled out in the card, I'm seeing that appContext value passed into my smart app  in the access token response (along with <code>patient</code>, <code>access_token</code>, <code>scope</code>, etc)</p>",
        "id": 164912192,
        "sender_full_name": "Kyle Neumeier",
        "timestamp": 1557050446
    },
    {
        "content": "<p>Thanks Kyle, I assume that this is by using the cds-hooks smart app in HSPC? Have you seen any way to specify the appContext for standalone app launching?</p>",
        "id": 164914731,
        "sender_full_name": "Patrick Haren",
        "timestamp": 1557054875
    },
    {
        "content": "<blockquote>\n<p>I assume that this is by using the cds-hooks smart app in HSPC</p>\n</blockquote>\n<p>Yes, that's what I did: Went to HSPC Sandbox, launched \"CDS Hooks Sandbox\" from there. </p>\n<blockquote>\n<p>Have you seen any way to specify the appContext for standalone app launching</p>\n</blockquote>\n<p>I have not, I don't think I know enough to answer that. For reference though, here is relevant code in cds server sandbox:</p>\n<p><a href=\"https://github.com/cds-hooks/sandbox/blob/master/src/retrieve-data-helpers/launch-context-retrieval.js#L25\" target=\"_blank\" title=\"https://github.com/cds-hooks/sandbox/blob/master/src/retrieve-data-helpers/launch-context-retrieval.js#L25\">https://github.com/cds-hooks/sandbox/blob/master/src/retrieve-data-helpers/launch-context-retrieval.js#L25</a></p>\n<p>It looks like it makes a <code>POST</code> to <code>${fhirBaseUrl}/_services/smart/Launch</code> with the <code>appContext</code> and gets back a <code>launch_id</code>. It then attaches this as the <code>launch</code> param to the launch url provided by the card.</p>",
        "id": 164915865,
        "sender_full_name": "Kyle Neumeier",
        "timestamp": 1557056850
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192603\">@Patrick Haren</span> our FHIR server supports the appContext in the CDS Hooks SMART App launch if you would like to test that interaction.</p>",
        "id": 164917743,
        "sender_full_name": "Chuck Feltner",
        "timestamp": 1557060045
    },
    {
        "content": "<p>Hi Chuck, we have a service with SMART web messaging.  Will let you know when your endpoint is white listed in our service.</p>",
        "id": 164921093,
        "sender_full_name": "Nancy Lush",
        "timestamp": 1557065638
    }
]