[
    {
        "content": "<p>Hi-<br>\nJust as we capture String or other valueTypes outputs in PlanDefinition&gt;action&gt;dynamicValue&gt;expression on CQL execution, can we capture FHIR resource(s) also if CQL returns a FHIR resource? I couldn't find a location or supporting valueType for PlanDefinition&gt;action&gt;dynamicValue. Please suggest.</p>",
        "id": 172615192,
        "sender_full_name": "Pankaj Grover",
        "timestamp": 1565115596
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span>   (Also - not clear how this question relates to CDS Hooks?)</p>",
        "id": 172615693,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1565115913
    },
    {
        "content": "<p>@<strong>Lloyd McKenzie </strong>: We, in turn, looking for a possibility to capture and send this response to CDSResonse via RequestGroup, when the request to trigger PlanDefinition/Related CQL came via CDSHooks request.</p>",
        "id": 172620040,
        "sender_full_name": "Pankaj Grover",
        "timestamp": 1565118984
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 172620079,
        "sender_full_name": "Pankaj Grover",
        "timestamp": 1565119019
    },
    {
        "content": "<p>Hi Pankaj, yes, you can return any value from a CQL expression, and so you can have the expression in a dynamicValue return a FHIR resource. For a dynamicValue, it just has to be a value of the type (or implicitly convertible to the type) of the element identified by the path in the dynamicValue.</p>",
        "id": 172646340,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1565146492
    },
    {
        "content": "<p>Thanks, <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span>  for your inputs and suggestions. Can you give me an example of dynamic value/ action having dynamic values, where dynamic value(s) path(s) expect value from an expression of valuetype  other than primitive(or implicitly convertible type(s))? Neither I could find any not have it running based on the valueType(s) or path(s) that I'm providing currrently. I would be really helpful to understand how API helps to capture different valueType(s) and a variety of valuetype(s) a CQL  expression can return.</p>",
        "id": 173251525,
        "sender_full_name": "Pankaj Grover",
        "timestamp": 1565824981
    }
]