[
    {
        "content": "<p>In choosing how to deliver patient preferences (based on consent) to a client, it seemed like, among existing options, CDS hooks specs provide a suitable interface since they aim at conveying the result of some external analysis to a client in a way that can be integrated with a workflow context (e.g., research or treatment decision). <br>\nI thought I'd reach out to this community and see if there are any thoughts or feedbacks on this. We have a workable prototype here:<br>\n<a href=\"https://github.com/sdhealthconnect/leap-cds#cds-hook-interface\">https://github.com/sdhealthconnect/leap-cds#cds-hook-interface</a></p>",
        "id": 197489812,
        "sender_full_name": "Mohammad Jafari",
        "timestamp": 1589412207
    },
    {
        "content": "<p>Hi Mohammad!  It sounds like rather than having the CDS Service listening for certain workflows (usually defined as hooks) and returning consent information for those hooks, you're wanting a web service to be called whenever the CDS Client wants to look up a consent, across a variety of different events.   i.e. the hook is more around the purpose of the CDS Service (retrieving consent) and the actual action/workflow information is sent as context instead.  </p>\n<p>Am I understanding?  I still have more to read in your documentation, so please clarify if I'm misrepresenting!</p>",
        "id": 197557989,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1589464788
    },
    {
        "content": "<p>Thanks. I think your characterization is correct. The Consent Decision Service does not return fine-grained feedback besides permit/deny and optionally some obligations (e.g., redact or mask some data item). I recognize that the CDS hooks interface is designed based on the assumption that the service returns much more detailed  feedback even at the UI level. <br>\nSo based on this, are you suggesting that the CDS hooks interface is not a suitable vehicle for delivering consent decisions?</p>",
        "id": 198094245,
        "sender_full_name": "Mohammad Jafari",
        "timestamp": 1589906802
    }
]