[
    {
        "content": "<p>The CDS Connect project is thinking of participating in a Connectathon.  What we have is:</p>\n<ul>\n<li><strong>CQL Services:</strong> A Node.js based service for exposing arbitrary CQL as CDS Hooks services (unlike the Java variant, it does <em>not</em> use PlanDefinition).</li>\n<li><strong>CQL Testing:</strong> A tool for building and running automated unit tests for CQL libraries.</li>\n<li><strong>CDS Authoring Tool:</strong> A graphical tool for building (mostly) rules-based CQL logic</li>\n<li><strong>CDS Repository:</strong> An online repository for sharing standards-based artifacts.</li>\n</ul>\n<p>As far as CDS Hooks goes, <em>CQL Services</em> seems the best fit, but maybe <em>CQL Testing</em> might be interesting to some as well.  Are CDS Hooks tracks generally broad enough that it might make sense for us to participate?  I'm thinking maybe we try a few of our own services with EHR vendors that can invoke hooks services, and/or we help others convert their CQL into CDS Hooks services if they're interested.  Or do you anticipate very specific tracks for which that type of participation might not be relevant?</p>",
        "id": 188765381,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1582313016
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191469\">@Chris Moesel</span> , Yes. A cds hooks connectathon easily incorporates CQL Services and you'd be welcomed in our connectathon tracks.</p>",
        "id": 188851024,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1582435356
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191358\">@Dennis Patterson</span> , <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> - do you agree?</p>",
        "id": 188851049,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1582435407
    },
    {
        "content": "<p>Absolutely, would love to see it!</p>",
        "id": 188888859,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1582500186
    },
    {
        "content": "<p>Since CDS Hooks is agnostic of the underlying algorithm implementation, you're welcome to use the track for leveraging the API to integrate with clients and having cql services expose themselves as CDS Hooks Services.  There may not be anything in the track description specific to CQL, but API usage is encouraged using a variety of implementations!</p>",
        "id": 188934064,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1582556859
    },
    {
        "content": "<p>Thanks all.  I figured this was the case, but wanted to get confirmation before formally requesting the travel from AHRQ.  Looking forward to it!</p>",
        "id": 188935772,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1582558006
    },
    {
        "content": "<p>@Chris - Bryn, Dennis and I chatted about the May connectathon this morning and are planning some scenarios within the CDS Hooks track around upcoming CDS Hooks features -- including the interoperable <a href=\"https://github.com/cds-hooks/docs/pull/513\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/pull/513\">override reasons</a> by which a cds service can provide acknowledgement reasons to an EHR and a <a href=\"https://github.com/cds-hooks/docs/wiki/Feedback-endpoint-for-CDS-Hooks-1.1\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/wiki/Feedback-endpoint-for-CDS-Hooks-1.1\">feedback service</a> which an EHR informs a remote CDS service of the end-result of a cds suggestion. </p>\n<p>Is this beta functionality of interest to you? We'll hoping to learn from implementor experience in May.</p>",
        "id": 189186139,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1582777771
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span> -- that's certainly some interesting functionality and looks like some good capability for CDS Hooks to explore.  So I'm interested in that regard.  That said, I don't know if I'll be able to bring any of that to the table.  We have several balls in the air at once and I don't know if implementing those features will gain sufficient priority by May.  I think we were hoping just to do some more basic integration testing using features defined in CDS Hooks 1.0.  But... you never know!</p>",
        "id": 189187663,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1582780345
    }
]