[
    {
        "content": "<p>Hello.</p>\n<p>I have a question about Infobutton versus CDS-HOOKs.</p>\n<p>Both specifications guide how to use an external clinical decision support service, correct?</p>\n<p>What are the advantages and disadvantages if I choose CDS-HOOKs over Infobutton?</p>\n<p>Does infobutton require an OID plan? Is it harder to deploy than FHIR CDS-HOOKs?</p>\n<p>Any colleagues know of any production implementations of CDS-HOOKs?</p>\n<p>I'm in this dilemma ... HOOKs or Infobutton?</p>\n<p>Thanks for any guidance</p>",
        "id": 180360205,
        "sender_full_name": "Paulo Rades",
        "timestamp": 1573386100
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span></p>",
        "id": 180367893,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1573399956
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"193385\">@Paulo Rades</span> !</p>\n<p>Great question, HL7 InfoButton is a wonderful mechanism to integrate and expose a clinical knowledgebase to a clinician. It has the significant advantages of not communicating PHI (and therefore ignoring security complications), it may be a simple HTTP GET with the optional return of mere html. Overall, it's simple and extremely implementable. Generally an InfoButton integration is manually enacted by the clinician (e.g. the provider has to click a button to access the clinical knowledgebase).</p>",
        "id": 180396561,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1573446557
    },
    {
        "content": "<p>InfoButton provides hypertext to the clinician. Similarly, CDS Hooks can also provide mere markup text to the clinician; however CDS Hooks integrations are specifically triggered based upon clinical workflow actions. Further, a CDS Hooks service can provide markup, a recommended app, or even specific actions -- represented in FHIR.</p>",
        "id": 180396562,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1573446557
    },
    {
        "content": "<p>Overall, your choice of InfoButton or CDS Hooks should depend upon the needs and goals of your cds. Are you providing a clinical knowledgebase, are you providing an app or discrete order suggestions? Overall, an InfoButton integration many well be simpler and easier ... and less functional than a CDS Hooks service. You should decide between these two mechanisms based upon the needs and capabilities of your cds.</p>",
        "id": 180396563,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1573446557
    },
    {
        "content": "<p>&lt;deleted&gt;</p>",
        "id": 180396564,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1573446557
    },
    {
        "content": "<p>Does that help?</p>",
        "id": 180396565,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1573446557
    },
    {
        "content": "<p>Hello <span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span> !!!</p>\n<p>Yes, your comments were valuable and of great help !!!</p>\n<p>Do you know where I can find a tutorial or starting point for implementing Infobutton (in EHR and the knowledge base?)</p>\n<p>Our decision was to pilot CDS-HOOKs and now deploy Infobutton, because what we have is a clinical knowledge base.</p>\n<p>Thanks for all the help!</p>",
        "id": 180453959,
        "sender_full_name": "Paulo Rades",
        "timestamp": 1573501620
    },
    {
        "content": "<p>As far as I know, there isn't a publically available InfoButton sandbox. I think these are <a href=\"https://www.hl7.org/implement/standards/product_brief.cfm?product_id=22\" target=\"_blank\" title=\"https://www.hl7.org/implement/standards/product_brief.cfm?product_id=22\">the right specs</a>.   <span class=\"user-mention\" data-user-id=\"195161\">@Guilherme Del Fiol</span> is the primary author of InfoButton and may have additional guidance.</p>",
        "id": 180461195,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1573507431
    },
    {
        "content": "<p>IHE has a Profile on InfoButton <a href=\"https://wiki.ihe.net/index.php/Retrieval_for_Clinical_Knowledge\" target=\"_blank\" title=\"https://wiki.ihe.net/index.php/Retrieval_for_Clinical_Knowledge\">https://wiki.ihe.net/index.php/Retrieval_for_Clinical_Knowledge</a><br>\nBut, no help as there is not a reference implementation. <span class=\"user-mention\" data-user-id=\"191387\">@Keith Boone</span> says it is trivial to implement</p>",
        "id": 180461773,
        "sender_full_name": "John Moehrke",
        "timestamp": 1573507797
    },
    {
        "content": "<p>I agree with <span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span> 's thoughts.  A couple more thoughts: </p>\n<p>- The Infobutton URL-based implementation guide is required for Meaningful Use certification and has been adopted by certified EHRs. Most of the popular knowledge resources are also compliant with this specification.<br>\n- CDS Hooks is a more general and more powerful standard, with several potential advantages over Infobutton. For example, it allows CDS requests to be automatically triggered based on EHR user events versus triggered on user demand. It also allows a CDS service to query additional data that could be used to refine the content included in an infobutton response. </p>\n<p>We did test CDS Hooks in the support of infobutton functionality at one of the previous connectathons and it worked fairly well. <br>\n<span class=\"user-mention\" data-user-id=\"193385\">@Paulo Rades</span> ,  If you want to try this out, the service endpoint for our CDS Hooks-based infobutton service is <a href=\"https://dev-service.oib.utah.edu:443/cds-services\" target=\"_blank\" title=\"https://dev-service.oib.utah.edu:443/cds-services\">https://dev-service.oib.utah.edu:443/cds-services</a> . This works with the CDS Hooks sandbox both for patient-view and order-select hooks.</p>\n<p>The main caveat is that I don't know if any of the mainstream infobutton knowledge vendors support CDS Hooks at the moment.</p>",
        "id": 180474058,
        "sender_full_name": "Guilherme Del Fiol",
        "timestamp": 1573522007
    },
    {
        "content": "<p>By the way, we do have an open source reference implementation: <a href=\"http://www.openinfobutton.org\" target=\"_blank\" title=\"http://www.openinfobutton.org\">www.openinfobutton.org</a> <br>\nI will be happy to provide details if anyone is interested.</p>",
        "id": 180474125,
        "sender_full_name": "Guilherme Del Fiol",
        "timestamp": 1573522102
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"195161\">@Guilherme Del Fiol</span> : Thanks a lot for the help...</p>\n<p>To deploy infobutton version 2.3, should I first deploy from previous versions?</p>\n<p>Is there any instruction.doc more current than what is available on the official infobutton website?</p>",
        "id": 181035761,
        "sender_full_name": "Paulo Rades",
        "timestamp": 1574097524
    },
    {
        "content": "<p>If you are thinking of using Infobutton I would highly suggest analyzing the target EHRs' implementations of Infobutton because they are all over the place!  Furthermore, practically, I have seen very few EHR vendor support staff that is familiar with their Infobutton implementations so it's hard to get support when implementing.  Another factor to consider is whether you will be listing the app on the EHR marketplaces because some EHR vendors will not consider apps that do not use SMART, FHIR, CDS Hooks, etc.</p>\n<p>Unfortunately, the biggest hurdle with CDS Hooks is, again, the vendor support, but from the EHR vendor investments and commitments so far it seems like the support is coming relatively quickly.</p>\n<p><span class=\"user-mention\" data-user-id=\"195161\">@Guilherme Del Fiol</span> in your Infobutton CDS Hooks wrapper, are you sending all the problems or somehow only one that a clinician might be interested in?</p>",
        "id": 182522787,
        "sender_full_name": "Farhan Ahmad",
        "timestamp": 1575431472
    },
    {
        "content": "<p>We are sending the most recent problem. Less than ideal, but sending all problems and getting cards for each of them would probably be worse.</p>",
        "id": 182577567,
        "sender_full_name": "Guilherme Del Fiol",
        "timestamp": 1575480032
    },
    {
        "content": "<p>I see. Thanks for that info. Agreed, most recent is better than sending all.</p>",
        "id": 182728702,
        "sender_full_name": "Farhan Ahmad",
        "timestamp": 1575605324
    },
    {
        "content": "<p>Per a discussion earlier today on the CDS WG call, I copied some of the above conversation and created this page: <a href=\"https://confluence.hl7.org/pages/viewpage.action?pageId=75170592\" target=\"_blank\" title=\"https://confluence.hl7.org/pages/viewpage.action?pageId=75170592\">CDS Hooks vs InfoButton: Which should I use?</a> on the CDS confluence space. </p>\n<p><span class=\"user-mention\" data-user-id=\"195161\">@Guilherme Del Fiol</span> - would you review/edit as appropriate? <br>\n<span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> - fyi and, is this what you had in mind?</p>",
        "id": 186917890,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1580325047
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span> , yes, that's great, thank you for putting that together!</p>",
        "id": 187023361,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1580413679
    }
]