[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191355\">@Kevin Shekleton</span> <span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span> <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> </p>\n<p>I've recently been working in a cross functional team on CDS Hooks (e.g. technologist, product, clinical, strategist) with the following feedback points on CDS Hooks:</p>\n<ul>\n<li>\n<p>Investing  time discussing the following was beneficial to start our work on CDS Hooks:</p>\n<ul>\n<li>Reviewing the history of HL7 protocols success within an enterprise and the move to FHIR to solve the inter-enterprise interoperability challenges and patient access needs. With a call out to the architectural principles of FHIR that resonate with modern web developers.</li>\n<li>Followed by discussing the SMART on FHIR apps that bring reusable apps that can run on multiple platforms, deployed within an app store model.</li>\n<li>Finally, introducing CDS Hooks as a way to bring attention to clinical decision support as part of the workflow with links out to SMART on FHIR apps to simplify accessibility. (reference to this video by <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>  was used as well: <a href=\"https://www.youtube.com/watch?v=BuS3meoQoKk&amp;t=8s\" target=\"_blank\" title=\"https://www.youtube.com/watch?v=BuS3meoQoKk&amp;t=8s\">https://www.youtube.com/watch?v=BuS3meoQoKk&amp;t=8s</a> )</li>\n</ul>\n</li>\n<li>\n<p>Next reviewing the CDS Hooks concepts and features could be done nearly end to end within 1 hour. This is a credit to keeping the standard approachable, reusing FHIR, and minimizing complexity.</p>\n</li>\n<li>\n<p>The following concepts and considerations were discussed:</p>\n<ul>\n<li>People quickly picked up on the ability to use the prefetch to create a payload of data in which to run CDS on.</li>\n<li>On the CDS service side it was noted that you may have multiple data sources that need to be accessed to run the CDS logic. Maybe more than one FHIR server or a mix of FHIR server and other data sources.</li>\n<li>We considered the access control for the actions on resources within suggestions. A discussion around this topic would be interesting (granted it may exist somewhere already), for example just cause a platform supports CREATE operations on a resource, it may not be appropriate/allowed in specific parts of a workflow, should the CDS Hook contain that knowledge in its specification in some way.</li>\n<li>In all discussions the ability to write back to the platform running CDS Hooks was seen as critical usage capability of CDS Hooks.</li>\n<li>Using CDS Hooks in wireframes was trivially easy given the simplicity of the JSON data. Wireframes were useful for stimulating conversation. It brought forth ideas about potential expansions on the CDS Hooks specification and solidified understanding of CDS Hooks specification (to date). For example it seemed natural to have a card with sections with multiple suggestions per section, which would violate the current specification: “If used, the user MUST BE allowed to choose no more than one suggestion.” Additionally, there is no sections in a card. Rather it had to be re-thought by the group as multiple Cards returned within a single CDS service invocation. We concluded grouping of the cards on the client side seems good, the grouping being determined by returning multiple cards within a single CDS service invocation.</li>\n</ul>\n</li>\n</ul>\n<p>Feedback on the above points or links to prior conversations both welcome.</p>\n<div class=\"youtube-video message_inline_image\"><a data-id=\"BuS3meoQoKk\" href=\"https://www.youtube.com/watch?v=BuS3meoQoKk&amp;t=8s\" target=\"_blank\" title=\"https://www.youtube.com/watch?v=BuS3meoQoKk&amp;t=8s\"><img src=\"https://i.ytimg.com/vi/BuS3meoQoKk/default.jpg\"></a></div>",
        "id": 153947493,
        "sender_full_name": "Aslan Brooke",
        "timestamp": 1521812750
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"193942\">@Aslan Brooke</span>! If you want a slide deck that to review too, here are the source decks that Josh used for the presentation in the video you linked too: <a href=\"https://speakerdeck.com/kpshek\" target=\"_blank\" title=\"https://speakerdeck.com/kpshek\">https://speakerdeck.com/kpshek</a></p>",
        "id": 153947521,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1521818645
    }
]