[
    {
        "content": "<p>Hi all, <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span> , </p>\n<p>Is there a way to extend the return card structure such that in the case of using a CDS Hook result to update a CarePlan? For example, if the patient has high blood pressure, the card will indicate in a programmatically computable way that the patient has high blood pressure instead of using the \"detail\" and \"indicator\" elements which are free text. We would want to see a boolean value to see whether or not the patient passed the eligibility for the guideline or not. </p>\n<p>Thanks,<br>\nChrista <span class=\"user-mention\" data-user-id=\"193795\">@Joel Francis</span> <span class=\"user-mention\" data-user-id=\"416084\">@Paul Puscas</span> <span class=\"user-mention\" data-user-id=\"192545\">@Alex Goel</span></p>",
        "id": 242349734,
        "sender_full_name": "Christa Wan",
        "timestamp": 1623420405
    },
    {
        "content": "<p>The specification supports two ways of doing this from the service perspective. First is to return a \"proposed diagnosis\" as a suggestion: you could put a Condition resource in the suggestions element of a card to indicate that the service is suggesting a diagnosis of hypertension (assuming such a diagnosis was not already present in the patient's record). The second is through <a href=\"https://cds-hooks.hl7.org/1.0/#extensions\">extensions</a> where you could define a specific element such as \"guidelineEligible\". Either approach would require coordination with the client(s) to make sure it was possible for the client to understand what actions should be taken. It's a great use case, do you have a particular client or clients in mind that would accept the response you're envisioning?</p>",
        "id": 242351770,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1623421274
    },
    {
        "content": "<p>Thanks Bryn, We're thinking about a use case where we need to update CarePlan from what was returned from a CDS hook. How would we know what had been updated? The indicator didn't seem to provide all the detail we needed. Seems like we'd need to configure the Guidelines and the Clients to make either of these approaches work. Is that correct? </p>\n<p>So in terms of a specific use case, I think this could be any Guideline applied to a patient where you want to update a CarePlan based on the actions that were taken. Alternatively would be useful in assessing if patient is eligible for the Guideline or not</p>",
        "id": 242354954,
        "sender_full_name": "Alex Goel",
        "timestamp": 1623422558
    }
]