[
    {
        "content": "<p>I can see how we could create a service and test it using the CDS Hooks Service sandbox.  However, if we have a service ready to go, we will need a production CDS Hooks Service Provider.  Do these exist?  In specific, looking to use CDS Hooks within informatics research projects.</p>",
        "id": 171454187,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1563819442
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> it seems that until there are real CDS Service Providers, CDS Hooks will not be useful.  Or am I missing something?  When will there be CDS Service Providers and who will they be?</p>",
        "id": 171485181,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1563849725
    },
    {
        "content": "<p>Do you mean EHR vendors?</p>",
        "id": 171575753,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1563939365
    },
    {
        "content": "<p>Absolutely: a standard becomes useful when it's supported in real systems <span class=\"user-mention\" data-user-id=\"191531\">@Virginia Lorenzi</span> . My understanding is that Epic and Cerner both have some support and growing, but perhaps <span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span> and <span class=\"user-mention\" data-user-id=\"191358\">@Dennis Patterson</span> can comments (and others).</p>",
        "id": 171606223,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1563975317
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191531\">@Virginia Lorenzi</span> - Epic has released our initial support for CDS Hooks, and Josh is correct that we intend to grow this support over time. Right now, as part of the <a href=\"https://github.com/argonautproject/cds-hooks-for-pama/blob/master/guidance.md\" target=\"_blank\" title=\"https://github.com/argonautproject/cds-hooks-for-pama/blob/master/guidance.md\">Argonaut project</a>, we're looking at potentially expanding our support for ordering hooks and suggestions.</p>",
        "id": 171626262,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1563989764
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191531\">@Virginia Lorenzi</span> , at Cerner we're building out support and are focused on ordering workflows within the context of Argonaut (mentioned above).  We continue to be involved in CDS Hooks connectathon tracks and would love to hear more on your informatics use-cases.</p>",
        "id": 171630987,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1563993138
    },
    {
        "content": "<p>Thanks.  But my understanding is the EHR is the CDS Client.  I am trying to figure where a CDS Service I create could live.  In the cdshooks specification it talks about CDS providers or external CDS providers.  It seems I would want my CDS Service to live in one of those but there arent any except for the cdshooks sandbox - or are ehr vendors also providing the server side for cds service discovery?  reference to spec: <br>\n\"Call discovery endpoint¶<br>\nThe CDS discovery endpoint provides the list of services a CDS provider supports, and the hooks a service should be invoked on. A CDS Client may configure their system to support a set of hooks at a certain location in their users work flow, or build a dynamic capability to interact with a CDS Service provider within a work flow. For the best end-user experience, this guide recommends a business analyst configure which hooks a CDS Client will support.\"</p>",
        "id": 171637640,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1563998135
    },
    {
        "content": "<p>Hey Virginia, I might be misunderstanding. Afaik, no ehr vendor is providing hosting for CDS Hooks services. Typically, a CDS Hooks service is hosted somewhere on the internet. Often contracted through one of the cloud providers.</p>",
        "id": 171643288,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1564002296
    },
    {
        "content": "<p>Are there any cds hooks already out there hosted somewhere? <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> or others can you read my question and help me?  I might just be confused.</p>",
        "id": 171783422,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1564155075
    },
    {
        "content": "<p>This is a question about commercially available CDS providers that support CDS Hooks? I wonder if <span class=\"user-mention\" data-user-id=\"192631\">@Alex Tatiyants</span> might be able to share thoughts on the Stanson/Premier side.</p>",
        "id": 171783502,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1564155129
    },
    {
        "content": "<p>If the question is about how to host your CDS Hooks enabled services, we have ours hosted on our <a href=\"http://api.stansonhealth.com\" target=\"_blank\" title=\"http://api.stansonhealth.com\">api.stansonhealth.com</a> domain, which is a fairly common pattern.</p>",
        "id": 171984940,
        "sender_full_name": "Alex Tatiyants",
        "timestamp": 1564435477
    },
    {
        "content": "<blockquote>\n<p>If the question is about how to host your CDS Hooks enabled services, we have ours hosted on our <a href=\"http://api.stansonhealth.com\" target=\"_blank\" title=\"http://api.stansonhealth.com\">api.stansonhealth.com</a> domain, which is a fairly common pattern.</p>\n</blockquote>\n<p>thanks</p>",
        "id": 175404885,
        "sender_full_name": "Virginia Lorenzi",
        "timestamp": 1568183414
    }
]