[
    {
        "content": "<p>Thank you <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> for agreeing to conduct this virtual interview with <span class=\"user-mention\" data-user-id=\"267497\">@Rachel Mellerowicz</span> and I for our Duke University MSN Informatics project on CDS Hooks. We are new to this topic, so we greatly appreciate your (and others) insight into our questions: </p>\n<ol>\n<li>\n<p>What do you see as the main advantage to using CDS Hooks? </p>\n</li>\n<li>\n<p>What do you see as the main disadvantage or challenge to using CDS Hooks? </p>\n</li>\n<li>\n<p>Do you know of any hospitals that are currently using CDS Hooks either as a pilot or in actual production mode?  </p>\n</li>\n<li>\n<p>Piggybacking off of our last question, it looks like only one hook is currently beyond a maturity level of 1, “patient-view.” Is this the only hook that has been tested by any actual CDS clients/hospitals? </p>\n</li>\n<li>\n<p>Can you provide any specific examples of the external CDS services that may be evoked when an EHR triggers a hook? Are they different from previous CDS services used in internal systems? </p>\n</li>\n<li>\n<p>We did a previous class project on Arden Syntax and learned more about the “curly braces” problem. From our understanding, CDS Hooks is not a solution to the curly braces problem. Instead, it offers a different approach entirely that is able to bypass the “curly braces” because the external CDS systems may use FHIR APIs to obtain any institution/patient specific information. Are we correct in our thinking here?  </p>\n</li>\n<li>\n<p>Do you think hospitals will be quick or hesitant to adopt CDS Hooks? </p>\n</li>\n<li>\n<p>What do you see as the next steps for the advancement of this standard? Do you think it will eventually replace some of the older internal CDS systems?</p>\n</li>\n</ol>",
        "id": 189626426,
        "sender_full_name": "Michaela Mirkovich",
        "timestamp": 1583264331
    },
    {
        "content": "<p>Sure thing <span class=\"user-mention\" data-user-id=\"267498\">@Michaela Mirkovich</span>, and thanks for agreeing to do this in an \"open\" format. I'm hoping others will feel free to chime in with details, context, contradictions, or general discussion ;-)</p>",
        "id": 189639823,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1583273187
    },
    {
        "content": "<hr>\n<p>Okay, can you tell I didn't read the questions through before answering them? I, um, did my best to simulate a live interview format ;-)</p>\n<p>Please find (and contribute to!) answers in the following threads:</p>\n<ul>\n<li><a class=\"stream-topic\" data-stream-id=\"179159\" href=\"/#narrow/stream/179159-cds-hooks/topic/Interview.20Q1\">#cds hooks &gt; Interview Q1</a> </li>\n<li><a class=\"stream-topic\" data-stream-id=\"179159\" href=\"/#narrow/stream/179159-cds-hooks/topic/Interview.20Q2\">#cds hooks &gt; Interview Q2</a> </li>\n<li><a class=\"stream-topic\" data-stream-id=\"179159\" href=\"/#narrow/stream/179159-cds-hooks/topic/Interview.20Q3\">#cds hooks &gt; Interview Q3</a> </li>\n<li><a class=\"stream-topic\" data-stream-id=\"179159\" href=\"/#narrow/stream/179159-cds-hooks/topic/Interview.20Q4\">#cds hooks &gt; Interview Q4</a> </li>\n<li><a class=\"stream-topic\" data-stream-id=\"179159\" href=\"/#narrow/stream/179159-cds-hooks/topic/Interview.20Q5\">#cds hooks &gt; Interview Q5</a> </li>\n<li><a class=\"stream-topic\" data-stream-id=\"179159\" href=\"/#narrow/stream/179159-cds-hooks/topic/Interview.20Q6\">#cds hooks &gt; Interview Q6</a> </li>\n<li><a class=\"stream-topic\" data-stream-id=\"179159\" href=\"/#narrow/stream/179159-cds-hooks/topic/Interview.20Q7\">#cds hooks &gt; Interview Q7</a> </li>\n<li><a class=\"stream-topic\" data-stream-id=\"179159\" href=\"/#narrow/stream/179159-cds-hooks/topic/Interview.20Q8\">#cds hooks &gt; Interview Q8</a> </li>\n</ul>\n<p>Please let me know if you've got follow-ups, <span class=\"user-mention\" data-user-id=\"267498\">@Michaela Mirkovich</span>, and good luck with your MSN Informatics project!</p>",
        "id": 189642077,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1583274991
    },
    {
        "content": "<p>excellent. This needs to be captured somewhere besides zulip</p>",
        "id": 189697839,
        "sender_full_name": "John Moehrke",
        "timestamp": 1583333352
    },
    {
        "content": "<p>(Re: captured somewhere else: this is going into a report that Michaela's working on for a masters program; I figured it'd be fun to open discussion to all. <span class=\"user-mention\" data-user-id=\"267498\">@Michaela Mirkovich</span>, by the way, will you share a link to your report back here when you've completed it?)</p>",
        "id": 189707445,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1583338981
    },
    {
        "content": "<p>Thank you Josh for keeping the interview to a public forum, helpful for all to see!</p>",
        "id": 189712244,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1583341689
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> Wow, thank you so much for all your detailed (and very quick!) responses.  As we were beginning to do research for our project, we found that we were struggling to find a lot of information about the standard, especially in published literature, because it is still so new. Having yours and others' personal insight is incredibly helpful!</p>",
        "id": 189739847,
        "sender_full_name": "Michaela Mirkovich",
        "timestamp": 1583358873
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> Our project is just structured as a regular research-type paper, not in a formal journal or anything like that for us to link to. We would be happy to share our main points with the group when it is finished?</p>",
        "id": 189766988,
        "sender_full_name": "Michaela Mirkovich",
        "timestamp": 1583394680
    },
    {
        "content": "<p>Sure, or whatever you're comfortable sharing (e.g., you could even post the paper itself here as an attachment -- but no pressure!).</p>",
        "id": 189793965,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1583417013
    },
    {
        "content": "<p>Hello again <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> ,<br>\nThank you so much for your responses on this thread to help us with our project. I have attached a copy of our final paper if anyone is interested in reading it. Since we were just getting introduced to the standard, much of the paper focuses on explaining the basics of how CDS Hooks works and some of its likely advantages and disadvantages. Of note, we also do have a section where we proposed 3 potential options for new hooks. We hope everyone is staying safe and healthy during these crazy times!<br>\n<a href=\"/user_uploads/10155/de4_OI7MV3l4V8uOvCdmAAWy/CDS-Hooks-Paper.docx\" title=\"CDS-Hooks-Paper.docx\">CDS-Hooks-Paper.docx</a></p>",
        "id": 194507811,
        "sender_full_name": "Michaela Mirkovich",
        "timestamp": 1587162381
    }
]