[
    {
        "content": "<p>The spec says (about suggestions): <code> If used, the user MUST BE allowed to choose no more than one suggestion.</code></p>\n<p>That's a problem in at least a couple of ways:<br>\n1. Some hooks trigger on a collection of resources - e.g. order-review.  If there are changes to propose for more than one of the orders, how is that done?  It's possible some changes could propose deltas to multiple orders to be selected as a group, but in other cases you might want to allow the provider to make certain changes/additions and not make other ones.<br>\n2. Sometimes the recommendation isn't to change the resource that triggered the hook, but to add something else to accompany it.  And there might be both changes and accompanyments or multiple accompanyments.  There needs to be a way to do that</p>\n<p>I absolutely understand the need to say \"of this set of choices, pick 1\", but there will also be situations where you can reasonably pick multiple things - sometimes those things will be interdependent (must do them all or none) and sometimes they'll be independent.</p>",
        "id": 153984025,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533791968
    },
    {
        "content": "<p>My recommendation would be to have a nested structure of suggestion contains 1..* alternatives and allow alternative to support transaction.  Suggestions would be independent.  Alternatives would be \"pick at most 1\".</p>",
        "id": 153984026,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533792235
    },
    {
        "content": "<p>What's the correct way to propose a change to one of the existing hooks?  I'd like order-review to include support for DeviceRequest and SupplyRequest as well, but those aren't listed.  Do I raise a github issue?  Submit a pull request?  Submit a proposal for the existing ones on the \"proposed hooks\" project the same as all the others and incidentally add the new stuff I want?</p>",
        "id": 153984055,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533804425
    },
    {
        "content": "<p>Lloyd,<br>\nRe: <code>no more than one suggestion</code><br>\nDo you understand the card-&gt;suggestion-&gt;action hierarchy? A service can return multiple cards. Each card can contain multiple suggestions which are XOR'd. Each suggestion can contain multiple actions, which are AND'd.</p>",
        "id": 153984233,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1533828542
    },
    {
        "content": "<blockquote>\n<p>I'd like order-review to include support for DeviceRequest and SupplyRequest as well, but those aren't listed. </p>\n</blockquote>\n<p>This seems pretty reasonable. I'm sure that I missed stuff when I wrote up this list of possible order-type resources. In practive, DeviceRequest and SupplyRequest aren't widely implemented yet, so we haven't heard this request yet. </p>\n<p>Will you create a gh issue to add these two resources to the list of possible STU3 resources on the order-review hook page? Are there additional DSTU2 resources that should also be added?</p>",
        "id": 153984235,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1533828771
    },
    {
        "content": "<p>Lloyd, would you mind creating an additional gh issue to update the med-prescribe and order-review hooks to specify their R4 resources (once those resources are final). Even if we defer the issue, it would be nice to have the issue logged.</p>",
        "id": 153984236,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1533829203
    },
    {
        "content": "<p>Doh!.  Yup, that makes sense.  (re card-&gt;suggestion-action)</p>\n<p>I'll write up the proposal for the STU2/STU3/R4 resources</p>",
        "id": 153984238,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533829949
    },
    {
        "content": "<p>I still think we're going to need Transaction and that multiple actions within a suggestion is not sufficient.  That's because Transaction will give us access to th conditional headers and will allow linkage across resources.  If I want to create a Task that says \"please complete Questionnaire X\", the Questionnaire will be a conditional create based on canonical URL and version and the Task will be a create that contains a reference to the Questionnaire.  I don't think I can do that using the 'action' framework.  (Though if we added support for conditional creates/updates to Action and expressed rules for identifier references across actions, that might be sufficient)</p>",
        "id": 153984240,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533830186
    },
    {
        "content": "<p>that sounds really complicated.</p>\n<p>Task -&gt; Questionnaire needs to be tested and implemented ...</p>",
        "id": 153984242,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1533830272
    },
    {
        "content": "<p>Absolutely.  So is your preference extension for purposes of connectathon and then see about pushing it into core?</p>",
        "id": 153984272,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533831319
    }
]