[
    {
        "content": "<p>Has anyone encountered the need for some kind of pre-conditions of a cds-service? Say for a given hook, there is a specific cds service to check if the anti-coagulation treatment is given to an atrial fibrillation (AF) patient according to AF management clinical guidelines. The actual treatment compliance checking is quite involved, but the pre-condition (or inclusion criteria) for that is the patient has AF condition and can be easily determined at client side (EHR). Without some kind of pre-conditions checking/filtering at client side, about 96% of the cds-service calls are meaningless since AF is only about 4% prevalence in general population. </p>\n<p>Other pre-conditions could be patient age group, gender or relevant medications. The point is to avoid unnecessary calls of remote cds-service unless some pre-defined conditions are met.</p>",
        "id": 188580373,
        "sender_full_name": "Rong Chen",
        "timestamp": 1582143216
    },
    {
        "content": "<p>I'm not sure there's been discussion about a mechanism to <em>suppress</em> calls, but I imagine that by pre-fetching the right resources in the hook definition you could make the calls lightweight enough.</p>",
        "id": 188589177,
        "sender_full_name": "Carl Anderson",
        "timestamp": 1582148884
    },
    {
        "content": "<p>Let me know if this is helpful: <a href=\"https://cds-hooks.org/specification/current/#prefetch-template\" target=\"_blank\" title=\"https://cds-hooks.org/specification/current/#prefetch-template\">https://cds-hooks.org/specification/current/#prefetch-template</a></p>",
        "id": 188589686,
        "sender_full_name": "Carl Anderson",
        "timestamp": 1582149246
    },
    {
        "content": "<p>Pre-fetching does help (that's actually what we use) a bit, but it doesn't avoid unnecessary calls (involving round-trip) of remote cds-services.</p>",
        "id": 188615535,
        "sender_full_name": "Rong Chen",
        "timestamp": 1582183646
    },
    {
        "content": "<p>For inspiration, an optional predictions attribute could be added to the service definition:<br>\n{<br>\n      \"hook\": \"patient-view\",<br>\n      \"title\": \"Static CDS Service Example\",<br>\n      \"description\": \"An example of a CDS Service that returns a static set of cards\",<br>\n      \"id\": \"static-patient-greeter\",<br>\n      \"prefetch\": {<br>\n        \"patientToGreet\": \"Patient/{{context.patientId}}\"<br>\n      }<br>\n      \"preconditions\": {<br>\n        \"patient.gender\": \"male\"<br>\n      }<br>\n    }</p>\n<p>To indicate that if the patient.gender isn't male, the client should not proceed to call at all. This does add a bit of complexity to the client-side to process the conditions. Since it's optional, similar to pre-fetch as an optimization, the client can still go ahead to call if it doesn't have the capability to process the pre-condictions.</p>",
        "id": 188616165,
        "sender_full_name": "Rong Chen",
        "timestamp": 1582184620
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192736\">@Rong Chen</span>  this had come up previously and was ultimately scoped out for 1.0, relying on the CDS Client underlying rules engine to handle when to invoke the CDS Service.  You can have a look at the discussion here - <a href=\"https://github.com/cds-hooks/docs/issues/6\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/6\">https://github.com/cds-hooks/docs/issues/6</a></p>",
        "id": 188646359,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1582211757
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191358\">@Dennis Patterson</span> . It's pity since this could bring significant potential for optimization. Any chance to bring it up for v1.1 considerations? If it's optional attribute (thus optional for client to process), it would fit in v1.1. Even with simple criteria like age, gender and single condition would be very useful.</p>",
        "id": 188652670,
        "sender_full_name": "Rong Chen",
        "timestamp": 1582215515
    },
    {
        "content": "<p>Are you suboptimal behavior in a production scenario today? Would be good to understand impact.</p>",
        "id": 188753297,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1582305519
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> Yes, it is based on the observation of production use of our patient-view hook based cds alert for stroke prevention. The relevant clinical guideline is only applicable for atrial fibrillation patient, which is about 2-4 % in general population. In other words, 96-98% of cds-service calls aren't necessary at all if the patient has no documented AF condition. You can find more information about the design of the cds from this publication on the scientific evaluation of the CDS, <a href=\"https://www.ncbi.nlm.nih.gov/pubmed/29534063\" target=\"_blank\" title=\"https://www.ncbi.nlm.nih.gov/pubmed/29534063\">https://www.ncbi.nlm.nih.gov/pubmed/29534063</a></p>\n<p>For a regional EHR that covers half million population (include GPs &amp; specialists care which is perhaps unique in Sweden), this means 10k calls per day (again 96-98% is unnecessary if the client can process some kind of pre-condition or inclusion/exclusion criteria). This is just one service, if we continue to add 20-100 more cds-services one could easily see why the current design isn't optimal.</p>",
        "id": 188809665,
        "sender_full_name": "Rong Chen",
        "timestamp": 1582365061
    },
    {
        "content": "<p>Thanks! The design is assuredly not optimal -- I'm just trying to understand the real-world consequences today, and anticipated consequences down the line. The things we could talk abou are 1) is this slowing down EHR usage for folks? Can this be quantified? 2) is this costing extra $$ in bandwidth or compute? Can this be quantified? 3) Is this preventing adoption of a broader set of services, vs. say steering your organization toward adopting closer-to-the-edge or more-highly-aggregated CDS service deployments? 4) is this causing compliance challenges? Of what nature? </p>\n<p>Other categories?</p>",
        "id": 188821564,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1582385029
    },
    {
        "content": "<p>Apologies for joining the conversation late, Rong. </p>\n<blockquote>\n<p>Has anyone encountered the need for some kind of pre-conditions of a cds-service?</p>\n</blockquote>\n<p>Yes, very much so.</p>",
        "id": 189185922,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1582777418
    },
    {
        "content": "<p>The widely deployed current state is that a CDS Hooks service can co-exist with local CDS rules exactly as you describe. (e.g. only call zika cds service if patient is female). It's not only appropriate, but also often desirable to intermix local CDS rules with remote CDS Hooks services to minimize traffic/compute/cost/UI time. Currently, these \"pre-conditions\" are also locally configured. Some systems/organizations use <a href=\"http://www.hl7.org/fhir/clinicalreasoning-module.html\" target=\"_blank\" title=\"http://www.hl7.org/fhir/clinicalreasoning-module.html\">FHIR Clinical Reasoning</a> to also provide interoperable rules to define pre-conditions. I expect to see more of these \"CQL Hooks\" going forward.</p>",
        "id": 189185923,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1582777423
    },
    {
        "content": "<p>You should determine the cost/benefit analysis of simply documenting the requisite pre-conditions to healthsystems using your service versus building an interoperable description of those rules.</p>",
        "id": 189185924,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1582777427
    },
    {
        "content": "<p>I think that means that there isn't interoperability in the pre-conditions at this time.</p>",
        "id": 189189057,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1582782766
    },
    {
        "content": "<p>but it seems like a reasonable thing to desire to me</p>",
        "id": 189189060,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1582782774
    },
    {
        "content": "<p>Thanks for the confirmation, <span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span> <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span></p>",
        "id": 189487562,
        "sender_full_name": "Rong Chen",
        "timestamp": 1583153309
    }
]