[
    {
        "content": "<p>What guidance does CDS hooks have in situations where multiple cards propose changes to the same resource and a practitioner choses to act on more than one.  E.g. One adds a comment, one adds a link to a study, one adds a pre-existing predtermination, one tweaks the dosage instructions.   Are clients expected to handle this?</p>",
        "id": 153984281,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533833622
    },
    {
        "content": "<p>In theory, yes, for example, an EHR should be able to handle suggestions from multiple services related to the same draft procedure. In practice, this won't really happen very often because health systems won't contract duplicative services.</p>",
        "id": 153984300,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1533835205
    },
    {
        "content": "<p>In the examples I gave, they wouldn't be duplicative services</p>",
        "id": 153984301,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533835233
    },
    {
        "content": "<p>Each of them are dealing with different aspects of the MedicationRequest</p>",
        "id": 153984302,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533835254
    },
    {
        "content": "<p>(Aspects unlikely to be handled by a single service)</p>",
        "id": 153984303,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533835269
    },
    {
        "content": "<p>Yep, the duplicative services is simply the most common scenario that's come up in the past. I think that the answer is that - yes, EHRs should be expected to handle this.</p>",
        "id": 153984305,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1533835331
    },
    {
        "content": "<p>Should I submit a change proposal to highlight that expectation in the spec?</p>",
        "id": 153984307,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533835410
    },
    {
        "content": "<p>sure, I think that the equally important part of a service returning multiple cards is setting accurate UI expectations to maintain usability.</p>",
        "id": 153984312,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1533835541
    },
    {
        "content": "<p><a href=\"https://github.com/cds-hooks/docs/issues/398\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/398\">https://github.com/cds-hooks/docs/issues/398</a></p>",
        "id": 153984320,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533835981
    }
]