[
    {
        "content": "<p>not sure if this is best place to ask, but I see that there was a Contraindication resource in DSTU2, owned by CDS group. What happened to this please? <br>\nContext is that there is now a new resource being proposed <a href=\"http://hl7.org/fhir/medicinalproductcontraindication.html\" target=\"_blank\" title=\"http://hl7.org/fhir/medicinalproductcontraindication.html\">http://hl7.org/fhir/medicinalproductcontraindication.html</a>, but probably being renamed to plain \"Contraindication\". This is needed for regulatory purposes (sending contraindications to regional regulators, as part of drug approvals), and for general drug knowledge base use. BR&amp;R workgroup, and Pharmacy, are looking to get this scope approved and would like input from CDS, and perhaps to combine with the scope of the withdrawn Contraindication resource if desirable.</p>",
        "id": 154251682,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1546535003
    },
    {
        "content": "<p>Changed to DetectedIssue</p>",
        "id": 154253338,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1546536960
    },
    {
        "content": "<p>It probably won't meet your needs though.  It's for a specific instance of a detected issue, rather than a definition of the knowledge that certain types of issues can exist.</p>",
        "id": 154253407,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1546537015
    },
    {
        "content": "<p>Ah yes, thanks. Not the same thing. But would still welcome feedback from CDS, and anyone, on these proposed draft resources. They represent knowledge of how drugs (and possibly other things like food) interact, which may be useful for decision support: MedicinalProductContraindication, MedicinalProductIndication, MedicinalProductInteraction, MedicinalProductUndesirableEffect. All those names will probably drop the MedicinalProduct prefix soon.</p>",
        "id": 154258168,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1546541366
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span></p>",
        "id": 154258621,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1546541727
    },
    {
        "content": "<p>So the intention is that the resources would be able to represent indications, interactions, etc. for a variety of things?  Devices, meds, procedures, lab tests, etc.?</p>",
        "id": 154258701,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1546541801
    },
    {
        "content": "<p>Devices, meds, food perhaps. Things that are given deliberately, rather than substances, or pollen etc.  No objection to procedures and lab tests, if the information is similar. Perhaps contraindications of those but not indications, or you would be saying what surgery or investigation to give for a condition, which starts to be something different.</p>",
        "id": 154259275,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1546542418
    },
    {
        "content": "<p>You could easily have indications for performing a test or a procedure.</p>",
        "id": 154261093,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1546543992
    },
    {
        "content": "<p>Agree in theory but it seems a different type of thing. I would expect e.g. \"if BP over X and no recent history of Y =&gt; check blood Z\". That seems way more complex.</p>",
        "id": 154423312,
        "sender_full_name": "Rik Smithies",
        "timestamp": 1546622864
    }
]