[
    {
        "content": "<p>CDS hooks currently does not allow a CDS Service to act on a change in the patients clinical record. <br>\nWhat would trigger such hook? A change to a resource in the Patients compartment?<br>\nWhat context elements should such hook contain?</p>",
        "id": 277402623,
        "sender_full_name": "Bas van den Heuvel",
        "timestamp": 1648812505
    },
    {
        "content": "<p>CDS Hooks is about hooking into a <em>provider workflow UX</em>; if you are interested in receiving notifications about changes to data, wouldn't subscriptions fit the bill better?</p>",
        "id": 277429604,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1648824667
    },
    {
        "content": "<p>Josh, good suggestion, a hook design based on Subscriptions would be very flexible, maybe a little bit too much.<br>\nThe intend of the hook(s) I would like to explore are workflow UX events where the provider changes the clinical record. E.g. add a condition, observation, risk assessment, ...<br>\nSo far as I see this is currently not covered by the current hooks.</p>",
        "id": 277694516,
        "sender_full_name": "Bas van den Heuvel",
        "timestamp": 1649059121
    },
    {
        "content": "<p>Thanks, that clarifies the concept for me. It's not about whether the record changed but rather whether the current user has taken a step to change the record. That would make sense as a new hook definition  from my perspective.</p>",
        "id": 277735500,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1649081161
    },
    {
        "content": "<p>Is there overlap with FHIRcast here?</p>",
        "id": 277888276,
        "sender_full_name": "John Silva",
        "timestamp": 1649169433
    },
    {
        "content": "<p>Not directly. The workflow actions might trigger FHIRcast events but I do not see FHIRcast dependencies for such hook(s).</p>",
        "id": 278015224,
        "sender_full_name": "Bas van den Heuvel",
        "timestamp": 1649247892
    }
]