[
    {
        "content": "<p>Hi, we just presented our pattern for using a configuration extension with a CDS service to coordinate order-select and order-sign requests. The slides from the presentation are linked below. While we did the work specifically for our use case (drug-drug interaction decision support) it was suggested that this might be a reasonable pattern for consideration for CDS Hooks base. Would there be any interest?  <br>\n<a href=\"https://drive.google.com/file/d/1objq4Ujv01ulVu8sdPDFoFaKNaBZCUZF/view?usp=sharing\">https://drive.google.com/file/d/1objq4Ujv01ulVu8sdPDFoFaKNaBZCUZF/view?usp=sharing</a></p>",
        "id": 197707062,
        "sender_full_name": "Rich Boyce",
        "timestamp": 1589555846
    },
    {
        "content": "<p>Hi Rich! I'm sorry I missed your presentation. It looks like there's a few different capabilities in your slides, are you primarily asking about the order-select/order-sign coordination?</p>",
        "id": 197709608,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1589556890
    },
    {
        "content": "<p>Why is a CDS Client the better choice to \"know\" the information in these extensions, compared to the CDS Service?</p>",
        "id": 197709807,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1589556972
    },
    {
        "content": "<p>Yes, we are focusing on the order-select/order-sign coordination and have a functional solution for our use case but one that might work more generally. I am not sure how to answer your question but would be willing to present again at a time that works for folks who are interested.   Please let me know if there might be interest and how to proceed. Thanks!</p>",
        "id": 197714983,
        "sender_full_name": "Rich Boyce",
        "timestamp": 1589559265
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191358\">@Dennis Patterson</span> - Rich's presentation came up as a discussion topic int he CDS Hooks Breakout earlier this morning. Would it make sense to have another CDS Hooks breakout about order-select/sign coordination today?</p>",
        "id": 197716094,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1589559797
    },
    {
        "content": "<p>We have our final sync scheduled for 3PM ET.  It's mostly a final chance to see everybody and touch base on anything else uncovered during testing beyond what we've previously discussed.  We'd be glad to have <span class=\"user-mention\" data-user-id=\"196276\">@Rich Boyce</span> stop by and chat and/or run through slides for this type of advanced coordination!</p>",
        "id": 197716482,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1589559965
    },
    {
        "content": "<p>I will be there!</p>",
        "id": 197716587,
        "sender_full_name": "Rich Boyce",
        "timestamp": 1589560017
    },
    {
        "content": "<p>Hi, following up on this. We think we are have a fairly general mechanism for coordinating between order-select and order-sign hooks to do card filtering. The mechanism requires  a configuration extension. We discussed and presented this at the last connectathon. We have quite a bit written up about it in our draft IG for drug interaction decision support (<a href=\"http://build.fhir.org/ig/HL7/PDDI-CDS/cds-service-spec.html#-360--cds-message-filtering\">http://build.fhir.org/ig/HL7/PDDI-CDS/cds-service-spec.html#-360--cds-message-filtering</a>). The IG team thinks that the mechanism is general enough that it should be proposed as an enhancement to CDS Hooks rather than just in the drug interaction IG. How would I go about posting this enhancement request? Would I create an issue on <a href=\"https://github.com/cds-hooks/docs/\">https://github.com/cds-hooks/docs/</a> or some other way? thanks</p>",
        "id": 200773313,
        "sender_full_name": "Rich Boyce",
        "timestamp": 1592064506
    }
]