[
    {
        "content": "<p>Hi,<br>\nI am working now on building a cds service, the service will have one hook only (order-select) with some custom logic for the CDS, yet I want it to be able to handle CQL in the future.<br>\nI am choosing between Javascript and Golang. but I couldn't find libraries that parse CQL for both, any idea if there are already existing ones?</p>",
        "id": 175402540,
        "sender_full_name": "Ahmed Mohamed",
        "timestamp": 1568179751
    },
    {
        "content": "<p>I know there's FHIRPath for JavaScript (which is a large chunk of CQL).</p>",
        "id": 175426297,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1568205352
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"215438\">@Ahmed Mohamed</span> -- we built a CQL execution framework using coffeescript, which compiles to JavaScript.  It's available on NPM and the GitHub repo is here: <a href=\"https://github.com/cqframework/cql-execution\" target=\"_blank\" title=\"https://github.com/cqframework/cql-execution\">https://github.com/cqframework/cql-execution</a></p>\n<p>That repo is just the logic portion of CQL, so you'd also want our cql-exec-fhir patient source implementation (<a href=\"https://github.com/cqframework/cql-exec-fhir\" target=\"_blank\" title=\"https://github.com/cqframework/cql-exec-fhir\">here</a>) to work with a FHIR data model.  Last you need a way to resolve value sets -- there's a basic in-memory code service example in the main repo, but there is one that works with VSAC <a href=\"https://github.com/cqframework/cql-exec-vsac\" target=\"_blank\" title=\"https://github.com/cqframework/cql-exec-vsac\">here</a>.</p>\n<p>Probably the easiest way to see how they all work together is by looking at our <a href=\"https://github.com/cqframework/cql-exec-examples\" target=\"_blank\" title=\"https://github.com/cqframework/cql-exec-examples\">cql-exec-examples</a> project.</p>",
        "id": 175433269,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1568209737
    },
    {
        "content": "<p>There are some limitations.  For example, it requires you to pass in all the FHIR data for the patient as a bundle.  It does not make dynamic queries to FHIR itself.</p>",
        "id": 175433603,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1568209926
    },
    {
        "content": "<p>Last, I'd point you to the CQL Services project that was developed as part of AHRQ's CDS Connect project.  It provides a mechanism for exposing CQL logic through a CDS Hooks interface (and leverages the cql-execution framework above).  It has a similar limitation, however, in that it only supports data passed in through <code>prefetch</code>; it does not support dynamic query of the FHIR server.</p>",
        "id": 175434673,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1568210503
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"215438\">@Ahmed Mohamed</span> , there's also a Java-based implementation, containing many of the same components that Chris identified above, but Java versions. There's a <a href=\"https://github.com/cqframework/clinical_quality_language/wiki/Community-Projects\" target=\"_blank\" title=\"https://github.com/cqframework/clinical_quality_language/wiki/Community-Projects\">community projects</a> page that lists known open source projects.</p>",
        "id": 175454048,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1568221902
    }
]