[
    {
        "content": "<p>Naïve, stream newbie, question here - but would CDS Hooks be an appropriate API to use for CVD Risk Assessments and, if so, are there any examples of this use case?</p>",
        "id": 153859498,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1480560006
    },
    {
        "content": "<p>there's a smart on FHIR app for this - I would've thought you'd need interactive access to the UI to do it properly - but perhaps you could show a bare risk with a link to see the full risk assessment</p>",
        "id": 153859502,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1480560308
    },
    {
        "content": "<p>Thanks, Grahame. I did wonder about SMART on FHIR, but there is an NZ-specific assessment algorithm (includes NZ Ethnicities) so I'm not sure if the existing SMART app could be configured to handle this or whether we'd have to develop our own.</p>",
        "id": 153859503,
        "sender_full_name": "Peter Jordan",
        "timestamp": 1480560807
    },
    {
        "content": "<p>no you'd write your own. Though have you looked at Dan's latest smart on fhir sandbox?</p>",
        "id": 153859504,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1480560859
    },
    {
        "content": "<p>I've thought quite a bit about a CVD risk assessment CDS Hooks card and provided all of the data needed for the calculation were available via the FHIR server, you could display a simplified view fo the score in the card with a link to a SMART app to view a more rich view of that same data.</p>",
        "id": 153863286,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1481666467
    },
    {
        "content": "<p>But, if there is any missing information in FHIR that is necessary for the calculation, the only thing you could do is return a card that links to the SMART app where the user could interact with the UI to enter in the missing data (this is what the current Cardiac Risk SMART app allows for today)</p>",
        "id": 153863288,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1481666526
    }
]