[
    {
        "content": "<p>Hi guys,</p>\n<p>We have a use case that I am looking into solutions to for when GuidanceResponse faces deprecation. We have a partner that would like to interact with our CDS system through suggestion cards, allowing them to handle card rendering (as opposed to within an app). To overcome the lack of XOR in a suggestion card, we are returning a RequestGroup (in a GuidanceResponse). Sometimes, further data is required. In which case we return a DataRequirement in the GuidanceResponse. If all this data was available on their FHIR server, read and search operations are sufficient.. but with slow FHIR adoption that data won't always be structured (it's often things like H&amp;P observations) and we have to ask the user for it. Also, in the case where some test result isn't back, it would be a way of indicating the results the service is waiting for</p>\n<p>With GuidanceResponse gone, there won't be a good resource to send a DataRequirement in. </p>\n<p>Does anyone have a suggestion for sending DataRequirement's in this situation?</p>\n<p>Thanks</p>",
        "id": 153900170,
        "sender_full_name": "Travis Stenerson",
        "timestamp": 1501699807
    },
    {
        "content": "<p>It sounds like the system you're dealing with has the opportunity to send this data via some means. Can that just be included in the CDS Service request as a custom field?</p>",
        "id": 153900414,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1501784141
    },
    {
        "content": "<p>Hmm, I did a search and found this one from a few years ago. I apparently have the same question today. Has this been solved since (e.g. ask the user for missing information when calling a hook)?</p>\n<p>Initially, I was thinking in this case of returning a link card to a questionnaire (i.e. questionnaire service that would also use CDS Hooks). That link would include the hookInstance or something so I could maintain state.</p>",
        "id": 180684923,
        "sender_full_name": "Brian Kaney",
        "timestamp": 1573687899
    },
    {
        "content": "<p>Hey Brian, an app link card can maintain state through the appContext field. This enables a system to associate a cds hooks interaction with an app launch.</p>",
        "id": 180689880,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1573692892
    },
    {
        "content": "<p>Since the original question, the suggestion/action structure and selectionBehavior field also enable XOR.</p>",
        "id": 180689908,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1573692953
    }
]