[
    {
        "content": "<p>Has there been any interest in a hook that just validates the data? Where this validation is to a set of local profiles or such. I am thinking things like data entry use-cases to validate the data is not a fat-finger oops. Patient weighs -10 lbs.</p>",
        "id": 249892980,
        "sender_full_name": "John Moehrke",
        "timestamp": 1629311701
    },
    {
        "content": "<p>(yes, i know the example I gave is just a profile validation... but I am thinking of validation as a service, where that service could be more complex than a profile might expose -- and might be more simply implemented than using the FHIR validation service)</p>",
        "id": 249893259,
        "sender_full_name": "John Moehrke",
        "timestamp": 1629311824
    },
    {
        "content": "<p>How would that manifest to the end user?  Keep in mind that they're going to be looking at a screen and have no idea what a profile is - or what their data is called in FHIR.  There's also no ability in CDS Hooks right now to tie a message to a data element in a resource (or any expected capability for a service to propagate such a link back to an element in the UI).</p>",
        "id": 249916538,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1629323554
    },
    {
        "content": "<p>I was thinking maybe John meant in cases where CDS hooks are used as part of our own developer tooling?</p>",
        "id": 249917812,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1629324344
    },
    {
        "content": "<p>I was merely expecting that the response to the hook would indicate good vs bad; and if bad there would be a reasonable user consumable message. I was not expecting an implementation existed. I was looking for if the hook was \"defined\", as I don't see one like this in the list of defined hook types.</p>",
        "id": 249978599,
        "sender_full_name": "John Moehrke",
        "timestamp": 1629376132
    }
]