[
    {
        "content": "<p>Hi, I have a CDS Hooks server that allows authors of services to specify relative dates in the FHIR queries utilized by that service.  For example, \"Get all instances of a certain lab that the patient has had in the last 6 months...\" or \"Get all inpatient encounters the patient has had in the last 30 days\".  When a client invokes a service and doesn't prefetch resources, my server can substitute these relative date expressions with an actual date.  The issue is that in the discovery response, I'm not aware of any way to specify a relative date in the prefetch URLs, and if I replace the relative date expressions with actual dates at the time discovery response is generated, then if the client caches the services in the discovery response, those prefetch URLs will grow \"stale\" over time.</p>\n<p>Any idea how to handle this? Should servers avoid using date parameters in prefetch URLs? Should clients always hit the discovery endpoint before invoking a service to make sure prefetch URLs are fresh? Perhaps there could be a supported syntax to specify a relative date in prefetch URLs?</p>",
        "id": 242229856,
        "sender_full_name": "Jorge de la Garza",
        "timestamp": 1623340878
    },
    {
        "content": "<p>This is a great use case; agreed it could be done through an enhancement to the prefetch syntax. (<a href=\"http://hl7.org/fhirpath/#subtraction-2\">http://hl7.org/fhirpath/#subtraction-2</a> provides a standard and a syntax that we could embed if we wanted this.)</p>",
        "id": 242257975,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1623353284
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>. Should I enter this issue in Github or Jira or what is the process for this?</p>",
        "id": 242353555,
        "sender_full_name": "Jorge de la Garza",
        "timestamp": 1623421975
    },
    {
        "content": "<p>Starting with discussion here to judge interest seems like the right first step.</p>",
        "id": 242353816,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1623422081
    },
    {
        "content": "<p>Doesn't fhirpath have something similar for fhirpath query?<br>\nWhere you can use {{today() - 6 month}}</p>",
        "id": 242472640,
        "sender_full_name": "Brian Postlethwaite",
        "timestamp": 1623532165
    },
    {
        "content": "<p>Indeed! (This is what I linked to in my post above.)</p>",
        "id": 242488097,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1623556480
    },
    {
        "content": "<p>We have a similar need for specifying relative date expressions in our prefetch template. +1 for this request <span class=\"user-mention\" data-user-id=\"192535\">@Jorge de la Garza</span>  and the proposed approach.</p>",
        "id": 244214202,
        "sender_full_name": "Aziz Boxwala",
        "timestamp": 1624920455
    },
    {
        "content": "<p>Why wouldn't this be a change to the FHIR search parameters, instead of just CDS Hooks?</p>",
        "id": 254404552,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1632331174
    },
    {
        "content": "<p>You could take a look at the x-fhir-query specification <a href=\"http://build.fhir.org/ig/HL7/sdc/expressions.html#fhirquery\">currently defined</a> in the SDC IG.  We could possibly migrate this into R5 if there was a desire to use it outside SDC.</p>",
        "id": 254424028,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632338822
    },
    {
        "content": "<p>That's neat. We'd need to either change the current prefetch tokens to be valid FHIRpath, or change our {{ }} delimiters.</p>",
        "id": 254428645,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1632340569
    }
]