[
    {
        "content": "<p>One of the use-cases we're looking at for the next release of the Da Vinci CRD specification is allowing the creation of 'deferring' a SMART app launch.  Specifically, if a provider is ordering something that requires a prior authorization, CRD will currently pass back a card allowing launching of a SMART app allowing the simplified capturing of information needed for that prior authorization.  However, the reality is that in many practices, the process of gathering that information might not be done immediately when the patient's in the room - and might not even always be done by the ordering practitioner.</p>\n<p>The initial thought was to pass back a card with two options - launch the SMART app or create a Task allowing the launch (complete with appropriate context) to be scheduled for later.  And that's what we'll still do if we can't find a better way.  However, the approach suffers from a few limitations</p>\n<ul>\n<li>there's no mechanism to allow the provider to choose whether they want the Task assigned to themselves, someone else or possibly leave it unassigned</li>\n<li>there's no ability to indicate priority or desired timing for completion</li>\n<li>there's no ability for the provider to adjust any other aspects of the Task  at the time it's created.</li>\n</ul>\n<p>It seems to me that 'deferring' a card is a pretty general set of functionality that would be useful on a wide variety of cards.  \"Would you like to review ABC's opioid prescribing guidelines?\" - \"Yes, but not now\".  \"Consider putting this patient on a diuretic as well\" - \"Good idea, but I want to think about it more/talk with their GP first\".</p>\n<p>This wouldn't even necessarily involve technical changes to the CDS Hooks spec, as it would really just be EHR functionality with no particular interoperability considerations.  Really, it would just involve some guidance around the types of cards that might be deferred and a recommendation to provide support for that.  I suppose it might be possible to add a flag on a card about whether a given card should be deferrable, but I'm not sure that should be decided by the service.  It might also have some impact on capturing Feedback - so you would know if something was deferred and also be able to track whether it was acted on eventually.</p>\n<p>Thoughts?</p>",
        "id": 250783975,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1629989229
    },
    {
        "content": "<p>Agreed this is an important UX consideration -- and I agree that it needn't involve much if any change to the spec. It'd be worth writing out what we think the UX guidance might be, in conjunction with CDS Clients to understand what's possible/likely (and in what kind of step-wise fashion, and over what time-course).</p>",
        "id": 250951265,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1630079241
    },
    {
        "content": "<p>I'm not sure that routing SMART apps to other users is really within the scope of a synchronous alert covered by CDS Hooks. <br>\nOne possibility is to create a suggestion that could read something like \"push to PA queue\" or \"push to my 'to do' list\" which would write something to a monitored database which could then create a task for someone else to fill out or for the clinician to fill out later or potentially do routing. There seem to be a lot of subtleties that could get quite complicated. </p>\n<p>The spec doesn't specify what the client should do if a client ignores or overrides a card. <br>\noverride forever? until the next time I log in? show again in five minutes?<br>\nSome of this will also do with how the client chooses to display the card. Is it an interruptive alert or does it just show up in a side panel?</p>\n<p>Deferring a card could be a special override case where the user sees something like \"snooze for 5 minutes\" <br>\nFeedback is sent that the card was overridden. The client could choose to recall the service in 5 minutes.</p>\n<ul>\n<li>Thinking about this again maybe it makes more sense to think of it as a special case of  \"ignore\" - no feedback is sent until the user decides to \"meaningfully\" interact with a card.</li>\n</ul>",
        "id": 250962146,
        "sender_full_name": "Frank Pandolfe",
        "timestamp": 1630083890
    },
    {
        "content": "<p>My primary concern here isn't the feedback given, it's that the action that needs to be taken at some point is one that doesn't necessarily need to happen right away.  In that case, the user should have the ability to 'track' the item as a to-do and, if appropriate, assign it to someone else.  The alert definitely needs to be synchronous.  The recommended action doesn't always need to be.</p>",
        "id": 250972061,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1630088137
    },
    {
        "content": "<p>The action of the suggestion could be to  create a task on a task management system. Once there, it is up to that system to manage all the tracking.</p>",
        "id": 250976756,
        "sender_full_name": "Frank Pandolfe",
        "timestamp": 1630089893
    },
    {
        "content": "<blockquote>\n<p>I'm not sure that routing SMART apps to other users is really within the scope of a synchronous alert covered by CDS Hooks.</p>\n</blockquote>\n<p>I wouldn't describe this as routing a card; I'd describe it as the user receiving a suggestion from the card, and the CDS Client helping the user act on that suggestion in a useful/convenient fashion.</p>",
        "id": 250978241,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1630090530
    },
    {
        "content": "<p>There are some important technical implications though, especially if the SMART App Launch takes advantage of an <code>appContext</code> param -- how long does the CDS Service need to honor <code>appContext</code> for, and is it bound to any particular security context?</p>",
        "id": 250978430,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1630090598
    },
    {
        "content": "<p>How would the CDS service be involved in honoring the appContext when the SMART app is launched?  I wasn't aware that the SMART app talked to the CDS Service.  The app context is just a chunk of data that gets passed into the launch.</p>",
        "id": 250978719,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1630090700
    },
    {
        "content": "<p>The <code>appContext</code> may not be stateless; it may be something like... a large random number that acts as a database key to a record that the CDS Service can write, and the SMART App can read.</p>",
        "id": 250980623,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1630091464
    },
    {
        "content": "<p>If the database is keeping that state alive for 2h and then clearing it (more than enough time for a provider to click an app link in any normal scenario) this is an assumption that will fall flat in a world where \"suddenly we're going to stick Tasks on someone's queue for next Monday\".</p>",
        "id": 250980797,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1630091524
    },
    {
        "content": "<p>Clinician is working in a patient chart, is writing a medication and receives a CDS Hooks Card indicating that pre-auth is needed. The card contains a link to a SMART app (among several other possible pieces of information including the appContext) where a clinician fills out a FHIR Questionnaire. The clinician:</p>\n<p>Scenario 1: Completes the questionnaire in real-time</p>\n<ul>\n<li>this is the \"expected\" workflow and does not seem to pose any issues</li>\n</ul>\n<p>Scenario 2: Defers the completion for several minutes while still in the patient chart</p>\n<ul>\n<li>Sill seems fine. The appContext is probably still valid. How to defer the card in this case is up for discussion.</li>\n</ul>\n<p>Scenario 3: Leaves the patient's chart and defers the completion until \"some later time\" be it several hours or several days. </p>\n<ul>\n<li>Do I want to create a \"reminder\" to myself to go back and do this? <br>\n         3.1 No reminder; clinician will remember.<div class=\"codehilite\"><pre><span></span><code>         -  Clinician navigates back to the chart, the CDS Hooks service is recalled and the appContext is refreshed\n   3.2 Yes, reminder;\n\n        - Create a task to remind me to go back into that patient&#39;s chart and prescribe that medication.\n</code></pre></div>\n\n</li>\n</ul>\n<p>Scenario 4: Determines that someone else should fill out the pre-auth</p>\n<ul>\n<li>Create a task to tell that someone else to fill out the pre-auth</li>\n</ul>\n<p>Scenario 5: Partially fill out a questionnaire via a SMART app and come back later to complete it or ask someone else to complete the rest. </p>\n<ul>\n<li>i don't want to think about that one yet. </li>\n</ul>\n<p>I wasn't trying to describe Scenario 3.2 and 4 as the routing of cards. I was trying to convey the idea that a synchronous notification protocol should not be responsible for task management or result routing. <br>\nI suggest one way to potentially get around that is to use the suggestion field. The action associated with that suggestion could create a FHIR Task resource and write it to some server that has a task management system on it. The task management system would be responsible for urgency, contacting people, sending messages, etc. Whoever picks up the task would have to have access permissions and launch the app from whatever system they are in. That system would be responsible for providing any further appContext.</p>\n<p>Of note, I'm not as familiar with the SMART app launch sequence and if launching a SMART app in a new window is allowed, but there would be a clinical risk if we  allowed a clinician to launch a SMART app in a new window with the appContext of Patient A, then allow the clinician to navigate to Patient B, while keeping the app launched with the context of Patient A. The clinician could get confused who's SMART app is up on the screen.</p>",
        "id": 250998711,
        "sender_full_name": "Frank Pandolfe",
        "timestamp": 1630099971
    },
    {
        "content": "<p>Re: confusion, EHRs manage smart app launch in patient context; the app learns whether it needs to display a patient banner. If the EHR supports having more than one patient chart open at a time, the usual UX should disambiguate.</p>",
        "id": 251005027,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1630103661
    },
    {
        "content": "<p>3.2 is clearly an EHR experience outside the protocol, IMHO. any management or creation of \"tasks\" would be an internal detail.</p>",
        "id": 251005111,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1630103754
    },
    {
        "content": "<p>For #3.1/3.2,  you can't re-trigger the \"order sign\" hook once the order is already signed and printed.  More is needed than a reminder Task.  You actually need to store the card information because you won't be able to re-generate it later.</p>\n<p>I <em>can</em> write a FHIR Task, but don't really want to because that doesn't allow the user to indicate who the Task owner should be (if they're deferring, it's quite probable it won't be the clinician), nor is it possible to fill in other information like urgency or timeframe.  Finally, it places whether a card is \"deferrable\" in the hands of the CDS service, which isn't ideal.  Having it as part of the spec means that it's now a UI function of the EHR where filling out other task-cue stuff can be handled, it can be available everywhere, and considerations about things like \"how long does the context need to be valid\" can be addressed.</p>",
        "id": 251008512,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1630106221
    },
    {
        "content": "<p>Understood. I'd start with implementation inside the EHR UX and feed changes into the spec based on that experience. It's too easy for the spec to get far ahead of implementations otherwise.</p>",
        "id": 251009078,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1630106626
    },
    {
        "content": "<p>The question from a CDS Hooks perspective is: should we be building in an expectation for CDS Services to include a \"create Task\" alternate action with some custom parameters to store the information needed to launch the SMART app later; or would the EHRs rather build this as a generic piece of functionality?</p>",
        "id": 251021787,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1630119340
    },
    {
        "content": "<p>I would argue that a CDS service should not provide this functionality. I believe it is outside the scope of a CDS service to do so. Additionally. offering the option of tasks for later time or a different user is admitting that we have failed at least a couple tenets of the five rights of clinical decision support .</p>",
        "id": 251023743,
        "sender_full_name": "Frank Pandolfe",
        "timestamp": 1630121401
    },
    {
        "content": "<p>Saying \"this thing you're ordering requires prior authorization, would you like to launch a SMART app to optimally apply for it\" is best done at the time the order is being written, even if the clinician doesn't want to be the one to use the app.  There's no other point in the workflow it can easily  be triggered.  \"X needs to be done now\" sometimes translates to \"The decision on who is going to do X and when needs to be made now\".</p>",
        "id": 251062284,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1630163565
    },
    {
        "content": "<p>I don't think it can be universally assumed that \"at time of order\" is the only, or even the best suited trigger point. There are systems that allow pending, multi-step order signing, and probably other mechanisms, where the trigger point can be executed.</p>",
        "id": 251142645,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1630254374
    },
    {
        "content": "<p>The hook points we have defined are \"order-select\" and \"order-sign\".  My point is that it's common for prior authorization to happen after the order is signed - and once signed, there isn't going to be a workflow point in a standard defined hook that would allow the relevant decision support to be triggered.</p>",
        "id": 251151170,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1630263595
    },
    {
        "content": "<p>What I was thinking about was:</p>\n<ol>\n<li>Order sign - DS trigger</li>\n<li>As result of DS, order is pended/moved to a work queue, or something else</li>\n<li>Order sign - DS trigger again</li>\n<li>Etc. - repeat as needed.</li>\n</ol>",
        "id": 251152586,
        "sender_full_name": "Vassil Peytchev",
        "timestamp": 1630265097
    },
    {
        "content": "<p>But the order can't necessarily be 'pended'.  Simple case of a prescription, the order needs to be signed, printed and handed to the patient before they leave, even if the prior authorization work will be done by someone an hour later.</p>",
        "id": 251153117,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1630265740
    },
    {
        "content": "<p>So in these cases the EHR would not offer to defer. I have a feeling EHR developers could discover the heuristics pretty quickly to optimize this experience. It's what they do!</p>",
        "id": 251156354,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1630269408
    },
    {
        "content": "<p>Right.  But the EHR still needs to hold onto the SMART app link so the prior auth can be done later.  The question is whether that should be handled by the EHR (my preference) or be one of the options on the card (which results in a less-satisfactory user experience because the user then has to go in to manipulate that Task queue to establish ownership, priority, etc.)</p>",
        "id": 251159673,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1630273051
    },
    {
        "content": "<p>Perfect. Is anyone arguing for \"options on the card\"? Reviewing the thread: Lloyd, Vassil,  Frank, and I aren't, as far as I can tell.</p>",
        "id": 251159953,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1630273374
    },
    {
        "content": "<p>If we don't have \"options on the card\", then we need \"functionality in the EHR\" - and I haven't heard arguing for that either...</p>",
        "id": 251160953,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1630274479
    },
    {
        "content": "<p>No matter how it is integrated, this feature requires buy-in from EHRs.</p>",
        "id": 251175249,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1630289580
    },
    {
        "content": "<p>Just a thought, this is something the CDS service initiates and tracks, if the CDS service knows the data is still pending, can't it just present a new card when patient-view is called again?</p>",
        "id": 251192170,
        "sender_full_name": "Bas van den Heuvel",
        "timestamp": 1630307928
    },
    {
        "content": "<p>Looking up a patient and having it flag that there are 20 potentially active orders for which prior authorization might be required doesn't seem super-friendly to me.  There wouldn't be a good way to track which ones the patient's decided to pay out of pocket or has gone through the steps already and determined that prior authorization wasn't required, etc.</p>",
        "id": 251252471,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1630339659
    },
    {
        "content": "<p>I think this is a really interesting use case to think about. It seems to involve a task (filling out a SMART on FHIR questionnaire) that is triggered in a synchronous workflow. However, if the filling out of the form does not happen in the expected workflow, it crosses over into an asynchronous workflow. How do we hand off the responsibility from CDS Hooks to something else?</p>",
        "id": 251263320,
        "sender_full_name": "Frank Pandolfe",
        "timestamp": 1630344278
    },
    {
        "content": "<p>That's exactly the question.</p>",
        "id": 251267248,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1630345991
    },
    {
        "content": "<p>What is preventing EHRs from implementing or experimenting with UX options here, without CDS Services having to do anything special?</p>",
        "id": 251275737,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1630349376
    },
    {
        "content": "<p>Then we're back to the beginning. </p>\n<p>Lloyd, it seems as though you initially suggested that a card should return an option to create a task. A task meaning an asynchronous process for a user to go back and fill out a SMART on FHIR app. </p>\n<p>Where do propose that the infrastructure needed to create a task lives? Is it part of CDS Hooks? Part of the client responsibility? </p>\n<p>I also think the solution to this likely lives on the client side. I'm not sure what additional functionality you would like CDS Hooks to supply in order to make the workflow happen.</p>",
        "id": 251276416,
        "sender_full_name": "Frank Pandolfe",
        "timestamp": 1630349674
    },
    {
        "content": "<p>The Da Vinci requirement is that when a card is returned, the provider needs to be able to assign it to be dealt with later (by themselves or someone else).  One approach to do that is to have a card return an action that creates a Task.  However, it's cleaner if the CDS Hooks implementations just generically allowed that functionality because they could then do things with the UI (assigning owner, timeline, priority) that couldn't easily be managed with a CDS Service initiated Task.  While EHRs could just choose to implement deferral and assignment of cards for subsequent handling independent of the CDS Hooks spec, it seems like something the CDS Hooks specification should speak to at least a little bit:</p>\n<ul>\n<li>to say that it's possible (or even recommended)</li>\n<li>to provide guidance about the types of cards that make sense to allow deferral of vs. not - if such guidance can be provided generically</li>\n<li>to talk about implications for card feedback</li>\n<li>to talk about implications for launch context duration (as mentioned by Josh earlier in the thread)</li>\n<li>to consider whether cards should be explicitly be marked as 'appropriate to defer'</li>\n<li>maybe other things</li>\n</ul>\n<p>If the EHR community says they're happy to start addressing deferral of cards as a generic process, then CRD will likely do nothing and allow that guidance to develop.  If they don't want a generic process, then we'll proceed with defining the Task-based approach even though it's not as ideal.</p>",
        "id": 251297202,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1630358562
    },
    {
        "content": "<p>I think there are two types Deferring. </p>\n<ol>\n<li>short term defer. (i.e. still working in patient chart and want to dealt with CDS, just not now.<br>\nYou mentioned: \"Would you like to review ABC's opioid prescribing guidelines?\" - \"Yes, but not now\". <br>\nI would view this as potentially a \"snooze\".<br>\nIn terms of feedback, i think that snoozing is an ignore until the clinician \"meaningfully\" interacts with a card</li>\n</ol>\n<ul>\n<li>i don't think this use case really is what you're asking about though. </li>\n</ul>\n<ol start=\"2\">\n<li>longer term defer. - create a task and deal with it later.<br>\nTo accomplish, I think this can be implemented with a suggestion that has an associated action that would kick off this workflow,  as opposed to launching the app, then deciding what to do.  <br>\nLaunching the  app  with the correct context would be done in the secondary  workflow<br>\nFor feedback, it would show that a particular suggestion was taken. </li>\n</ol>\n<p>I don't think the spec has to say anything additional in regards to say that deferring is possible or recommended or what type of cards make sense to defer. I think those are implementation details. </p>\n<p>If you have other specific recommendations, I'd be interested to hear what they are.</p>",
        "id": 251405573,
        "sender_full_name": "Frank Pandolfe",
        "timestamp": 1630424181
    },
    {
        "content": "<p>I'm not sure about how 'snoozing' would work when a provider is context switching between different workflows.  A card can't very well \"wake up\" when the provider is now in a different workflow.  And once a workflow is 'complete' (appointment booked, referral sent, order printed), the provider won't ever be \"coming back\"</p>\n<p>I'm also not sure what the 'secondary workflow' would be in my case.  Once the order is printed or the appointment is booked, if prior authorization is needed, what 'hook' would fire later on that would be appropriate to display the \"fill out your prior authorization\" SMART app launch?  Patient-view would get super noisy and I can't think of another trigger point that'd be more specific.</p>",
        "id": 251407391,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1630424825
    },
    {
        "content": "<p>I think case one is for the EHR client implementation to figure out</p>\n<p>I think case two is for the secondary workflow to figure out (something like a task manager that we've discussed). Once the CDS hooks service has displayed the card and the clinician has taken action, from the CDS Hooks workflow perspective, the service has done its job. end of story.  that means there is no longer a \"hook\" to call. CDS Hooks service has completed and and now it is up to that other process to figure out.</p>",
        "id": 251410213,
        "sender_full_name": "Frank Pandolfe",
        "timestamp": 1630425627
    },
    {
        "content": "<p>I agree the hook service has done its job.  However, the 'card' may still need to be dealt with.  If a card is acted upon 2 days later, you presumably still want to know that in 'feedback'.  We can't presume there's going to be another workflow that's going to trigger the same card.</p>",
        "id": 251410702,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1630425778
    },
    {
        "content": "<p>the card has been dealt with. and the \"same card\" doesn't need to be triggered. The function of the \"card\" you want dealt with as a follow up is the clicking of a SMART on FHIR app to fill out the pre-auth. not anything else to do with the card. It is this secondary workflow outside of CDS Hooks  that somehow indicates a pre-auth still needs attention. If it is launching a SMART on FHIR app, that can be done outside the context of CDS Hooks.</p>",
        "id": 251415830,
        "sender_full_name": "Frank Pandolfe",
        "timestamp": 1630427850
    },
    {
        "content": "<p>A card has been provided.  The user doesn't want to act on it yet, but does want to act on it in the future.  The \"closed loop\" of the feedback mechanism should indicate that it's been acted on when it eventually is.  The card might be to launch a smart app, but it could also be to create some other order, to read a PDF or to do various other things.  Any one of those might be something the user wants to \"do later\" or \"get someone else to do later\".  And we can't count on the workflow that led to the original card being repeated to retrigger the card.</p>",
        "id": 251418244,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1630428919
    },
    {
        "content": "<p>That <em>seems</em> to me to be something that CDS Hooks can/should speak to</p>",
        "id": 251418873,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1630429189
    },
    {
        "content": "<p>\"The user doesn't want to act on it yet\"  - This is the definition of \"ignore\"<br>\n\"The \"closed loop\" of the feedback mechanism should indicate that it's been acted on when it eventually is\" - it will, if the card is re-triggered</p>\n<p>\"We can't count on the workflow that led to the original card being repeated to retrigger the card\"  - i disagree</p>",
        "id": 251420511,
        "sender_full_name": "Frank Pandolfe",
        "timestamp": 1630429786
    },
    {
        "content": "<p>Ignore can be three substates - I don't care now and I never will; I care, but I'll deal with it later; I care and I'll get someone else to deal with it later.  What, specifically, does the user need to do to ensure that when later comes, they can still act on the information, or put the action in someone else's queue to address?  How is the workflow that led to the original card being triggered (e.g. creating an appointment) going to get re-triggered once the appointment is made?  I've heard assertions that it's possible.  No one has yet explained to me what the user would do in the EHR interface to make it happen.</p>",
        "id": 251421082,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1630430029
    },
    {
        "content": "<p>for cases two and three... you are trying to shove an asynchronous workflow into a synchronous protocol. </p>\n<p>see what i said above:<br>\nlonger term defer. - create a task and deal with it later.<br>\nTo accomplish, I think this can be implemented with a suggestion that has an associated action. </p>\n<ul>\n<li>that action creates a task that guides the user to do something</li>\n</ul>",
        "id": 251422760,
        "sender_full_name": "Frank Pandolfe",
        "timestamp": 1630430677
    },
    {
        "content": "<p>In the real world, a prior authorization questionnaire won't be filled out in a single pass. Provider staff would want to open the app, fill some details, save that. Review the chart / call the patient, gather additional information, open the app again, fill more details, repeat.. Even passing the baton among multiple staff. Likewise, even after the questionnaire is filled out, there may be a desire to review the data before PAS submission.</p>\n<p>So CDS Hooks having the ability to defer will only address the first iteration of this. And therefore, I can't see CDS Hooks being the right place for this.</p>\n<p>Whereas, what is really needed is a repeatable ability to open the SMART App. I personally don't know how this is going to be covered in \"standards\" for interchange of data. This is workflow, and the EHR will have to store off the SMART App URL understanding it is a prior authorization app, and allow the app to be launched multiple times ?</p>",
        "id": 251423750,
        "sender_full_name": "Matt Varghese",
        "timestamp": 1630431053
    },
    {
        "content": "<p>The foundation of CDS Hooks is indeed synchronous.  But the foundation is also solving real-world issues.  And if it turns out that some of the real-world problems involve the synchronous response needing to be handled asynchronously, that seems like something the standard <em>could</em> address.  (And in my opinion, <em>should</em> address.)</p>\n<p>I'm happy for the outcome to be a Task.  The question is how do we set an expectation that the user can right-click (or perform some other EHR-specific gesture) on a card to create the Task, including being able to fill in details like owner and timeframe?  Also, what's the best way for a Task to represent what's in the card?  Both of those questions seem to me like things that CDS Hooks could address.  If those questions are asked, then the process of launching (and re-launching if necessary) the SMART app could absolutely be managed outside the boundaries of CDS Hooks.  (As could later instantiation of a suggested order or launching a browser to read a PDF during a slower period of the shift.)</p>",
        "id": 251427423,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1630432514
    },
    {
        "content": "<p>I'm getting a bit worried about the statement \"I'll deal with it later\". I do see value in asking the EHR to something at the practitioners convenience, but whether this is possible (and <strong>safe</strong>) highly depends on the advice that has been given. The advice is given based on the data available when the original call has been made. Any change in the clinical data may invalidate the advice and could result in an <strong>unsafe/dangerous</strong> advice. In the case a advice has not been acted on or completed. A re-run of the CDS service would allow the CDS service to decide what the appropriate advice is at that point in time.</p>",
        "id": 251514274,
        "sender_full_name": "Bas van den Heuvel",
        "timestamp": 1630480923
    },
    {
        "content": "<p>the card will have an indicator field which will indicate the \"severity\" of the returned card. and the available suggestion presented to the user could be based on the indicator.  It would be up to the person writing the card to  help prevent unsafe actions. </p>\n<p>This is another reason why the ability to \"deal with it later\" should be an action<br>\n<a href=\"https://cds-hooks.org/specification/current/#action\">https://cds-hooks.org/specification/current/#action</a> <br>\nattached to a suggestion. <br>\nThe card author write a create action with a resource object to create a new task. <br>\nThis keeps ability to \"deal with it later\" within the control of the card author. </p>\n<p>Maybe we can come up with some best practice guidelines around how to do this.</p>",
        "id": 251564408,
        "sender_full_name": "Frank Pandolfe",
        "timestamp": 1630505262
    },
    {
        "content": "<p>The problem with using an 'action' is that there's no way to capture who should action, when it should be done by or priority.  It also means that the provider is dependent on the CDS service providing the 'defer' option.  However, if that's the preference, we can go that way.  It would still be good to have guidance on how best to represent different types of cards in Task.</p>",
        "id": 251575101,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1630508706
    },
    {
        "content": "<p>Frank, I think Bas was concerned about race conditions, e.g.:</p>\n<ul>\n<li>a practitioner defers a card that had \"ok to prescribe medication X\"</li>\n<li>in the time between issue and when the practitioner actually views the card, new medication Y has been added which makes X unsafe</li>\n</ul>\n<p>Unless the practitioner is guarding against noticing that the card is out of date (and practitioners have enough to be worrying about), they will think it is safe when it isn't.</p>\n<p>My quick read of what Bas is suggesting is that when the practitioner comes back to the card that was deferred it should be refreshed so that contents are current.</p>",
        "id": 251580965,
        "sender_full_name": "Gino Canessa",
        "timestamp": 1630510871
    },
    {
        "content": "<p>Today, each CDS invocation is associated with a <code>hookInstance</code> UUID. If an EHR wants to support some kind of \"do this later\" workflow, it can keep track of the CDS invocation associated with a deferred card and re-run them later, with updated inputs as needed. I agree with Frank there are probably some \"best practice guidelines\" we can develop here, but those will come from trying things out in prototypes. We've got a lot of good building blocks.</p>",
        "id": 251582467,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1630511417
    },
    {
        "content": "<p>Gino, <br>\nI would agree that we want to prevent those types of conditions from occurring. That's also why it's a good idea to be able to control what actions are able to be taken within a card by the card author. If deferring a medication prescribe is a bad idea, which it probably is, then it shouldn't appear as a potential suggestion. <br>\nAs Josh suggesting the UUID can help keep track and re-run the service.... and prototypes will certainly help clarify the limitations and best practices.</p>",
        "id": 251592715,
        "sender_full_name": "Frank Pandolfe",
        "timestamp": 1630515292
    },
    {
        "content": "<p>I think it's hard to determine that 'deferring' is a bad idea.  If decision support recommends prescribing a companion drug, but the patient has a vague recollection that they may have tried it in the past and had a reaction but isn't sure, then deferring the companion until you can contact the other provider or have time to do more digging or whatever may be reasonable.  CDS services will typically feel that their actions are important and should be dealt with right away.  I think that in general, the choice should always be up to the users.  If they want to defer something, they should defer it.  (I do like the notion that the deferred 'task' contains the information to re-trigger the decision support rather than re-launch the action, such that if the context has changed, the recommendation might be different.)</p>",
        "id": 251594576,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1630516020
    },
    {
        "content": "<p>EHRs can today try things like letting administrators manage a table of</p>\n<table>\n<thead>\n<tr>\n<th>Card <code>source.url</code></th>\n<th>Card <code>source.topic</code></th>\n<th>Okay to defer?</th>\n<th>Need to re-execute?</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td><a href=\"https://service1.example.org\">https://service1.example.org</a></td>\n<td><code>prior-auth</code></td>\n<td>true</td>\n<td>false</td>\n</tr>\n</tbody>\n</table>\n<p>... and use this to drive downstream workflow. Over time, we might realize we need some extensions in cards to make the logic more robust; those an feed into the spec.</p>",
        "id": 251595291,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1630516318
    },
    {
        "content": "<p>I want to cite this other zulip thread here: <a href=\"#narrow/stream/180803-Da-Vinci.20CRD\">https://chat.fhir.org/#narrow/stream/180803-Da-Vinci.20CRD</a> for context.</p>\n<p>As I see it, this desire to defer is coming in response to to underlying workflow problems in the CRD spec. I don't think making a bunch of hasty modifications to CDS Hooks to make up for workflow insufficiencies in the CRD spec is the right thing to do. We should really think through <strong>the CRD spec</strong> better to make sure it matches real world workflows, and does not burden providers with what was previously back end staff responsibilities. </p>\n<p>Especially given that the NPRM to regulate CRD has been repealed, I would personally prefer that the CRD spec be given more careful thought with good insights from how workflows actually exist in the real world, rather than trying to bend the CDS Hooks spec to make the CRD spec work.</p>",
        "id": 251661184,
        "sender_full_name": "Matt Varghese",
        "timestamp": 1630553573
    },
    {
        "content": "<p>I don't see how that thread is relevant to the current question.  Yes, having an additional hook point might be useful in some workflows, but the need to be able to defer cards (all sorts of cards) is generic.  I provided a couple of examples of non-CRD-related situations (reviewing a PDF, submitting a companion order) where deferral would also be useful.  Even if there was a hook point for \"fulfill order\" (no one ever submitted a change request), that wouldn't eliminate the utility of the hook on \"order select\" or \"order sign\" nor would it mean that deferring the card wouldn't sometimes still be relevant in any of those three hook points.</p>",
        "id": 251665385,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1630557876
    }
]