[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> - how important is ensuring that CDS Hooks fits into the FHIR design model? The reason why I ask is because by making CDS Hooks fit into the FHIR design, it affects several things: the URI ($cds-hook), request/response (Parameters resource), and advertising capabilities via Conformance. While I understand the desire &amp; value to communicate prefetched data as FHIR resources (I agree this is a good thing), I'm struggling to understand the value in coupling the rest of the CDS Hooks design with FHIR's model/design.</p>",
        "id": 153812202,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1452702230
    },
    {
        "content": "<p>Decoupling from FHIR would allow for much cleaner and easier requests &amp; responses, more straightforward advertising of capabilities by CDS services, and the notion that a CDS service is itself a FHIR server (albeit, potentially a much more narrow server)</p>",
        "id": 153812203,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1452702349
    },
    {
        "content": "<p>However, if this is important to you, that's fine. I just want to understand where the value lies. I get the value in communicating the prefetched data via FHIR and re-using the same SMART/FHIR authorization model, but I'm not seeing the value in going all in with FHIR</p>",
        "id": 153812207,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1452702461
    },
    {
        "content": "<p>Admittedly, many of my reservations are due to my dislike of the FHIR modeling (Parameters resource)</p>",
        "id": 153812210,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1452702502
    },
    {
        "content": "<p>Well, I think it's important to ask the question. Certainly my life would be easier without Parameters, etc. But at the Connectathon keep in mind that several devs were using FHIR libraries (e.g. In Java)  that were a big help. </p>",
        "id": 153812214,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1452702680
    },
    {
        "content": "<p>I'm not convinced that dropping Parameters in favor of a more simple/tailored request/response model would affect developer productivity or the success of CDS Hooks</p>",
        "id": 153812215,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1452702858
    },
    {
        "content": "<p>If necessary, we could provide similar OSS libraries for developers to handle the serialization code and provide language specific models to work with</p>",
        "id": 153812216,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1452702966
    },
    {
        "content": "<p>Coupling all of CDS Hooks to FHIR also concerns me as FHIR evolves. So, as the generic Parameters resource evolves, this will affect CDS Hooks. We could mitigate this by defining our own tailored FHIR Resource rather than using the generic Parameters resource. By the same token, changes to Conformance will affect CDS services</p>\n<p>edit: testing editing</p>",
        "id": 153812232,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1452703355
    },
    {
        "content": "<p>With all of this being said, I'm just trying to gain a better understanding of where your head was at. :) If you feel strongly about keeping things as-is, I'd just like to understand the value we're getting. If we're open to evaluating this, I'm happy to work on other proposal to the current design on aspects like the request/response, alternatives to conformance/prefetching, etc</p>",
        "id": 153812253,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1452703744
    },
    {
        "content": "<p>I think the \"value of FHIR\" piece is worth discussion on Google groups.  Frankly the branding/enthusiasm angle of it is important, but obviously there are degrees of \"using FHIR\". </p>",
        "id": 153812270,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1452709992
    },
    {
        "content": "<p>Ok, I can start a post on the Google group about all of this</p>",
        "id": 153812271,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1452710030
    },
    {
        "content": "<p>Cool! Thanks. </p>",
        "id": 153812272,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1452710098
    },
    {
        "content": "<p>I posted a Google group discussion on this topic: <a href=\"https://groups.google.com/d/msg/cds-hooks/frHmx2VCvIE/TEWxUXLzEwAJ\" target=\"_blank\" title=\"https://groups.google.com/d/msg/cds-hooks/frHmx2VCvIE/TEWxUXLzEwAJ\">https://groups.google.com/d/msg/cds-hooks/frHmx2VCvIE/TEWxUXLzEwAJ</a></p>",
        "id": 153812280,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1452715333
    },
    {
        "content": "<p>I think we've heard two suggestions for making CDS Hooks interactions lighter-weight:</p>\n<p>1. Conformance as simple JSON data<br>\n2. Parameters as simple JSON data</p>\n<p>... and the question then becomes, can/should FHIR explicitly introduce support for such things.</p>",
        "id": 153812330,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1452792403
    },
    {
        "content": "<p>Later today / tonight I'll post my proposal for handling conformance and the CDS service URIs (currently an operation) via my Google group discussion</p>",
        "id": 153812331,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1452792525
    },
    {
        "content": "<p>So in talking with Bryn over lunch today, I thought of a (what I think is) a good analogy around SMART apps and CDS on FHIR's DecisionSupportModle's parameters. SMART apps have the exact same need as DecisionSupportModules with respect to declaring the FHIR resources and attributes they need.</p>\n<p>With SMART, there is no declarative model for this information; rather, this information is communicated in documentation or verbally between the EHR and app. In spite of this, SMART has flourished and as someone who has spent a lot of time working on integrating many different SMART apps into my EHR, I can say that this lack of declarative model has not been a hinderance to our implementation or adoption of SMART.</p>\n<p>However, with CDS on FHIR, they are trying to model these data requirements declaratively. While that is an admirable goal, I don't see it as being required and think that successful adoption is predicated on having such a declaractive model. One of my concerns with CDS on FHIR is this declarative model and it's complexity for implementors.</p>\n<p>What does this have to do with CDS Hooks? I like that this isn't a strict requirement right now on the prefetching of data. I think CDS Hooks will be adopted and successful without such a model. And, since you were in the last quarter on this topic, Josh, I thought you might be interested in this analogy.</p>",
        "id": 153812336,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1452798150
    },
    {
        "content": "<p>I'm starting to put together details for our initial sprint call next week: <br>\n<a href=\"https://github.com/cds-hooks/cds-hooks-wiki/wiki/Sprint-Program\" target=\"_blank\" title=\"https://github.com/cds-hooks/cds-hooks-wiki/wiki/Sprint-Program\">https://github.com/cds-hooks/cds-hooks-wiki/wiki/Sprint-Program</a></p>",
        "id": 153815306,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1457753857
    },
    {
        "content": "<p>I've documented a <a href=\"https://github.com/cds-hooks/cds-hooks-wiki/wiki/CDS-Hook-Metadata-Operation\" target=\"_blank\" title=\"https://github.com/cds-hooks/cds-hooks-wiki/wiki/CDS-Hook-Metadata-Operation\"><code>$cds-hook-metadata</code> operation</a> to expose a hooks basic details (name, description, trigger activity, preFetch requirements)</p>",
        "id": 153815307,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1457753907
    },
    {
        "content": "<p>I've also written up a few tasks where contributions would be especially welcome: <a href=\"https://github.com/cds-hooks/cds-hooks-wiki/issues\" target=\"_blank\" title=\"https://github.com/cds-hooks/cds-hooks-wiki/issues\">https://github.com/cds-hooks/cds-hooks-wiki/issues</a></p>",
        "id": 153815308,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1457753933
    },
    {
        "content": "<p>We need more of these, but the basic idea is that, unlike in Argonaut sprints where we're really just asking for implementation activity, here I'd like to see if we can get the community engaged in actually building the spec, with test tools, infrastructure, etc. (I wish I had time to do all this myself :-))</p>",
        "id": 153815309,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1457753982
    },
    {
        "content": "<p>Thoughts welcome in advance of the call, of course (especially <span class=\"user-mention\" data-user-id=\"191355\">@Kevin Shekleton</span> , since I know you've been thinking about this)</p>",
        "id": 153815310,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1457754006
    },
    {
        "content": "<p>Thanks, <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>. I'll review this over the weekend and respond</p>",
        "id": 153815311,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1457754149
    },
    {
        "content": "<p>I also really need to respond to <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span>'s email from several weeks ago. I am so behind in several things… :-(</p>",
        "id": 153815312,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1457754180
    },
    {
        "content": "<p>yeah you do. The current build includes a definition of cds-hooks, and I'm generating my code from that now</p>",
        "id": 153815313,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1457767263
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> - I think you've got a great start on the sprint program. I'm a huge fan of your suggestion for getting the community to build tools and contribute towards the documentation.</p>",
        "id": 153816040,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1458197596
    },
    {
        "content": "<p>I actually have a Rails app that returns test cards that I used for my own testing. I need an excuse to start open sourcing my work on CDS Hooks and I'd be happy to start with this to help on <a href=\"https://github.com/cds-hooks/cds-hooks-wiki/issues/1\" target=\"_blank\" title=\"https://github.com/cds-hooks/cds-hooks-wiki/issues/1\">issue #1</a></p>",
        "id": 153816041,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1458197978
    },
    {
        "content": "<p>hey - the calls are not at a time I can join - and I'm probably not the only one - can someone dump a short precis of things here?</p>",
        "id": 153816057,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458211709
    },
    {
        "content": "<p>Absolutely -- I'll take notes and post them to Github and then link that here</p>",
        "id": 153816087,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1458218183
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> - Generally speaking, what times do you prefer calls?</p>",
        "id": 153816088,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1458218226
    },
    {
        "content": "<p>FWIW, it's not \"calls\" -- it's just one call so far. We don't have an ongoing schedule. Would love to figure out a time when you're available, <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> .</p>",
        "id": 153816105,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1458225999
    },
    {
        "content": "<p>Yeah, that's why I asked Grahame what times he prefers. I figure we can schedule recurring calls that are more amenable to his (and other non-US) schedules :)</p>",
        "id": 153816134,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1458234277
    },
    {
        "content": "<p>We'll need to see who wants to participate. International synchronous scheduling is hard!</p>",
        "id": 153816136,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1458235649
    },
    {
        "content": "<p>well, I don't do calls between midnight and 5am. but the time slots between 5am and end of us business are relatively full</p>",
        "id": 153816171,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458238194
    },
    {
        "content": "<p>hah turns out I did at it to my calendar, and will be there a little</p>",
        "id": 153816205,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1458240643
    }
]