[
    {
        "content": "<p>robs16 opened <a href=\"https://github.com/cds-hooks/docs/issues/17\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/17\">issue 17</a></p>\n<blockquote>\n<p>For a CDS service provider, it is necessary to know which organization (or client) and potentially sub-organization is requesting the service. For example, it may be that a given client purchased only a subset of CDS Service’s capabilities and CDS Service needs this information to properly handle the request. Another example is that the client could be a cloud-based EMR, which encompasses many practices, each with their own organizational structure.</p>\n<p>We believe it would be beneficial to add a required <strong>organization</strong> field to the the CDS service request which would provide the FHIR id of the organization (or sub organization) requesting CDS.</p>\n<p>There are at least a few other ways to provide this information, but each has a downside:</p>\n<ul>\n<li>\n<p><strong>FhirServer Url</strong> can include an identifier that indicates which organization (or hospital or practice, etc) is requesting the service. The primary issue with this approach is that the CDS service has to parse out the relevant identifier, thereby hardcoding assumptions about how the Url is structured. If those assumptions are ever violated, the process breaks down.</p>\n</li>\n<li>\n<p><strong>Context</strong> could reference the relevant FHIR resources, such as Organization to establish the context. However, the spec and examples currently focus the context on the triggering orders.</p>\n</li>\n<li>\n<p><strong>Service URL</strong> could include a prefix which identifies the organization. However with sub-organizations and sub-sub-organizations this could become unwieldy.</p>\n</li>\n</ul>\n</blockquote>",
        "id": 153869126,
        "sender_full_name": "Github Notifications",
        "timestamp": 1485366448
    },
    {
        "content": "<p>The Security perspective would be that this is the role of the security assertion. Just because the security token is generally consumed by the security layer, does not mean it isn'</p>",
        "id": 153869130,
        "sender_full_name": "John Moehrke",
        "timestamp": 1485367499
    },
    {
        "content": "<p>The CDS-Hook can inspect the call stack to see who is the calling individual/organization</p>",
        "id": 153869131,
        "sender_full_name": "John Moehrke",
        "timestamp": 1485367521
    }
]