[
    {
        "content": "<p>isaacvetter opened <a href=\"https://github.com/cds-hooks/docs/issues/41\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/41\">Issue #41</a></p>\n<blockquote>\n<p>In discussion with @brynrhodes and @kpshek regarding aligning Clinical Reasoning and CDS Hooks, one of the topics of discussion was around the ability of a user to \"unsubscribe\" from a card.</p>\n<p>It would make a lot of clinicians happy if they were able to unsubscribe from a card. This information would also be valuable to CDS services.</p>\n<p>It would make sense to enhance the analytics-endpoint to support this additional information.</p>\n<p>Overall, the analytics-endpoint that's currently defined in the CDS Hooks specification has not yet seen significant adoption, although it's clearly a useful feature to CDS services. </p>\n</blockquote>",
        "id": 153887404,
        "sender_full_name": "Github Notifications",
        "timestamp": 1494047804
    },
    {
        "content": "<p>bdoolittle <a href=\"https://github.com/cds-hooks/docs/issues/41#issuecomment-299636079\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/41#issuecomment-299636079\">commented</a> on <a href=\"https://github.com/cds-hooks/docs/issues/41\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/41\">Issue #41</a></p>\n<blockquote>\n<p>I agree that that clinicians will undoubtedly want to have some control in the filtering of their CDS cards and that CDS services will find the user feedback valuable. </p>\n<p>If the hooks spec supports an unsubscribe, should it also support a way for clinicians to subscribe to content (or content subscription may be performed outside the scope of the CDS-hooks workflow)?</p>\n<p>Should a clinician be able to unsubscribe from any card? This gives the user more control, but may also prevent important feedback from being delivered at the point of care. Does this introduce a patient safety risk?</p>\n</blockquote>",
        "id": 153887569,
        "sender_full_name": "Github Notifications",
        "timestamp": 1494073076
    }
]