[
    {
        "content": "<p>kpshek <a href=\"https://github.com/cds-hooks/docs/issues/15#issuecomment-296972239\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/15#issuecomment-296972239\">commented</a> on <a href=\"https://github.com/cds-hooks/docs/issues/15\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/15\">Issue #15</a></p>\n<blockquote>\n<p>@olbrich - My apologies for not commenting on this issue much earlier.</p>\n<p>I agree with you in that CDS services (when possible), should utilize a progressive enhancement approach to their functionality. That is, the CDS service makes every attempt to work with the FHIR capabilities of each EHR.</p>\n<p>We've been working under the assumption that the EHR is solely responsible for determining which CDS services they consume or integrate with. This includes likely offline coordination between the CDS service provider and EHR. I see your viewpoint though that in order to remove manual coordination, the CDS service would need to be able to advertise the FHIR resources it requires.</p>\n<p>One way to do this would be to pass the <code>iss</code> parameter in the Discovery request to the CDS service (<code>/cds-services</code>) like you suggested. The complication here is that some EHRs will support multiple FHIR versions so the EHR would need to call Discovery for each FHIR version they support.</p>\n<p>Another way to do this would be for the CDS service to list the FHIR resources it needs in the Discovery response. However, this provides a more coarse grained view and doesn't get into the specific fields that the CDS service may require on each FHIR resource.</p>\n<p>Taking a step back, we have this exact same concern today with SMART on FHIR. That is, EHRs have no way of knowing if a given SMART app will work based on the current FHIR capabilities of the EHR. However, this hasn't been an issue due to the aforementioned offline coordination between the EHR and SMART application. Barring this offline coordination, the SMART app needs to either utilize a progressive enhancement approach (as you mentioned) or communicate to the user that it requires data which isn't available. I think the same is true for CDS services.</p>\n<p>My thoughts are that we don't make any changes for the time being regarding this for the following reasons:<br>\n- We're relying on that offline coordination -- both within CDS Hooks and SMART on FHIR<br>\n- CDS services should utilize a progressive enhancement approach. If required data is not available, it can communicate that to the user via a card (this also may relate to our errors discussion in #14)</p>\n</blockquote>",
        "id": 153885897,
        "sender_full_name": "Github Notifications",
        "timestamp": 1493112356
    },
    {
        "content": "<p>kpshek edited <a href=\"https://github.com/cds-hooks/docs/issues/15\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/15\">Issue #15</a></p>\n<blockquote>\n<p>When it comes to service discovery, it may make sense for the CDS service discovery endpoint to interrogate the CapabilityStatement of the EHR that is attempting service discovery.</p>\n<p>This would allow a service discovery endpoint to be able to determine if the EHR in question supports the necessary FHIR resources and is of an appropriate version to successfully interact with the CDS service and filter out responses as necessary.</p>\n<p>This might require calls to <code>/cds-services</code> to include an <code>iss</code> parameter.</p>\n</blockquote>",
        "id": 153885898,
        "sender_full_name": "Github Notifications",
        "timestamp": 1493112423
    }
]