[
    {
        "content": "<p>The pull request for a new candidate hook of \"Encounter-discharge\" has been accepted and the candidate hook can now be reviewed here: <a href=\"https://cds-hooks.org/hooks/encounter-discharge\" target=\"_blank\" title=\"https://cds-hooks.org/hooks/encounter-discharge\">https://cds-hooks.org/hooks/encounter-discharge</a></p>\n<p>This thread is to encourage discussion of the proposed hook. It was initiated as part of the Da Vinci Coverage Requirements Discovery (CRD) project, but is intended to be generally applicable. It allows decision support services to provide recommendations at the time an EHR is performing the discharge process for an inpatient encounter.  (If EHRs have an 'end of encounter' hook point for non-inpatient encounters, it could occur there as well.)  It can be used to help verify that the patient is indeed ready for discharge, to check that discharge processing steps have occurred appropriately (e.g. a care plan exists for the GP, discharge med list properly prepared, follow-ups scheduled), that billing and insurance documentation requirements have been met, etc.</p>",
        "id": 160233233,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551989436
    },
    {
        "content": "<p>I know this is an old thread, but <span class=\"user-mention\" data-user-id=\"192205\">@Lisa Nelson</span>  was asking during the Sept 2020 connectathon about an encounter-end (or otherwise similarly named hook) for outpatient workflows.  Rather than copy encounter-discharge with a slightly different name, she was curious about having a more generic verb for both inpatient and outpatient.  That being said, we're still early in discussing the actual kinds of support that would occur in the outpatient setting.  I'll pause to let her elaborate on the use-case</p>",
        "id": 209683549,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1599760198
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192205\">@Lisa Nelson</span>  brought this up again during Jan 2021 connectathon.  I did notice that both Lloyd's comment above and the definition of \"encounter-discharge\" says that it's <em>typically</em> an inpatient encounter, but is intended to be generally applicable to any end of encounter, including outpatient.  \"discharge\" is probably confusing if you specifically have outpatient in mind</p>",
        "id": 222749014,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1610644313
    },
    {
        "content": "<p>Is the guidance from the CDS services and the contextual information that would reasonably be sent different between inpatient and outpatient ? I'm guessing that Lloyd has reason to implicitly limit encounter-discharge to inpatient.</p>",
        "id": 222749492,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1610644497
    }
]