[
    {
        "content": "<p>Has anyone tested the new (experimental) <code>error</code> cards? I know <span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> hasn't had a chance to yet. I'm curious if anyone else has (or will <span class=\"emoji emoji-1f600\" title=\"grinning\">:grinning:</span>)</p>",
        "id": 153931927,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1517156204
    },
    {
        "content": "<p>I deployed a server that will almost certainly return one of the order-review hook because it has stringent data reqirements, but I didn't do any client testing yet</p>",
        "id": 153931930,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1517156269
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191355\">@Kevin Shekleton</span> Our lame \"blood pressure\" hook can't get BP data from the sandbox, so I can legitimately switch that one to \"error\" in that case. Not a great example but happy to switch it over to test it out. Seems to work locally at least - getting a black border in the sandbox</p>",
        "id": 153931941,
        "sender_full_name": "Paul Curcio",
        "timestamp": 1517156759
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"193244\">@Paul Curcio</span>, you're seeing the expected styling on the error cards. I'm more interested too in if CDS Services find value in having the ability to return a card not providing CDS to the end user but rather providing some error text. If so, we can formalize the notion of an error card in the specification.</p>",
        "id": 153931943,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1517156854
    },
    {
        "content": "<p>I tested the error card and got the \"black\" styling</p>",
        "id": 153932195,
        "sender_full_name": "Nikolai Schwertner",
        "timestamp": 1517169386
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191496\">@Nikolai Schwertner</span>! If you have any functional use cases where you would use it, please let us know!</p>",
        "id": 153932211,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1517170326
    }
]