[
    {
        "content": "<p>Hello Everyone, </p>\n<p>We had a demo of our CDS Hooks service, the hook returns a Medication Risk Score Visualization in the markdown, but the team asked if we could also return the numeric score in the response card. What would be the recommendation approach to adding additional data in the card response? Would we use an <code>extension</code> element?</p>",
        "id": 154012287,
        "sender_full_name": "Tom Wilson",
        "timestamp": 1540499427
    },
    {
        "content": "<p>Hi Tom, as you say CDS Hooks definitely does include some an <a href=\"https://cds-hooks.org/specification/1.0/#extensions\" target=\"_blank\" title=\"https://cds-hooks.org/specification/1.0/#extensions\">extensions</a> option. I think this is a very reasonable place for a discrete risk score.</p>",
        "id": 154012323,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1540526534
    },
    {
        "content": "<p>Great, Thank you</p>",
        "id": 154012446,
        "sender_full_name": "Tom Wilson",
        "timestamp": 1540561995
    },
    {
        "content": "<p>There have been some discussions within the CDS WG about plugging more expressive FHIR resources in the CDS Hooks card, such as <a href=\"https://www.hl7.org/fhir/communication.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/communication.html\">Communication</a> and <a href=\"https://www.hl7.org/fhir/riskassessment.html\" target=\"_blank\" title=\"https://www.hl7.org/fhir/riskassessment.html\">RiskAssessment</a>. <span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span>  and <span class=\"user-mention\" data-user-id=\"193796\">@Tom Wilson</span> , any thoughts?</p>",
        "id": 154012544,
        "sender_full_name": "Guilherme Del Fiol",
        "timestamp": 1540565340
    },
    {
        "content": "<p>You can already do a \"create\" with any resource, can't you?  (If the EHR supports the resource :&gt;)</p>",
        "id": 154012553,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1540565534
    },
    {
        "content": "<p>Yes, a card with a \"create\" action is how folks thought this could be implemented.</p>",
        "id": 154012579,
        "sender_full_name": "Guilherme Del Fiol",
        "timestamp": 1540566268
    },
    {
        "content": "<p>Wouldn't a create action still require the end user to physically click something, or am I imposing my interpretation on the spec?  I was under the impression that actions were expected (not required) to produce buttons.  I'm more interested in a functionality that allows the CDS client to capture <br>\nA. an audit of what recommendation, information was displayed to the end user<br>\nB. That same basic data but beyond just an audit, say as an observation on the patient.</p>\n<p>I'd like to see some way do differentiate between an action I am asking the user to take, and a bundle of FHIR elements that I'm providing to the client system.</p>",
        "id": 154013311,
        "sender_full_name": "Tejay Cardon",
        "timestamp": 1540833121
    }
]