[
    {
        "content": "<p>One of the things DaVinci CRD would like to be able to do is to send back forms (Questionnaires) that would need to be completed and submitted with any claim.  Ideally these would come back as cards containing the Questionnaire resources.  However, it's not clear what the appropriate Suggestion.action.type would be.  Opinions on how this should be handled?</p>",
        "id": 153980801,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533187033
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> I expect to be working on almost this problem, so happy to contribute to this activity. </p>\n<p>Here are some options:<br>\n1. In one project I am involved in right now, we're implementing the request to fill a QuestionnaireResponse as a  ProcedureRequest whose code is the questionnaire's LOINC code, and category is a SNOMED code for evaluation. Doesn't seem completely right but is reasonable.<br>\n2. In Health eDecisions (pre FHIR PlanDef) we had a CompleteInformationAction class. An equivalent in FHIR might be a new resource DocumentationRequest.<br>\n3. Create a Task resource to fill a QuestionnaireResponse.</p>\n<p>Consider the above as thinking out loud.</p>\n<p>On a related note, we implemented internally a cds-hook where the trigger is a QuestionnaireResponse being completed. That also might be useful in the DaVinci flow.</p>",
        "id": 153980807,
        "sender_full_name": "Aziz Boxwala",
        "timestamp": 1533188140
    },
    {
        "content": "<p>Ok.  I think DiagnosticRequest would be better than ProcedureRequest, though they both merge into ServiceRequest.  Task might be better yet.  So in that case, you'd have the service passing back both a Task and the Questionnaire the Task points to.  (The payer almost certainly would not have a RESTful endpoint the Task could point at to query the server.)  So would you send that as a Bundle containing both resources?  What's the correct action to process a batch/transaction?</p>",
        "id": 153980808,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533188356
    },
    {
        "content": "<p>As I think about it more, the Questionnaire is something that would typically need to be included as part of a Claim or pre-authorization request.  So we'd possibly want to tie it to that too.  A draft Claim that points to a draft (empty) QuestionnaireResponse that points to a Questionnaire?</p>",
        "id": 153980809,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533188465
    },
    {
        "content": "<p>(Made more entertaining by the fact that all of that might have to be converted to X12 before actually sending it to the payer... :))</p>",
        "id": 153980811,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533188511
    },
    {
        "content": "<p>The risk is that Task is not widely implemented. But as long as it is a transient thing that is sent within the hook response (for the client to consume/interpret and then discard) we may be okay.</p>",
        "id": 153980963,
        "sender_full_name": "Aziz Boxwala",
        "timestamp": 1533224898
    },
    {
        "content": "<p>I see the concern about the bundle - after finishing my <del>cup</del>mug of tea.</p>",
        "id": 153980964,
        "sender_full_name": "Aziz Boxwala",
        "timestamp": 1533225064
    },
    {
        "content": "<p>Hope your mug was good :)  Is it legitimate to pass back a FHIR batch or transaction as a recommendation?  If so, what's the correct action type?</p>",
        "id": 153981994,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533334210
    },
    {
        "content": "<blockquote>\n<p>Hope your mug was good :)  Is it legitimate to pass back a FHIR batch or transaction as a recommendation?  If so, what's the correct action type?</p>\n</blockquote>\n<p>That's a question for someone more intimate with the spec development, perhaps <span class=\"user-mention\" data-user-id=\"191355\">@Kevin Shekleton</span></p>",
        "id": 153983321,
        "sender_full_name": "Aziz Boxwala",
        "timestamp": 1533669585
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> - I don't recall anyone ever talking about this. It sounds like a great Connnectathon use case. I don't see anything wrong with that and it would be great to see implementation around this</p>",
        "id": 153983334,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1533673664
    },
    {
        "content": "<p>We'll plan to bring it to Connectathon as part of DaVinci.  Thoughts on what the correct \"action\" should be to execute a batch/transaction?  Is it legimate for us to introduce a new action for connectathon purposes?</p>",
        "id": 153983355,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533674636
    },
    {
        "content": "<p>I'd like to be involved in that, but cannot do in September.  If you decide to continue on this activity in the Jan connectathon, I can participate.</p>",
        "id": 153983504,
        "sender_full_name": "Aziz Boxwala",
        "timestamp": 1533699691
    },
    {
        "content": "<p>I'm pretty sure DaVinci will be running in January too.</p>",
        "id": 153983508,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533700297
    },
    {
        "content": "<p>Would this batch/transaction still be a suggestion for the user to act upon? Or, is this something the CDS Service is wanting the CDS Client (aka, EHR) to execute regardless of the user's choice?</p>",
        "id": 153983634,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1533734521
    },
    {
        "content": "<p>This would be a suggestion for the user to act on (above/in addition to what they're doing now).  It'd be the equivalent of saying \"in addition to prescribing drug X, you should also order lab test Y monthly for the next 6 months to make sure the drug isn't killing the patient's liver\".  In this case, the 'extra' suggestion is \"Add 'filling out form X\" to my task list\" - where there's a need to store both the Task and the Questionnaire (though the Questionnaire piece in the transaction would probably be set to create if not exists)</p>",
        "id": 153983669,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533736848
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span> : I don't see DiagnosticRequest in STU3 or in build. </p>\n<blockquote>\n<p>Ok.  I think DiagnosticRequest would be better than ProcedureRequest, though they both merge into ServiceRequest.  Task might be better yet.  So in that case, you'd have the service passing back both a Task and the Questionnaire the Task points to.  (The payer almost certainly would not have a RESTful endpoint the Task could point at to query the server.)  So would you send that as a Bundle containing both resources?  What's the correct action to process a batch/transaction?</p>\n</blockquote>",
        "id": 153989689,
        "sender_full_name": "Aziz Boxwala",
        "timestamp": 1534811220
    },
    {
        "content": "<p>DiagnosticRequest was STU2.  In STU3, DiagnosticRequest merged into ProcedureRquest.  In R4 it merges again into ServiceRequest</p>",
        "id": 153990401,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1535033419
    }
]