[
    {
        "content": "<p>I was looking at the hooks that currently exist, and didn't see one that would be appropriate for CDS that is shown to a pharmacist who is verifying a medication order.  The information I'd expect to be sent as context is similar to what is sent for the order-sign hook, except that instead of draft-orders, it would be the information for the order being verified.  Does it make sense to use the order-sign hook for this workflow?<br>\nThank you!</p>",
        "id": 219538198,
        "sender_full_name": "Steve Long",
        "timestamp": 1607636669
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span> , <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>,  <span class=\"user-mention\" data-user-id=\"191358\">@Dennis Patterson</span> , <span class=\"user-mention\" data-user-id=\"191359\">@Bryn Rhodes</span>  - thoughts on this workflow / and whether it merits a separate hook or could use the order-sign hook? Note that the order being verified is an order that has already been signed.</p>",
        "id": 220172682,
        "sender_full_name": "Matt Varghese",
        "timestamp": 1608152570
    },
    {
        "content": "<p>I think order-sign's structure  could be used to try out some use-cases, but correct there would be some tweaks to the hook context.  Since they aren't draft orders, the CDS Service won't necessarily have all of the same types of guidance and a different hook would communicate that semantic difference in the workflow.  I'm curious what kinds of decision guidance any services in question would be communicating (to help paint the picture).</p>",
        "id": 220188842,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1608161659
    },
    {
        "content": "<p>I feel like the guidance would be roughly the same, just presented to a different user (the pharmacist)</p>\n<p>All the decision factors written somewhat humorously here could be possibilities</p>\n<p><a href=\"https://www.tldrpharmacy.com/content/how-to-verify-medication-orders-like-a-pharmacist-boss\">https://www.tldrpharmacy.com/content/how-to-verify-medication-orders-like-a-pharmacist-boss</a></p>",
        "id": 220203864,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1608176011
    }
]