[
    {
        "content": "<p>We've been trying to figure out the relationship between CDS Hooks (like <code>order-select</code> or <code>patient-view</code> and something that the <a href=\"https://github.com/smart-on-fhir/smart-web-messaging/blob/master/README.md\" target=\"_blank\" title=\"https://github.com/smart-on-fhir/smart-web-messaging/blob/master/README.md\">SMART Web Messaging spec</a> calls an <code>activityType</code>. In Web Messaging, the idea is that an app can request a navigation event in the host EHR, e.g., to navigate to a particular screen or activity such as \"problem list\" or \"orders\" or \"patient face sheet\".</p>",
        "id": 167521639,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1559854350
    },
    {
        "content": "<p>I'd love to tell a simple story like \"for every activity type we care about, there's a CDS Hook to represent that point in the navigation\". This would avoid trying to model the same basic workflows in two competing ways.</p>",
        "id": 167521727,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1559854414
    },
    {
        "content": "<p>In practice, this might mean leaning on existing hooks, and defining new ones as the need arises, like <code>allergy-list-view</code> or <code>problem-list-view</code>. Does this strike anyone as a fundamentally bad/backwards idea?</p>",
        "id": 167521848,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1559854497
    },
    {
        "content": "<p>I think there's a many::1 relationship between screens and CDS Hooks.</p>",
        "id": 167528687,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559859890
    },
    {
        "content": "<p>order-select could easily be triggered from a pharmacy screen, a lab screen, a general order screen (referrals, etc.) and maybe one or two others.</p>",
        "id": 167528723,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559859921
    },
    {
        "content": "<p>Similarly the patient-admit could show up a few different places too (e.g. inpatient vs. outpatient workflows)</p>",
        "id": 167528738,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559859945
    },
    {
        "content": "<p>One of the points of the cds hook definitions was to be independent of the particular \"screens\" and focus more on what type of workflow was happening.  If you're going to do navigation, you're going to need specific screens.</p>",
        "id": 167528802,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559859989
    },
    {
        "content": "<p>But navigation is also not about <em>screens</em> per se -- it's about functionality.</p>",
        "id": 167532386,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1559863984
    },
    {
        "content": "<p>It's about navigating to <em>activities</em> the same way CDS Hooks is about notifying when activities are occurring.</p>",
        "id": 167532399,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1559864008
    },
    {
        "content": "<p>In practice, responding to a navigation request will mean picking a particular screen -- but that could be considered an EHR-internal detail, or might even be configurable.</p>",
        "id": 167532464,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1559864094
    },
    {
        "content": "<p>I should also say that I don't think <em>every</em> CDS Hook would need to be associated with a navigatable activity; just the other way around (for each navigatable activity, we'd need to ensure a hook existed).</p>",
        "id": 167532490,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1559864143
    },
    {
        "content": "<p>Ok, but if order-select corresponds to 3-4 different functional areas of an EHR, as does patient-view or encounter-start, what would it mean for an activityType to say \"transition to order-select\" or \"patient-view\"?</p>",
        "id": 167540889,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559874942
    },
    {
        "content": "<p>The narrow, accurate path is to only align <code>view</code>-type hooks with standardized activity names. Josh, note that you did this, implicitly, above. However, <code>view</code> hooks tend to be less actionable than action hooks (select, sign, create) and therefore less valuable. This is demonstrated by our list of current, proposed, and defunct hooks: <code>order-select</code>, <code>order-review</code>, <code>order-sign</code>, <code>med-prescribe</code>, <code>appt-book</code>,  <code>encounter-start</code>, <code>encounter-discharge</code>, <code>med-refill</code>, <code>allergy-create</code>, <code>problem-create</code> and, of course, <code>patient-view</code>. Note that all but one of these hooks is a user action, not an activity view.</p>",
        "id": 167543155,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1559878079
    },
    {
        "content": "<p>By limiting SMART messaging to use CDS Hooks-aligned <code>activityType</code>, we'd simply encourage the creation of fluff in CDS Hooks.</p>",
        "id": 167543199,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1559878085
    },
    {
        "content": "<p>(Note that we're attempting to standardize clinical workflow -- this is the realm of BPMN and such and can get really complicated really quick).</p>",
        "id": 167543200,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1559878088
    },
    {
        "content": "<p>OK - so I'm hearing \"no, go build a separate catalog of activities that will overlap with CDS Hooks <code>*-view</code> hooks but will be maintained independently\".  Feels like a unnecessary duplication to me, given that the CDS Hooks catalog is open-ended (i.e., one person's \"fluff\" is another's substance).</p>",
        "id": 167586101,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1559920985
    },
    {
        "content": "<p>But I won't push it if there's no support. So: <span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span>  are you willing to help me iterate on an navigation-relevant activity list that makes sense in Epic? Basically, a list of view-type activities that should serve as the target of navigation requests?</p>",
        "id": 167586126,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1559921018
    },
    {
        "content": "<p>Hey Josh!</p>",
        "id": 167634148,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1559969278
    },
    {
        "content": "<p>Two points:</p>",
        "id": 167634192,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1559969286
    },
    {
        "content": "<p>1) There are probably thousands of \"activities\" in an EHR. Frankly, I don't think that we know (or at least I don't) which of these would be valuable as the target of a navigation request. I imagine that it will be highly dependent upon the goals and relevant workflow of the particular app. I'd suggest that the best source of knowledge for workflow requirements is provider organizations, not app developers, not EHR developers. (E.g. Epic uses <a href=\"https://www.nytimes.com/2018/12/20/business/epic-systems-campus-verona-wisconsin.html\" target=\"_blank\" title=\"https://www.nytimes.com/2018/12/20/business/epic-systems-campus-verona-wisconsin.html\">developer immersion</a> (sorry, couldn't find better public explanation) in health systems to understand provider workflow). I'd suggest starting with a sophisticated app developer and committed health system for a popular use-case.</p>",
        "id": 167634195,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1559969294
    },
    {
        "content": "<p>2)   </p>\n<blockquote>\n<p>feels like unnecessary duplication to me, given that the CDS Hooks catalog is open-ended (i.e., one person's \"fluff\" is another's substance).</p>\n</blockquote>",
        "id": 167634199,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1559969305
    },
    {
        "content": "<p>I hate unnecessary duplication too!, and definitely do not want to block any person’s substance. I don’t understand what substantive use-cases are being proposed. Are you sure that navigation to <code>view</code>-type activities is what’s needed? Are you certain that navigation to “action”-type activities (aligning perfectly with our hooks) wouldn’t better satisfy clinical workflow?</p>",
        "id": 167634206,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1559969311
    },
    {
        "content": "<p><span aria-label=\"idea\" class=\"emoji emoji-1f4a1\" role=\"img\" title=\"idea\">:idea:</span>  As a middle ground — our hooks are currently constructed as <code>noun</code>-<code>action</code>. Could we repurpose <code>noun</code> as activity?</p>",
        "id": 167634210,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1559969334
    },
    {
        "content": "<p>p.s. So, HL7 has an EHR workgroup, created by the ONC in the oughts. I suspect that our notion of “activity” should be part of this WG’s researched and published “functional model”. I got lost in pdfs upon downloading and reading the <a href=\"https://www.hl7.org/implement/standards/product_brief.cfm?product_id=18\" target=\"_blank\" title=\"https://www.hl7.org/implement/standards/product_brief.cfm?product_id=18\">HL7 Electronic Health Record-System (EHR-S) Functional Model (FM), Release 1</a> and so don’t have anything useful to say here … :(</p>",
        "id": 167634211,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1559969338
    },
    {
        "content": "<p>\"lost in PDFs\" is precisely where I don't want to be :)</p>",
        "id": 167653786,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1560005017
    },
    {
        "content": "<p>\"view\" is one kind of action, and clearly a relevant one from the navigation perspective. Ordering actions like \"order-select\" are also pretty natural targets. I don't want to start a project to model all EHR activities; I just want a clear place for Web Messaging navigation events to plug into the ecosystem.</p>",
        "id": 167653968,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1560005284
    },
    {
        "content": "<p>My current plan to include a <code>navigtion-targets.md</code> file in the Web Messaging spec and list targets ad-hoc, but I'll follow the CDS Hooks naming convention and probably include values that already are defined in CDS Hooks, just to preserve the possibility that we can reconcile.</p>",
        "id": 167653972,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1560005287
    }
]