[
    {
        "content": "<blockquote>\n<p>Piggybacking off of our last question, it looks like only one hook is currently beyond a maturity level of 1, “patient-view.” Is this the only hook that has been tested by any actual CDS clients/hospitals?</p>\n</blockquote>\n<p>This is the only formally standardized hook, but it's not the only hook being used! There's often (and there should be) a time lag between when definitions are tested/deployed and when they're formally standardized. This helps ensure that the standards process reflects capabilities that are working in the real world. (Overall, ensuring this level of quality is something that we still struggle with as a community -- but FHIR and CDS Hooks are really focused on getting to this level of real-world implementation in the process of maturing the standard.)</p>\n<p>One example from last year is the \"CDS Hooks for PAMA\" guide, which uses the <code>order-select</code> and <code>order-sign</code> hooks. We've seen this successfully implemented by T-System (on the EHR side) and Evidence.care (on the CDS Service side), and we've seen a partial implementation from Athenahealth and Stanson.</p>",
        "id": 189641024,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1583274158
    },
    {
        "content": "<p>Is there a general timeline of how long it may take for a hook to progress through the maturity levels, or is this completely dependent on any issues identified with each individual hook?</p>",
        "id": 189740938,
        "sender_full_name": "Michaela Mirkovich",
        "timestamp": 1583359637
    },
    {
        "content": "<p>It's mainly dependant on time to get real world implementation experience; more complex or workflow-intensive hooks of course should take longer.</p>",
        "id": 189756450,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1583376534
    },
    {
        "content": "<p>Michaela, to add on -- I think it's important to understand that \"issues identified with [a] hook\" is not what holds back <a href=\"https://cds-hooks.hl7.org/1.0/#hook-maturity-model\" target=\"_blank\" title=\"https://cds-hooks.hl7.org/1.0/#hook-maturity-model\">maturity</a>. Defining a perfect hook spec doesn't at all guarantee that a hook (or interoperability specification) will be used/mature. Rather, a mature spec/hook is often imperfect in that it's implementable and implemented by a wide variety of the community and industry. A perfect design isn't sufficient to produce a successful interoperability standard; rather, a successful standard is the crystallization of capabilities and intent of a community of implementers.</p>",
        "id": 190250077,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1583901285
    }
]