[
    {
        "content": "<blockquote>\n<p>What do you see as the main advantage to using CDS Hooks?</p>\n</blockquote>\n<p>This depends on what your alternative is. I initially designed CDS Hooks with two advantages in mind:</p>\n<ul>\n<li>\n<p>Advantage over using SMART Apps alone for CDS. When it comes to running a SMART app, clincians can connect all kind of CDS tools to the EHR and run them at-will. For example, you might run a bilirubin management app to guide you towards apporpriate therapy for a neonate. The main challenge becomes the cognitive burden for a clinician: there are too many apps, each doing a small job; how do you know which app to run in any given circumstance? And for apps that are <em>critically useful</em> but only <em>rarely</em>, this is an especially hard problem.</p>\n</li>\n<li>\n<p>Advantage over vendor-specific deep integration of CDS. Here, it comes down to a marketplace argument: as a service developer, it's very hard to keep up to date with a wide surface area of different EHR vendor APIs. Targeting a standard means you can focus on integrating with a consistent set of APIs, and really polishing the user experience around it. There are trade-offs here (e.g., the standard API is often going to lag behind specific vendor APIs in raw capabilities), but as the community grows, it drives consistency in the user experience.</p>\n</li>\n</ul>",
        "id": 189640102,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1583273419
    },
    {
        "content": "<p>I think this first advantage you mentioned is so important. Currently working as a bedside nurse myself, I know clinicians can easily get overwhelmed with many different tasks and may not think to use a specific app that could be beneficial to them. I see great promise with CDS Hooks running these important apps automatically!</p>",
        "id": 189740597,
        "sender_full_name": "Michaela Mirkovich",
        "timestamp": 1583359337
    },
    {
        "content": "<p>From my perspective as an EHR developer, I see the advantage to CDS Hooks as the reverse side of Josh's second bullet -- </p>\n<blockquote>\n<p>as a service developer, it's very hard to keep up to date with a wide surface area of different EHR vendor APIs</p>\n</blockquote>\n<p>As a CDS client developer, it's hard to educate and provide an ecosystem of testing tools and libraries that best enable a CDS service developer to use my own API. By using a standard, integration gets faster and cheaper for everyone.</p>",
        "id": 190250209,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1583901546
    },
    {
        "content": "<p>I actually disagree with Josh's point about consistent \"UI\". I believe that there's currently little commonality of the display of CDS Hooks cards across widely deployed EHRs.</p>",
        "id": 190250324,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1583901798
    },
    {
        "content": "<p>Lastly, CDS Hooks' modern security architecture and integration with FHIR are distinct advantages over previous remote CDS standards. Additionally, the <code>prefetch</code> mechanism and the CDS service's streamlined ability to query standard, RESTful FHIR APIs are novel.</p>",
        "id": 190250509,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1583902181
    }
]