[
    {
        "content": "<blockquote>\n<p>Do you think it will eventually replace some of the older internal CDS systems?</p>\n</blockquote>\n<p>Time will tell. My generic answer about whether new standards will \"replace\" older approaches is: yes, but by attrition. That is to say: older systems that work will keep working, and nobody is going to rip and replace them just for fun. But as folks lauch new projects, or look to seriously overhaul existing systems, they'll gravitate toward newer and more capable (or just easier to use) standards. So this is a process that plays out slowly over time, and a new standard only \"wins\" over that time period if it's solving a real-world problem. I think CDS Hooks is going to meet that bar, but it's still early days. The best-equipped folks to answer this question are service developers, who today are programming against a variety of APIs in order to get their products on the market. If <span class=\"user-mention\" data-user-id=\"192631\">@Alex Tatiyants</span> or <span class=\"user-mention\" data-user-id=\"191581\">@Kalyani Yerra</span> or <span class=\"user-mention\" data-user-id=\"258919\">@Adam Murray</span> (or other service developers!) have perspectives on this front, they'd be most welcome.</p>",
        "id": 189641985,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1583274922
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191315\">Josh Mandel</span> <a href=\"#narrow/stream/179159-cds-hooks/topic/CDS.20Hooks.20Interview/near/189641985\" title=\"#narrow/stream/179159-cds-hooks/topic/CDS.20Hooks.20Interview/near/189641985\">said</a>:</p>\n<blockquote>\n<blockquote>\n<p>Do you think it will eventually replace some of the older internal CDS systems?</p>\n</blockquote>\n<p>Time will tell. My generic answer about whether new standards will \"replace\" older approaches is: yes, but by attrition. That is to say: older systems that work will keep working, and nobody is going to rip and replace them just for fun. But as folks lauch new projects, or look to seriously overhaul existing systems, they'll gravitate toward newer and more capable (or just easier to use) standards. So this is a process that plays out slowly over time, and a new standard only \"wins\" over that time period if it's solving a real-world problem. I think CDS Hooks is going to meet that bar, but it's still early days. The best-equipped folks to answer this question are service developers, who today are programming against a variety of APIs in order to get their products on the market. If <span class=\"user-mention silent\" data-user-id=\"192631\">Alex Tatiyants</span> or <span class=\"user-mention silent\" data-user-id=\"191581\">Kalyani Yerra</span> or <span class=\"user-mention silent\" data-user-id=\"258919\">Adam Murray</span> (or other service developers!) have perspectives on this front, they'd be most welcome.</p>\n</blockquote>\n<p>I agree with @ <strong>Josh Mandel</strong> that “older systems” that work will keep working, and nobody is going to rip and replace them. But as we work on new CDS Content, we create additional adapters/wrappers to expose the CDS content. Basically, the CDS logic is developed with our domain and we create wrappers/adapters to interact with the CDS clients. Some examples of the adapters would be CDS-Hooks adapter, Epic BPA Adapter etc. We also look at the following criteria to determine the best choice of when to use the standard.<br>\n1.  Does the new CDS content benefit the clinician during the clinical workflow. Ex: Does this content need to show up during ordering or patient view etc or can be content be reviewed / viewed at leisure<br>\n2.  Does the customer EHR support the needed standard and integration points(hooks).<br>\n3.  Is there additional data needed for the CDS logic available in the EHR that can be acquired by the standard. (FHIR, pre-fetch etc)<br>\n4.  Is there additional cost and implementation needed because of the standard?</p>",
        "id": 189647060,
        "sender_full_name": "Kalyani Yerra",
        "timestamp": 1583279205
    },
    {
        "content": "<blockquote>\n<p>Do you think it will eventually replace some of the older internal CDS systems?</p>\n</blockquote>\n<p>I fully expect that CDS Hooks will replace some existing CDS integrations, for all the reasons laid in Q1 including the increase in capability and security.</p>",
        "id": 190250564,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1583902291
    }
]