[
    {
        "content": "<blockquote>\n<p>What do you see as the main disadvantage or challenge to using CDS Hooks?</p>\n</blockquote>\n<p>I got into this a little bit above, but I think about disadvantages in two categories:</p>\n<ul>\n<li>\n<p><strong>Issues with the current status of the spec and current levels of support</strong>. CDS Hooks is still in its early days: it's at a 1.0 level, and we're only just now in the process of formally standardizing the first hook definition (<code>patient-view</code>). So support for the API in vendor products is still pretty limited, and especially when you get into some of the technical features (e.g., requesting that an EHR gather \"pre-fetch\" data to pass along to a service) or some of the more workflow-intensive features  (e.g., providing a set of \"action\" buttons that a user can click to update an in-progress order), support in currently-deployed EHRs is still limited.</p>\n</li>\n<li>\n<p><strong>Fundamental issues with the nature of a standardized interface</strong>. There's always tension between the API features you can get widespread agreement on, vs the API features that can be implemented within a given vendor product. So an <em>excellent</em> vendor-specific API might have more features and might be easier to use than a standard like CDS Hooks. In practice, I haven't seem much in the way of vendor-specific APIs that's \"easier to use\" from a developer perspective, but there are certainly some extra features. (Conversely, we're in the process of standardizing some really interesting features for CDS Hooks 1.1, like a <a href=\"https://github.com/cds-hooks/docs/wiki/Feedback-endpoint-for-CDS-Hooks-1.1\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/wiki/Feedback-endpoint-for-CDS-Hooks-1.1\">feedback endpoint</a> for services to learn when/how their advice is taken by clinicians; I'm not aware of any vendor-specific API that has introduced this kind of functionality, so we're actually pushing the envelope <em>and</em> standardizing expectations here at the same time.)</p>\n</li>\n</ul>",
        "id": 189640505,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1583273779
    },
    {
        "content": "<p>Well put. Even when available, CDS Hooks are seemingly relegated to live with the dark confines of deepest pits of EHR API programs.</p>\n<p>Really hoping that either policy or customer demand bring about more uniformity of deployment and easy accessibility.</p>",
        "id": 189763053,
        "sender_full_name": "Brendan Keeler",
        "timestamp": 1583388366
    }
]