[
    {
        "content": "<p>Is it legal for an update to introduce an extension/core element that the client doesn't support?  Or more specifically, should we explicitly indicate that clients should watch for this and potentially suppress suggestions/cards that would result in changes they can't execute?</p>",
        "id": 153984283,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533833867
    },
    {
        "content": "<p>Extensions should be ignored, per FHIR, right? <br>\nCore elements are tougher ...</p>",
        "id": 153984284,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1533833981
    },
    {
        "content": "<p>Any element you don't support can be ignored unless it's a modifier (in which case you need to look at where it is)</p>",
        "id": 153984287,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533834071
    },
    {
        "content": "<p>The question is whether it's ok to display an option to a provider and have them click on it, only to have the EHR not actually do what the option said.</p>",
        "id": 153984288,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533834099
    },
    {
        "content": "<p>(Or at least not completely...)</p>",
        "id": 153984289,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533834107
    },
    {
        "content": "<p>If the narrative from the hook service is retained, ignoring elements may be less critical, so this is slightly related to the thread I raised on narrative.</p>",
        "id": 153984290,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533834159
    },
    {
        "content": "<p>ack, wrong thread.</p>",
        "id": 153984304,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1533835290
    },
    {
        "content": "<p>In practice, I'd expect the CDS service to not send me FHIR resources that I can't understand. That's maybe naive. Could the EHR's FHIR server's CapabilityStatement statement help the CDS service understand what's possible?</p>",
        "id": 153984310,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1533835487
    },
    {
        "content": "<p>It could - but only if the CapabilityStatement included profiles for each supported resource.  And the tricky bit is that might vary by context.  If you manage chemotherapy orders separately from regular prescriptions, you might support more elements/extensions in your chemo module than you do in the other module.  CapabilityStatement won't help there.</p>",
        "id": 153984314,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533835586
    },
    {
        "content": "<p>(CapabilityStatement profiles by resource are optional.  Not sure how many systems are currently exposing them.)</p>",
        "id": 153984315,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533835609
    },
    {
        "content": "<p>I'd think the service provider would put together an ImplementationGuide for their service and the EHR would look at that and make a determination how/if to support that service prior to installation.</p>",
        "id": 153984388,
        "sender_full_name": "Kevin Olbrich",
        "timestamp": 1533840034
    },
    {
        "content": "<p>Maybe.   That's certainly outside any expectation documented in the Hooks specification so far.  There's also the question of evolution of both the hook service and the EHR client.  While making sure things are smooth at design-time should always be the objective, having a runtime check to avoid problems seems wise to me.</p>",
        "id": 153984396,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533840882
    },
    {
        "content": "<p>Agreed</p>",
        "id": 153984489,
        "sender_full_name": "Kevin Olbrich",
        "timestamp": 1533847529
    },
    {
        "content": "<p>Based on our experience, an implementation guide by the service provider is necessary in any case - there are too many details which are not part of the specification to support a consumer building an interface to the service. To augment it, we have provided an extension to each discovery service for CapabilityStatements which describe the resources and fields which our service depends on for prefetch/context/FHIR data gathering requests. Given the above scenario, it might help to have separate CapabilityStatements on covering what we may create or update.</p>",
        "id": 153985720,
        "sender_full_name": "Robert Sax",
        "timestamp": 1534156688
    },
    {
        "content": "<blockquote>\n<p>we have provided an extension to each discovery service for CapabilityStatements which describe the resources and fields which our service depends on for prefetch/context/FHIR data gathering requests</p>\n</blockquote>\n<p><span class=\"user-mention\" data-user-id=\"193057\">@Robert Sax</span> - wow! </p>\n<p>When you say CapabilityStatement, do you mean that ya'll are extending your discovery endpoint with extensions to describe capabilities OR that you're extending a FHIR CapabilityStatement resource to describe your CDS Hooks services' capabilities?</p>",
        "id": 153985819,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1534175763
    },
    {
        "content": "<p>The discovery endpoint has extensions which provide a URL for the CapabilityStatement for each service. The CapabilityStatement describes the set of FHIR resources our service consumes, and for each the set of fields that we use. We did not extend CapabilityStatement to describe the CDS Hooks services' capabilities.</p>",
        "id": 153985827,
        "sender_full_name": "Robert Sax",
        "timestamp": 1534176415
    },
    {
        "content": "<p>Robert - that's really neat. May I ask if there was a production / customer need to do this? Is this being used? Or rather, are ya'll going above and beyond by programmically describing your service/app's FHIR requirements.</p>\n<p>In practice, I've seen lots of SMART apps but precious few of them have created CapabilityStatements that define their requirements.</p>",
        "id": 153985852,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1534180953
    },
    {
        "content": "<p>I guess a bit of both (need vs above/beyond). As a service provider, we want more integrations. To support this with limited resources, it would be ideal to have a very detailed implementation guide/specification to help the integrations move forward. CapabilityStatements by themselves cannot take the place of an implementation guide, but do provide a detailed look at the data we need or will use if provided, which may change on a service-to-service basis or even a client-to-client basis. It is clear that many EMR vendors implement  partial FHIR support (ie not all resources, subset of fields, etc), so this helps both them and us understand where  work needs to be done to make the integration successful.</p>",
        "id": 153985861,
        "sender_full_name": "Robert Sax",
        "timestamp": 1534182348
    },
    {
        "content": "<p>is this the {baseURL}/cds-services endpoint? Interested how you added extensions as it doesn't return a FHIR resource...  (or did you simply add extra elements to the service description?</p>",
        "id": 153989651,
        "sender_full_name": "David Hay",
        "timestamp": 1534798646
    },
    {
        "content": "<p>Hey David, CDS Hooks defines a really simple extension capability, see: <a href=\"https://cds-hooks.org/specification/1.0/#extensions\" target=\"_blank\" title=\"https://cds-hooks.org/specification/1.0/#extensions\">https://cds-hooks.org/specification/1.0/#extensions</a></p>",
        "id": 153989839,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1534876728
    }
]