[
    {
        "content": "<p>I'll be serving as a first-time track lead at the January 7-8 Connectathon in Baltimore.  My track focuses on the PAMA imaging use case, and I'll be putting special emphasis on how to use CDS Hooks to work nicely with a SMART app that uses SMART Web Messaging to update an unsigned order.</p>\n<p>If anyone @here is planning to attend, please let me know so I can get a sense of head-count.</p>",
        "id": 182692871,
        "sender_full_name": "Carl Anderson",
        "timestamp": 1575573404
    },
    {
        "content": "<p>I'll be there ;-)</p>",
        "id": 182702132,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1575579073
    },
    {
        "content": "<p>Reminder, tomorrow is Track Orientation <br>\nThu, Dec 12, 2019 1:00 PM - 2:00 PM EST </p>\n<p>Please join my meeting from your computer, tablet or smartphone. <br>\n<a href=\"https://global.gotomeeting.com/join/688335029\" target=\"_blank\" title=\"https://global.gotomeeting.com/join/688335029\">https://global.gotomeeting.com/join/688335029</a> </p>\n<p>You can also dial in using your phone. <br>\nUnited States: +1 (872) 240-3412</p>",
        "id": 183165006,
        "sender_full_name": "Brett Marquard",
        "timestamp": 1576076477
    },
    {
        "content": "<p>Hi Carl: I will try second scenario 3; I am halfway through code lab and I plan to complete it today. I will not be able to use our epic installation. So I need to use some other method of testing the app. I am thinking of an app, that will use machine learning and provide input to clinician. I want to test out end-to-end operation of take a patients existing images of chest x-ray or heart image and provide feed back to clinician. I want to implement the workflow of taking existing patient image from EHR system through FHIR, run it through a prediction and present results back to the clinician to make decision.  I have not yet completely worked out the details yet. It would be helpful for me if you can give me steps involved in achieving the workflow (from which FHIR publicly available system I can extract a dicom image), i.e. what public servers are available to get an image of patient and run it through prediction....</p>",
        "id": 184127277,
        "sender_full_name": "Hari Kunamneni",
        "timestamp": 1577129789
    },
    {
        "content": "<p>FHIR 4, seems to have imaging study resource ...</p>",
        "id": 184127647,
        "sender_full_name": "Hari Kunamneni",
        "timestamp": 1577130122
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"237615\">@Hari Kunamneni</span> this all sounds super interesting, and I'd encourage you to build in this direction -- but I also want to point out that it goes beyond the scope of the PAMA track. So you'll be a bit out \"on your own\", and there won't be ready-made answers (\"steps involved in achieving the workflow\") for you :)</p>",
        "id": 184137052,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1577140535
    },
    {
        "content": "<p>Looking forward to seeing you in Baltimore!</p>",
        "id": 184137102,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1577140570
    },
    {
        "content": "<p>(deleted)</p>",
        "id": 184803552,
        "sender_full_name": "Hari Kunamneni",
        "timestamp": 1578143540
    },
    {
        "content": "<p>Sorry for the slow response on my part, too.  I read your message late on the 23rd and didn't know how to reply at first (then I forgot about it over break).</p>\n<p>Anyway, I see your name on the list of track participants, so I'll see you in person tomorrow!  Please let me know if there's anything you'd like help on before then, too.</p>",
        "id": 184931741,
        "sender_full_name": "Carl Anderson",
        "timestamp": 1578334799
    },
    {
        "content": "<p>FYI - for those attending the connectathon, you can add yourself to ConMan here (which will help me manage the track):<br>\n<a href=\"http://conman.clinfhir.com/connectathon.html?event=baltimore2020\" target=\"_blank\" title=\"http://conman.clinfhir.com/connectathon.html?event=baltimore2020\">http://conman.clinfhir.com/connectathon.html?event=baltimore2020</a></p>",
        "id": 184938410,
        "sender_full_name": "Carl Anderson",
        "timestamp": 1578339492
    },
    {
        "content": "<p>I still plan to participate remotely ... As per your e-mail, we are going to communicate through this app</p>",
        "id": 184990855,
        "sender_full_name": "Hari Kunamneni",
        "timestamp": 1578385802
    },
    {
        "content": "<p>I added my name to track; please let me know if i need to do anything...</p>",
        "id": 184990921,
        "sender_full_name": "Hari Kunamneni",
        "timestamp": 1578385843
    }
]