[
    {
        "content": "<p>Starting a thread to gauge interest in a CDS Hooks track during the January 2021 Connectathon.  Other than testing 1.0 scenarios and continue testing the 1.1 balloted content, what would the community like to see in a CDS Hooks track?  What additional areas would you like to test or explore?</p>",
        "id": 217030976,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1605632400
    },
    {
        "content": "<p>I kicked off an e-mail thread to many of you, but wanted to provide the form link here, as well.</p>\n<p>As I alluded above, I’m reaching out to learn more about your use-cases for CDS Hooks and input on what the community would find valuable at a Connectathon track as we continue to advance the standard and foster real-world adoption.</p>\n<p>Please take a few minutes and let us know what we can do better: <a href=\"https://forms.gle/gYcLk7S5yeUjBdib9\">https://forms.gle/gYcLk7S5yeUjBdib9</a></p>",
        "id": 217320342,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1605814950
    },
    {
        "content": "<p>Thanks to those who have participated in the survey so far! If you haven't please do so. </p>\n<p>On a separate note, I'm looking at scheduling a track orientation on Thursday, December 17th at 10am Central time.  If you can't make it, it'll be recorded, but feel free to chime in here with concerns</p>",
        "id": 218622161,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1606944443
    },
    {
        "content": "<p>Alrighty, it's scheduled - <a href=\"https://confluence.hl7.org/display/FHIR/2021-01+CDS+Hooks#id-202101CDSHooks-TrackOrientationDate\">https://confluence.hl7.org/display/FHIR/2021-01+CDS+Hooks#id-202101CDSHooks-TrackOrientationDate</a></p>",
        "id": 218894444,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1607117900
    },
    {
        "content": "<p>Reminder that track orientation is Thursday (tomorrow) at 10AM Central!</p>",
        "id": 220188406,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1608161349
    },
    {
        "content": "<p>Reminder to add yourself as a CDS Client or CDS Service on the connectathon tracking spreadsheet so we can facilitate pre-event coordination.   Thanks!  <a href=\"https://bit.ly/cds-hooks-connectathon-tracking\">https://bit.ly/cds-hooks-connectathon-tracking</a></p>",
        "id": 220265951,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1608222432
    },
    {
        "content": "<p>It's Connectathon week!  Reminder to register your CDS Server/Client information within <a href=\"https://bit.ly/cds-hooks-connectathon-tracking\">https://bit.ly/cds-hooks-connectathon-tracking</a> so we can all start wiring things up before Thursday morning.  Looking forward to seeing everyone!</p>",
        "id": 222343632,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1610392514
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191358\">@Dennis Patterson</span> MaxMD is back for another attempt at making progress with our CDS Hooks Service supporting the order-select hook.  Yan Wang and I will be looking to test with EHRs to show how our CDS Hooks Service works.  It returns a card that allows the EHR user to launch a SMART App that lets the provider order some patient screening.  once ordered, this kicks off our patient screening solution to kick in and manage the task of actually providing the patient with the screening questionnaire, and gathering their consent to share and their questionnaireResponse.  We also support patient-view, so when the patient's record is opened, the hook calls our CDS Service and then the EHR gets to see what screening responses and other incoming information is available for the patient.  They can review the info and decide what information they might like to upload into their EHR.  </p>\n<p>We are showing a SDOH screening that is relevant for the Gravity Track--so we are sort of killing to birds with one stone (not that I have anything against birds :^) )</p>\n<p>We appreciate anything you can do to help introduce us to the right folks that we can test this workflow with.  Great to be here.</p>",
        "id": 222667320,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1610584425
    },
    {
        "content": "<p>Excellent, and thanks for adding your info to the Google spreadsheet plus reaching out here!  <span class=\"user-mention\" data-user-id=\"193248\">@Kol Kheang</span> and <span class=\"user-mention\" data-user-id=\"193265\">@Matt Varghese</span> can likely wire up your services and SMART app launch for Cerner and Epic, respectively.  We’ll touch base in the kick-off tomorrow morning and see if there are any other CDS Clients present.</p>",
        "id": 222667769,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1610584781
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192205\">@Lisa Nelson</span>  I can also test your CDS Service and SMART App launch against our CorroHealth (T-System) EHR server. We have support for the patient-view and order-sign hooks.</p>",
        "id": 222670320,
        "sender_full_name": "Chuck Feltner",
        "timestamp": 1610586892
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192613\">@Chuck Feltner</span> Great to meet you. How different is the order-sign hook from the order-select hook?  I just need to discuss this with <span class=\"user-mention\" data-user-id=\"235325\">@Yan Wang</span> to see if we can adjust to use order-sign rather than order-select.</p>",
        "id": 222672756,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1610589898
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192205\">@Lisa Nelson</span> at order-select, an orderable has been selected but not all details may be finalized.  order-sign signifies that the user is ready to place the order(s).  Depending on the kind of guidance being provided via cards and/or the amount of information needed by the CDS Service, both hooks allow cards to be delivered at different stages of ordering</p>",
        "id": 222674679,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1610592434
    },
    {
        "content": "<p>Hi everybody!  I work with James Agnew at Smile CDR.  We recently built support for CDS Hooks into the Smile CDR FHIR Repository to make it easy for developers to write CDS Hooks services in Java.  The api gives you Java Json instances with FHIR resources pre-parsed into hapi-fhir instances.</p>\n<p>If you'd like to try writing a CDS Hooks service I've set up a server for the conference and I'd be happy to deploy your code to the server to try it out.  The endpoint is <a href=\"https://connect.smilecdr.com:8010/cds-services\">https://connect.smilecdr.com:8010/cds-services</a>.  The developer guide is here:  <a href=\"https://smilecdr.com/docs/cds_hooks/cds_hooks_intro.html\">https://smilecdr.com/docs/cds_hooks/cds_hooks_intro.html</a></p>",
        "id": 222722019,
        "sender_full_name": "Ken Stevens",
        "timestamp": 1610633780
    },
    {
        "content": "<p>Great, Ken! So not only do you have a couple services on that endpoint, but you're offering to host other services using these libraries.  Any CDS Service authors interested in trying this out?</p>",
        "id": 222727590,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1610636229
    },
    {
        "content": "<p>While the kick-off doesn't officially start until 8am Pacific, I've started up the room for anybody that wants to hop in to ask questions or start to coordinate.  In your Whova app, if you find the CDS Hooks kick-off on the agenda (8am pacific, 10am central, etc.) and join despite being early, it'll be there.  We'll also keep it running throughout the day for the same purposes.</p>",
        "id": 222727858,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1610636364
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193248\">@Kol Kheang</span> Using your demo patient, could you please request a Food Insecurity screening and send the request to <a href=\"mailto:LNelson@direct.max.md\">LNelson@direct.max.md</a>  after I complete it, could you please open the patient's chart, review that questionnaire response and choose to import it into the EHR.  After it imports, could you please demonstrate showing the imported Progress Note from inside the EHR and grab a screen capture of that view with enough real estate to see that you are in the context of your Cerner EHR while viewing that pdf document. Thank you</p>",
        "id": 222886934,
        "sender_full_name": "Lisa Nelson",
        "timestamp": 1610729386
    },
    {
        "content": "<p>Thanks again to everybody who attended the CDS Hooks track!  <span aria-label=\"tada\" class=\"emoji emoji-1f389\" role=\"img\" title=\"tada\">:tada:</span>  I finished making tweaks to the <a href=\"https://confluence.hl7.org/display/FHIR/2021+-+01+HL7+FHIR+Connectathon+Track+Report+Outs#id-202101HL7FHIRConnectathonTrackReportOuts-CDSHooks\">report-out</a> so please take a look and let me know if anything should be added/adjusted.  I appreciate everybody's hard work creating implementations and thoughtfulness in bringing up issues!</p>",
        "id": 222941086,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1610753622
    }
]