[
    {
        "content": "<p>Hello! Will a CDS Hook ever be able to launch a SMART app directly from a hook (medication-prescribe)? The only use case I've seen is a link to a SMART on FHIR app. Thank you!</p>",
        "id": 153934669,
        "sender_full_name": "Johnny Bender",
        "timestamp": 1517503630
    },
    {
        "content": "<p>What would you expect to happen when more than one vendor tried to immediately launch a SMART app for the same hook?</p>",
        "id": 153934685,
        "sender_full_name": "Kevin Olbrich",
        "timestamp": 1517505486
    },
    {
        "content": "<p>I would expect all the SMART apps to open simultaneously. I suppose that would cause a bit of a workflow interruption. We're building an opioid addiction risk stratification tool  that requires supplemental survey data. Would the recommended approach be to provide a SMART app link in a card and prompt the user, \"Please provide additional data for the addiction risk stratification tool\"?</p>",
        "id": 153934696,
        "sender_full_name": "Johnny Bender",
        "timestamp": 1517506390
    },
    {
        "content": "<p>Hi @<strong>John Bender</strong>. Are you asking if when a card returns a link to the SMART app, the EHR automatically opens that SMART app (rather than requiring the user to click the link)?</p>",
        "id": 153934706,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1517506731
    },
    {
        "content": "<p>Probably, and I think I saw a mention that if you set the severity of the card to 'hard-stop' that would signal the EHR that they should not allow the workflow to proceed.  Perhaps we could modify that slightly for SMART apps so that the workflow can't proceed until the app is launched and returns.</p>",
        "id": 153934708,
        "sender_full_name": "Kevin Olbrich",
        "timestamp": 1517506776
    },
    {
        "content": "<p>Ultimately, I think it is an organizational concern here. That is, the hospital should decide when/if they want to automatically open the link(s) from cards rather than the CDS Service determine this.</p>",
        "id": 153934710,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1517507101
    },
    {
        "content": "<p>We are probably going to need some consistent way to give the EHR hints about what needs to happen next and then they can build configurations in about how to handle them.</p>",
        "id": 153934712,
        "sender_full_name": "Kevin Olbrich",
        "timestamp": 1517507256
    },
    {
        "content": "<p>Thanks Kevin S, yes that was the use case I was pursuing. Thanks for the advice, Kevin O, I'll check out the 'hard-stop' signal.</p>",
        "id": 153934730,
        "sender_full_name": "Johnny Bender",
        "timestamp": 1517509941
    },
    {
        "content": "<p>The problem with <code>hard-stop</code> is that the intention is for critical CDS. If the SMART app is to be used in that scenario then this makes sense but all of the use cases I've heard are more about saving a user a click (which is a totally valid endeavor).</p>\n<p>Also, <code>hard-stop</code> cards may have links which are just informational and the EHR would probably not want to auto-follow that link.</p>",
        "id": 153934745,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1517513153
    },
    {
        "content": "<p>I'm trying to develop a CDS hook that can launch our SMART app within an EPIC EHR. We have the card showing as expected but the launch functionality seems to not be passing in the launch url, how would we do pass the ISS and launch url from the card?</p>",
        "id": 211311499,
        "sender_full_name": "Meir Snyder",
        "timestamp": 1601064584
    },
    {
        "content": "<p>Hi Meir!  Can you share the card definition you're using, or at least confirm that you're setting the <code>type: smart</code> attribute?</p>",
        "id": 211312158,
        "sender_full_name": "Carl Anderson",
        "timestamp": 1601064936
    },
    {
        "content": "<p>Thanks Carl, we are using the type: smart as mentioned in the documentation, not sure if there's additional fields we need to add, here's the card definition we're using with some placeholder values </p>\n<div class=\"codehilite\"><pre><span></span><code>response_cards = {\n        &quot;cards&quot;: [{\n          &quot;summary&quot;: &quot;Summary text&quot;,\n          &quot;indicator&quot;: &quot;warning&quot;,\n          &quot;detail&quot;: &quot;&quot;,\n          &quot;source&quot;: {\n            &quot;label&quot;: &quot;Label Text&quot;,\n            &quot;url&quot;: &quot;&quot;,\n            &quot;icon&quot;: &quot;&quot;,\n          },\n          &quot;links&quot;: [\n            {\n              &quot;label&quot;: &quot;Label_Text&quot;,\n\n              &quot;url&quot;: &quot;appUrl/launch?ClientID=123foo&quot;,\n              &quot;type&quot;: &quot;smart&quot;,\n              &quot;appContext&quot;: &quot;{\\&quot;calcID\\&quot;:608}&quot;\n          },\n          ]\n        }]\n      }\n</code></pre></div>",
        "id": 211313141,
        "sender_full_name": "Meir Snyder",
        "timestamp": 1601065363
    },
    {
        "content": "<p>OK, and just checking - which scopes are you requesting in your launch endpoint when you invoke <code>authorize</code>?</p>",
        "id": 211314259,
        "sender_full_name": "Carl Anderson",
        "timestamp": 1601065846
    },
    {
        "content": "<p>Hi Carl! Chiming in from Meir's team: if I understand your question correctly, I believe the scope would be: \"patient/FamilyMemberHistory.read patient/MedicationStatement.read patient/Encounter.read patient/Patient.read patient/Observation.read patient/Condition.read launch online_access openid profile\"</p>\n<p>Just to add a little clarification: it seems as though the parameters required for the EHR launch sequence (\"iss\" and \"launch\" -- <a href=\"http://hl7.org/fhir/smart-app-launch/index.html\">http://hl7.org/fhir/smart-app-launch/index.html</a>) are not being appended by Epic when the SMART app is launched from the CDS Card link in Storyboard. I believe we can grab the \"iss\", but where would the launch parameter (\"opaque identifier for this specific launch\") be generated in this scenario?</p>",
        "id": 211314949,
        "sender_full_name": "Jonah Wilkof",
        "timestamp": 1601066212
    },
    {
        "content": "<p>I'm not sure.  Nothing jumps out at me as wrong, but I'm not familiar with the Epic particulars.  <span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span> - any insights here?</p>",
        "id": 211536269,
        "sender_full_name": "Carl Anderson",
        "timestamp": 1601320221
    },
    {
        "content": "<p>Hey Guys, if you're in App Orchard, your App Orchard TS are best able to help. The client Id of the app returned on a card must be in an allowlist in some epic configuration. That would be something for the health system to check.</p>",
        "id": 211562415,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1601334788
    },
    {
        "content": "<p>Thanks for the suggestion Isaac! We'll pursue that path next.</p>",
        "id": 211624066,
        "sender_full_name": "Jonah Wilkof",
        "timestamp": 1601387797
    }
]