[
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span>, you had submitted <a href=\"http://jira.hl7.org/browse/FHIR-24614\">FHIR#24614</a> against DTR indicating that instead of a SMART app, the DTR functionality should be able to be a local EHR function.  How did you envision a CRD CDS Hook coming back that would allow the launching of the functionality?  There are two questions here:</p>\n<ul>\n<li>How can a CDS Hook card allow invocation of a set of local EHR functionality rather than a SMART app</li>\n<li>How should the CDS Service know whether to (and how to) point to a set of local functionality rather than a specified SMART app, or for that matter allow a choice of what app to actually use or have an EHR choose what app to use</li>\n</ul>",
        "id": 252481650,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631115109
    },
    {
        "content": "<p>SMART Web Messaging takes a crack at this, modeling a \"please launch a specific local EHR functionality\" as a <a href=\"http://build.fhir.org/ig/HL7/smart-web-messaging/smart-web-messaging.html#request-payload-for-uidone-and-uilaunchactivity\"><code>ui.launchActivity</code></a> message (basically: an activity type and params, where activity types are an open set, with a small catalog as a starting point).</p>",
        "id": 252485363,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1631116466
    },
    {
        "content": "<p>Ok, but that would be a \"launch this functionality from a SMART app\", not \"launch this functionality from a card\", correct?</p>",
        "id": 252487776,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631117288
    },
    {
        "content": "<p>In the case of SMART Web Messaging, yes. I'm just calling out a place where shared modeling of the problem (i.e., what does it mean to \"launch an activity\", what activities exist, what parameters do they support/require) could serve needs of multiple projects. The use case sounds the same.</p>",
        "id": 252490049,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1631118157
    },
    {
        "content": "<p>Fair enough.  Thanks.  Thoughts from others about exposing this in CDS Hooks?</p>",
        "id": 252490286,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631118254
    },
    {
        "content": "<p>Hey Lloyd, no doubt you've put more though into this than I have, but I was expecting the local EHR function to interact with the payer in the same way the DTR app is prescribed to work. My intent with that jira was to not arbitrarily limit the DTR functionality to only a 3rd party system, if the EHR could perform it.</p>",
        "id": 254400762,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1632329831
    },
    {
        "content": "<p>In DTR, the mechanism by which the app receives the location and technical ability to access the CQL is defined here: <a href=\"http://hl7.org/fhir/us/davinci-dtr/2019Sep/specification__behaviors__retrieval_of_payer_resources.html\">http://hl7.org/fhir/us/davinci-dtr/2019Sep/specification__behaviors__retrieval_of_payer_resources.html</a>. It's a profiled <code>appContext</code> field.</p>",
        "id": 254400935,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1632329899
    },
    {
        "content": "<p>To attempt to specifically answer your questions ...</p>\n<blockquote>\n<p>How can a CDS Hook card allow invocation of a set of local EHR functionality rather than a SMART app</p>\n</blockquote>\n<p>maybe a canonical url in the card?</p>",
        "id": 254401058,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1632329959
    },
    {
        "content": "<blockquote>\n<p>How should the CDS Service know whether to (and how to) point to a set of local functionality rather than a specified SMART app, or for that matter allow a choice of what app to actually use or have an EHR choose what app to use</p>\n</blockquote>\n<p>This is just my opinion -- personally, I think that CDS Services, including payers, should have the technical ability to customize their CRD functionality per provider organization to ensure appropriate clinical user experience.</p>",
        "id": 254401323,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1632330042
    },
    {
        "content": "<p>Largely unrelated -- Re-reading DTR's \"Retreival of Payer Resources\" (and I think I'd submitted a comment  as well), it really seems like a bad idea to bounce the access_token to the payer's FHIR server through the EHR. Wouldn't it be better for the app to use backend SMART / client_credentials to authenticate to the payer's server?</p>",
        "id": 254402096,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1632330320
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span>,  I'm not opposed to providing a mechanism for the EHR to launch local functionality rather than a SMART app.  But that need would presumably not be CRD-specific.  It's just as realistic for an EHR to have its own Opioid prescribing solution or growth chart tool and want to give the user the ability to launch those instead of the SMART app version.  And in those cases, it's possible that the CDS service might have information that would be relevant to 'initiate' the starting point for the EHR's functionality.</p>\n<p>There's also the question of how the CDS service is to know that there's EHR functionality that should be launched.  It might be feasible for a payer to adjust for an overall EHR product, but we definitely don't want to customize on a per-hospital basis.  That's definitely not the outcome we'd want for a \"standard\".  However, whether a feature is enabled by the EHR might well be hospital-specific.  If we're going to introduce a capability like this, it should be via a generic mechanism and not treated as something that's CRD-specific.</p>\n<p>Also, do we believe EHRs actually have support for FHIR Questionnaires with embedded CQL for population?  (That's well beyond what Argonaut got agreement on.)</p>\n<p>In terms of using SMART / client_credentials, do we expect SMART apps to be able to protect client secrets?  How would this be managed?  If you think this is possible/reasonable/appropriate, feel free to submit a change request.</p>",
        "id": 254423405,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632338591
    },
    {
        "content": "<ul>\n<li>Security of access token in <code>appContext</code><ul>\n<li><a href=\"https://jira.hl7.org/browse/FHIR-24714\">Found my jira</a>! The resolution was to update the spec to have the DTR app use backend services, the jira was marked as applied, but the change hadn't been applied (or had been and then was again changed back later). I changed to \"Not Applied\" (jira for the win!). The comments on that jira are a fairly thorough analysis of the options.</li>\n<li>\n<blockquote>\n<p>do we expect SMART apps to be able to protect client secrets</p>\n</blockquote>\n</li>\n<li>Definitely yeah, there's a confidential client ... \"profile\" in SMART that describes this. It's common for apps to have client secrets/private keys. It's less common for user-facing apps to support both auth code and client_credentials flow, but not unheard of or unreasonable, in my experience.</li>\n</ul>\n</li>\n</ul>",
        "id": 254430756,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1632341309
    },
    {
        "content": "<p>Perfect - then it's DTR's fault and not mine ;)</p>",
        "id": 254431101,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632341424
    },
    {
        "content": "<p>oh yeah, my default assumption is that that's the case for all the problems .... <span aria-label=\"wink\" class=\"emoji emoji-1f609\" role=\"img\" title=\"wink\">:wink:</span></p>",
        "id": 254431205,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1632341463
    },
    {
        "content": "<p>Your thoughts on defining a generic mechanism for CDS Hooks to be able to a) identify the availability of EHR-specific functions; and b) indicate to the user that they might want to launch them?</p>",
        "id": 254431299,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632341502
    },
    {
        "content": "<p>(Thoughts also welcome on providing guidance on the ability to defer/assign cards to be acted on by others)</p>",
        "id": 254431454,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632341553
    },
    {
        "content": "<blockquote>\n<p>how the CDS service is to know that there's EHR functionality that should be launched. It might be feasible for a payer to adjust for an overall EHR product, but we definitely don't want to customize on a per-hospital basis</p>\n</blockquote>\n<p>I'd expect customization/configuration to be reasonable, at a minimum, at the level of the client id. Right now, we have three client ids involved:<br>\n1) used by the payer's CDS service, issued by the EHR <br>\n2) used by the DTR app, issued by the EHR<br>\n3) used by the DTR app, issued by the payer</p>",
        "id": 254432423,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1632341972
    },
    {
        "content": "<p>It seems like during the registration process of either the app or the CDS service (#1 or #2) would be the natural place for the payer to determine and configure capabilities. That would be for the EHR software though, and not a particular health system (\"hospital\" or system comprising a hundred hospitals).</p>",
        "id": 254432606,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1632342050
    },
    {
        "content": "<p>That seems reasonable - and would be the time to address <span class=\"user-mention\" data-user-id=\"193265\">@Matt Varghese</span>'s concern about knowing that a particular app is a 'DTR' app.</p>",
        "id": 254467669,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632362011
    },
    {
        "content": "<p>Ha ha, <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>, now you're accepting that the CDS Client needs to know that a particular App is the DTR App. I would rather this is captured in the data exchange, rather than orthogonally configured. (I kinda like <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>'s phrase: \"dark arts\" type stuff). I was talking to my boss and he suggested that perhaps we should walk through existing Prior Authorization workflows with the Da Vinci Burden Reduction group..</p>",
        "id": 254468549,
        "sender_full_name": "Matt Varghese",
        "timestamp": 1632362574
    },
    {
        "content": "<p>I'm saying that <em>if</em> it needs to happen, the time to do it is at app registration, not in the card.  From a CDS hooks perspective, an app is an app and all apps are aimed at humans, not at automated processes.</p>",
        "id": 254469790,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632363367
    },
    {
        "content": "<p>We absolutely aren't trying to mirror existing prior auth processes.  We're very much intending to change them, to ensure that all clinical data is collected up front and that the clinician is 'done' with the prior auth (including any possible follow-ups) before the patient leaves the room.</p>",
        "id": 254469890,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632363446
    },
    {
        "content": "<p>I think spending some time understanding current workflows would be extremely valuable.</p>",
        "id": 254471469,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632364679
    },
    {
        "content": "<p>I'd love to have a tour/discussion on this.</p>",
        "id": 254471521,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1632364706
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>: <a href=\"https://jira.hl7.org/browse/FHIR-33959\">https://jira.hl7.org/browse/FHIR-33959</a> and <a href=\"https://jira.hl7.org/browse/FHIR-33958\">https://jira.hl7.org/browse/FHIR-33958</a></p>",
        "id": 254472294,
        "sender_full_name": "Matt Varghese",
        "timestamp": 1632365401
    },
    {
        "content": "<p>We'll figure out a CRD call time that will work and will post an invite here.  (<span class=\"user-mention\" data-user-id=\"196359\">@Robert Dieterle</span>)</p>",
        "id": 254567739,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1632416062
    },
    {
        "content": "<p>Lloyd, CDS talked a little bit about how to better enable and support CRD's use of CDS Hooks yesterday. The <a href=\"https://confluence.hl7.org/pages/viewpage.action?pageId=79499688\">outcome</a> was the same as the above -- to find some time for discussion.</p>",
        "id": 254582945,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1632422111
    },
    {
        "content": "<p>CDS Discussed this with <span class=\"user-mention\" data-user-id=\"196359\">@Robert Dieterle</span> during a session today and he offered the CRD call two weeks from yesterday (so the 10/6 call, details on the HL7 calendar <a href=\"https://www.hl7.org/concalls/CallDetails.cfm?concall=56968\">here</a>)</p>",
        "id": 254609757,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1632433186
    }
]