[
    {
        "content": "<p>Hello, I am wondering what others have done, or if there is a recommendation to limit the CDS Hook requests sent from a client to a service. Specifically, if the service is a payer, have others implemented strategies to only make CDS Hook requests to a specific payer for orders where that payer is documented on the order or the patient chart?</p>",
        "id": 253674494,
        "sender_full_name": "Joseph Sadlon",
        "timestamp": 1631840959
    },
    {
        "content": "<p>More generically, can a hook service specify pre-conditions for when they're interested in receiving a hook?</p>",
        "id": 253678221,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631844066
    },
    {
        "content": "<p>I know this was talked about a few years ago, but there doesn't seem to be anything that's been added to the draft spec to support the capability.</p>",
        "id": 253678243,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1631844093
    },
    {
        "content": "<p>Hey Joseph, Lloyd's right. We've colloquially referred to this as \"trigger guards\". Generally, the work to standardize trigger guards would require pretty broad support for something CQL to enable robust expressions. Whereas, it seems like many CDS Clients already have a rule engine sufficiently capable of implementing these rules.</p>",
        "id": 254392005,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1632326574
    },
    {
        "content": "<p>Further, there's lots of reasons why a CDS Client shouldn't call a service depending upon the workflow. The CDS Client will always be better able to determine what the workflow should be; therefore, there will always need to be \"trigger guards\" that the service doesn't know about.</p>",
        "id": 254392008,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1632326576
    },
    {
        "content": "<p>The middle ground that we're discussing adding to the specification a textual description of the \"trigger guard\", proposed name is \"usageRequirements\" see this jira: <a href=\"https://jira.hl7.org/browse/FHIR-28651\">https://jira.hl7.org/browse/FHIR-28651</a></p>",
        "id": 254392438,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1632326741
    }
]