[
    {
        "content": "<p>Should we do something in the menu to distinguish 'deprecated' hooks?  E.g. mark them with strikethrough or something?</p>",
        "id": 160218532,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551979728
    },
    {
        "content": "<p>I might also make the template italics so it's obviously distinct from the true hooks</p>",
        "id": 160225547,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1551984736
    },
    {
        "content": "<p>Can we just remove them and archive them off on a wiki or something? I don't want a bunch of deprecated/unused hooks cluttering up that list</p>",
        "id": 160291076,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1552053584
    },
    {
        "content": "<p>You could have an italicized link to \"deprecated hooks\" if you wanted and then have a page that pointed to them.  How quickly you can just \"yank\" them should probably be driven by your deprecation policy (which might want to be informed by the highest maturity level something's hit.  Pretty reasonable to make something 0 or 1 just disappear.  Might want to give some time for something 4 or 5 and for something normative, you'll probably want to adhere to FHIR's deprecation policy of a couple of balloted releases.</p>",
        "id": 160299748,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1552059724
    },
    {
        "content": "<p>In general when we decide to deprecate something there should be a time window. That window could be immediate or extensive -- but I don't think deprecated hooks should disappear until that time when they were lapses. Links to them should not break during the transition window. but the content should be clearly marked and once the time window elapses the deprecated hooks should be removed from the main list.</p>",
        "id": 160314861,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1552071323
    },
    {
        "content": "<p>For our recent deprecation decisions, we did not mark a time window, and I think \"effective immediately\" is just fine.</p>",
        "id": 160314887,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1552071351
    },
    {
        "content": "<p>I think hooks that may have hit production should remain discoverable and accessible.</p>",
        "id": 160322569,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1552076778
    }
]