[
    {
        "content": "<p>Has anyone implemented cds-hooks for the scenario that the CDS warns the user that this medication is contra-indicated, but allows the user to provide some text to explain why they are overriding the CDS warning<br>\n- where does the text go?<br>\n- how does the MedicationRequest end-point know that the CDS is happy with the override?</p>",
        "id": 153859084,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1480468522
    },
    {
        "content": "<p>No — we haven't closed the loop on collecting data as part of the workflow (other than by launching an app).</p>",
        "id": 153859328,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1480541963
    },
    {
        "content": "<p>I think there are some pretty clear use cases, though. For something as simple as a labeled text field. And we've defined a workflow for sending data back to service to indicate when a \"suggestion\" button is clicked, so we could follow that same pattern.</p>",
        "id": 153859329,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1480542013
    },
    {
        "content": "<p>this is something we definitely need to close out - I have a project running here in Australia that should use cds-hooks, but can only do so if we close this loop. We'll try to bring this forward to the San Antonio connectathon, and we'll be having a series of our own </p>",
        "id": 153859336,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1480542330
    },
    {
        "content": "<p>Sorry I'm late to this thread -- I've been on sabbatical (still am) and away for the first part of it but am now getting back into things. :) I agree this would be a good thing to look at in San Antonio and I agree with Josh that using something similar to our analytics endpoint would be appropriate.</p>",
        "id": 153863280,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1481666163
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> - Do you need to retrieve the override information out later? In Cerner's system, this override information is stored in audit events so my initial thoughts (based upon what I'm used to) is that this information would be available via the AuditEvent resource)</p>",
        "id": 153863282,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1481666240
    },
    {
        "content": "<p>I don't know the answer. it seems to me that a pharmacist would want that information when dispensing</p>",
        "id": 153863289,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481666652
    },
    {
        "content": "<p>In the system I work with, I *think* the override information is only accessible to those running audit reports to see how the alerts are being handled.</p>",
        "id": 153863297,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1481666984
    },
    {
        "content": "<p>I'll ask around</p>",
        "id": 153863310,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1481667995
    }
]