[
    {
        "content": "<p>Hi guys! There's a lot of info sources, this chat and github etc, so this may have been asked before: what is the rationale between only having one hook per service? I would find it logical to provide multiple hooks under the same theme or \"umbrella\", i.e. the CDS service.</p>",
        "id": 153891918,
        "sender_full_name": "Ville Lindholm",
        "timestamp": 1496303432
    },
    {
        "content": "<p>My case is that we are implementing decision support for a national self-care service, i.e. the user fills out a questionnaire that asks for symptoms, and this (potentially together with publicly available EHR data) is sent to us and we provide directions for self-care and for seeking professional help if it is needed. It would be nice to have all the hooks under e.g. a 'self-care' service :)</p>",
        "id": 153891919,
        "sender_full_name": "Ville Lindholm",
        "timestamp": 1496303735
    },
    {
        "content": "<p>what do you mean, all under one service?</p>",
        "id": 153891920,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1496308126
    },
    {
        "content": "<p>As far as I can understand, cds-services lists all the available services, returning each service (i.e. rest endpoint) and the hook name corresponding to that service</p>",
        "id": 153891921,
        "sender_full_name": "Ville Lindholm",
        "timestamp": 1496308776
    },
    {
        "content": "<p>and hook name != service name</p>",
        "id": 153891922,
        "sender_full_name": "Ville Lindholm",
        "timestamp": 1496308785
    },
    {
        "content": "<p>but I haven't seen any example of a service, i.e. endpoint, supporting multiple hooks.</p>",
        "id": 153891923,
        "sender_full_name": "Ville Lindholm",
        "timestamp": 1496308811
    },
    {
        "content": "<p>is it as simple as cds-service returning the same endpoint multiple times, with different hook and parameter values?</p>",
        "id": 153891924,
        "sender_full_name": "Ville Lindholm",
        "timestamp": 1496308887
    },
    {
        "content": "<p>cds-services*</p>",
        "id": 153891925,
        "sender_full_name": "Ville Lindholm",
        "timestamp": 1496308902
    },
    {
        "content": "<p>Each CDS hooks server can have a list of  'services' each of which has it's own endpoint based on the base url of the server e.g. two 'services' listed <a href=\"https://oridashiquickhooks.azurewebsites.net/cds/cds-services\" target=\"_blank\" title=\"https://oridashiquickhooks.azurewebsites.net/cds/cds-services\">https://oridashiquickhooks.azurewebsites.net/cds/cds-services</a> - this means there are two endpoints to call with the specified pre-fetch data - the 'hook' value is the context when to make the call <br>\ne.g. for this server endpoints are <a href=\"https://oridashiquickhooks.azurewebsites.net/cds/cds-services/redbook-7\" target=\"_blank\" title=\"https://oridashiquickhooks.azurewebsites.net/cds/cds-services/redbook-7\">https://oridashiquickhooks.azurewebsites.net/cds/cds-services/redbook-7</a> and <a href=\"https://oridashiquickhooks.azurewebsites.net/cds/cds-services/redbook-8\" target=\"_blank\" title=\"https://oridashiquickhooks.azurewebsites.net/cds/cds-services/redbook-8\">https://oridashiquickhooks.azurewebsites.net/cds/cds-services/redbook-8</a></p>",
        "id": 153891942,
        "sender_full_name": "Brett Esler",
        "timestamp": 1496329937
    },
    {
        "content": "<p>is that the sort of thing you are meaning? the 'hook' would not need to be thesame type ; and can see the prefetch content can be different for each service</p>",
        "id": 153891944,
        "sender_full_name": "Brett Esler",
        "timestamp": 1496330010
    },
    {
        "content": "<p>I was actually thinking about it the other way around, that I would have one endpoint (i.e. service) which would support multiple hooks. In your example e.g. 'redbook-7' could support both 'patient-view' and 'medication-prescribe' hooks.</p>",
        "id": 153891949,
        "sender_full_name": "Ville Lindholm",
        "timestamp": 1496331737
    },
    {
        "content": "<p>So I was wondering if it was kosher to list the same endpoint multiple times in 'cds-services', only with different hook names and prefetch contents.</p>",
        "id": 153891951,
        "sender_full_name": "Ville Lindholm",
        "timestamp": 1496331774
    },
    {
        "content": "<p>I can of course just name the endpoints e.g. 'redbook-7-patient-view' and 'redbook-7-medication-prescribe' or whatever but that's not very aesthetic :)</p>",
        "id": 153891952,
        "sender_full_name": "Ville Lindholm",
        "timestamp": 1496331960
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193725\">@Ville Lindholm</span> - While it is true each CDS Service is associated with a single hook, you can (under the covers as an implementation detail of your server) simply have multiple endpoints for your \"uber\" service, each of which is associated to whatever hook you want</p>",
        "id": 153891966,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1496342176
    },
    {
        "content": "<p>Not sure what you mean. I'm a bit lost as to the hierarchy between services and hooks. Why is there only one hook allowed per endpoint? My first thought would be that the hook is the \"verb\" and the service is the context for that verb. I would like to apply that same context to many verbs. <br>\n Without going into details, my plan was that one service would equal one vendor, and every vendor would have access to the same set of hooks on their own endpoint, with the hook's prefetches and results tailored for their specific needs.</p>",
        "id": 153891967,
        "sender_full_name": "Ville Lindholm",
        "timestamp": 1496343194
    },
    {
        "content": "<p>I think setting the 'hook' element on a 'service' to whichever hook type you would like i.e. same or different - then calls are made into the appropriate 'service' at the appropriate trigger point... the 'id' is whatever it is so don't see that being  that important (?) -  so I think of it as an endpoint {baseUrl}/cds-services and the call {baseUrl}/cds-services/{id} is a call to that endpoint with an 'id' parameter (RESTful) - which is how i've implemented it also</p>",
        "id": 153892000,
        "sender_full_name": "Brett Esler",
        "timestamp": 1496362000
    },
    {
        "content": "<p>each service entry is a self contained definition of - appopriate time to trigger (hook); which data to provider up front (prefetch); an identity to reference (id) + descriptions (name, description) <br>\neach cds service call is done at appropriate hook trigger point and contains the id of the 'service' you are invoking </p>",
        "id": 153892001,
        "sender_full_name": "Brett Esler",
        "timestamp": 1496362240
    },
    {
        "content": "<p>granularity of the service is up to the cds provider i.e. I could put all of the chapters of my preventative care guidelines into one call with a lot of prefetch data; or split to have one call per chapter (which is as per my example site);</p>",
        "id": 153892003,
        "sender_full_name": "Brett Esler",
        "timestamp": 1496362474
    },
    {
        "content": "<p>I guess multple 'hook' elements would be something to think about for 'services' definitions i.e. same cds calls at multiple trigger points? although this becomes just a definition/discovery issue - as multiple service defintions can be routed through to a single processor for implementation anway... </p>",
        "id": 153892004,
        "sender_full_name": "Brett Esler",
        "timestamp": 1496362637
    }
]