[
    {
        "content": "<p>Are changes to resources by CDS servers expected to include updates to the narrative or is the expectation that the client will re-generate the narrative after updates are applied?  What are the rules if the narrative isn't marked as being generated?</p>",
        "id": 153984282,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1533833738
    },
    {
        "content": "<p>bump</p>",
        "id": 153986102,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1534213465
    },
    {
        "content": "<p>Hey Lloyd, following an update, I'd expect a narrative to be either discarded or re-generated. Where a generated narrative exists, a best practice would be for the cds service to simply provide a narrative as part of the suggestion. The client should possibly display this narrative as part of the card as well.</p>",
        "id": 153986107,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1534213865
    },
    {
        "content": "<p>And if the existing narrative was not generated, should updates be prohibited?  The challenge of the CDS service displaying the narrative is that it might well not recognize some of the extensions in the instance and know how/whether to display them.  It would also mean that the narrative of the CDS-generated instance would look different from 'standard' orders from that system.  I can see the hook service generating narrative if it introduced its own extensions, but it might be better for the EHR to do it if the service was only manipulating existing elements or core elements.</p>",
        "id": 153986111,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1534214133
    },
    {
        "content": "<p>Hey Lloyd - I'm was hoping to find guidance on how a regular restful update treated narrative, here: <a href=\"https://www.hl7.org/fhir/http.html#update\" target=\"_blank\" title=\"https://www.hl7.org/fhir/http.html#update\">https://www.hl7.org/fhir/http.html#update</a>, but the only guidance is in patch. I don't know how servers typically handle narratives for resource updates. I'd expect the server to trust the client and update the narrative along with the rest of the resource as requested. From the client's perspective, a CDS Hooks suggestion with an update is simply a FHIR update. A great client that supports non-generated updates might enable the clinician to view/modify the narrative being stored with the updated resource, but I don't think this would be a requirement.</p>",
        "id": 153986128,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1534214916
    }
]