[
    {
        "content": "<p>Hi all - fyi have just established a new cds service at  <a href=\"http://oridashiquickhooks.azurewebsites.net/cds\" target=\"_blank\" title=\"http://oridashiquickhooks.azurewebsites.net/cds\">http://oridashiquickhooks.azurewebsites.net/cds</a> this is currently implementing advice based on sections 7.1/7.2 of <a href=\"http://www.racgp.org.au/your-practice/guidelines/redbook\" target=\"_blank\" title=\"http://www.racgp.org.au/your-practice/guidelines/redbook\">http://www.racgp.org.au/your-practice/guidelines/redbook</a> preventative care guidelines. Currently this is accepting DSTU2, but a STU3 version will also become available in the near future. </p>",
        "id": 153869446,
        "sender_full_name": "Brett Esler",
        "timestamp": 1485700885
    },
    {
        "content": "<p>Great, thanks for the heads up Brett</p>",
        "id": 153869592,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1485873684
    },
    {
        "content": "<p>\"The resource you are looking for has been removed, had its name changed, or is temporarily unavailable.\"?</p>",
        "id": 153872953,
        "sender_full_name": "Vadim Peretokin",
        "timestamp": 1487685475
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"191368\">@Brett Esler</span>, I found your post from Jan 29th that you are working on an STU3 version of services for Redbook guidelines. Is that available for my testing?  Looks like a very interesting example use case!  Also, do you have additional notes about this service implementation, e.g. from simple testing, it appears that the prefetched Patient is required, but does your service query for other data that may be used, or must all be provided in prefetch POST request?</p>",
        "id": 153891187,
        "sender_full_name": "Dave Carlson",
        "timestamp": 1495651439
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197476\">@Dave Carlson</span> will get an updated STU3 version online and post details here - it has been left a bit behind recently.  Currently this service is running only on prefetched data which can contain Conditions,  some select Observations (e. g.  height and weight). Will add some notes also that explain things further.  This is all pretty experimental..</p>",
        "id": 153891297,
        "sender_full_name": "Brett Esler",
        "timestamp": 1495728439
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191368\">@Brett Esler</span> experimental is perfectly fine for my purposes.  I would like to incorporate this (and other similar services) into proposal for a Care Plan track at the Sept connectathon in San Diego.  Do you expect to be there?  I would like to pre-plan coordinated testing between the Care Plan and CDS-Hooks tracks.</p>",
        "id": 153891301,
        "sender_full_name": "Dave Carlson",
        "timestamp": 1495728823
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"197476\">@Dave Carlson</span>  STU3 version of Redbook guildeines is now published on <a href=\"http://oridashiquickhooksstu3.azurewebsites.net/cds\" target=\"_blank\" title=\"http://oridashiquickhooksstu3.azurewebsites.net/cds\">http://oridashiquickhooksstu3.azurewebsites.net/cds</a>  - I won't be at San Diego in person but will most likely connect in virtually. Still no notes as yet but can see what may be supplied in the pre-fetch - so basically patient (demographics include AU extension for indigenous status); conditions, height, weight, bmi, waist circumference, blood pressure, lipids, smoking status.</p>",
        "id": 153891437,
        "sender_full_name": "Brett Esler",
        "timestamp": 1495983899
    }
]