[
    {
        "content": "<p>While I would expect a majority of Hooks clients to obtain the bearer tokens needed for authentication from an OAuth server, I notice the section in the spec on authenticating client requests doesn't actually mention OAuth.  I imagine this is because the Hooks server doesn't care how the token was obtained, only that it is valid (\"iss\" URI is trusted, signature passes validation, etc.).  Is it indeed the case that the bearer token does <em>not</em> have to come from an OAuth server?  And if so, is anyone aware of this being done anywhere?  Or is OAuth the de facto standard?</p>",
        "id": 260701405,
        "sender_full_name": "Jorge de la Garza",
        "timestamp": 1636397359
    },
    {
        "content": "<p>Why doesn't CDS hooks just point to \"SMART backend services: Authorization Guide\" <a href=\"https://hl7.org/fhir/uv/bulkdata/authorization/index.html\">https://hl7.org/fhir/uv/bulkdata/authorization/index.html</a> instead of defining its own spec for client authorization?</p>",
        "id": 262028120,
        "sender_full_name": "Gunjit Chhatwal",
        "timestamp": 1637298832
    },
    {
        "content": "<p>The CDS Hooksauthentication spec came first. Also, keep in mind that smart backend services requires client authentication and uses that as an authorization grant, so there is one step to get an access token and a separate step to use that access token in a request.  In CDS, hooks,  The client just directly presents an authentication token as part of its API request.</p>",
        "id": 262067928,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1637329747
    },
    {
        "content": "<p>Thanks, Josh. However, since most of the API servers would already be supporting \"SMART backend services: Authorization Guide\" for FHIR APIs, having the same mechanism for CDS will help. Otherwise API owners will need to implement and test both these auth mechanisms.</p>",
        "id": 262118378,
        "sender_full_name": "Gunjit Chhatwal",
        "timestamp": 1637350587
    },
    {
        "content": "<p>I agree. But CDS Hooks needs to balance the need for</p>\n<p>1) API stability and<br>\n2) Avoiding an extra round-trip</p>\n<p>... against the value of consistency with SMART Backend Services. I don't think there's a slam-dunk argument for making a change.</p>",
        "id": 262122721,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1637352456
    },
    {
        "content": "<p>er, nvm</p>",
        "id": 265244630,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1639705732
    },
    {
        "content": "<p>what Josh said -- latency, and also simplicity.</p>",
        "id": 265244753,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1639705857
    }
]