[
    {
        "content": "<p>As discussed on the CDS call, I've put forward the draft version of the order-dispatch hook.  You can see the proposal here: <a href=\"https://github.com/cds-hooks/docs/pull/611\">https://github.com/cds-hooks/docs/pull/611</a><br>\n(<span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span>)</p>",
        "id": 270504684,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1643868057
    },
    {
        "content": "<p>There will be cases in which a referral is made to an organization, and then that performing organization sets a specific provider, and therefore the performing organization should also call order-dispatch. Is this an intended use-case? (that the performing org may also call this hook)</p>",
        "id": 271001720,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1644250413
    },
    {
        "content": "<p>Ongoing feedback about the name choice -- we talked about not using the more obvious term \"referral\" on a previous call, because of concern that \"referral\" is overloaded and doesn't have a clear or consistent definition in the industry; hence, a new term is useful. \"dispatch\" is the act of sending something, but (above question), wouldn't order-delegate or order-assigned be more accurate?</p>",
        "id": 271002521,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1644250677
    },
    {
        "content": "<p>cc/ <span class=\"user-mention\" data-user-id=\"468490\">@Kyle Johnsen</span></p>",
        "id": 271002623,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1644250701
    },
    {
        "content": "<p>That's possible.  When an order gets to a 'performer', there's actually an \"order encoding\" step where the generic order is transformed into more detail - identifying more specific products/therapies, more specific service providers, more specific timing, etc.  I've been considering this to be an appropriate use of order-select/order-sign, but it's probably best to clarify that.  Certainly the cards that come back need to operate within the constraints of the parent order.  E.g. might be reasonable to suggest switching to a generic rather than name-brand if that's allowed by the parent order, but probably not ok to propose a therapy not allowed by the original order.</p>\n<p>I could accept order-assign.  Not a fan of order-delegate as it's not really \"delegation\" because there isn't anyone responsible for the order before it's assigned.</p>",
        "id": 271005178,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1644251726
    }
]