[
    {
        "content": "<p>I'm coming late to this party, but: for the use case of pre-populating a specific CDS Service in (so users don't have to manually click \"Add a CDS Service\"), how come the sandbox is configured to take a <code>serviceDiscoveryURL</code> as an access token parameter rather than just a regular URL parameter?</p>\n<p>Using a regular URL parameter would allow more flexible sandbox configuration even outside the context of a SMART-launched sandbox -- but maybe I'm missing a design consideration here <span class=\"user-mention\" data-user-id=\"191355\">@Kevin Shekleton</span> <span class=\"user-mention\" data-user-id=\"191414\">@Dan Gottlieb</span> <span class=\"user-mention\" data-user-id=\"193731\">@Vladimir Ignatov</span> ?</p>",
        "id": 153954789,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1524841955
    },
    {
        "content": "<p>To put this more concretely: why not pass a <code>serviceDiscoveryURL</code> like </p>\n<div class=\"codehilite\"><pre><span></span>https://sandbox.cds-hooks.org?serviceDiscoveryURL=:url\n</pre></div>\n\n\n<p>Instead of embedding this parameter in an access token response that the sandbox only sees when it's launched as a SMART app?</p>",
        "id": 153954791,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1524842066
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>  I agree that's a better approach - iirc, we used the context to limit modifications to the current sandbox code while it's being rewritten...</p>",
        "id": 153954797,
        "sender_full_name": "Dan Gottlieb",
        "timestamp": 1524846056
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191414\">@Dan Gottlieb</span> , <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> <br>\nAre there any CDS Services available in production today?  If so, who is providing them, and what version of FHIR are they using?  If nothing in FHIR available in production quality, what are options do I have to use an external service to do Allergy Checking at the time of Medication Order.  I also need to do Duplicate Medication Checking, but I think I can do that internally.</p>",
        "id": 153954891,
        "sender_full_name": "Radu Craioveanu",
        "timestamp": 1524951623
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192495\">@Radu Craioveanu</span> - There are none in production today as we have not released a version of the CDS Hooks specification. However, we are currently balloting our first release of CDS Hooks through HL7 for the May 2018 ballot cycle!</p>",
        "id": 153955473,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1525292357
    }
]