[
    {
        "content": "<p>Hi Everyone,</p>\n<p>Looks like there is a lot of activity going on at the CDS-Hooks track. I am missing the fun, but would like to participate actively today. So what is the plan for today. Please do let me know.</p>\n<p>Thanks,<br>\nKalyani </p>",
        "id": 153887746,
        "sender_full_name": "Kalyani Yerra",
        "timestamp": 1494137023
    },
    {
        "content": "<p>Hey Kalyani! We just have 2hrs this morning (10a-12p) before presentations start. CDS Hooks is first up and we have 5 minutes to talk about our work during the Connectathon. I'm going to ask everyone to send me what they did by 11a so that I can get the slides ready. From 11a-12p we're going to do a breakout and discuss the <a href=\"https://github.com/cds-hooks/docs/wiki/2017-05-Connectathon\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/wiki/2017-05-Connectathon\">Github Issues noted here</a></p>",
        "id": 153887761,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1494143058
    },
    {
        "content": "<p>Thanks Kevin.  Is there a possibility for me to participate in the discussion remotely? If there is a phone number I can dial in , that would be great.</p>",
        "id": 153887764,
        "sender_full_name": "Kalyani Yerra",
        "timestamp": 1494143156
    },
    {
        "content": "<p>I'm not sure that we'll be able to have a call where you can hear everyone. :-(</p>\n<p>What we will do is summarize the group discussion on each Github Issue that we discuss. We won't be making final decisions on these so that those not present can provide their input. That way you can read through our discussion and provide your comments too. How does that sound?</p>",
        "id": 153887767,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1494143359
    },
    {
        "content": "<p>Yes that sounds fine. Thank you.</p>",
        "id": 153887769,
        "sender_full_name": "Kalyani Yerra",
        "timestamp": 1494143428
    },
    {
        "content": "<p>Thanks. Also, I'm super impressed you are up in the middle of the night :-)</p>",
        "id": 153887770,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1494143458
    },
    {
        "content": "<p>For those not here in person -- at 12p Madrid time the Connectathon presentations will start. CDS Hooks has the very first presentation (it's just 5 minutes). <a href=\"https://global.gotowebinar.com/pjoin/5921601672585879554/2436342227070906626\" target=\"_blank\" title=\"https://global.gotowebinar.com/pjoin/5921601672585879554/2436342227070906626\">Here is the WebEx</a> for those who want to watch/listen live.</p>\n<p>Don't worry if you cannot watch live. I'll be posting the slides for everyone to see too!</p>",
        "id": 153887771,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1494143662
    },
    {
        "content": "<p>Break out session to discuss Github Issues in Burdeos (sp?) (right across from the Connectathon room)</p>",
        "id": 153887874,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1494147994
    }
]