[
    {
        "content": "<p>Hi,<br>\nWe're working on a new CDS Hooks service and I wanted to just clarify the behaviour around when we have a 'Precondition Failed'. Are we able or is it even appropriate to send cards back detailing what data was missing?</p>",
        "id": 238437990,
        "sender_full_name": "Dan Miller",
        "timestamp": 1620807457
    },
    {
        "content": "<p>Cards are intended to be displayed to the user, so that may not be the most appropriate means for this type of error.  The spec doesen't <em>currently</em> define an operation outcome or similar response structure for a 412, but I know there's been <a href=\"https://github.com/cds-hooks/docs/issues/14\">conversation</a> around this for errors in general.</p>\n<p>It sounds like the scenario you're thinking through is when the CDS Service isn't able to obtain its necessary data because the FHIR server is down, returning errorrs, or there's other connecetivity issues.  The 412 would tell the CDS Client that these kinds of problems are occuring, which the CDS Client may use to indicate to the user that there are issues, as well as trigger action on the operational side of things.</p>\n<p>Within this scenario when the CDS Client isn't able to obtain the data it needs to make a recommndation, are there sub-types of errors that you can see being useful to tell a CDS Client?</p>",
        "id": 238490047,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1620832172
    },
    {
        "content": "<p>Yes, one scenario we are thinking about is when the fhir server is unavailable to us. However, we are also considering when the data just isn't available.</p>\n<p>The best example I can think of is when our CDS requires the patient’s height or weight, but one hasn't been recorded and isn't available. This data isn't always required and depends on the medication being prescribed. If the CDS passes without this data but checks that required height or weight data couldn't be run I would think we should send a 412 'Precondition Failed'. But it's something the clinician may be able to address so also giving them a message detailing the missing data could possibly be helpful?</p>\n<p>Going further down the rabbit hole, we could indicate the type of data missing allowing the client to trigger a workflow but given the client knows what is in the prefetch criteria this is probably redundant.</p>",
        "id": 238639666,
        "sender_full_name": "Dan Miller",
        "timestamp": 1620920851
    },
    {
        "content": "<p>If there's something that the user might be able to do something about, a card <em>might</em> be possible.  Otherwise, OperationOutcome could be appropriate so that each CDS Client can decide whether the user should be notified.  For example, if the FHIR server is down and 3 services report that, the CDS Client could aggregate that into one message just to say that there are issues with CDS.   Similarly, if 3 services report that vitals were missing, the client has potential to present a single message rather than spamming the user.</p>\n<p>Want to bump <a href=\"https://github.com/cds-hooks/docs/issues/14\">https://github.com/cds-hooks/docs/issues/14</a> with some of your thoughts?</p>",
        "id": 239243512,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1621340734
    },
    {
        "content": "<p>Thanks Dennis,</p>\n<p>I think for now we are going to return the 412 with an empty payload. The prefetch details what's required to process the CDS so it should be possible to determine what data is missing. As we understand more about implementations we will be able to determine if and what additional messaging might be helpful.</p>\n<p>I'll add our thoughts to the issue as I think it might be good for discussion.</p>",
        "id": 239262778,
        "sender_full_name": "Dan Miller",
        "timestamp": 1621348105
    }
]