[
    {
        "content": "<p>Hello,</p>\n<p>are we required to send the prefetch data with every invocation of the hook instance? So far I have interpreted it that prefetch data needs to be sent with the first invocation of a hook instance. When we invoke it again (e.g. after the CDS service/app redirects back to the EHR), are we expected to provide the prefetch data again?</p>",
        "id": 153923384,
        "sender_full_name": "Wolfgang Wiessler",
        "timestamp": 1512661263
    },
    {
        "content": "<p>Hi Wolfgang! Prefetch is an optional aspect of the CDS Service request and the EHR is not obligated to honor any prefetch requests. From our <a href=\"http://cds-hooks.org/specification/1.0\" target=\"_blank\" title=\"http://cds-hooks.org/specification/1.0\">specification</a>:</p>\n<p>\"An EHR may choose to honor some or all of the desired prefetch templates from an appropriate source.\"</p>\n<p>\"It is the CDS Service's responsibility to check to see what prefetched data was satisfied (if any) and manually retrieve any necessary data. If the CDS Service is unable to obtain required data because it cannot access the FHIR server and the request did not contain the necessary pre-fetch keys; the service shall respond with an HTTP 412 Precondition Failed status code.\"</p>",
        "id": 153923441,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1512671719
    },
    {
        "content": "<p>Hi Kevin! That is what I thought. I am currently building our CDS framework implementation and I am testing it against the CDS Sandbox services. Those services are rejecting requests that do not have the matching prefetch. My assumption was that they are not 100% up to spec and I wanted to make sure that this is indeed the case or if services should reject requests if the expected prefetch data is not there.</p>",
        "id": 153923678,
        "sender_full_name": "Wolfgang Wiessler",
        "timestamp": 1512724833
    },
    {
        "content": "<p>I was not aware that not caching this data was not up to spec?</p>",
        "id": 153923703,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1512734232
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"194405\">@Wolfgang Wiessler</span> - That is correct that those CDS Services that are bundled with our Sandbox assume the prefetched data is always present. <span class=\"user-mention\" data-user-id=\"192599\">@Zach Plata</span> is actually re-writing those CDS Services now and as part of that work, he is changing them to gracefully handle the scenario in which case the prefetched data is not present :)</p>",
        "id": 153923802,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1512760868
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191316\">@Grahame Grieve</span> - Where are you getting the caching questions from?</p>",
        "id": 153923803,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1512760928
    },
    {
        "content": "<p>just from what is above</p>",
        "id": 153923808,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1512764394
    },
    {
        "content": "<p>I’m sorry, I’m not following. I don’t see any references to caching in this thread</p>",
        "id": 153923889,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1512824809
    },
    {
        "content": "<p>the notion above is that you should only need to send the pre-fetch data with the first invocation of a hookInstance. And any casual reader would conclude, from the thread, that if a cds service does not do this, it's not up to spec.</p>\n<p>But the spec never says that this is an expectation, and it's a <em>hard</em> expectation, since there's no 'done with a hook' call for a CDS service to stop remembering the context. I think there should be more clarity around this</p>",
        "id": 153923964,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1512855358
    },
    {
        "content": "<p>To summarize:<br>\n- The prefetch queries are not mandatory. A CDS Service can ask for that data upon invocation, but it is not guaranteed that the data will be there<br>\n- The EHR decides whether to fulfill the prefetch requests (in full or partially)<br>\n- The CDS Service is expected to gracefully deal with missing data: 1. Try querying the data via the FHIR API (if available); 2. If the CDS Service cannot get the data, return a proper response (e.g. empty cards array or an info card) </p>\n<p>In our case the CDS Service would just return an App Link Card and the app will not have any data pre-filled.</p>\n<p>I suppose the \"caching\" aspect could come in when we only send the prefetch on the first invocation. Then the CDS Service needs to cache that data if it needs it in subsequent requests or it needs to query it again. </p>\n<p>To me, sending prefetch (only) makes sense on the first invocation, since this is where you are setting the context of the interaction and kick-start the service. Most subsequent calls are for getting the status/results from the CDS Service after user interaction.</p>",
        "id": 153924478,
        "sender_full_name": "Wolfgang Wiessler",
        "timestamp": 1513077894
    },
    {
        "content": "<p>Is there any way that a client can find out in advance what FHIR queries a service is likely to make of it? the 'definition' returned by the discovery has a prefetch, but that is not necessarily all the data that a service might want from the client (is it?).  It would be nice to look at the definition to understand what data it is expecting to get from the client...</p>",
        "id": 153929368,
        "sender_full_name": "David Hay",
        "timestamp": 1516232553
    },
    {
        "content": "<p>We don't have this in CDS Hooks today, no.</p>",
        "id": 153929446,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1516297157
    },
    {
        "content": "<p>This question has come up before and you could take this same question and ask it regarding SMART apps, too.</p>",
        "id": 153929447,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1516297186
    },
    {
        "content": "<p>perhaps a statement of SMART on FHIR scopes that may be needed and list of profile URIs the CDS relies on?</p>",
        "id": 153929530,
        "sender_full_name": "Brett Esler",
        "timestamp": 1516316136
    }
]