[
    {
        "content": "<p>I looked over the Proposed Security Model. Here are a few questions:<br>\n1. The proposal has the EHR server obtaining an access token on behalf of the CDS Service. Do we intend to specify which OAuth2 flow will be used for this? The SMART On FHIR Authorization Guide specifies the use of the OAuth2 Authorization Code Grant flow. But that flow seems to require a user interface for entering credentials and optionally for presenting a prompt for the user to grant access. So it would not seem to fit for this server to server exchange. For server to server, it appears the Client Credentials Grant or Resource Owner Password Credentials flows are recommended.<br>\n2. The Access Token is sent to the CDS Service when the CDS Service is called at triggering of a CDS Hook. Does the CDS Service then cache the Access Token so that when a SMART application is launched from a CDS Service card it will have the access token to use for the subsequent queries to the EHR server? </p>",
        "id": 153895068,
        "sender_full_name": "Chuck Feltner",
        "timestamp": 1498223322
    },
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"192613\">@Chuck Feltner</span> ,</p>\n<p>1) I think that the intent is the \"client credentials grant\".</p>\n<p>2) No. The cds service and smart app shound't need to be the same system / able to exchange an access token. The SMART app is launched from the EHR with a standard SMART launch token and gets it's own access token from the EHR's OAuth2 server.</p>\n<p>Any concerns with the above approach?</p>",
        "id": 153895110,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1498240511
    },
    {
        "content": "<p>Thanks <span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span>.  That makes sense.<br>\nIs there any concern that the user session which triggers the CDS Hook may not be authorized for all of the scopes that the CDS Service is requesting?<br>\nUser: clinician1, allowed scopes=patient/Patient.read<br>\nCDS Service: CDSService1, allowed scopes=patient/Patient.read,Observation.read,MedicationStatement.read</p>",
        "id": 153895123,
        "sender_full_name": "Chuck Feltner",
        "timestamp": 1498247564
    },
    {
        "content": "<p>In looking over the proposed security model I have a few questions that are somewhat inter-related:</p>\n<p>1. I may be missing something in the documentation on SMART and in the proposed security model, but I do not understand how the app pointed at by link.url authenticates to the CDS service. There is no requirement that they are the same, yet the app will generally need to access the CDS service (probably more often than the FHIR service) and will need to reference the session created by the request that provided the link.url. This applies equally to the non-SMART app. I am assuming that authentication would need to be part of the URL?</p>\n<p>2. How will the analytics endpoints be authenticated by the service? How will the service know which hookInstance an analytics request is about? </p>\n<p>3. Depending on the answers from 1 and 2, both link.url and the analytic endpoints have a fixed string which may contain authentication credentials. To maintain security, these must have a timeout and may be one-time in nature. How do we inform the EMR of this? I mean there is nothing that says that a displayed card needs to be acted on within an hour, a day, a week, month, etc.</p>\n<p>4. Proposed JWT aud. What does this refer to? The specific endpoint, a prefix to it, or a token request endpoint? ie: '<a href=\"https://example.com/cds-services\" target=\"_blank\" title=\"https://example.com/cds-services\">https://example.com/cds-services</a>', '<a href=\"https://example.com/cds-services/medication-echo\" target=\"_blank\" title=\"https://example.com/cds-services/medication-echo\">https://example.com/cds-services/medication-echo</a>', '<a href=\"https://example.com/cds-services/medication-echo/analytics/C919155B-2138-4177-A316-524CB48B4EC9\" target=\"_blank\" title=\"https://example.com/cds-services/medication-echo/analytics/C919155B-2138-4177-A316-524CB48B4EC9\">https://example.com/cds-services/medication-echo/analytics/C919155B-2138-4177-A316-524CB48B4EC9</a>', '<a href=\"https://example.com/token\" target=\"_blank\" title=\"https://example.com/token\">https://example.com/token</a>'</p>",
        "id": 153895644,
        "sender_full_name": "Robert Sax",
        "timestamp": 1498737603
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span>,  <span class=\"user-mention\" data-user-id=\"191355\">@Kevin Shekleton</span>,  <span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span>  thoughts on the above questions?</p>",
        "id": 153896489,
        "sender_full_name": "Robert Sax",
        "timestamp": 1499702519
    },
    {
        "content": "<p>Sorry I'm so late to this conversation guys. I've been off of Zulip for too long!</p>\n<p><span class=\"user-mention\" data-user-id=\"192613\">@Chuck Feltner</span>  &amp; <span class=\"user-mention\" data-user-id=\"191864\">@Isaac Vetter</span>, regarding question 1. There is no intent behind the OAuth2 flow so I wouldn't say that we're targeting the OAuth 2 client credentials grant. The EHR owns the authorization server so it can obtain access tokens however it sees fit, including eschewing any OAuth 2 workflows. As long as the access token is accepted by the FHIR server, the manner in which it is obtained is an implementation detail of the EHR.</p>",
        "id": 153896903,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1500003868
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"193057\">@Robert Sax</span> - I replied to your questions on <a href=\"https://github.com/cds-hooks/docs/issues/55\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/55\">#55</a>. Sorry for not being online here earlier to reply and thanks for your patience. :-)</p>",
        "id": 153896904,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1500003951
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191355\">@Kevin Shekleton</span> , regarding question 1. While it does seem that all EHRs are providing both a FHIR Server and custom OAuth2 Authorization Server, showing the interaction between the servers using the standard protocols does help to define the interaction. As you said if the EHR provides both the FHIR Server and Authorization server they could achieve this by an internal mechanism but this would be an optimization. Also by not specifying the OAuth2 flow are we limiting the CDS Services from not being able to call the Authorization service directly? Currently, the CDS Service does not have to use the prefetch option and can fetch all of the data once it is called. Wouldn't that require them first to authorize?</p>",
        "id": 153897068,
        "sender_full_name": "Chuck Feltner",
        "timestamp": 1500296890
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"192613\">@Chuck Feltner</span> - I do not think our proposed security model precludes the EHR from obtaining an access token on behalf of the CDS Service via a standard OAuth 2 workflow.</p>",
        "id": 153897102,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1500311637
    },
    {
        "content": "<p>If the CDS Service wants to interact with the Authorization (OAuth 2) server directly, it would only be able to obtain a B2B access token and not a token on behalf of the current user. This is because the CDS Service does not have any UI -- it is a service</p>",
        "id": 153897103,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1500311789
    }
]