[
    {
        "content": "<p>All, WOuld be great to get a bit of clarity on the use of the RiskAssessment Resource. Would it be OK to use this for the outcome of Early Warning Score (EWS) algorithms or cart-cardiac-arrest-risk-triage-score? How about using it for Apgar score?</p>",
        "id": 160787768,
        "sender_full_name": "Asim",
        "timestamp": 1552575245
    },
    {
        "content": "<p>Yes, I think those would both be reasonable uses of the RiskAssessment resource. One of the examples in the spec is a Cardiac Risk score: <a href=\"http://build.fhir.org/riskassessment-example-cardiac.html\" target=\"_blank\" title=\"http://build.fhir.org/riskassessment-example-cardiac.html\">http://build.fhir.org/riskassessment-example-cardiac.html</a></p>",
        "id": 160808032,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1552587960
    },
    {
        "content": "<p>Thanks Bryn, so do you see the output of these algorithms as \"risk\" or \"score\"? in the later case the \"score\" needs to be mapped to the assoicated \"risk\", thoughts?</p>",
        "id": 161069624,
        "sender_full_name": "Asim",
        "timestamp": 1552924273
    },
    {
        "content": "<p>The score can be represented as an Observation that the RiskAssessment.basis references</p>",
        "id": 161070421,
        "sender_full_name": "Bryn Rhodes",
        "timestamp": 1552924851
    },
    {
        "content": "<p>OK so if \"score\" then it is an observation, however when interpretted and mapped to \"risk\" then the appropriate resource to use would be \"RiskAssessment\"</p>",
        "id": 161070982,
        "sender_full_name": "Asim",
        "timestamp": 1552925242
    },
    {
        "content": "<p>This discussion is right on, but you should also consider how and where this is going to be used.  RiskAssessment is at maturity level 1, and as far as I'm aware, is not supported (yet) by any of the major EHR vendors.  So... if you design a solution around RiskAssessment, and you need to exchange it with another FHIR server -- you might want to make sure that server supports it before fully investing in that solution.</p>",
        "id": 161173643,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1553017476
    },
    {
        "content": "<p>That said, my experience is that some of the major EHR vendors won't support the score in an Observation either -- as they might only support the Argonaut/USCore categories of Observations -- for lab results, vitals, and smoking history.</p>",
        "id": 161173771,
        "sender_full_name": "Chris Moesel",
        "timestamp": 1553017562
    },
    {
        "content": "<p>Thanks Chris, those are indeed very important items to take into considerations but this also points to the need for further clarity on the use of such resources. let's hope the EHR vendors would use what is right per standard!!!</p>",
        "id": 161225105,
        "sender_full_name": "Asim",
        "timestamp": 1553070212
    }
]