[
    {
        "content": "<p>With the deprecation of the medication-prescribe hook, the public sandbox's Rx View tab has been updated to invoke order-select!  The corresponding default service for that tab (cms-price-check) has also been updated.  While the tab is still dedicated to Meds, hopefully this will help as you start experimenting with order-select!</p>",
        "id": 167034904,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1559337161
    },
    {
        "content": "<p>Is there any way to have targetted order-select? I'm trying to have the cds pop up only when certain medications are prescribed not for every drug that is prescribed. It would be amazing if anyone has insight on narrowing down and creating this specific use case</p>",
        "id": 167146009,
        "sender_full_name": "Jeremie Osaghae-Nosa",
        "timestamp": 1559522095
    },
    {
        "content": "<p>You only need to return cards if you have something useful to say.  At the moment there isn't a mechanism to further filter what notifications you receive as a CDS service, but just because the service is invoked doesn't mean it has to return anything.  No CDS will pop up unless the service returns cards.</p>",
        "id": 167146939,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559523865
    },
    {
        "content": "<p>Yes, I want to return a card for certain medications but not all medications. So if I'm understanding you correctly, there is no way to do that?</p>",
        "id": 167147805,
        "sender_full_name": "Jeremie Osaghae-Nosa",
        "timestamp": 1559525323
    },
    {
        "content": "<p>Sure.  Your service will receive all medications.  You return cards for only the messages you care about.  What you can't do right now is prevent your service from being invoked for all medications.</p>",
        "id": 167147968,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559525560
    },
    {
        "content": "<p>Thank you. Is there any way to know the medication that is being prescribed if the card sends the Physician to a Smart on FHIR app?</p>",
        "id": 167148146,
        "sender_full_name": "Jeremie Osaghae-Nosa",
        "timestamp": 1559525858
    },
    {
        "content": "<p>There's a token your card can provide to the Smart App when it's invoked.  That can contain whatever information you wanted it to.  I think up to and including the whole draft Rx.</p>",
        "id": 167148285,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559526038
    },
    {
        "content": "<p>Thank you for this information it was really helpful. Have an amazing rest of the day.</p>",
        "id": 167148354,
        "sender_full_name": "Jeremie Osaghae-Nosa",
        "timestamp": 1559526143
    },
    {
        "content": "<p>You too :)</p>",
        "id": 167150259,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1559529088
    }
]