[
    {
        "content": "<p>Ref: <a href=\"http://build.fhir.org/ig/HL7/davinci-crd/\">http://build.fhir.org/ig/HL7/davinci-crd/</a></p>\n<p>The Da Vinci Coverage Requirements Discovery IG - in combination with the DTR and PAS IGs - describe a workflow to support prior authorization for US payers.</p>\n<p>My understanding of CDS Hooks and my interpretation of these IGs suggest a single clinical action in an EMR could trigger a hook resulting in many CDS Hooks client requests (i.e. at least one for each configured CDS Hooks payer service supporting that hook). Each service would have to evaluate each request for eligibility before proceeding.</p>\n<p>This strikes me as really expensive when in reality only one or two payers will actually be applicable for a given patient.</p>\n<p><strong>Questions:</strong></p>\n<ol>\n<li>Am I misundertanding this?</li>\n<li>Does CDS Hooks support some mechanism for targeting a specific service for a given hook with respect to some context? For example, we already know this patient is a member with this payer, so don't send requests to other payer services.</li>\n</ol>\n<p>It's worth noting that the FHIR payloads for the CRD CDS Hooks client requests do not appear to include any profiles that identify the patient's payer.</p>\n<p>Any help with this is greatly appreciated. Thanks!</p>",
        "id": 276077249,
        "sender_full_name": "Diederik Muylwyk",
        "timestamp": 1647879862
    },
    {
        "content": "<p>There's a rule that says that EHRs are only allowed to invoke payer services where the patient has active coverage with that payer.  We had explored using a formal mechanism of doing that generically, but it was the preference of the EHRs to do it as a custom rule.  So the EHR will need to check the patient's coverage before sending the data.</p>\n<p>There is a prefetch defined to retrieve the patient's Coverage.  The Coverage will indicate the payer.</p>",
        "id": 276080116,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1647880919
    },
    {
        "content": "<p>Thanks, <span class=\"user-mention\" data-user-id=\"191320\">@Lloyd McKenzie</span>. That's really helpful.</p>\n<p>Could you please share links directly to this rule as well as the prefetch you mentioned? I haven't been able to find either but I must be looking with my nose.</p>",
        "id": 276083094,
        "sender_full_name": "Diederik Muylwyk",
        "timestamp": 1647882063
    },
    {
        "content": "<p>I think I've found the Coverage prefetch here. It's New Content under 4.3.5.1.</p>\n<p><a href=\"http://build.fhir.org/ig/HL7/davinci-crd/hooks.html#prefetch\">http://build.fhir.org/ig/HL7/davinci-crd/hooks.html#prefetch</a></p>",
        "id": 276084125,
        "sender_full_name": "Diederik Muylwyk",
        "timestamp": 1647882480
    }
]