[
    {
        "content": "<p>Hi folks!</p>\n<p>I wanted to start up a thread to coordinate the CDS Hooks track for <a href=\"https://confluence.hl7.org/display/FHIR/2020-09+Connectathon+25\">Connectathon 25</a> coming up on September 9-11! The <a href=\"https://confluence.hl7.org/display/FHIR/2020-09+CDS+Hooks+Track\">CDS Hooks Track</a> contains the usual scenarios around 1.0 specification integrations, but also scenarios around 1.1 candidate functionality.  With the CDS Hooks 1.1 ballot (<a href=\"https://cds-hooks.hl7.org/ballots/2020Sep/index.html\">content snapshot</a>) running 8/14-9/14, this is a great opportunity to try implementing what's proposed so that good feedback can be provided.</p>\n<p>Head over to HL7's <a href=\"https://www.hl7.org/events/fhir/connectathon/2020/09/\">registration page</a> to formally sign up for the event.  Additionally, we'll continue using a <a href=\"https://bit.ly/cds-hooks-connectathon-tracking\">Google Spreadsheet</a> to coordinate clients and servers, so please start indicating your intention to participate out there (and details later when you have them).</p>",
        "id": 206958089,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1597427837
    },
    {
        "content": "<p>I updated the <a href=\"https://confluence.hl7.org/display/FHIR/2020-09+CDS+Hooks+Track\">track page</a> with an Orientation call on Tuesday, September 1st at 10 AM Central time</p>",
        "id": 206978650,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1597437263
    },
    {
        "content": "<p>Looking forward to seeing folks in the track orientation call next week!</p>\n<p>Besides adding yourself to the Google Spreadsheet linked above, HL7's <a href=\"https://www.surveymonkey.com/r/6R3LFFM\">Pre-Connectathon Survey</a> is available  and I'd encourage you all to fill that out</p>",
        "id": 207990880,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1598375320
    },
    {
        "content": "<p>I also wanted to mention that folks who are interested in participating in a SMART Web Messaging track will be directed instead to the CDS Hooks track.  I'm revising last year's (2019-Sep) scenario and Dennis has graciously agreed to facilitate.  Expect to see that scenario appear in the CDS Hooks track soon!</p>",
        "id": 208100898,
        "sender_full_name": "Carl Anderson",
        "timestamp": 1598453136
    },
    {
        "content": "<p>Reminder that tomorrow morning at 10AM Central is the track orientation.  Looking forward to syncing up!</p>",
        "id": 208616347,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1598908593
    },
    {
        "content": "<p>Slides for the track orientation are available here - <a href=\"https://bit.ly/cdshooks-25-orientation\">https://bit.ly/cdshooks-25-orientation</a> .  Reach out to me if you have questions and add your client/service information to the <a href=\"https://bit.ly/cds-hooks-connectathon-tracking\">Google Spreadsheet</a>!</p>",
        "id": 208706382,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1598975013
    },
    {
        "content": "<p>Like in May, we'll plan to sync up after the event kickoff to kick off the track.  The chat medium is TBD since nothing is currently scheduled in Whova by default until Thursday.   If I don't hear more about doing this in Whova, we'll use Microsoft Teams.</p>\n<p>Also like last time, we'll do daily meetings at 10AM and 3PM Eastern on Thursday and Friday, with the Friday @ 10AM slot also being a breakout session</p>",
        "id": 209443485,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1599598769
    },
    {
        "content": "<p><strong>Update</strong>: As a deviation from my previous message, event organizers have recommended track kick-off meetings tomorrow morning.  I am working on updating track info in Whova (if you expand the thursday/friday descriptions) to contain times for our meetings.</p>",
        "id": 209539878,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1599671464
    },
    {
        "content": "<p>Given the typical track sync times of 10 AM ET and 3 PM ET, I was considering doing this kick-off at 10 AM ET to account for any west coast participants.  The room will be open beforehand, and anybody chomping at the bit to start earlier is welcome to reach out here or to any participants on the <a href=\"https://bit.ly/cds-hooks-connectathon-tracking\">Google Spreadsheet</a></p>",
        "id": 209540111,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1599671575
    },
    {
        "content": "<p>Good morning everybody!  Participants are already gathering in the room via Whova and we'll be kicking off formally around 10AM ET.  Looking forward to working together and seeing what we can accomplish!</p>",
        "id": 209643175,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1599745692
    },
    {
        "content": "<p>Wanted to touch base on our scheduled breakout tomorrow.  It was originally scheduled for 10 AM ET, though in the course of getting set up in Whova, our time was changed on the sign-up and imported at an 11 AM ET slot.  I have been unsuccessful with getting it reverted, so we'll plan to roll with it unless I get a late response.  Apologies for any confusion!</p>",
        "id": 209699197,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1599766995
    },
    {
        "content": "<p>Reminder that our breakout session is starting in about 5 minutes.  Check your Whova schedule for the location!</p>",
        "id": 209790896,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1599836132
    },
    {
        "content": "<p>Big thanks for all who came to the breakout session and for sharing your experiences and questions!  We didn't get any time for the retrospective aspect, so we'll hold that in our afternoon sync at 3pm ET back in our main track room</p>",
        "id": 209800349,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1599840306
    },
    {
        "content": "<p>If you haven't done so already, please send me a snippet by 1PM ET with what you worked on during the connectathon:</p>\n<ul>\n<li>Who you integrated with</li>\n<li>What you tested/accomplished/uncovered</li>\n<li>Any CDS Service screenshots (from the public sandbox or another CDS Client / EHR)</li>\n<li>Anything else you’d like to share</li>\n</ul>",
        "id": 209800561,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1599840388
    },
    {
        "content": "<p>btw here's a link to the slides from the breakout session - <a href=\"https://bit.ly/202009-cdshooks-breakout\">https://bit.ly/202009-cdshooks-breakout</a></p>",
        "id": 209807812,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1599843971
    },
    {
        "content": "<p>Draft of the track report is out on the bottom of the track page on confluence - <a href=\"https://confluence.hl7.org/display/FHIR/2020-09+CDS+Hooks+Track\">https://confluence.hl7.org/display/FHIR/2020-09+CDS+Hooks+Track</a> . Please let me know if I left anything out that I missed or that you'd like included!</p>",
        "id": 209820631,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1599850444
    }
]