[
    {
        "content": "<p>Are there any demo service implementations available that use FHIR 3.0 resources? I am starting to prototype client app invocation of cds-hooks and all of my work is based on FHIR 3.0.  The demo references I've found on <a href=\"http://cds-hooks.org\" target=\"_blank\" title=\"http://cds-hooks.org\">cds-hooks.org</a> appear to be all DSTU-2.  Thanks!</p>",
        "id": 153891185,
        "sender_full_name": "Dave Carlson",
        "timestamp": 1495651169
    },
    {
        "content": "<p>Yeah, the FHIR sandbox that is wired to <a href=\"http://demo.cds-hooks.org\" target=\"_blank\" title=\"http://demo.cds-hooks.org\">demo.cds-hooks.org</a> is currently DSTU 2. We're going to enhance the sandbox to allow you to hook up any FHIR server (see <a href=\"https://github.com/cds-hooks/sandbox/issues/19\" target=\"_blank\" title=\"https://github.com/cds-hooks/sandbox/issues/19\">#19</a>) which will address your need here.</p>",
        "id": 153891207,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1495657814
    },
    {
        "content": "<p>Something that is worth noting too on this topic is that no EHR that I'm aware of has STU3 deployed. Given that STU3 was just released a couple months ago, my guess is that it will be some time before we start seeing STU3 deployments in production.</p>",
        "id": 153891208,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1495657879
    },
    {
        "content": "<p>Thanks Kevin. I understand that most production servers are stuck on DSTU2 for now, but thought there may be some prototype STU3 CDS services created for connectathons, etc.  This may be a good opportunity for the HSPC Sandbox to host and demonstrate cds-hooks for STU3, I'll pursue that approach for now.</p>",
        "id": 153891211,
        "sender_full_name": "Dave Carlson",
        "timestamp": 1495658283
    },
    {
        "content": "<p>Yeah, hooking up to the HSPC FHIR Sandbox (or any other FHIR Sandbox) would be great</p>",
        "id": 153891213,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1495658388
    },
    {
        "content": "<p>As it turns out, I learned about a hidden feature of the CDS Hooks Sandbox where if you add a fhirServiceUrl URL parameter, you can point to any FHIR server. So, you could do this today to hit a STU3 sandbox</p>",
        "id": 153891214,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1495658442
    },
    {
        "content": "<p>Note: I haven't tested this myself yet :)</p>",
        "id": 153891215,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1495658449
    }
]