[
    {
        "content": "<p>If there's an error in the service processing, is there a defined response? The 'patient-hello-world' just returns a string (if you send it a patient with no name), and Bryns service returns an html page with a screen dump...</p>",
        "id": 153929833,
        "sender_full_name": "David Hay",
        "timestamp": 1516503441
    },
    {
        "content": "<p>Hey David, there was some discussion around this question, here: <a href=\"https://github.com/cds-hooks/docs/issues/14\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/14\">https://github.com/cds-hooks/docs/issues/14</a></p>\n<p>In summary, an appropriate HTTP status code  seems appropriate, such that the CDS Hooks client knows not to show the response to a user and perhaps additional details if available.</p>",
        "id": 153929834,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1516503791
    },
    {
        "content": "<p>Thanks Isaac - but what format should the additional data be? I agree with Grahames last comment - it should be something that the client expects...</p>",
        "id": 153929838,
        "sender_full_name": "David Hay",
        "timestamp": 1516504143
    },
    {
        "content": "<p>Yeah, re-reading that thread, Sean and Kevin seem fairly set against OperationOutcome -- I think due to its additional overhead.  I'd suggest that if the CDS Hooks service is able to explain its HTTP status code, it should do so in json, at the least.</p>",
        "id": 153929839,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1516504368
    },
    {
        "content": "<p>Hey <span class=\"user-mention\" data-user-id=\"191355\">@Kevin Shekleton</span> , would it make sense to resolve #14 during the Jan WGM with community input? It looks like the right answer is currently disputed.</p>",
        "id": 153929840,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1516504481
    },
    {
        "content": "<p>btw - what's the agenda for the friday evening meeting?</p>",
        "id": 153929841,
        "sender_full_name": "David Hay",
        "timestamp": 1516504549
    },
    {
        "content": "<p>We haven't set a firm agenda on the issues being discussed -- we'll get that landed this week and communicated</p>",
        "id": 153929973,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1516639846
    },
    {
        "content": "<p>We can discuss #14 but we should ensure that we don't rehash and just have the same discussion all over again. The reason why that issue is still open is that we need to write up the guidance the community agreed upon and put that into our spec.</p>",
        "id": 153929974,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1516639907
    },
    {
        "content": "<p>The core issue on #14 was if CDS Services should return error information that can be programmatically interpreted (more so than HTTP status codes). The broad consensus in the room at madrid (representing a diverse set of users) was that programmatic error handling beyond HTTP status codes wasn't valuable.</p>",
        "id": 153929975,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1516640050
    },
    {
        "content": "<p>CDS Services that have an error should return a HTTP status code that is appropriate for the particular error.</p>",
        "id": 153929977,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1516640104
    }
]