[
    {
        "content": "<p><span aria-label=\"trumpet\" class=\"emoji emoji-1f3ba\" role=\"img\" title=\"trumpet\">:trumpet:</span> CDS Hooks STU2 <a href=\"https://jira.hl7.org/browse/FHIR-28644?filter=12820&amp;jql=project%20%3D%20FHIR%20AND%20Specification%20%3D%20%22CDS%20Hooks%20(FHIR)%20%5BFHIR-cds-hooks%5D%22%20and%20(grouping%3Dblock-vote-6%20or%20grouping%3DBlock-Vote-6%20)%20%20ORDER%20BY%20issue\">Block-vote-6</a> will be held in two weeks!</p>",
        "id": 269482605,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1643231385
    },
    {
        "content": "<p>Nice overview of the 19 issues in this vote is here: <a href=\"https://confluence.hl7.org/display/CDS/2022-01-26+Meeting+Agenda\">https://confluence.hl7.org/display/CDS/2022-01-26+Meeting+Agenda</a>.</p>",
        "id": 269483027,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1643231552
    },
    {
        "content": "<p>Commenters include: <span class=\"user-mention\" data-user-id=\"194452\">@Bas van den Heuvel</span> , <span class=\"user-mention\" data-user-id=\"295049\">@Celine A Lefebvre</span> , <span class=\"user-mention\" data-user-id=\"193265\">@Matt Varghese</span> , <span class=\"user-mention\" data-user-id=\"191358\">@Dennis Patterson</span> , <span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> , <span class=\"user-mention\" data-user-id=\"380192\">@Kishan Patel</span> , <span class=\"user-mention\" data-user-id=\"198982\">@Gunjit Chhatwal</span>. </p>\n<p>HL7 thanks you for your feedback.</p>",
        "id": 269483031,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1643231554
    },
    {
        "content": "<p>Anyone, for any reason, may request that one or more issues be withdrawn from this block vote for further, individual workgroup discussion.</p>",
        "id": 269483152,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1643231624
    },
    {
        "content": "<p><a href=\"https://jira.hl7.org/browse/FHIR-28663\">https://jira.hl7.org/browse/FHIR-28663</a> (allow next page links on prefetch) - If it's prefetch, what is the point of a next page link?  I'm trying to avoid complexity in prefetch templates where a CDS Service now needs to specify whether to send the whole response or only the first page</p>",
        "id": 271293723,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1644420158
    },
    {
        "content": "<p><a href=\"https://jira.hl7.org/browse/FHIR-28694\">https://jira.hl7.org/browse/FHIR-28694</a> (Client authentication should not be mandated) - How does a CDS Service now advertise whether their endpoint requires authentication?  Does we just want an allowance for a CDS Service to be able to ignore the header if they don't care?  Or do we really want the CDS Client behavior to flex?</p>",
        "id": 271293811,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1644420194
    },
    {
        "content": "<p><a href=\"https://jira.hl7.org/browse/FHIR-28761\">https://jira.hl7.org/browse/FHIR-28761</a> (Add \"patient\" parameter as required by SMART App Launch spec) - Can we make addition of fhirAuthorization.patient a SHOULD instead of making this a breaking change?  The issue description isn't necessarily proposing rfc-style language, but does use \"should\" regarding the use of this field</p>",
        "id": 271293878,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1644420226
    },
    {
        "content": "<p><a href=\"https://jira.hl7.org/browse/FHIR-34274\">https://jira.hl7.org/browse/FHIR-34274</a> (OO during prefetch) </p>\n<ul>\n<li>Will we break any existing CDS Services that assume template keys on a request mean that actual data is included?  With this change, they may not be expecting the target resource to be absent</li>\n<li>Regarding supporting OO during prefetch, this resolution assumes implementation details about a CDS Client calling a FHIR Server.  It also still allows the absence of the prefetch template for other errors and the \"MUST NOT\" language conflicts with the inclusion of an OO.  Also, this OO should be in a Bundle, correct?  What's not clear to me is the difference between known and unknown errors.  Outside existing implementations, for what kinds of errors should the OO be included vs the prefetch key ommitted?<ul>\n<li>I'm open to further wordsmithing, but here's a stab at including some additional language: \"the CDS Client SHOULD send a Bundle with OperationOutcome(s) to communicate known errors prefetching the requested data to prevent the CDS Service from incurring an unneeded follow-up query but MUST omit the prefetch key if details cannot be provided.  CDS Services SHOULD check any prefetched data for the existence of OperationOutcomes.\"</li>\n</ul>\n</li>\n</ul>",
        "id": 271294461,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1644420428
    },
    {
        "content": "<blockquote>\n<p>Dennis Patterson: <a href=\"https://jira.hl7.org/browse/FHIR-28694\">https://jira.hl7.org/browse/FHIR-28694</a> (Client authentication should not be mandated) - How does a CDS Service now advertise whether their endpoint requires authentication? Does we just want an allowance for a CDS Service to be able to ignore the header if they don't care? Or do we really want the CDS Client behavior to flex?</p>\n</blockquote>\n<p>Given this <a href=\"https://cds-hooks.org/specification/current/#trusting-cds-clients\">language in the spec</a>:</p>\n<blockquote>\n<p>CDS Services SHOULD maintain an allowlist of the iss and jku fields to only the CDS Clients they trust</p>\n</blockquote>\n<p>It seems safe for CDS Services to ignore authn if they don't care about it. This may be worth stating explicitly, since it's reasonable behavior for many classes of CDS Services that never expose any sensitive information and are happy to respond to any client.</p>",
        "id": 271302902,
        "sender_full_name": "Josh Mandel",
        "timestamp": 1644423520
    },
    {
        "content": "<p>I'm fine with that... flipping the resolution to be more focused on the CDS Services' decision to do something with it vs requiring the CDS Client to start flexing whether to send it</p>",
        "id": 271307821,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1644425118
    }
]