[
    {
        "content": "<p>We are currently implementing a CDS Hook service suggesting studies for cancer patients. This includes links to clinicaltrails.<br>\nI couldn't find a defined way to include links into suggestions, or tie a link to a suggestion.<br>\nIs there a best practice on how to do this?</p>",
        "id": 206245343,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1596798769
    },
    {
        "content": "<p>What do you actually want the clinician to see?  It seems like text with a hyperlink to a website is likely to be more useful than a resource reference, as I'm not sure what an EHR would do with a resource reference right now.  (I'm not aware of many/any EHRs that have support for ResearchStudy right now...)</p>",
        "id": 206264727,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1596811154
    },
    {
        "content": "<p>We were thinking about actions creating the patients study enrolment directly, but also providing links to clinical trails for these studies</p>",
        "id": 206437704,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1597047397
    },
    {
        "content": "<p>Currently we are thinking about adding a link element to the suggestion as well. What do other CDS people think about this? Can this be added to the CDS Hook Spec?</p>",
        "id": 206573333,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1597152032
    },
    {
        "content": "<p>If the action creates the patient study enrollment , what FHIR resource is that suggesting be created?  Is the clinical trials link a website?  Why does this need to be on the suggestion? What is the reason for not using card.links?</p>",
        "id": 206957199,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1597427365
    },
    {
        "content": "<p>The action would create a ResearchSubject. Yes clinical trials is a website/DB: <a href=\"https://clinicaltrials.gov/\">https://clinicaltrials.gov/</a></p>",
        "id": 207119761,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1597654156
    },
    {
        "content": "<p>It does need to be on the suggestion, as the CDS Service queries available studies and proposes the best fitting one(s) via suggestions.</p>",
        "id": 207119802,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1597654193
    },
    {
        "content": "<p>Inside the suggestion there should be a possibility to include a linkt to more details of the study</p>",
        "id": 207119875,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1597654221
    },
    {
        "content": "<p>e.g.: <a href=\"https://clinicaltrials.gov/ct2/show/NCT04495088\">https://clinicaltrials.gov/ct2/show/NCT04495088</a></p>",
        "id": 207119919,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1597654275
    },
    {
        "content": "<p>I'm still not understanding why that wouldn't just come back on the card.  The card is  focused on clinical trials.  The suggestion is FHIR-focused on creating a resource, and the link is supplemental content.  There's nothing for the EHR to programmatically do with the link, right?</p>",
        "id": 207197190,
        "sender_full_name": "Dennis Patterson",
        "timestamp": 1597698192
    },
    {
        "content": "<p><span class=\"user-mention silent\" data-user-id=\"191358\">Dennis Patterson</span> <a href=\"#narrow/stream/179159-cds-hooks/topic/suggestions.2Flinks/near/207197190\">said</a>:</p>\n<blockquote>\n<p>There's nothing for the EHR to programmatically do with the link, right?</p>\n</blockquote>\n<p>right.<br>\nSo you are proposing putting the link into the label of the suggestion then? Could work, but you'd end up with a link inline in a string label. <br>\nLike it is done with the links on the card level, a link per suggestion would be a nice feature.<br>\nThis link is only meant for human consumption to get background on the suggested action.</p>",
        "id": 207234043,
        "sender_full_name": "Patrick Werner",
        "timestamp": 1597738521
    },
    {
        "content": "<p>Is this a CDS Hooks question? Or is this a FHIR question? <br>\nTo propose that a patient be enrolled in a study is an action (which will be in a suggestion in CDS Hooks). That action will include a FHIR resource, which is the enrollment of the patient on the study. Shouldn't that FHIR resource be pointing therefore to the study? So isn't this a FHIR resource question?</p>",
        "id": 209541567,
        "sender_full_name": "Matt Varghese",
        "timestamp": 1599672190
    }
]