[
    {
        "content": "<p>Hi, we are working on cds-hooks based CDS integration with EHR. One of the challenges we are facing is how to transfer control &amp; data from web-based CDS app back to the EHR client. It's specifically about so called fat-client, typically on .Net/Java platform deployed as a desktop application, which is common in legacy EHRs in the market today. It seems feasible to run web-based CDS apps using Chromium browser component embedded within the EHR client, there are number of open source projects/commercial products such as CEF, JxBrowser etc. However the challenge is how to transfer the control/data back to EHR for events such as close-cds-app, save-a-journal-note, and start-prescribing-medication so the the hosting EHR client can receive the control as well as data resulted from user interacting with the CDS app frontend. Anyone in the cds-hooks community also struggling with the same challenge? Any chance to share the experience here so we can work towards standardizing the interactions between CDS apps and EHR, which is partly related to decisions tracking in the specs.</p>",
        "id": 153915598,
        "sender_full_name": "Rong Chen",
        "timestamp": 1508830097
    },
    {
        "content": "<p>I'm confused. are you talking about smart apps, or cds-hooks cards?</p>",
        "id": 153915604,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1508834683
    },
    {
        "content": "<p>there's no 'closing' a cds-hooks app - it's a server side process</p>",
        "id": 153915605,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1508834699
    },
    {
        "content": "<p>I am talking about smart apps.</p>",
        "id": 153915627,
        "sender_full_name": "Rong Chen",
        "timestamp": 1508842280
    },
    {
        "content": "<p><span class=\"user-mention\" data-user-id=\"191315\">@Josh Mandel</span> I forget what we said when we talked about this...</p>",
        "id": 153915628,
        "sender_full_name": "Grahame Grieve",
        "timestamp": 1508842318
    },
    {
        "content": "<p>We try to generalize the idea of including a smart app link as part of the suggestion in the cds-hooks cards. So it's possible to use web-based apps for further user interaction using the app frontend until a decision is reached by the end user and somehow finds its way back to EHR client.</p>",
        "id": 153915629,
        "sender_full_name": "Rong Chen",
        "timestamp": 1508842470
    },
    {
        "content": "<p>This is related to how to track decisions as part of cds-hooks specs, but there are other details such as how to handle e.g. app window close event, so the hosting EHR client can warn the user about unsaved data in the CDS app web frontend. Other examples are 1) user wants to start a medication prescribing using native e-Prescribing user interface provided by the local EHR client. both the control and the details of the medicine recommended by CDS should be transferred to the local EHR prescribing window. 2) it's quite common that the user wants to save a medical record note recording the input and result of this CDS session, e.g. a treatment review initiative by a CDS alert resulted in prescribing recommended medicine or documented deviation from recommended treatment for whatever reason.</p>",
        "id": 153915630,
        "sender_full_name": "Rong Chen",
        "timestamp": 1508842828
    },
    {
        "content": "<p>I'm not aware of anyone else who has tackled what you're trying to do today</p>",
        "id": 153915788,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1508878245
    },
    {
        "content": "<p>We could tell you how to do this with Meteor(Node/Javascript) apps running on Chromium/V8.  We baked Collection Hooks and Event Hooks throughout the Clinical Meteor framework; and use them for transferring control of devices/user-interface, logging HIPAA audit-events, kicking off data processing pipelines, etc.</p>",
        "id": 153916295,
        "sender_full_name": "Abbie Watson",
        "timestamp": 1509040649
    }
]