[
    {
        "content": "<p>Hi,<br>\nI am looking for some guidance on how to figure out who the EHR(or hospital/clinic location) that is calling my CDS Service is.  I see the JWT that is being sent on each request, and I am able to decode it, but what piece(s) of data should I look at to determine the identity of the EHR system?  I was thinking that it may be the “iss” value that I need to focus on but two different docs say two slightly different things. At <a href=\"https://cds-hooks.github.io/docs-hl7-ballot/#trusting-ehrs\" target=\"_blank\" title=\"https://cds-hooks.github.io/docs-hl7-ballot/#trusting-ehrs\">https://cds-hooks.github.io/docs-hl7-ballot/#trusting-ehrs</a> I see that the iss value should be “The base URL of the EHR’s FHIR server. This must be the same URL as the fhirServer field in a CDS Service request.”  And at <a href=\"http://cds-hooks.org/specification/1.0/#trusting-ehrs\" target=\"_blank\" title=\"http://cds-hooks.org/specification/1.0/#trusting-ehrs\">http://cds-hooks.org/specification/1.0/#trusting-ehrs</a> I see that iss should be “The URL of the issuer of this JWT.”  So which one is it or are they the same thing just worded differently? How can I be sure that the issuer and the EHR are the same server?</p>\n<p>Thank you</p>",
        "id": 153922780,
        "sender_full_name": "Manny Ramirez",
        "timestamp": 1512399643
    },
    {
        "content": "<p>Hi <span class=\"user-mention\" data-user-id=\"194799\">@Manny Ramirez</span>. Don't look at <a href=\"https://cds-hooks.github.io/docs-hl7-ballot\" target=\"_blank\" title=\"https://cds-hooks.github.io/docs-hl7-ballot\">https://cds-hooks.github.io/docs-hl7-ballot</a> -- that is an old version of the spec that was used for an informal HL7 ballot back in September 2017. The latest spec is at <a href=\"http://cds-hooks.org/specification/1.0\" target=\"_blank\" title=\"http://cds-hooks.org/specification/1.0\">http://cds-hooks.org/specification/1.0</a> (which you found). The differences you found are the changes we made based upon implementer feedback at the September 2017 Connectathon.</p>\n<p>When determining who/how to trust the EHR, you should work with the EHR vendor and learn:<br>\n1. The <code>iss</code> value they will be sending in the JWT<br>\n2. The location of their public key (we will be standarizing this in <a href=\"https://github.com/cds-hooks/docs/issues/87\" target=\"_blank\" title=\"https://github.com/cds-hooks/docs/issues/87\">#87</a>)</p>",
        "id": 153922815,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1512411000
    }
]