[
    {
        "content": "<p>Is there any guidance around when to <code>use Card.links</code> vs. embedding links in the markdown present in <code>Card.detail</code>?  Is the latter even permitted?</p>",
        "id": 153985551,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1534088187
    },
    {
        "content": "<p>Hey Lloyd, <br>\n1) support of markdown isn't universal yet. For those systems that do render ghf-markdown in cards, I'd expect links to work fine.<br>\n2) Note that SMART app links are identified by the Card.link.type.</p>",
        "id": 153985552,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1534088447
    },
    {
        "content": "<p>Yeah, I'd expect SMART Apps to always use Card.link.    So there isn't specific guidance beyond Card.link is currently more widely supported?</p>",
        "id": 153985554,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1534090425
    },
    {
        "content": "<p>In the UI representation of the card, the Card.Links will be more prominently and discretely displayed. Links in markdown will be less instrusive. I'd recommend that any links in the markdown are also returned as Card.Links for two purposes:<br>\n1) to cover EHRs that don't support markdown<br>\n2) to serve as a list of references</p>",
        "id": 153985555,
        "sender_full_name": "Isaac Vetter",
        "timestamp": 1534090992
    },
    {
        "content": "<p>If you return them in both places, wouldn't that confuse an EMR that implemented both per spec? There is no guidance in this regard, and nothing which groups or otherwise notes that a link is also part of the detail.</p>",
        "id": 153985743,
        "sender_full_name": "Robert Sax",
        "timestamp": 1534160047
    },
    {
        "content": "<p>For now I've gone with \"if you're going to put them in the detail, still put them in the links\"  If the user clicks on the links in both places, they just get the same content more than once.</p>",
        "id": 153985787,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1534169732
    },
    {
        "content": "<p>Personally, I would not put a link in both the detail and the links array. Just put it in one spot.</p>",
        "id": 153986898,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1534340240
    },
    {
        "content": "<p>Guidance as to which one?</p>",
        "id": 153986919,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1534343583
    },
    {
        "content": "<p>The card.links array. It's why we have a dedicated section in the API for links :-)</p>",
        "id": 153986949,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1534346152
    },
    {
        "content": "<p>Should there be a \"SHALL NOT\" or \"SHOULD NOT\" on links in the detail?</p>",
        "id": 153986966,
        "sender_full_name": "Lloyd McKenzie",
        "timestamp": 1534346983
    },
    {
        "content": "<p>No, I don't think so. There are cases where it is fine to put links in the detail.</p>",
        "id": 153986995,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1534351151
    },
    {
        "content": "<p>I personally think of card.links as references to the supporting evidence (eg, a list of links to research papers/studies), references to apps, etc. Links in the card.details Markdown would be inline links.</p>\n<p>It is hard to make a requirement on what CDS Service Providers should do or even guidance since in doing so, you are telling them how to structure/word their content. Another wrinkle is that CDS Clients (aka, EHRs) will render the cards as they see fit and this will likely impact how CDS Service Providers construct the data within their cards.</p>",
        "id": 153986997,
        "sender_full_name": "Kevin Shekleton",
        "timestamp": 1534351311
    }
]